{"artist": "James Paick", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210250", "mcmId": "294404", "mtgjsonV4Id": "e748b4a0-4f7a-5264-92ef-77d461fbb4d5", "multiverseId": "423590", "scryfallId": "ed4f4210-9871-4cec-9b46-100c80f93cd4", "scryfallIllustrationId": "8d617a18-0f09-4471-8ac6-f0928f1f9912", "scryfallOracleId": "15b979de-c8ee-4664-9ca7-6c4eb3346967", "tcgplayerProductId": "125570"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Academy at Tolaria West", "number": "9", "originalText": "At the beginning of your end step, if you have no cards in hand, draw seven cards.\nWhenever you roll {Chaos}, discard your hand.", "originalType": "Plane — Dominaria", "printings": ["OHOP", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/536c25225d9c5601", "tcgplayer": "https://mtgjson.com/links/83a915a27d3f07e3"}, "rarity": "common", "rulings": [{"date": "2009-10-01", "text": "A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"}, {"date": "2009-10-01", "text": "A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."}, {"date": "2009-10-01", "text": "The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."}, {"date": "2009-10-01", "text": "If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}, {"date": "2009-10-01", "text": "Academy at Tolaria West’s first ability has an “intervening ‘if’ clause.” That means (1) the ability won’t trigger at all unless you have no cards in hand as your end step begins, and (2) the ability will do nothing unless you have no cards in hand by the time it resolves."}, {"date": "2009-10-01", "text": "If you discard your hand as a result of rolling {CHAOS}, Academy at Tolaria West’s first ability will then trigger at the beginning of your end step (unless you planeswalk or somehow put a card in your hand before then)."}], "setCode": "OPCA", "subtypes": ["Dominaria"], "supertypes": [], "text": "At the beginning of your end step, if you have no cards in hand, draw seven cards.\nWhenever you roll {CHAOS}, discard your hand.", "type": "Plane — Dominaria", "types": ["Plane"], "uuid": "2681bced-dd18-5a57-a1c4-985b73ec5164"}