{"artist": "Slawomir Maniak", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 2.0, "edhrecRank": 15543, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 378868, "name": "Belohnung des Tempeldieners", "text": "Verhindere die nächsten X Schadenspunkte, die in diesem Zug einer Kreatur deiner Wahl zugefügt würden, wobei X gleich deiner Hingabe zu Weiß ist. Falls auf diese Weise Schaden verhindert wurde, fügt die Belohnung des Tempeldieners einer Kreatur oder einem Spieler deiner Wahl entsprechend viele Schadenspunkte zu. (Jedes {W} in den Manakosten von bleibenden Karten, die du kontrollierst, erhöht deine Hingabe zu Weiß um eins.)", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 380023, "name": "Recompensa del acólito", "text": "Prevén los siguientes X puntos de daño que se le fueran a hacer a la criatura objetivo este turno, donde X es tu devoción al blanco. Si se previene daño de esta manera, la Recompensa del acólito hace esa misma cantidad de daño a la criatura o jugador objetivo. (Cada {W} en los costes de maná de los permanentes que controlas cuenta para tu devoción al blanco.)", "type": "Instantáneo"}, {"language": "French", "multiverseId": 379033, "name": "Récompense de l'acolyte", "text": "Prévenez, ce tour-ci, les prochaines X blessures qui devraient être infligées à une créature ciblée, X étant votre dévotion au blanc. Si des blessures sont prévenues de cette manière, la Récompense de l'acolyte inflige autant de blessures à une cible, créature ou joueur. (Chaque {W} dans les coûts de mana des permanents que vous contrôlez compte pour votre dévotion au blanc.)", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 379198, "name": "Ricompensa dell'Accolito", "text": "Previeni i prossimi X danni che verrebbero inflitti a una creatura bersaglio in questo turno, dove X è pari alla tua devozione al bianco. Se i danni vengono prevenuti in questo modo, la Ricompensa dell'Accolito infligge altrettanti danni a una creatura o a un giocatore bersaglio. (La tua devozione al bianco è la somma dei {W} nel costo di mana dei permanenti che controlli.)", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 379363, "name": "侍祭の報賞", "text": "クリーチャー１体を対象とし、クリーチャー１体かプレイヤー１人を対象とする。このターン、次にその前者に与えられるダメージをＸ点軽減する。Ｘはあなたの白への信心に等しい。これによりダメージが軽減されるなら、侍祭の報賞はその点数に等しい点数のダメージをその後者に与える。（あなたの白への信心は、あなたがコントロールするパーマネントのマナ・コストに含まれる{W}の総数に等しい。）", "type": "インスタント"}, {"language": "Korean", "multiverseId": 379528, "name": "견습 사제의 보상", "text": "생물 하나를 목표로 정한다. 이번 턴에 그 생물이 다음으로 입을 피해 X점을 방지한다. X는 당신의 백색 신앙심이다. 이렇게 피해를 방지하면, 생물 또는 플레이어 하나를 목표로 정한다. 견습 사제의 보상은 그 목표에 방지된 만큼의 피해를 입힌다. (당신이 조종하는 지속물의 마나 비용에 있는 각 {W}마다 당신의 백색 신앙심이 1씩 증가한다.)", "type": "순간마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 379693, "name": "Recompensa do Acólito", "text": "Previna os próximos X pontos de dano que seriam causados à criatura alvo neste turno, sendo X a sua devoção ao branco. Se algum dano for prevenido dessa forma, Recompensa do Acólito causará uma quantidade equivalente de dano ao jogador ou criatura alvo. (Cada {W} nos custos de mana de permanentes que você controla conta para sua devoção ao branco.)", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 379858, "name": "Награда Служителя", "text": "Предотвратите следующие Х повреждений, которые должны быть нанесены целевому существу в этом ходу, где Х — ваша Преданность белому. Если повреждения предотвращаются таким образом, Награда Служителя наносит столько же повреждений целевому существу или игроку. (Каждый символ {W} в мана-стоимости перманентов под вашим контролем идет в счет вашей Преданности белому.)", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 378538, "name": "侍僧的报偿", "text": "于本回合中，防止接下来将对目标生物造成的X点伤害，X为你的白色献力。如果以此法防止伤害，则侍僧的报偿对目标生物或牌手造成等量的伤害。（由你操控之永久物的法术力费用当中每含有一个{W}，你的白色献力就加一。）", "type": "瞬间"}, {"language": "Chinese Traditional", "multiverseId": 378703, "name": "侍僧的報償", "text": "於本回合中，防止接下來將對目標生物造成的X點傷害，X為你的白色獻力。如果以此法防止傷害，則侍僧的報償對目標生物或玩家造成等量的傷害。（由你操控之永久物的魔法力費用當中每含有一個{W}，你的白色獻力就加一。）", "type": "瞬間"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "193616", "cardKingdomId": "193392", "cardsphereId": "7380", "mcmId": "265863", "mcmMetaId": "209326", "mtgjsonV4Id": "69b4b108-5458-543f-a4f6-79ab117be1e7", "mtgoFoilId": "51764", "mtgoId": "51763", "multiverseId": "378373", "scryfallId": "cd8980af-c3fa-4027-917a-4a3d441c0a75", "scryfallIllustrationId": "f3390fb1-182d-4a37-b429-c784178acf9c", "scryfallOracleId": "944689b2-f9f7-45c3-952c-54287b9824d5", "tcgplayerProductId": "79093"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}", "manaValue": 2.0, "name": "Acolyte's Reward", "number": "1", "originalText": "Prevent the next X damage that would be dealt to target creature this turn, where X is your devotion to white. If damage is prevented this way, Acolyte's Reward deals that much damage to target creature or player. (Each {W} in the mana costs of permanents you control counts toward your devotion to white.)", "originalType": "Instant", "printings": ["BNG"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/0f364d3510f49380", "cardKingdomFoil": "https://mtgjson.com/links/8a9ae3e5291162ee", "cardmarket": "https://mtgjson.com/links/2df0a6318acc07a9", "tcgplayer": "https://mtgjson.com/links/9f71356cd59c6fb5"}, "rarity": "uncommon", "rulings": [{"date": "2013-09-15", "text": "Mana symbols in the text boxes of permanents you control don’t count toward your devotion to any color."}, {"date": "2013-09-15", "text": "Hybrid mana symbols, monocolored hybrid mana symbols, and Phyrexian mana symbols do count toward your devotion to their color(s)."}, {"date": "2013-09-15", "text": "If an activated ability or triggered ability has an effect that depends on your devotion to a color, you count the number of mana symbols of that color among the mana costs of permanents you control as the ability resolves. The permanent with that ability will be counted if it’s still on the battlefield at that time."}, {"date": "2013-09-15", "text": "Numeric mana symbols ({0}, {1}, and so on) in mana costs of permanents you control don’t count toward your devotion to any color."}, {"date": "2014-02-01", "text": "If the first target would be dealt combat damage by multiple creatures, you choose which of that damage to prevent. (For example, if one of those creatures has deathtouch, you could choose to prevent the damage from that creature specifically.) You don’t decide until the point at which the creatures would deal their damage."}, {"date": "2014-02-01", "text": "After Acolyte’s Reward resolves, it no longer matters whether either target is still legal. For example, if the second target is a creature controlled by an opponent, and it gains hexproof after Acolyte’s Reward resolves but before it prevents damage, Acolyte’s Reward will still deal damage to that creature. If Acolyte’s Reward can’t deal damage to the second target (perhaps because it’s a creature that has left the battlefield), Acolyte’s Reward will still prevent damage; it just won’t deal any damage itself."}, {"date": "2014-02-01", "text": "If Acolyte’s Reward prevents damage, it deals its damage immediately afterward as part of that same prevention effect. This happens before state-based actions are performed, and before any player can cast spells or activate abilities. If the source of the original damage was a spell or ability, this happens before that spell or ability resumes its resolution."}, {"date": "2014-02-01", "text": "If the amount of damage that would be dealt to the first target is in excess of the amount of damage that Acolyte’s Reward would prevent, the source deals its excess damage to the first target at the same time that the rest of it is prevented. Then Acolyte’s Reward deals its damage."}, {"date": "2014-02-01", "text": "The damage will be dealt by Acolyte’s Reward as it existed on the stack, not as it exists when the damage is dealt. That is, it’s an instant spell that’s dealing the damage, in case an ability cares about that (such as Satyr Firedancer’s, which includes the phrase “Whenever an instant or sorcery spell you control deals damage to an opponent”)."}, {"date": "2014-02-01", "text": "Acolyte’s Reward has two targets: the creature that would be dealt damage and the permanent or player that Acolyte’s Reward will deal damage to. These targets are chosen as you cast Acolyte’s Reward."}, {"date": "2014-02-01", "text": "The amount of damage the prevention shield will prevent is based on your devotion to white as Acolyte’s Reward resolves. That amount won’t change later in the turn, even if your devotion to white does."}, {"date": "2014-02-01", "text": "You don’t choose a source of damage. The prevention shield will apply to the next X damage that would be dealt to the first target, no matter where that damage comes from. It also doesn’t matter whether the damage is dealt at the same time. For example, if the shield prevents the next 5 damage to the first target, and that creature would be dealt 3 damage by Lightning Strike, that 3 damage is prevented and Acolyte’s Reward deals 3 damage to the second target. The prevention effect will still apply to the next 2 damage the first target would be dealt that turn."}, {"date": "2014-02-01", "text": "The effect of Acolyte’s Reward isn’t a redirection effect. If it prevents damage, Acolyte’s Reward (not the source of that damage) deals damage to the second target as part of that prevention effect. Acolyte’s Reward is the source of the new damage, so the characteristics of the original source (such as its color or whether it had lifelink) don’t apply. The new damage isn’t combat damage, even if the prevented damage was."}, {"date": "2014-02-01", "text": "As Acolyte’s Reward tries to resolve, if only the first target is illegal, Acolyte’s Reward won’t prevent any damage that would be dealt to that creature and, because of this, Acolyte’s Reward won’t deal damage to the second target. If only the second target is illegal, damage that would be dealt to the first target will be prevented, but Acolyte’s Reward won’t deal damage. If both targets are illegal, Acolyte’s Reward won’t resolve."}], "setCode": "BNG", "subtypes": [], "supertypes": [], "text": "Prevent the next X damage that would be dealt to target creature this turn, where X is your devotion to white. If damage is prevented this way, Acolyte's Reward deals that much damage to any target. (Each {W} in the mana costs of permanents you control counts toward your devotion to white.)", "type": "Instant", "types": ["Instant"], "uuid": "f51fea6e-e9f1-5704-94ca-954ee1d619e9"}