{"artist": "Anna Steinbauer", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 2.0, "edhrecRank": 11753, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 492038, "name": "Beschaffungsexpertin", "text": "Wenn die Beschaffungsexpertin ins Spiel kommt, zeigt ein Gegner deiner Wahl so viele Karten aus seiner Hand offen vor, wie du Kreaturen in deiner Abenteurergruppe hast. Bestimme eine der Karten. Der Spieler wirft die bestimmte Karte ab. (Deine Abenteurergruppe besteht aus bis zu je einem Kleriker, Krieger, Räuber und Zauberer)", "type": "Kreatur — Mensch, Räuber"}, {"language": "Spanish", "multiverseId": 492354, "name": "Experta en adquisiciones", "text": "Cuando la Experta en adquisiciones entre al campo de batalla, el oponente objetivo muestra una cantidad de cartas de su mano igual a la cantidad de criaturas en tu grupo. Tú eliges una de esas cartas. Ese jugador descarta esa carta. (Tu grupo consiste en hasta un Clérigo, un Bribón, un Guerrero y un Hechicero.)", "type": "Criatura — Bribón humano"}, {"language": "French", "multiverseId": 492670, "name": "Experte en acquisitions", "text": "Quand l'Experte en acquisitions arrive sur le champ de bataille, un adversaire ciblé révèle un nombre de cartes de sa main égal au nombre de créatures dans votre groupe. Vous choisissez une de ces cartes. Ce joueur se défausse de cette carte. (Votre groupe est composé de jusqu'à un clerc, un gredin, un guerrier et un sorcier.)", "type": "Créature : humain et gredin"}, {"language": "Italian", "multiverseId": 492986, "name": "Esperta di Acquisizioni", "text": "Quando l'Esperta di Acquisizioni entra nel campo di battaglia, un avversario bersaglio rivela dalla sua mano un numero di carte pari al numero di creature nella tua compagnia. Scegli una di quelle carte. Quel giocatore scarta quella carta. (La tua compagnia può includere fino a un Chierico, un Farabutto, un Guerriero e un Mago.)", "type": "Creatura — Farabutto Umano"}, {"language": "Japanese", "multiverseId": 493302, "name": "収得の熟練者", "text": "収得の熟練者が戦場に出たとき、対戦相手１人を対象とする。そのプレイヤーは自分の手札から、あなたのパーティーを構成しているクリーチャーの総数に等しい枚数のカードを公開する。あなたはそれらのカードのうち１枚を選ぶ。そのプレイヤーはそのカードを捨てる。（あなたのパーティーは、ウィザードとクレリックと戦士とならず者それぞれ最大１体から構成される。）", "type": "クリーチャー — 人間・ならず者"}, {"language": "Korean", "multiverseId": 493618, "name": "습득 전문가", "text": "습득 전문가가 전장에 들어올 때, 상대를 목표로 정한다. 그 플레이어는 당신의 파티에 있는 생물의 수만큼 자신의 손에 있는 카드를 공개한다. 당신은 그 카드 중 한 장을 선택한다. 그 플레이어는 그 카드를 버린다. (당신의 파티에는 성직자, 도적, 전사, 마법사가 각각 최대 한 개씩 포함된다.)", "type": "생물 — 인간 도적"}, {"language": "Portuguese (Brazil)", "multiverseId": 493934, "name": "Especialista em Aquisições", "text": "Quando Especialista em Aquisições entra no campo de batalha, o oponente alvo revela um número de cards da própria mão igual ao número de criaturas em seu grupo. Você escolhe um desses cards. Aquele jogador descarta aquele card. (Seu grupo consiste em até um membro de cada um dos seguintes tipos: Clérigo, Ladino, Guerreiro e Mago.)", "type": "Criatura — Humano Ladino"}, {"language": "Russian", "multiverseId": 494250, "name": "Знаток Приобретений", "text": "Когда Знаток Приобретений выходит на поле битвы, целевой оппонент показывает столько карт из своей руки, сколько существ в вашем отряде. Вы выбираете одну из тех карт. Тот игрок сбрасывает ту карту. (В вашем отряде может быть не более одного Бродяги, Воина, Священника и Чародея.)", "type": "Существо — Человек Бродяга"}, {"language": "Chinese Simplified", "multiverseId": 494566, "name": "取物专家", "text": "当取物专家进战场时，目标对手从其手上展示若干牌，其数量等同于你冒险团中的生物数量。你从中选择一张。该牌手弃掉该牌。（冒险团由僧侣、浪客、战士和法术师组成，每种类别至多只计入一个。）", "type": "生物 ～人类／浪客"}, {"language": "Chinese Traditional", "multiverseId": 494882, "name": "取物專家", "text": "當取物專家進戰場時，目標對手從其手上展示若干牌，其數量等同於你冒險團中的生物數量。你從中選擇一張。該玩家棄掉該牌。（冒險團由僧侶、浪客、戰士和魔法師組成，每種類別至多只計入一個。）", "type": "生物 ～人類／浪客"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "237583", "cardKingdomId": "236897", "cardsphereId": "70085", "mcmId": "494609", "mcmMetaId": "315964", "mtgArenaId": "73283", "mtgjsonV4Id": "95eb29a0-3258-5cf0-9540-642a66c0e0cb", "mtgoId": "83137", "multiverseId": "491722", "scryfallId": "281336c7-ca7c-4c91-bdfb-d253a965cb7c", "scryfallIllustrationId": "6a627cda-915d-4e1a-9cd5-d1c73dc1bac1", "scryfallOracleId": "07e5f59e-3a98-4e01-a368-0be60e0463ba", "tcgplayerProductId": "221775"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{B}", "manaValue": 2.0, "name": "Acquisitions Expert", "number": "89", "originalText": "When Acquisitions Expert enters the battlefield, target opponent reveals a number of cards from their hand equal to the number of creatures in your party. You choose one of those cards. That player discards that card. (Your party consists of up to one each of Cleric, Rogue, Warrior, and Wizard.)", "originalType": "Creature — Human Rogue", "power": "1", "printings": ["ZNR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/641bcb21ea92ebda", "cardKingdomFoil": "https://mtgjson.com/links/e66f784b18af500c", "cardmarket": "https://mtgjson.com/links/91491e7d33add533", "tcgplayer": "https://mtgjson.com/links/c1e8369e2420535b"}, "rarity": "uncommon", "rulings": [{"date": "2020-09-25", "text": "If there are no creatures in your party as Acquisitions Expert’s ability resolves, the target opponent reveals no cards and you choose no card."}, {"date": "2020-09-25", "text": "To determine “the number of creatures in your party,” check whether you control a Cleric, whether you control a Rogue, whether you control a Warrior, and whether you control a Wizard. The number is the total number of those checks to which you answered yes. Each creature you control can be counted for only one of those checks."}, {"date": "2020-09-25", "text": "If a creature has more than one party creature type, and there are multiple ways to count that creature that could result in a different number of creatures in your party, the highest such number is used. For example, if you control a Cleric and a Cleric Wizard, the number of creatures in your party is two. You can’t choose to have it be just one by counting the Cleric Wizard first as a Cleric."}, {"date": "2020-09-25", "text": "An ability referring to the number of creatures in your party gets a number from zero to four. Such abilities never ask which creatures are in your party, and you never have to designate specific creatures as being in your party. You can’t choose to exclude creatures from this count to lower the number."}, {"date": "2020-09-25", "text": "If an ability of a creature counts the number of creatures in your party, that number is counted as the ability resolves. If that creature is still on the battlefield when the ability resolves, it’ll be counted if appropriate."}], "setCode": "ZNR", "subtypes": ["Human", "Rogue"], "supertypes": [], "text": "When Acquisitions Expert enters the battlefield, target opponent reveals a number of cards from their hand equal to the number of creatures in your party. You choose one of those cards. That player discards that card. (Your party consists of up to one each of Cleric, Rogue, Warrior, and Wizard.)", "toughness": "2", "type": "Creature — Human Rogue", "types": ["Creature"], "uuid": "16b73777-ebad-5771-b1c7-0726eeda9f3c"}