{"artist": "Jeremy Jarvis", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 5.0, "edhrecRank": 695, "finishes": ["nonfoil", "foil"], "flavorText": "When the task spilled over into undeath, he stopped calling it his life's work.", "foreignData": [{"flavorText": "Als die Arbeit in den Bereich des Untoten überging, nannte er sie nicht mehr sein Lebenswerk.", "language": "German", "multiverseId": 187530, "name": "Bis zum Erbrechen", "text": "Zeige die oberste Karte deiner Bibliothek offen vor und nimm sie auf deine Hand. Du verlierst Lebenspunkte in Höhe ihrer umgewandelten Manakosten. Du kannst diesen Prozess beliebig oft wiederholen.", "type": "Spontanzauber"}, {"flavorText": "Cuando su tarea continuó en la muerte viviente, dejó de llamarlo \"el trabajo de mi vida\".", "language": "Spanish", "multiverseId": 187779, "name": "Ad nauseam", "text": "Muestra la primera carta de tu biblioteca y ponla en tu mano. Pierdes una cantidad de vida igual a su coste de maná convertido. Puedes repetir este proceso tantas veces como quieras.", "type": "Instantáneo"}, {"flavorText": "Quand son travail empiéta sur sa mort, il cessa de l'appeler l'œuvre de sa vie.", "language": "French", "multiverseId": 188526, "name": "Ad Nauseam", "text": "Révélez la carte du dessus de votre bibliothèque et mettez cette carte dans votre main. Vous perdez autant de points de vie que son coût converti de mana. Vous pouvez répéter ce processus autant de fois que vous le souhaitez.", "type": "Éphémère"}, {"flavorText": "Quando l'incarico si trasformò in non morte, smise di chiamarlo il lavoro della sua vita.", "language": "Italian", "multiverseId": 188277, "name": "Ad Nauseam", "text": "Rivela la prima carta del tuo grimorio e aggiungila alla tua mano. Perdi punti vita pari al costo di mana convertito di quella carta. Puoi ripetere questo procedimento un qualsiasi numero di volte.", "type": "Istantaneo"}, {"flavorText": "その業が不死の領域に触れるようになってから、彼はそれを一生の仕事と呼ぶことをやめた。", "language": "Japanese", "multiverseId": 187032, "name": "むかつき", "text": "あなたのライブラリーの一番上のカードを公開し、そのカードをあなたの手札に加える。 あなたはそれの点数で見たマナ・コストに等しい点数のライフを失う。あなたはこの手順を望む回数だけ繰り返してもよい。", "type": "インスタント"}, {"flavorText": "Quando a tarefa passou a envolver até os mortos-vivos, ele parou de chamá-la de \"a obra de sua vida\".", "language": "Portuguese (Brazil)", "multiverseId": 188028, "name": "Até Enjoar", "text": "Revele o card do topo de seu grimório e coloque-o na sua mão. Você perde uma quantidade de pontos de vida igual ao seu custo de mana convertido. Você pode repetir esse processo quantas vezes desejar.", "type": "Mágica Instantânea"}, {"flavorText": "Когда его творение случайно превратилось в нежить, он перестал называть его делом своей жизни.", "language": "Russian", "multiverseId": 188775, "name": "До Тошноты", "text": "Покажите верхнюю карту вашей библиотеки и положите ту карту в вашу руку. Вы теряете количество жизней, равное ее конвертированной мана-стоимости. Вы можете повторять этот процесс сколько угодно раз.", "type": "Мгновенное заклинание"}, {"flavorText": "当任务在他死后的生涯仍需持续，他便不再称此为「终生使命」。", "language": "Chinese Simplified", "multiverseId": 187281, "name": "倒胃口", "text": "展示你的牌库顶牌，并将该牌放入你手上。 你失去与该牌之总法术力费用等量的生命。你可将此流程重复进行任意次数。", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "125947", "cardKingdomId": "125706", "cardsphereId": "42233", "mcmId": "19831", "mcmMetaId": "10145", "mtgjsonV4Id": "78ee699f-d25d-594d-abd0-176af9cdbc9f", "mtgoFoilId": "31357", "mtgoId": "31356", "multiverseId": "174915", "scryfallId": "0a4ce4a1-65e3-4b40-be35-8fc55a968ec8", "scryfallIllustrationId": "a954eea3-b937-4152-8390-ea7b15398009", "scryfallOracleId": "981b0e21-e5e6-4a1e-bfde-679d56623f7f", "tcgplayerProductId": "27601"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}{B}", "manaValue": 5.0, "name": "Ad Nauseam", "number": "63", "originalText": "Reveal the top card of your library and put that card into your hand. You lose life equal to its converted mana cost. You may repeat this process any number of times.", "originalType": "Instant", "printings": ["2XM", "ALA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/a9e99e4e427443c6", "cardKingdomFoil": "https://mtgjson.com/links/0f728613c4b86f89", "cardmarket": "https://mtgjson.com/links/a50cda57a14c198e", "tcgplayer": "https://mtgjson.com/links/4c1f81c086921e5c"}, "rarity": "rare", "rulings": [{"date": "2020-08-07", "text": "If a card in a player's library has {X} in its mana cost, X is considered to be 0."}, {"date": "2020-08-07", "text": "Each time you put the revealed card into your hand and lose the appropriate amount of life, you decide whether to continue by revealing another card. You don't decide in advance how many cards to put into your hand this way."}, {"date": "2020-08-07", "text": "You may continue to reveal cards with Ad Nauseam even if your life total has been reduced to 0 or less. If you continue, you will continue to lose life, dropping your life total into negative numbers. As soon as you stop, you'll lose the game as a state-based action."}], "setCode": "ALA", "subtypes": [], "supertypes": [], "text": "Reveal the top card of your library and put that card into your hand. You lose life equal to its mana value. You may repeat this process any number of times.", "type": "Instant", "types": ["Instant"], "uuid": "6deaff86-d4d7-5002-8c5e-5fc6d8365902"}