{"artist": "Jason Rainville", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": [], "convertedManaCost": 4.0, "edhrecRank": 14977, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 402700, "name": "Widrige Umstände", "text": "Fahl (Diese Karte hat keine Farbe.)Tappe bis zu zwei Kreaturen deiner Wahl. Diese Kreaturen enttappen nicht während des nächsten Enttappsegments ihrer Beherrscher. Bringe einen 1/1 farblosen Eldrazi-Brut-Kreaturenspielstein ins Spiel. Er hat „Opfere diese Kreatur: Erhöhe deinen Manavorrat um {1}.\"", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 404793, "name": "Condiciones adversas", "text": "Vacío. (Esta carta no tiene ningún color.)Gira hasta dos criaturas objetivo. Esas criaturas no se enderezan durante el próximo paso de enderezar de su controlador. Pon en el campo de batalla una ficha de criatura Vástago Eldrazi incolora 1/1. Tiene \"Sacrificar esta criatura: Agrega {1} a tu reserva de maná\".", "type": "Instantáneo"}, {"language": "French", "multiverseId": 402999, "name": "Conditions défavorables", "text": "Carence (Cette carte n'a pas de couleur.)Engagez jusqu'à deux créatures ciblées. Ces créatures ne se dégagent pas pendant la prochaine étape de dégagement de leur contrôleur. Mettez sur le champ de bataille un jeton de créature 1/1 incolore Eldrazi et Scion. Il a « Sacrifiez cette créature : Ajoutez {1} à votre réserve. »", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 403298, "name": "Condizioni Avverse", "text": "Vacuità (Questa carta non ha colore.)TAPpa fino a due creature bersaglio. Quelle creature non STAPpano durante il prossimo STAP del loro controllore. Metti sul campo di battaglia una pedina creatura Discendente Eldrazi 1/1 incolore. Ha \"Sacrifica questa creatura: Aggiungi {1} alla tua riserva di mana\".", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 403597, "name": "逆境", "text": "欠色（このカードは無色である。）クリーチャーを最大２体対象とし、それらをタップする。それらのクリーチャーは、それらのコントローラーの次のアンタップ・ステップにアンタップしない。無色の１/１のエルドラージ・末裔・クリーチャー・トークンを１体戦場に出す。それは「このクリーチャーを生け贄に捧げる：あなたのマナ・プールに{1}を加える。」を持つ。", "type": "インスタント"}, {"language": "Korean", "multiverseId": 403896, "name": "불리한 조건", "text": "결여 (이 카드는 무색이다.)생물을 최대 두 개까지 목표로 정한다. 그 생물들을 탭한다. 그 생물들은 조종자의 다음 언탭단에 언탭되지 않는다. 1/1 무색 엘드라지 자손 생물 토큰 한 개를 전장에 놓는다. 그 생물은 \"이 생물을 희생한다: 당신의 마나풀에 {1}을 담는다.\"를 가진다.", "type": "순간마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 404195, "name": "Condições Adversas", "text": "Desprovido (Este card não tem cor.)Vire até duas criaturas alvo. Aquelas criaturas não são desviradas durante a próxima etapa de desvirar de seu controlador. Coloque no campo de batalha uma ficha de criatura incolor 1/1 do tipo Rebento Eldrazi. Ela tem \"Sacrifique esta criatura: Adicione {1} à sua reserva de mana.\".", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 404494, "name": "Неблагоприятные Условия", "text": "Лишение (У этой карты нет цвета.)Поверните не более двух целевых существ. Те существа не разворачиваются во время следующего шага разворота контролирующего их игрока. Положите на поле битвы одну фишку существа 1/1 бесцветный Эльдрази Отпрыск. Она имеет способность «Пожертвуйте это существо: добавьте {1} в ваше хранилище маны».", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 402102, "name": "不利情况", "text": "虚色（此牌没有颜色。）横置至多两个目标生物。这些生物于其操控者的下一个重置步骤中不能重置。将一个1/1无色奥札奇／孽裔衍生生物放进战场。它具有「牺牲此生物：加{1}到你的法术力池中。」", "type": "瞬间"}, {"language": "Chinese Traditional", "multiverseId": 402401, "name": "不利情況", "text": "虛色（此牌沒有顏色。）橫置至多兩個目標生物。這些生物於其操控者的下一個重置步驟中不能重置。將一個1/1無色奧札奇／孽裔衍生生物放進戰場。它具有「犧牲此生物：加{1}到你的魔法力池中。」", "type": "瞬間"}], "frameEffects": ["devoid"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "202993", "cardKingdomId": "202670", "cardsphereId": "6361", "mcmId": "284821", "mcmMetaId": "220757", "mtgjsonV4Id": "3ac54c2b-cd67-5fcd-b9f5-0e6cfb54e17c", "mtgoFoilId": "58356", "mtgoId": "58355", "multiverseId": "401803", "scryfallId": "03d86e0b-294f-41b8-a5cd-d3144a019334", "scryfallIllustrationId": "6aa5f6c0-31f2-4cc2-aab6-34546581526d", "scryfallOracleId": "7a5a81f7-1597-4972-8565-fd2a5667df99", "tcgplayerProductId": "105564"}, "keywords": ["Devoid"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Adverse Conditions", "number": "54", "originalText": "Devoid (This card has no color.)\nTap up to two target creatures. Those creatures don't untap during their controller's next untap step. Put a 1/1 colorless Eldrazi Scion creature token onto the battlefield. It has \"Sacrifice this creature: Add {1} to your mana pool.\"", "originalType": "Instant", "printings": ["BFZ"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/fb2be6581667e79e", "cardKingdomFoil": "https://mtgjson.com/links/8baeebc10fcbf14b", "cardmarket": "https://mtgjson.com/links/de651a3cefa9fb6b", "tcgplayer": "https://mtgjson.com/links/71cf5db386a4cf27"}, "rarity": "uncommon", "rulings": [{"date": "2015-08-25", "text": "You can cast Adverse Conditions with no targets. When it resolves, you’ll get an Eldrazi Scion. However, if you cast Adverse Conditions with any targets and all of those targets are illegal as it tries to resolve, it won’t resolve and none of its effects will happen. You won’t get the Eldrazi Scion in that case."}, {"date": "2015-08-25", "text": "Adverse Conditions tracks the creatures, but not their controller. If either of the creatures changes controllers before its first controller’s next untap step has come around, then it won’t untap during its new controller’s next untap step."}, {"date": "2015-08-25", "text": "Cards with devoid use frames that are variations of the transparent frame traditionally used for Eldrazi. The top part of the card features some color over a background based on the texture of the hedrons that once imprisoned the Eldrazi. This coloration is intended to aid deckbuilding and game play."}, {"date": "2015-08-25", "text": "A card with devoid is just colorless. It’s not colorless and the colors of mana in its mana cost."}, {"date": "2015-08-25", "text": "Other cards and abilities can give a card with devoid color. If that happens, it’s just the new color, not that color and colorless."}, {"date": "2015-08-25", "text": "Devoid works in all zones, not just on the battlefield."}, {"date": "2015-08-25", "text": "If a card loses devoid, it will still be colorless. This is because effects that change an object’s color (like the one created by devoid) are considered before the object loses devoid."}, {"date": "2015-08-25", "text": "Eldrazi Scions are similar to Eldrazi Spawn, seen in the Zendikar block. Note that Eldrazi Scions are 1/1, not 0/1."}, {"date": "2015-08-25", "text": "Eldrazi and Scion are each separate creature types. Anything that affects Eldrazi will affect these tokens, for example."}, {"date": "2015-08-25", "text": "Sacrificing an Eldrazi Scion creature token to add {C} to your mana pool is a mana ability. It doesn’t use the stack and can’t be responded to."}, {"date": "2015-08-25", "text": "Some instants and sorceries that create Eldrazi Scions require targets. If all targets for such a spell have become illegal by the time that spell tries to resolve, the spell won’t resolve and none of its effects will happen. You won’t get any Eldrazi Scions."}], "setCode": "BFZ", "subtypes": [], "supertypes": [], "text": "Devoid (This card has no color.)\nTap up to two target creatures. Those creatures don't untap during their controller's next untap step. Create a 1/1 colorless Eldrazi Scion creature token. It has \"Sacrifice this creature: Add {C}.\"", "type": "Instant", "types": ["Instant"], "uuid": "09ebac3a-adde-538f-8474-b7aee7e969ae"}