{"artist": "Nottsuo", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 13931, "finishes": ["nonfoil", "foil"], "flavorText": "Its fickle form holds hints of a thousand former identities.", "foreignData": [{"flavorText": "Seine undeutliche Gestalt hat Ähnlichkeit mit tausenden früherer Identitäten.", "language": "German", "multiverseId": 117690, "name": "Ätherplasma", "text": "Immer wenn das Ätherplasma eine Kreatur blockt, kannst du das Ätherplasma auf die Hand seines Besitzers zurückbringen. Falls du das tust, kannst du eine Kreaturenkarte aus deiner Hand ins Spiel bringen, so dass sie diese Kreatur blockt.", "type": "Kreatur — Illusion"}, {"flavorText": "Su forma inestable contiene trazas de mil identidades anteriores.", "language": "Spanish", "multiverseId": 118680, "name": "Eterplasma", "text": "Siempre que el Eterplasma bloquee a una criatura, puedes regresar el Eterplasma a la mano de su propietario. Si lo haces, puedes poner en juego una carta de criatura de tu mano bloqueando a esa criatura.", "type": "Criatura — Ilusión"}, {"flavorText": "Sa forme changeante renferme les traces de milliers d'anciennes identités.", "language": "French", "multiverseId": 117855, "name": "Aetherplasme", "text": "À chaque fois que l'Aetherplasme bloque une créature, vous pouvez renvoyer l'Aetherplasme dans la main de son propriétaire. Si vous faites ainsi, vous pouvez mettre en jeu une carte de créature de votre main bloquant cette créature.", "type": "Créature : illusion"}, {"flavorText": "La sua forma cangiante contiene tracce di migliaia di identità precedenti.", "language": "Italian", "multiverseId": 118020, "name": "Eterplasma", "text": "Ogniqualvolta l'Eterplasma blocca una creatura, puoi far tornare l'Eterplasma in mano al suo proprietario. Se lo fai, puoi mettere in gioco una carta creatura dalla tua mano a bloccare quella creatura.", "type": "Creatura — Illusione"}, {"flavorText": "その移ろう姿は、これまでの一千もの個体の特徴をかもし出している。", "language": "Japanese", "multiverseId": 118185, "name": "霊気の原形質", "text": "霊気の原形質がいずれかのクリーチャーのブロックに参加するたび、あなたは霊気の原形質をオーナーの手札に戻してもよい。 そうした場合、あなたはあなたの手札にあるクリーチャー・カード１枚を、そのクリーチャーをブロックしている状態で場に出してもよい。", "type": "クリーチャー — イリュージョン"}, {"flavorText": "Sua forma inconstante guarda indícios de suas milhares de identidades passadas.", "language": "Portuguese (Brazil)", "multiverseId": 118350, "name": "Éterplasma", "text": "Toda vez que Éterplasma bloqueia uma criatura, você pode devolver Éterplasma para a mão de seu dono. Se fizer isso, você pode colocar em jogo um card de criatura de sua mão bloqueando aquela criatura.", "type": "Criatura — Ilusão"}, {"flavorText": "В ее переменчивых формах угадываются тысячи прежних ее воплощений.", "language": "Russian", "multiverseId": 118515, "name": "Эфироплазма", "text": "Каждый раз, когда Эфироплазма блокирует существо, вы можете вернуть ее в руку владельца. Если вы делаете это, вы можете ввести в игру карту существа из вашей руки и блокировать им существо, блокированное Эфироплазмой.", "type": "Существо — Иллюзия"}, {"flavorText": "它的外型变幻莫测，透露千百种过往身分。", "language": "Chinese Simplified", "multiverseId": 117525, "name": "乙太原质怪", "text": "每当乙太原质怪阻挡一个生物时，你可以将乙太原质怪移回其拥有者手上。 若你如此作，你可以将一张生物牌从你的手上放置进场且阻挡该生物。", "type": "生物～虚影"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "119745", "cardKingdomId": "119580", "cardsphereId": "19496", "mcmId": "13133", "mcmMetaId": "7714", "mtgjsonV4Id": "14665a32-4673-5e8a-b18f-8ad697aed054", "mtgoFoilId": "23742", "mtgoId": "23741", "multiverseId": "96924", "scryfallId": "95bee334-c56e-4221-97ed-bea73a61b812", "scryfallIllustrationId": "5d7893c6-eb98-4dcb-b486-6c8c28c68b0e", "scryfallOracleId": "0cd99210-8d34-4112-8e41-7e8c5d2a95b9", "tcgplayerProductId": "13651"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{U}", "manaValue": 4.0, "name": "Aetherplasm", "number": "22", "originalText": "Whenever Ætherplasm blocks a creature, you may return Ætherplasm to its owner's hand. If you do, you may put a creature card from your hand into play blocking that creature.", "originalType": "Creature - Illusion", "power": "1", "printings": ["GPT"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2cd16bde83e13472", "cardKingdomFoil": "https://mtgjson.com/links/509aa9166f527f38", "cardmarket": "https://mtgjson.com/links/fc2e110c4bf67ef9", "tcgplayer": "https://mtgjson.com/links/4ac4a39f7efc0951"}, "rarity": "uncommon", "rulings": [{"date": "2006-02-01", "text": "Aetherplasm will return to your hand before any combat damage is assigned."}, {"date": "2006-02-01", "text": "If you want, you can return Aetherplasm to your hand and not put anything onto the battlefield. The attacking creature will still be considered blocked, so it won’t be able to deal combat damage to you unless it has trample or a similar ability."}, {"date": "2006-02-01", "text": "The creature you put onto the battlefield may be the Aetherplasm you just returned to your hand. This allows it to dodge abilities like Deathgazer’s."}, {"date": "2006-02-01", "text": "The creature you put onto the battlefield from your hand is blocking the attacking creature, even if the block couldn’t legally be declared (for example, if that creature enters the battlefield tapped, or it can’t block, or the attacking creature has protection from it)."}], "setCode": "GPT", "subtypes": ["Illusion"], "supertypes": [], "text": "Whenever Aetherplasm blocks a creature, you may return Aetherplasm to its owner's hand. If you do, you may put a creature card from your hand onto the battlefield blocking that creature.", "toughness": "1", "type": "Creature — Illusion", "types": ["Creature"], "uuid": "0fc98b17-8787-5188-a733-40f385b8e56a"}