{"artist": "Cyril Van Der Haegen", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 3881, "finishes": ["nonfoil", "foil"], "flavorText": "Erebos's minions hunt the Returned and warn those who consider the same folly.", "foreignData": [{"flavorText": "Erebos' Diener jagen die Wiedergekehrten und mahnen jene, die dieselbe Torheit erwägen.", "language": "German", "multiverseId": 380861, "name": "Agent des Erebos", "text": "Konstellation — Immer wenn der Agent des Erebos oder eine andere Verzauberung unter deiner Kontrolle ins Spiel kommt, schicke alle Karten aus dem Friedhof eines Spielers deiner Wahl ins Exil.", "type": "Verzauberungskreatur — Zombie"}, {"flavorText": "Los siervos de Erebos cazan a los Resurgidos y advierten a aquellos que se plantean la misma locura.", "language": "Spanish", "multiverseId": 382016, "name": "Agente de Erebos", "text": "Constelación — Siempre que el Agente de Erebos u otro encantamiento entre al campo de batalla bajo tu control, exilia todas las cartas del cementerio del jugador objetivo.", "type": "Criatura encantamiento — Zombie"}, {"flavorText": "Les serviteurs d'Érébos chassent les Reparus et avertissent les fous qui songeraient à faire de même.", "language": "French", "multiverseId": 381026, "name": "Agent d'Érébos", "text": "Constellation — À chaque fois que l'Agent d'Érébos ou un autre enchantement arrive sur le champ de bataille sous votre contrôle, exilez toutes les cartes du cimetière du joueur ciblé.", "type": "Créature-enchantement : zombie"}, {"flavorText": "I servi di Erebos cacciano i Risvegliati e mettono in guardia coloro che progettano la stessa follia.", "language": "Italian", "multiverseId": 381191, "name": "Agente di Erebos", "text": "Costellazione — Ogniqualvolta l'Agente di Erebos o un altro incantesimo entrano nel campo di battaglia sotto il tuo controllo, esilia tutte le carte dal cimitero di un giocatore bersaglio.", "type": "Creatura Incantesimo — Zombie"}, {"flavorText": "エレボスの下僕たちは蘇りし者を狩り、同じ過ちを犯そうとする者たちに対して警告をしている。", "language": "Japanese", "multiverseId": 381356, "name": "エレボスの代行者", "text": "星座 ― エレボスの代行者か他のエンチャントが１つあなたのコントロール下で戦場に出るたび、プレイヤー１人を対象とする。そのプレイヤーの墓地にあるすべてのカードを追放する。", "type": "クリーチャー・エンチャント — ゾンビ"}, {"flavorText": "에레보스의 하수인들은 되살아난 자들을 사냥하면서 똑같이 어리석은 생각을 하는 자들에게 경고를 보낸다.", "language": "Korean", "multiverseId": 381521, "name": "에레보스의 하수인", "text": "성좌 — 에레보스의 하수인이나 다른 부여마법이 당신의 조종 하에 전장에 들어올 때마다, 플레이어를 목표로 정한다. 그 플레이어의 무덤에 있는 모든 카드를 추방한다.", "type": "부여마법 생물 — 좀비"}, {"flavorText": "Os lacaios de Érebo perseguem os Ressurgidos e advertem todos os que pensam em fazer o mesmo.", "language": "Portuguese (Brazil)", "multiverseId": 381686, "name": "Agente de Érebo", "text": "Constelação — Toda vez que Agente de Érebo ou outro encantamento entrar no campo de batalha sob seu controle, exile todos os cards do cemitério do jogador alvo.", "type": "Criatura Encantamento — Zumbi"}, {"flavorText": "Слуги Эреба охотятся на Возвращенных. Для тех же, у кого хватает безрассудства самому думать об этом, они служат предупреждением.", "language": "Russian", "multiverseId": 381851, "name": "Агент Эреба", "text": "Созвездие — Каждый раз, когда Агент Эреба или другие чары выходят на поле битвы под вашим контролем, изгоните все карты из кладбища целевого игрока.", "type": "Чары Существо — Зомби"}, {"flavorText": "厄睿柏斯的仆从四处追捕转世者，警示他人勿入歧途。", "language": "Chinese Simplified", "multiverseId": 380531, "name": "厄睿柏斯的密探", "text": "星彩～每当厄睿柏斯的密探或另一个结界在你的操控下进战场时，放逐目标牌手坟墓场中的所有牌。", "type": "结界生物～灵俑"}, {"flavorText": "厄睿柏斯的僕從四處追捕轉世者，警示他人勿入歧途。", "language": "Chinese Traditional", "multiverseId": 380696, "name": "厄睿柏斯的密探", "text": "星彩～每當厄睿柏斯的密探或另一個結界在你的操控下進戰場時，放逐目標玩家墳墓場中的所有牌。", "type": "結界生物～殭屍"}], "frameEffects": ["nyxtouched"], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "194250", "cardKingdomId": "194004", "cardsphereId": "21982", "mcmId": "266699", "mcmMetaId": "209585", "mtgjsonV4Id": "3eba9561-30ec-506f-8cf7-5bda2013f26c", "mtgoFoilId": "52183", "mtgoId": "52182", "multiverseId": "380366", "scryfallId": "1e07a595-5579-4d5a-b07c-84239d690459", "scryfallIllustrationId": "2989284a-d5d3-4f79-88bc-5efbbd2feeaa", "scryfallOracleId": "3fa5e109-4a67-4523-8183-90e48a906400", "tcgplayerProductId": "82352"}, "keywords": ["Constellation"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}", "manaValue": 4.0, "name": "Agent of Erebos", "number": "59", "originalText": "Constellation — Whenever Agent of Erebos or another enchantment enters the battlefield under your control, exile all cards from target player's graveyard.", "originalType": "Enchantment Creature — Zombie", "power": "2", "printings": ["JOU"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/23e4d5274044d9f2", "cardKingdomFoil": "https://mtgjson.com/links/a300c0109141a40e", "cardmarket": "https://mtgjson.com/links/6adcfe310e3939ab", "tcgplayer": "https://mtgjson.com/links/50231de41eb8d903"}, "rarity": "uncommon", "rulings": [{"date": "2014-04-26", "text": "The constellation ability is mandatory. If you are the only legal target (perhaps because your opponent has hexproof), you must target yourself and exile all the cards from your graveyard."}, {"date": "2014-04-26", "text": "A constellation ability triggers whenever an enchantment enters the battlefield under your control for any reason. Enchantments with other card types, such as enchantment creatures, will also cause constellation abilities to trigger."}, {"date": "2014-04-26", "text": "An Aura spell without bestow that has an illegal target when it tries to resolve won't resolve and will be put into its owner's graveyard. It won't enter the battlefield and constellation abilities won't trigger. An Aura spell with bestow won't be countered this way. It will revert to being an enchantment creature and resolve, entering the battlefield and triggering constellation abilities."}, {"date": "2014-04-26", "text": "When an enchantment enters the battlefield under your control, each constellation ability of permanents you control will trigger. You can put these abilities on the stack in any order. The last ability you put on the stack will be the first one that resolves."}], "setCode": "JOU", "subtypes": ["Zombie"], "supertypes": [], "text": "Constellation — Whenever Agent of Erebos or another enchantment enters the battlefield under your control, exile target player's graveyard.", "toughness": "2", "type": "Enchantment Creature — Zombie", "types": ["Enchantment", "Creature"], "uuid": "846d8310-4e55-5d42-b813-242549bc1501"}