{"artist": "Igor Kieryluk", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 2605, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 554286, "name": "Anstachler-Ameise", "text": "Zu Beginn deines Endsegments kann jeder Spieler zwei +1/+1-Marken auf eine Kreatur legen, die er kontrolliert. Stachele jede Kreatur an, auf die auf diese Weise Marken gelegt wurden. (Bis zu deinem nächsten Zug greifen jene Kreaturen in jedem Kampf an, falls möglich, und greifen einen anderen Spieler als dich an, falls möglich.)", "type": "Kreatur — Insekt"}, {"language": "Spanish", "multiverseId": 554387, "name": "Hormiga agitadora", "text": "Al comienzo de tu paso final, cada jugador puede poner dos contadores +1/+1 sobre una criatura que controla. Incita a cada criatura sobre la que se hayan puesto contadores de esta manera. (Hasta tu próximo turno, esas criaturas atacan cada combate si pueden y atacan a un jugador que no seas tú si pueden.)", "type": "Criatura — Insecto"}, {"language": "French", "multiverseId": 554488, "name": "Fourmi agitatrice", "text": "Au début de votre étape de fin, chaque joueur peut mettre deux marqueurs +1/+1 sur une créature qu'il contrôle. Incitez chaque créature sur laquelle des marqueurs ont été mis de cette manière. (Jusqu'à votre prochain tour, ces créatures attaquent à chaque combat si possible et attaquent un joueur autre que vous si possible.)", "type": "Créature : insecte"}, {"language": "Italian", "multiverseId": 554589, "name": "Formica Sobillatrice", "text": "All'inizio della tua sottofase finale, ogni giocatore può mettere due segnalini +1/+1 su una creatura che controlla. Sprona ogni creatura che ha ricevuto segnalini in questo modo. (Fino al tuo prossimo turno, quelle creature attaccano in ogni combattimento un giocatore diverso da te, se possono farlo.)", "type": "Creatura — Insetto"}, {"language": "Japanese", "multiverseId": 554690, "name": "扇動する蟻", "text": "あなたの終了ステップの開始時に、各プレイヤーはそれぞれ、自分がコントロールしているクリーチャー１体の上に＋１/＋１カウンター２個を置いてもよい。これによりカウンターが置かれたすべてのクリーチャーを使嗾する。（次のあなたのターンまで、それらのクリーチャーは、可能なら各戦闘で攻撃し、可能ならあなたでないプレイヤーを攻撃する。）", "type": "クリーチャー — 昆虫"}, {"language": "Portuguese (Brazil)", "multiverseId": 554791, "name": "Formiga Agitadora", "text": "No início de sua etapa final, cada jogador pode colocar dois marcadores +1/+1 em uma criatura que ele controla. Atice cada criatura que tenha recebido marcadores dessa forma. (Até seu próximo turno, aquelas criaturas atacam a cada combate se estiverem aptas e atacam um jogador que não seja você se estiverem aptas.)", "type": "Criatura — Inseto"}, {"language": "Russian", "multiverseId": 554892, "name": "Муравей-Подстрекатель", "text": "В начале вашего заключительного шага каждый игрок может положить два жетона +1/+1 на существо под своим контролем. Разъярите каждое существо, на которое были положены жетоны таким образом. (До вашего следующего хода те существа атакуют в каждом бою, если могут, и атакуют не вас, а другого игрока, если могут.)", "type": "Существо — Насекомое"}, {"language": "Chinese Simplified", "multiverseId": 554993, "name": "煽动蚁", "text": "在你的结束步骤开始时，每位牌手各可以在一个由其操控的生物上放置两个+1/+1指示物。煽惑每个上面以此法放置了指示物的生物。（直到你的下一个回合，那些生物每次战斗若能攻击，则必须攻击，且若能攻击除你以外的牌手，则必须如此作。）", "type": "生物 ～昆虫"}, {"language": "Chinese Traditional", "multiverseId": 555094, "name": "煽動蟻", "text": "在你的結束步驟開始時，每位玩家各可以在一個由其操控的生物上放置兩個+1/+1指示物。煽惑每個上面以此法放置了指示物的生物。（直到你的下一個回合，那些生物每次戰鬥若能攻擊，則必須攻擊，且若能攻擊除你以外的玩家，則必須如此作。）", "type": "生物 ～昆蟲"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "257276", "mcmId": "608917", "mtgjsonV4Id": "47e185ba-7587-52b0-a2b8-8dc491ded5c9", "multiverseId": "554185", "scryfallId": "6a61c242-5273-430c-b14e-fb76dc782ba3", "scryfallIllustrationId": "08a5eaba-bd1c-4286-bb85-5957c794cbea", "scryfallOracleId": "abe377f8-35f0-4dea-a681-91d31a36815c", "tcgplayerProductId": "262974"}, "isReprint": true, "isStarter": true, "keywords": ["Goad"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}", "manaValue": 3.0, "name": "Agitator Ant", "number": "102", "originalText": "At the beginning of your end step, each player may put two +1/+1 counters on a creature they control. Goad each creature that had counters put on it this way. (Until your next turn, those creatures attack each combat if able and attack a player other than you if able.)", "originalType": "Creature — Insect", "power": "2", "printings": ["C20", "CLB", "NCC", "NEC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2ae8d6907e424585", "tcgplayer": "https://mtgjson.com/links/7b206cf1f9ef37a3"}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "As Agitator Ant's ability resolves, first you choose which creature you control, if any, to put two +1/+1 counters on, then each other player in turn order does the same, knowing the choices made before them. Then each chosen creature receives its +1/+1 counters and becomes goaded."}, {"date": "2020-04-17", "text": "If a creature can't have +1/+1 counters put on it, its controller can't choose it just to have it become goaded. If it can have counters put on it but replacement effects cause it not to receive +1/+1 counters, it doesn't become goaded."}, {"date": "2020-04-17", "text": "If a goaded creature can't attack for any reason (such as being tapped or having come under that player's control that turn), then it doesn't attack. If there's a cost associated with having it attack, its controller isn't forced to pay that cost, so it doesn't have to attack in that case either."}, {"date": "2020-04-17", "text": "If a goaded creature doesn't meet any of the above exceptions and can attack, it must attack a player other than a player who goaded it if able. It the creature can't attack any of those players but could otherwise attack, it must attack an opposing planeswalker (controlled by any opponent) or a player who goaded it."}, {"date": "2020-04-17", "text": "Attacking with a goaded creature doesn't cause it to stop being goaded."}, {"date": "2020-04-17", "text": "Being goaded more than once by the same player is redundant."}, {"date": "2020-04-17", "text": "If you goad a creature you control, it must attack and it must attack a player rather than a planeswalker."}, {"date": "2020-04-17", "text": "If a creature you control has been goaded by multiple opponents, it must attack one of your opponents who hasn't goaded it. If a creature you control has been goaded by each of your opponents, you choose which opponent it attacks."}], "securityStamp": "oval", "setCode": "NEC", "subtypes": ["Insect"], "supertypes": [], "text": "At the beginning of your end step, each player may put two +1/+1 counters on a creature they control. Goad each creature that had counters put on it this way. (Until your next turn, those creatures attack each combat if able and attack a player other than you if able.)", "toughness": "2", "type": "Creature — Insect", "types": ["Creature"], "uuid": "597669fc-b687-5746-9ad5-98ebe1fc7d13"}