{"artist": "Todd Lockwood", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210251", "mcmId": "294406", "mtgjsonV4Id": "57f51b2a-954f-502f-a57b-18d589dca44e", "multiverseId": "423592", "scryfallId": "6caf8b21-1807-442c-a461-c89c7591df70", "scryfallIllustrationId": "995f5b3f-7988-4eb5-9335-284f5c3a1e10", "scryfallOracleId": "38f84e55-049c-441e-b4e2-1e207ab5dbe5", "tcgplayerProductId": "125571"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Agyrem", "number": "11", "originalText": "Whenever a white creature dies, return it to the battlefield under its owner's control at the beginning of the next end step.\nWhenever a nonwhite creature dies, return it to its owner's hand at the beginning of the next end step.\nWhenever you roll {Chaos}, creatures can't attack you until a player planeswalks.", "originalType": "Plane — Ravnica", "printings": ["OHOP", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/27673126ece6abaf", "tcgplayer": "https://mtgjson.com/links/fc3e2befde8b88ba"}, "rarity": "common", "rulings": [{"date": "2009-10-01", "text": "A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"}, {"date": "2009-10-01", "text": "A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."}, {"date": "2009-10-01", "text": "The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."}, {"date": "2009-10-01", "text": "If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}, {"date": "2009-10-01", "text": "Agyrem’s first and second abilities each set up a delayed triggered ability. These abilities will trigger at the beginning of the next end step even if Agyrem is no longer the face-up plane card."}, {"date": "2009-10-01", "text": "Agyrem’s first ability will return a card to the battlefield only if it’s still in the graveyard by the time the delayed triggered ability resolves. Similarly, Agyrem’s second ability will return a card to its owner’s hand only if it’s still in the graveyard by the time the delayed triggered ability resolves."}, {"date": "2009-10-01", "text": "If a creature is put into a graveyard from the battlefield, its last existence on the battlefield is checked to determine its color."}, {"date": "2009-10-01", "text": "A creature that caused either of Agyrem’s first two abilities to trigger will be returned at the beginning of the next end step even if it’s not a creature card. (For example, if it’s a Treetop Village.)"}, {"date": "2009-10-01", "text": "If a token creature is put into a graveyard from the battlefield, one of Agyrem’s first two abilities will trigger, but the token will cease to exist long before it would be returned somewhere."}, {"date": "2009-10-01", "text": "If multiple creatures are put into their owners’ graveyards at the same time (due to combat damage or Planar Cleansing, for example), Agyrem’s first two abilities trigger that many times. At the beginning of the next end step, the player whose turn it is at that time puts all of their Agyrem delayed triggered abilities on the stack in any order, then each other player in turn order does the same. The last ability put on the stack is the first one that resolves. The creatures are returned one at a time."}, {"date": "2009-10-01", "text": "If you’re affected by the chaos ability, creatures will still be able to attack planeswalkers you control."}], "setCode": "OPCA", "subtypes": ["Ravnica"], "supertypes": [], "text": "Whenever a white creature dies, return it to the battlefield under its owner's control at the beginning of the next end step.\nWhenever a nonwhite creature dies, return it to its owner's hand at the beginning of the next end step.\nWhenever you roll {CHAOS}, creatures can't attack you until a player planeswalks.", "type": "Plane — Ravnica", "types": ["Plane"], "uuid": "202e6df5-33d8-5706-afcf-1db90ae22137"}