{"artist": "Richard Wright", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 4.0, "edhrecRank": 10692, "finishes": ["foil"], "flavorText": "The last hedron slotted into place, locking Ulamog in an infinite loop of binding energy.", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "204594", "cardsphereId": "37014", "mcmId": "285046", "mtgjsonV4Id": "341d86cb-0f2b-5c04-9251-488f81e0d36e", "scryfallId": "b41cecd5-85d0-402a-ae50-a31b397c1fa4", "scryfallIllustrationId": "9a8cdc04-3478-4603-8bf5-9d66b596e12e", "scryfallOracleId": "5a399467-abb7-4f33-962d-8bef5aa9ebf3", "tcgplayerProductId": "93368"}, "isPromo": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}", "manaValue": 4.0, "name": "Aligned Hedron Network", "number": "222s", "printings": ["BFZ", "PBFZ"], "promoTypes": ["setpromo", "datestamped", "prerelease"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/b09769c4bc136291", "tcgplayer": "https://mtgjson.com/links/bb1f73f012c8bd64"}, "rarity": "rare", "rulings": [{"date": "2015-08-25", "text": "Check the power of each creature as Aligned Hedron Network’s ability resolves to determine if it’s exiled. It doesn’t matter who controls the creature."}, {"date": "2015-08-25", "text": "If Aligned Hedron Network exiles multiple creatures, those cards all return to the battlefield at the same time."}, {"date": "2015-08-25", "text": "If Aligned Hedron Network leaves the battlefield before its triggered ability resolves, no creatures will be exiled."}, {"date": "2015-08-25", "text": "Auras attached to the exiled creatures will be put into their owners’ graveyards. Equipment attached to the exiled creatures will become unattached and remain on the battlefield. Any counters on the exiled creatures will cease to exist."}, {"date": "2015-08-25", "text": "If a creature token is exiled, it ceases to exist. It won’t be returned to the battlefield."}, {"date": "2015-08-25", "text": "The exiled cards return to the battlefield immediately after Aligned Hedron Network leaves the battlefield. Nothing happens between the two events, including state-based actions."}, {"date": "2015-08-25", "text": "In a multiplayer game, if Aligned Hedron Network’s owner leaves the game, the exiled cards will return to the battlefield. Because the one-shot effect that returns the cards isn’t an ability that goes on the stack, it won’t cease to exist along with the leaving player’s spells and abilities on the stack."}, {"date": "2015-08-25", "text": "In some very rare situations, Aligned Hedron Network may enter the battlefield as a creature with power 5 or greater. If this happens, Aligned Hedron Network will exile itself along with other creatures with power 5 or greater. Those cards will immediately return to the battlefield. If this causes a loop with Aligned Hedron Network continually exiling and returning itself, the game will be a draw unless a player breaks the loop somehow."}], "securityStamp": "oval", "setCode": "PBFZ", "subtypes": [], "supertypes": [], "text": "When Aligned Hedron Network enters the battlefield, exile all creatures with power 5 or greater until Aligned Hedron Network leaves the battlefield. (Those creatures return under their owners' control.)", "type": "Artifact", "types": ["Artifact"], "uuid": "2144c35c-2b31-5cac-bd60-8e4879f3ac2d"}