{"artist": "Bram Sels", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 2811, "finishes": ["nonfoil", "foil"], "flavorText": "\"There is no justice when some profit and others go without.\"", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "21f5618b-3f64-5d30-9b9c-78bb6b0af37f", "mtgoId": "65677", "scryfallId": "27057e88-fd59-453d-8f3a-136ec6c8c40a", "scryfallIllustrationId": "647bfbe2-1b8a-4e3d-b7fd-5d7c0321aa52", "scryfallOracleId": "278e51fe-3cd9-4c82-bd81-2164771f8611"}, "isOnlineOnly": true, "isReprint": true, "isStarter": true, "keywords": ["Flash"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}", "manaValue": 4.0, "name": "Alms Collector", "number": "65677", "power": "3", "printings": ["C17", "PZ2"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2017-08-25", "text": "Alms Collector’s replacement effect applies to an instruction to draw more than one card before any replacement effects apply to individual cards drawn. For example, if you have a card with dredge in your graveyard, you can’t dredge it before the effect of Divination is modified by Alms Collector’s replacement effect."}, {"date": "2017-08-25", "text": "Once a replacement effect has been applied to an event, it can’t be applied again to the resulting events. For example, once Alms Collector’s replacement effect has modified the effect of a player’s Divination, Thought Reflection can double that player’s resulting card draw without Alms Collector’s replacement effect applying again."}, {"date": "2017-08-25", "text": "To determine whether a player is instructed to draw multiple once or instructed multiple times to draw one card, count how many times the word “draw” is used. Alms Collector’s replacement effect watches for one “draw” that instructs a player to draw multiple cards (including instructions to “draw a card for each. . .”)."}, {"date": "2017-08-25", "text": "If an effect puts cards into a player’s hand without using the word “draw” at all, Alms Collector’s replacement effect doesn’t apply."}, {"date": "2017-08-25", "text": "If two players each control an Alms Collector and an effect instructs them to each draw two or more cards, the replacement effect of each Alms Collector is applied and both players end up drawing two cards."}, {"date": "2017-08-25", "text": "If two players each control an Alms Collector and a third player would draw two or more cards, the third player chooses which Alms Collector’s replacement effect will apply, and therefore which of the first two players draws a card."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": ["Cat", "Cleric"], "supertypes": [], "text": "Flash\nIf an opponent would draw two or more cards, instead you and that player each draw a card.", "toughness": "4", "type": "Creature — Cat Cleric", "types": ["Creature"], "uuid": "a5b5aaaa-a646-5778-b358-ff383a0037a5"}