{"artist": "Randy Gallegos", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 8.0, "edhrecRank": 11749, "finishes": ["nonfoil", "foil"], "flavorText": "Being an alpha means proving it every full moon.", "foreignData": [{"flavorText": "Alphatiere müssen sich bei jedem Vollmond neu beweisen.", "language": "German", "multiverseId": 337008, "name": "Kampf der Alphatiere", "text": "Eine Kreatur deiner Wahl, die ein Gegner kontrolliert, fügt jeder anderen Kreatur, die dieser Spieler kontrolliert, so viele Schadenspunkte zu, wie ihre Stärke beträgt, dann fügt jede dieser Kreaturen der gewählten Kreatur Schadenspunkte in Höhe ihrer Stärke zu.", "type": "Hexerei"}, {"flavorText": "Ser un alfa significa probarlo cada luna llena.", "language": "Spanish", "multiverseId": 337179, "name": "Lucha de alfas", "text": "La criatura objetivo que controla un oponente le hace daño igual a su fuerza a cada otra criatura que controla ese jugador, luego cada una de esas criaturas le hace daño igual a su fuerza a esa criatura.", "type": "Conjuro"}, {"flavorText": "Un alpha doit prouver son statut à chaque pleine lune.", "language": "French", "multiverseId": 336666, "name": "Combat d'alphas", "text": "Une créature ciblée qu'un adversaire contrôle inflige un nombre de blessures égal à sa force à chaque autre créature que ce joueur contrôle, puis chacune de ces créatures inflige un nombre de blessures égal à sa force à cette créature.", "type": "Rituel"}, {"flavorText": "Essere un esemplare alfa significa dimostrarlo ad ogni luna piena.", "language": "Italian", "multiverseId": 337350, "name": "Rissa dell'Alfa", "text": "Una creatura bersaglio controllata da un avversario infligge danno pari alla propria forza a ogni altra creatura controllata da quel giocatore, poi ognuna di quelle creature infligge a quella creatura danno pari alla propria forza.", "type": "Stregoneria"}, {"flavorText": "頭目であることは、満月のたびにそれを証明しなければいけないことだ。", "language": "Japanese", "multiverseId": 337521, "name": "頭目の乱闘", "text": "いずれかの対戦相手がコントロールするクリーチャー１体を対象とする。それは自身のパワーに等しい点数のダメージを、そのプレイヤーがコントロールする他の各クリーチャーにそれぞれ与え、その後それらの各クリーチャーは、それぞれのパワーに等しい点数のダメージをそのクリーチャーに与える。", "type": "ソーサリー"}, {"flavorText": "우두머리로 있으려면 보름달이 뜰 때마다 그럴 자격이 있음을 증명해야 한다.", "language": "Korean", "multiverseId": 336153, "name": "우두머리의 난투극", "text": "상대가 조종하는 생물 한 개를 목표로 정한다. 그 생물은 그 플레이어가 조종하는 다른 생물들에게 자신의 공격력만큼의 피해를 입히고, 이렇게 피해를 입은 생물들은 그 생물에게 각자의 공격력만큼의 피해를 입힌다.", "type": "집중마법"}, {"flavorText": "Ser um alfa significa provar isso a cada lua cheia.", "language": "Portuguese (Brazil)", "multiverseId": 336495, "name": "Disputa de Alfa", "text": "A criatura alvo que um oponente controla causa dano igual ao seu poder a cada outra criatura que aquele jogador controla, depois, cada uma daquelas criaturas causa dano igual ao seu poder àquela criatura.", "type": "Feitiço"}, {"flavorText": "Быть вожаком означает доказывать это в каждое полнолуние.", "language": "Russian", "multiverseId": 336837, "name": "Схватка Вожаков", "text": "Целевое существо под контролем оппонента наносит повреждения, равные своей силе, каждому другому существу под контролем того игрока, затем каждое из тех существ наносит повреждения, равные своей силе, тому существу.", "type": "Волшебство"}, {"flavorText": "身为首领，代表着每次满月都要证明自己能耐。", "language": "Chinese Simplified", "multiverseId": 335982, "name": "首领争斗", "text": "目标由对手操控的生物对每个由该牌手操控的其他生物各造成等同于前者力量的伤害，然后这些生物各对前者造成等同于后者力量的伤害。", "type": "法术"}, {"flavorText": "身為首領，代表著每次滿月都要證明自己能耐。", "language": "Chinese Traditional", "multiverseId": 336324, "name": "首領爭鬥", "text": "目標由對手操控的生物對每個由該玩家操控的其他生物各造成等同於前者力量的傷害，然後這些生物各對前者造成等同於後者力量的傷害。", "type": "巫術"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "186512", "cardKingdomId": "186339", "cardsphereId": "12174", "mcmId": "252591", "mcmMetaId": "204855", "mtgjsonV4Id": "9c5299f5-ac93-58eb-b745-28034537d7ae", "mtgoFoilId": "43306", "mtgoId": "43305", "multiverseId": "262657", "scryfallId": "e2ec168a-3e4f-4527-901a-bc28cc28d125", "scryfallIllustrationId": "ac2830f1-f5b1-4971-bebf-95977515163c", "scryfallOracleId": "cfc023e0-9e9d-48ac-bfb5-74bfd5977dee", "tcgplayerProductId": "57823"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{6}{R}{R}", "manaValue": 8.0, "name": "Alpha Brawl", "number": "82", "originalText": "Target creature an opponent controls deals damage equal to its power to each other creature that player controls, then each of those creatures deals damage equal to its power to that creature.", "originalType": "Sorcery", "printings": ["DKA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/0271da5e2e460aaf", "cardKingdomFoil": "https://mtgjson.com/links/8fb4d5b2c1249cb2", "cardmarket": "https://mtgjson.com/links/dd56d1379d454c69", "tcgplayer": "https://mtgjson.com/links/e2e77cdef860eeab"}, "rarity": "rare", "rulings": [{"date": "2011-01-22", "text": "The two parts of Alpha Brawl’s effect happen sequentially: first the targeted creature deals damage, then the other creatures deal damage. State-based actions aren’t checked in the middle, so creatures that are dealt lethal damage by the targeted creature will still deal damage."}, {"date": "2011-01-22", "text": "None of the damage dealt due to Alpha Brawl is combat damage."}, {"date": "2011-01-22", "text": "Combat abilities like first strike, double strike, and trample don’t apply and will have no impact on Alpha Brawl’s effect."}, {"date": "2011-01-22", "text": "Abilities like lifelink and deathtouch that care about any kind of damage are taken into account."}, {"date": "2011-01-22", "text": "If the targeted creature has infect or wither, the damage it deals will result in -1/-1 counters being put on each creature it deals damage to. The power of those creatures will be reduced when they deal damage back to the targeted creature."}, {"date": "2011-01-22", "text": "The damage dealt by the targeted creature is not divided in any way. For example, if a 3/3 creature is targeted, it will deal 3 damage to each other creature controlled by its controller."}], "setCode": "DKA", "subtypes": [], "supertypes": [], "text": "Target creature an opponent controls deals damage equal to its power to each other creature that player controls, then each of those creatures deals damage equal to its power to that creature.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "7e84abf0-a001-517d-ad16-b5b153bd8483"}