{"artist": "Richard Luong", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 6273, "faceName": "Hakka, Whispering Raven", "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "dbdfd2eb-edea-511a-93c5-d0a13984ef0d", "mtgoId": "88238", "scryfallId": "09551fee-6389-42be-936a-67371531d9ea", "scryfallIllustrationId": "087b963f-b915-4e29-bcd9-686c28501754", "scryfallOracleId": "0a69c3dd-52a3-4ef6-b53f-b0780e0dc5f8"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Flying", "Scry"], "language": "English", "layout": "modal_dfc", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Alrund, God of the Cosmos // Hakka, Whispering Raven", "number": "88238", "originalReleaseDate": "2021-02-28", "otherFaceIds": ["428026fc-5319-57bc-aec5-2e392ff4bcae"], "power": "2", "printings": ["KHM", "PKHM", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-01-22", "text": "Alrund recieved day 1 eratta to clarify that you select from the cards \"revealed this way\". For more information, see https://magic.wizards.com/en/articles/archive/feature/kaldheim-release-notes-2021-01-22"}, {"date": "2021-02-05", "text": "There is a single triangle icon in the top left corner of the front face. There is a double triangle icon in the top left corner of the back face."}, {"date": "2021-02-05", "text": "To determine whether it is legal to play a modal double-faced card, consider only the characteristics of the face you’re playing and ignore the other face’s characteristics."}, {"date": "2021-02-05", "text": "If an effect allows you to play a specific modal double-faced card, you may cast it as a spell or play it as a land, as determined by which face you choose to play. If an effect allows you to cast (rather than “play”) a specific modal double-faced card, you can’t play it as a land."}, {"date": "2021-02-05", "text": "If an effect allows you to play a land or cast a spell from among a group of cards, you may play or cast a modal double-faced card with any face that fits the criteria of that effect."}, {"date": "2021-02-05", "text": "The mana value of a modal double-faced card is based on the characteristics of the face that’s being considered. On the stack and battlefield, consider whichever face is up. In all other zones, consider only the front face. This is different than how the mana value of a transforming double-faced card is determined."}, {"date": "2021-02-05", "text": "A modal double-faced card can’t be transformed or be put onto the battlefield transformed. Ignore any instruction to transform a modal double-faced card or to put one onto the battlefield transformed."}, {"date": "2021-02-05", "text": "If an effect puts a double-faced card onto the battlefield, it enters with its front face up. If that front face can’t be put onto the battlefield, it doesn’t enter the battlefield."}, {"date": "2021-02-05", "text": "If an effect instructs a player to choose a card name, the name of either face may be chosen. If that effect or a linked ability refers to a spell with the chosen name being cast and/or a land with the chosen name being played, it considers only the chosen name, not the other face’s name."}, {"date": "2021-02-05", "text": "In the Commander variant, a double-faced card’s color identity is determined by the mana costs and mana symbols in the rules text of both faces combined. If either face has a color indicator or basic land type, those are also considered."}, {"date": "2021-02-05", "text": "The words “revealed this way” were inadvertently omitted from the printed card. Alrund’s current Oracle text appears above."}, {"date": "2021-02-05", "text": "Alrund’s first ability applies only while Alrund is on the battlefield. In every other zone, Alrund is 1/1."}, {"date": "2021-02-05", "text": "You may choose any card type, but the ones that may appear in your library are artifact, creature, enchantment, instant, land, planeswalker, sorcery, and tribal (a card type found on some older cards). Supertypes such as snow and basic may not be chosen. Subtypes such as God, Aura, and Forest also may not be chosen."}], "securityStamp": "oval", "setCode": "PRM", "side": "b", "subtypes": ["Bird"], "supertypes": ["Legendary"], "text": "Flying\nWhenever Hakka, Whispering Raven deals combat damage to a player, return it to its owner's hand, then scry 2.", "toughness": "3", "type": "Legendary Creature — Bird", "types": ["Creature"], "uuid": "bcbea9ed-4dab-5a93-a4e1-98704ca80397"}