{"artist": "Seb McKinnon", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 8.0, "edhrecRank": 2467, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "dec1612e-cfb2-5338-a5a7-612ae9d98760", "mtgoId": "70745", "scryfallId": "488a7bbd-b2e3-43d8-8f37-d8c2ddd320f3", "scryfallIllustrationId": "40a42f98-dbc6-4652-aae2-9ec4679a10f7", "scryfallOracleId": "c9160997-0305-47f5-9a2f-77588d167da0"}, "isOnlineOnly": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{6}{U}{U}", "manaValue": 8.0, "name": "Aminatou's Augury", "number": "70745", "originalReleaseDate": "2018-12-06", "printings": ["C18", "MB1", "PZ2"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2018-07-13", "text": "If you wish to put a land card onto the battlefield, you do so while Aminatou’s Augury is resolving, before you’re allowed to cast any of the other cards. You may do this even if you’ve already played a land this turn."}, {"date": "2018-07-13", "text": "If a nonland card has multiple types, such as an artifact creature, you may cast it as either of those types. For example, you could cast one artifact creature as your artifact card and another artifact creature as your creature card."}, {"date": "2018-07-13", "text": "If you exile a land with another card type, you can’t play it later in the turn. You can only put it onto the battlefield at the time Aminatou’s Augury instructs you to."}, {"date": "2018-07-13", "text": "You must follow the normal timing permissions and restrictions of each spell you cast."}, {"date": "2018-07-13", "text": "If you cast a card “without paying its mana cost,” you can’t choose to cast it for any alternative costs, such as evoke costs. You can, however, pay additional costs. If the card has any mandatory additional costs, such as that of Tormenting Voice, those must be paid to cast the card."}, {"date": "2018-07-13", "text": "If a spell has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2018-07-13", "text": "Casting an exiled card causes it to leave exile. You can’t cast it multiple times."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": [], "supertypes": [], "text": "Exile the top eight cards of your library. You may put a land card from among them onto the battlefield. Until end of turn, for each nonland card type, you may cast a spell of that type from among the exiled cards without paying its mana cost.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "78aeb2eb-0c25-5431-b06c-6c960f0e945b"}