{"artist": "Seb McKinnon", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B", "U", "W"], "colors": ["B", "U", "W"], "convertedManaCost": 3.0, "edhrecRank": 3068, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "7229d56a-2ffb-5423-97a9-30fab62eebb3", "mtgoId": "70763", "scryfallId": "73ab23e2-457d-4726-89fa-5112109c2204", "scryfallIllustrationId": "9da492c3-2e5f-4f40-a254-fc3993a8ead6", "scryfallOracleId": "3a30089d-cd2d-49be-9b06-7a2454117692"}, "isOnlineOnly": true, "isReprint": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "loyalty": "3", "manaCost": "{W}{U}{B}", "manaValue": 3.0, "name": "Aminatou, the Fateshifter", "number": "70763", "originalReleaseDate": "2018-12-06", "printings": ["2X2", "C18", "OC18", "PZ2"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2018-07-13", "text": "You draw a card and put one back all while Aminatou’s first ability is resolving. Nothing can happen between the two, and no player may choose to take actions."}, {"date": "2018-07-13", "text": "Aminatou’s second ability can target any permanent you own, including those another player controls."}, {"date": "2018-07-13", "text": "Once the exiled permanent returns, it’s considered a new object with no relation to the object that it was. Auras attached to the exiled permanent will be put into their owners’ graveyards. Equipment attached to the exiled permanent will become unattached and remain on the battlefield. Any counters on the exiled permanent will cease to exist."}, {"date": "2018-07-13", "text": "If a token is exiled this way, it will cease to exist and won’t return to the battlefield."}, {"date": "2018-07-13", "text": "As Aminatou’s third ability resolves, you choose a direction, then each player takes control of their new permanents at the same time."}, {"date": "2018-07-13", "text": "The effect of Aminatou’s third ability lasts indefinitely. It continues to apply after Aminatou (or her controller) leaves the game."}, {"date": "2018-07-13", "text": "In a two-player game, each player gains control of each permanent the other controls (aside from Aminatou) no matter which direction you choose."}, {"date": "2018-07-13", "text": "In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. The effect of Aminatou’s third ability stops applying to all permanents that player controlled and control of them reverts to their previous controller."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": ["Aminatou"], "supertypes": ["Legendary"], "text": "[+1]: Draw a card, then put a card from your hand on top of your library.\n[−1]: Exile another target permanent you own, then return it to the battlefield under your control.\n[−6]: Choose left or right. Each player gains control of all nonland permanents other than Aminatou, the Fateshifter controlled by the next player in the chosen direction.\nAminatou, the Fateshifter can be your commander.", "type": "Legendary Planeswalker — Aminatou", "types": ["Planeswalker"], "uuid": "f68e378a-208c-5b13-a435-24a7c407ca0d"}