{"artist": "Dan Scott", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 15774, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 457495, "name": "Amplifeuer", "text": "Decke zu Beginn deines Versorgungssegments Karten oben von deiner Bibliothek auf, bis du eine Kreaturenkarte aufdeckst. Bis zu deinem nächsten Zug wird die Basis-Stärke des Amplifeuers zum Doppelten der Stärke jener Karte und seine Basis-Widerstandskraft wird zum Doppelten der Widerstandskraft jener Karte. Lege die aufgedeckten Karten in zufälliger Reihenfolge unter deine Bibliothek.", "type": "Kreatur — Elementarwesen"}, {"language": "Spanish", "multiverseId": 457754, "name": "Amplifuego", "text": "Al comienzo de tu mantenimiento, muestra las primeras cartas de tu biblioteca hasta que muestres una carta de criatura. Hasta tu próximo turno, la fuerza base del Amplifuego se convierte en el doble de la fuerza de esa carta y su resistencia base se convierte en el doble de la resistencia de esa carta. Pon las cartas mostradas en el fondo de tu biblioteca en un orden aleatorio.", "type": "Criatura — Elemental"}, {"language": "French", "multiverseId": 458013, "name": "Flamplificateur", "text": "Au début de votre entretien, révélez les cartes du dessus de votre bibliothèque jusqu'à ce que vous révéliez une carte de créature. Jusqu'à votre prochain tour, la force de base du Flamplificateur devient égale au double de la force de cette carte et son endurance de base devient égale au double de l'endurance de cette carte. Mettez les cartes révélées au-dessous de votre bibliothèque dans un ordre aléatoire.", "type": "Créature : élémental"}, {"language": "Italian", "multiverseId": 458272, "name": "Amplifuoco", "text": "All'inizio del tuo mantenimento, rivela carte dalla cima del tuo grimorio finché non riveli una carta creatura. Fino al tuo prossimo turno, la forza base dell'Amplifuoco diventa il doppio della forza di quella carta e la sua costituzione base diventa il doppio della costituzione di quella carta. Metti le carte rivelate in fondo al tuo grimorio in ordine casuale.", "type": "Creatura — Elementale"}, {"language": "Japanese", "multiverseId": 458531, "name": "倍火", "text": "あなたのアップキープの開始時に、クリーチャー・カードが公開されるまで、あなたのライブラリーの一番上からカードを１枚ずつ公開する。あなたの次のターンまで、倍火の基本のパワーはそのカードのパワーの２倍になり、これの基本のタフネスはそのカードのタフネスの２倍になる。それらの公開されたカードをあなたのライブラリーの一番下に無作為の順番で置く。", "type": "クリーチャー — エレメンタル"}, {"language": "Korean", "multiverseId": 458790, "name": "증폭불길", "text": "당신의 유지단 시작에, 생물 카드가 공개될 때까지 당신의 서고 맨 위 카드를 공개한다. 당신의 다음 턴까지, 증폭불길의 기본 공격력은 그 카드의 공격력의 두 배가 되고 기본 방어력은 그 카드의 방어력의 두 배가 된다. 공개된 카드들은 무작위 순서로 당신의 서고 맨 밑에 놓는다.", "type": "생물 — 정령"}, {"language": "Portuguese (Brazil)", "multiverseId": 459049, "name": "Amplifogo", "text": "No início de sua manutenção, revele cards do topo de seu grimório até revelar um card de criatura. Até seu próximo turno, o poder básico de Amplifogo torna-se o dobro do poder daquele card e a resistência básica de Amplifogo torna-se o dobro da resistência daquele card. Coloque os cards revelados no fundo de seu grimório em ordem aleatória.", "type": "Criatura — Elemental"}, {"language": "Russian", "multiverseId": 459308, "name": "Сверхогонь", "text": "В начале вашего шага поддержки показывайте карты с верха вашей библиотеки до тех пор, пока вы не покажете карту существа. До вашего следующего хода базовая сила Сверхогня становится равной удвоенному значению силы той карты, а его базовая выносливость — удвоенному значению выносливости той карты. Положите показанные карты в низ вашей библиотеки в случайном порядке.", "type": "Существо — Элементаль"}, {"language": "Chinese Simplified", "multiverseId": 459567, "name": "倍火妖", "text": "在你的维持开始时，从你的牌库顶开始展示牌，直到你展示出一张生物牌为止。直到你的下一个回合，倍火妖的基础力量成为该牌力量的两倍，且其基础防御力成为该牌防御力的两倍。将所展示的牌以随机顺序置于你的牌库底。", "type": "生物 ～元素"}, {"language": "Chinese Traditional", "multiverseId": 459826, "name": "倍火妖", "text": "在你的維持開始時，從你的牌庫頂開始展示牌，直到你展示出一張生物牌為止。直到你的下一個回合，倍火妖的基礎力量成為該牌力量的兩倍，且其基礎防禦力成為該牌防禦力的兩倍。將所展示的牌以隨機順序置於你的牌庫底。", "type": "生物 ～元素"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "223480", "cardKingdomId": "223168", "cardsphereId": "58258", "mcmId": "368102", "mcmMetaId": "267536", "mtgArenaId": "69220", "mtgjsonV4Id": "21cc3904-5ef0-5f93-814b-4f8cc97c9458", "mtgoId": "71184", "multiverseId": "457236", "scryfallId": "7a58c77f-7c15-44f4-8011-6046482a2d08", "scryfallIllustrationId": "86fce992-2e43-4491-9a5a-646683c2a926", "scryfallOracleId": "c6861c50-d336-4352-a76d-ec22a86ec09e", "tcgplayerProductId": "182953"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}{R}", "manaValue": 4.0, "name": "Amplifire", "number": "92", "originalText": "At the beginning of your upkeep, reveal cards from the top of your library until you reveal a creature card. Until your next turn, Amplifire's base power becomes twice that card's power and its base toughness becomes twice that card's toughness. Put the revealed cards on the bottom of your library in a random order.", "originalType": "Creature — Elemental", "power": "1", "printings": ["PRNA", "RNA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7c47acbaa2c8f18b", "cardKingdomFoil": "https://mtgjson.com/links/76a8fd00b86990ee", "cardmarket": "https://mtgjson.com/links/403ee50c97f8cb3f", "tcgplayer": "https://mtgjson.com/links/8f7e616d392111d9"}, "rarity": "rare", "rulings": [{"date": "2019-01-25", "text": "Amplifire will be a 1/1 creature from the time your untap step begins until the time its triggered ability resolves during your upkeep."}, {"date": "2019-01-25", "text": "Any effects that modify Amplifire’s power and/or toughness without setting them to a specific number or value will apply after its base power and toughness are set, regardless of the order in which those effects were created. The same is true of counters that modify its power and toughness."}, {"date": "2019-01-25", "text": "If you reveal your entire library and don’t reveal a creature card, Amplifire becomes a 0/0 creature and you put your library back in a random order."}], "securityStamp": "oval", "setCode": "RNA", "subtypes": ["Elemental"], "supertypes": [], "text": "At the beginning of your upkeep, reveal cards from the top of your library until you reveal a creature card. Until your next turn, Amplifire's base power becomes twice that card's power and its base toughness becomes twice that card's toughness. Put the revealed cards on the bottom of your library in a random order.", "toughness": "1", "type": "Creature — Elemental", "types": ["Creature"], "uuid": "4e2ecd9f-45ad-50c2-88d3-de4debdb43a9"}