{"artist": "Grzegorz Rutkowski", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 6.0, "edhrecRank": 724, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 495719, "name": "Uralter Grünwächter", "text": "Reichweite\nDu kannst Länder aus deinem Friedhof spielen.\nFalls ein Land ins Spiel kommt und dadurch bei einer bleibenden Karte, die du kontrollierst, eine ausgelöste Fähigkeit auslöst, wird die Fähigkeit ein weiteres Mal ausgelöst.", "type": "Kreatur — Elementarwesen"}, {"language": "French", "multiverseId": 495794, "name": "Gardien vert ancien", "text": "Portée\nVous pouvez jouer des terrains depuis votre cimetière.\nSi l'arrivée sur le champ de bataille d'un terrain provoque le déclenchement d'une capacité déclenchée d'un permanent que vous contrôlez, cette capacité se déclenche une fois de plus.", "type": "Créature : élémental"}, {"language": "Japanese", "multiverseId": 495869, "name": "古の緑守り", "text": "到達\nあなたはあなたの墓地から土地をプレイしてもよい。\n土地が戦場に出たことによりあなたがコントロールしているパーマネントの誘発型能力が誘発するなら、その能力は追加でもう１回誘発する。", "type": "クリーチャー — エレメンタル"}], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "237558", "cardKingdomId": "237259", "cardsphereId": "71307", "mcmId": "496710", "mcmMetaId": "317160", "mtgjsonV4Id": "dd9918f0-cea4-5564-82df-808741fc6f3a", "multiverseId": "495644", "scryfallId": "c6a058aa-f620-4a1f-af32-6e6be2cb3e4b", "scryfallIllustrationId": "9e0f1f93-5eca-4e8c-8808-5647bb9952a7", "scryfallOracleId": "3bcf090c-e890-4a9f-a8aa-6079e4ec9947", "tcgplayerProductId": "222168"}, "isStarter": true, "keywords": ["Reach"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{G}{G}", "manaValue": 6.0, "name": "Ancient Greenwarden", "number": "357", "originalText": "Reach\nYou may play lands from your graveyard.\nIf a land entering the battlefield causes a triggered ability of a permanent you control to trigger, that ability triggers an additional time.", "originalType": "Creature — Elemental", "power": "5", "printings": ["PRM", "PZNR", "ZNR"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/b6c7c3f4924ee413", "cardKingdomFoil": "https://mtgjson.com/links/cbb387a05ba590d2", "cardmarket": "https://mtgjson.com/links/08822d2bbbd100f9", "tcgplayer": "https://mtgjson.com/links/30e2f6815542ccfa"}, "rarity": "mythic", "rulings": [{"date": "2020-09-25", "text": "Ancient Greenwarden doesn’t change the times when you can play those lands. You can still play only one land per turn, and only during your main phase when you have priority and the stack is empty."}, {"date": "2020-09-25", "text": "Ancient Greenwarden doesn’t allow you to activate abilities (such as cycling) of land cards in your graveyard."}, {"date": "2020-09-25", "text": "Ancient Greenwarden allows you to play a modal double-faced card’s land face, but not a nonland face."}, {"date": "2020-09-25", "text": "Ancient Greenwarden’s third ability affects a land’s own enters-the-battlefield triggered abilities as well as other triggered abilities that trigger when that land enters the battlefield, such as landfall abilities. Such triggered abilities start with “when” or “whenever.”"}, {"date": "2020-09-25", "text": "Replacement effects are unaffected by Ancient Greenwarden’s third ability. This includes any abilities that apply “as [this land] enters the battlefield” and any ability that says the land enters the battlefield with counters."}, {"date": "2020-09-25", "text": "Ancient Greenwarden’s effect doesn’t copy the triggered ability; it causes the ability to trigger twice. Any choices made as you put the ability onto the stack, such as modes and targets, are made separately for each instance of the ability. Any choices made on resolution, such as whether to put counters on a permanent, are also made individually."}, {"date": "2020-09-25", "text": "The trigger event doesn’t have to specifically refer to “lands.” For example, an ability that triggers “whenever a creature enters the battlefield under your control” would trigger twice if the entering land is also a creature."}, {"date": "2020-09-25", "text": "An ability that triggers whenever you play a land won’t trigger an additional time."}, {"date": "2020-09-25", "text": "Look at each permanent as it exists on the battlefield, taking into account continuous effects, to determine whether any triggered abilities will trigger multiple times. For example, if you control Ashaya, Soul of the Wild, a nontoken creature entering the battlefield will cause any appropriate abilities to trigger an additional time."}, {"date": "2020-09-25", "text": "If you control two Ancient Greenwardens, a land entering the battlefield causes abilities to trigger three times, not four. A third Ancient Greenwarden causes abilities to trigger four times, a fourth causes abilities to trigger five times, and so on."}, {"date": "2020-09-25", "text": "If a land entering the battlefield at the same time as Ancient Greenwarden (including Ancient Greenwarden itself if an effect causes it to be a land) causes a triggered ability of a permanent you control to trigger, that ability triggers an additional time."}], "securityStamp": "oval", "setCode": "ZNR", "subtypes": ["Elemental"], "supertypes": [], "text": "Reach\nYou may play lands from your graveyard.\nIf a land entering the battlefield causes a triggered ability of a permanent you control to trigger, that ability triggers an additional time.", "toughness": "7", "type": "Creature — Elemental", "types": ["Creature"], "uuid": "f0e55194-46e6-518c-8bbd-5deb749e92d0", "variations": ["d9464359-036d-515d-9bd1-8888f97e722c"]}