{"artist": "Min Yum", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 5.0, "edhrecRank": 4666, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "212312", "cardsphereId": "49485", "mcmId": "297675", "mtgjsonV4Id": "dd143ad4-5e15-55ad-bfc4-9e4737c3cd4c", "scryfallId": "36848874-2435-4fc0-82d9-f773aacbd76b", "scryfallIllustrationId": "6ce3ed26-bf8c-4c24-a070-b7419f028166", "scryfallOracleId": "3c49e98d-d33b-47fa-8b07-b38b367de2c7", "tcgplayerProductId": "130612"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Embalm", "Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}{W}", "manaValue": 5.0, "name": "Angel of Sanctions", "number": "1s", "power": "3", "printings": ["AKH", "AKR", "C19", "PAKH"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/c250069c38ee92ca", "tcgplayer": "https://mtgjson.com/links/b92aa7c91fdc2125"}, "rarity": "mythic", "rulings": [{"date": "2017-04-18", "text": "Auras attached to the exiled permanent will be put into their owners’ graveyards. Any Equipment will become unattached and remain on the battlefield. Any counters on the exiled permanent will cease to exist."}, {"date": "2017-04-18", "text": "If a token is exiled this way, it will cease to exist and won’t return to the battlefield."}, {"date": "2017-04-18", "text": "The exiled card returns to the battlefield immediately after Angel of Sanctions leaves the battlefield. Nothing happens between the two events, including state-based actions."}, {"date": "2017-04-18", "text": "For each card with embalm, a corresponding game play supplement token can be found in some Amonkhet booster packs. These supplements are not required to play with cards with embalm; you can use the same items to represent an embalmed token as you would any other token."}, {"date": "2017-04-18", "text": "The token copies exactly what was printed on the original card and nothing else. It doesn’t copy any information about the object the card was before it was put into your graveyard."}, {"date": "2017-04-18", "text": "The token is a Zombie in addition to its other types and is white instead of its other colors. It has no mana cost, and thus its mana value is 0. These are copiable values of the token that other effects may copy."}, {"date": "2017-04-18", "text": "If the card copied by the token had any “when [this permanent] enters the battlefield” abilities, then the token also has those abilities and will trigger them when it’s created. Similarly, any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities that the token has copied will also work."}, {"date": "2017-04-18", "text": "In a multiplayer game, if Angel of Sanctions’s owner leaves the game, the exiled card will return to the battlefield. Because the one-shot effect that returns the card isn’t an ability that goes on the stack, it won’t cease to exist along with the leaving player’s spells and abilities on the stack."}, {"date": "2017-04-18", "text": "If Angel of Sanctions leaves the battlefield before its triggered ability resolves, the target permanent won’t be exiled."}, {"date": "2017-07-14", "text": "If a spell or ability puts a creature card with embalm into your graveyard during your main phase, you’ll have priority immediately after that spell or ability resolves. You can activate the creature card’s embalm ability before any player can exile it with an effect, such as that of Crook of Condemnation, if it’s legal for you to do so."}, {"date": "2017-07-14", "text": "Once you’ve activated an embalm ability, the card is immediately exiled. Opponents can’t try to stop the ability by exiling the card with an effect such as that of Crook of Condemnatnion."}], "securityStamp": "oval", "setCode": "PAKH", "subtypes": ["Angel"], "supertypes": [], "text": "Flying\nWhen Angel of Sanctions enters the battlefield, you may exile target nonland permanent an opponent controls until Angel of Sanctions leaves the battlefield.\nEmbalm {5}{W} ({5}{W}, Exile this card from your graveyard: Create a token that's a copy of it, except it's a white Zombie Angel with no mana cost. Embalm only as a sorcery.)", "toughness": "4", "type": "Creature — Angel", "types": ["Creature"], "uuid": "35c05ab3-288a-53de-a35c-1b54addd9369"}