{"artist": "Slawomir Maniak", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 6714, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "213426", "cardsphereId": "50507", "mcmId": "298968", "mtgjsonV4Id": "bf28c959-021b-5861-91b4-99769901c85c", "scryfallId": "93373139-0c5a-45e5-bfdc-74869d2a5eb6", "scryfallIllustrationId": "7fb76b30-b422-4eae-808f-d7b34cbcb6e9", "scryfallOracleId": "2317a33f-665e-4cbc-bb5c-16b912ac2eef", "tcgplayerProductId": "137125"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Exert", "Flying", "Vigilance"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}{W}", "manaValue": 4.0, "name": "Angel of Condemnation", "number": "3s", "power": "3", "printings": ["HOU", "PHOU"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/d0ad9eb424791324", "tcgplayer": "https://mtgjson.com/links/ee62924f94175bdd"}, "rarity": "rare", "rulings": [{"date": "2017-04-18", "text": "If an exerted creature is already untapped during your next untap step (most likely because it had vigilance or an effect untapped it), exert’s effect preventing it from untapping expires without having done anything."}, {"date": "2017-04-18", "text": "If you gain control of another player’s creature until end of turn and exert it, it will untap during that player’s untap step."}, {"date": "2017-04-18", "text": "You can’t exert a creature unless an effect allows you to do so. Similar effects that “tap and freeze” a creature (such as that of Decision Paralysis) don’t exert that creature."}, {"date": "2017-07-14", "text": "Some cards in the Hour of Devastation set let you exert a creature as a cost to activate one of its abilities. You can exert it to pay that cost even if you’ve already exerted it earlier in the turn. Exerting it multiple times will keep it tapped only during your next untap step."}, {"date": "2017-07-14", "text": "If Angel of Condemnation leaves the battlefield before its last ability resolves, the target creature won’t be exiled."}, {"date": "2017-07-14", "text": "The card exiled with Angel of Condemnation’s last ability returns to the battlefield immediately after Angel of Condemnation leaves the battlefield. Nothing happens between the two events, including state-based actions."}, {"date": "2017-07-14", "text": "Tapping Angel of Condemnation to activate either of its abilities while it’s attacking doesn’t remove it from combat."}, {"date": "2017-07-14", "text": "Auras attached to the exiled creature will be put into their owners’ graveyards. Any Equipment will become unattached and remain on the battlefield. Any counters on the exiled permanent will cease to exist."}, {"date": "2017-07-14", "text": "If a creature token is exiled this way, it will cease to exist and won’t return to the battlefield."}, {"date": "2017-07-14", "text": "If Angel of Condemnation leaves the battlefield before its first activated ability resolves, the target creature is still exiled. That card returns to the battlefield even if Angel of Condemnation has left the battlefield before the next end step."}], "securityStamp": "oval", "setCode": "PHOU", "subtypes": ["Angel"], "supertypes": [], "text": "Flying, vigilance\n{2}{W}, {T}: Exile another target creature. Return that card to the battlefield under its owner's control at the beginning of the next end step.\n{2}{W}, {T}, Exert Angel of Condemnation: Exile another target creature until Angel of Condemnation leaves the battlefield. (An exerted creature won't untap during your next untap step.)", "toughness": "3", "type": "Creature — Angel", "types": ["Creature"], "uuid": "9dab2c31-a065-50b3-9515-5a56e9f5d938"}