{"artist": "Joseph Meehan", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 8.0, "edhrecRank": 12762, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 410728, "name": "Engel der Erlösung", "text": "Fliegend\nDelirium — Immer wenn der Engel der Erlösung Schaden zufügt und falls dein Friedhof vier oder mehr unterschiedliche Kartentypen enthält, schicke eine Kreatur deiner Wahl, die ein Gegner kontrolliert, ins Exil.", "type": "Kreatur — Engel"}, {"language": "Spanish", "multiverseId": 413038, "name": "Ángel de la liberación", "text": "Vuela.\nDelirio — Siempre que el Ángel de la liberación haga daño, si entre las cartas de tu cementerio hay cuatro o más tipos de carta, exilia la criatura objetivo que controla un oponente.", "type": "Criatura — Ángel"}, {"language": "French", "multiverseId": 411058, "name": "Ange de la délivrance", "text": "Vol\nDélire — À chaque fois que l'Ange de la délivrance inflige des blessures, s'il y a au moins quatre types de carte parmi les cartes de votre cimetière, exilez une créature ciblée qu'un adversaire contrôle.", "type": "Créature : ange"}, {"language": "Italian", "multiverseId": 411388, "name": "Angelo della Redenzione", "text": "Volare\nDelirio — Ogniqualvolta l'Angelo della Redenzione infligge danno, se ci sono quattro o più tipi di carta tra le carte nel tuo cimitero, esilia una creatura bersaglio controllata da un avversario.", "type": "Creatura — Angelo"}, {"language": "Japanese", "multiverseId": 411718, "name": "救出の天使", "text": "飛行\n昂揚 ― 救出の天使がダメージを与えるたび、あなたの墓地にあるカードにカード・タイプが合計４種類以上含まれる場合、対戦相手がコントロールするクリーチャー１体を対象とし、それを追放する。", "type": "クリーチャー — 天使"}, {"language": "Korean", "multiverseId": 412048, "name": "구원의 천사", "text": "비행\n섬망 — 구원의 천사가 피해를 입힐 때마다, 당신의 무덤에 네 개 이상의 카드 유형이 있다면, 상대가 조종하는 생물을 목표로 정한다. 그 생물을 추방한다.", "type": "생물 — 천사"}, {"language": "Portuguese (Brazil)", "multiverseId": 412378, "name": "Anjo do Livramento", "text": "Voar\nDelírio — Toda vez que Anjo do Livramento causar dano, se houver quatro ou mais tipos de card entre os cards de seu cemitério, exile a criatura alvo que um oponente controla.", "type": "Criatura — Anjo"}, {"language": "Russian", "multiverseId": 412708, "name": "Ангел Освобождения", "text": "Полет\nБуйство — Каждый раз, когда Ангел Освобождения наносит повреждения, если среди карт на вашем кладбище есть не менее четырех типов карт, изгоните целевое существо под контролем оппонента.", "type": "Существо — Ангел"}, {"language": "Chinese Simplified", "multiverseId": 410068, "name": "解脱天使", "text": "飞行\n躁狂～每当解脱天使造成伤害时，若你坟墓场中牌的类别有四种或更多，则放逐目标由对手操控的生物。", "type": "生物～天使"}, {"language": "Chinese Traditional", "multiverseId": 410398, "name": "解脫天使", "text": "飛行\n躁狂～每當解脫天使造成傷害時，若你墳墓場中牌的類別有四種或更多，則放逐目標由對手操控的生物。", "type": "生物～天使"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "206068", "cardKingdomId": "205587", "cardsphereId": "41631", "mcmId": "288915", "mcmMetaId": "222155", "mtgjsonV4Id": "ad49485c-5536-5f29-89b2-80bf1d69253a", "mtgoFoilId": "59917", "mtgoId": "59916", "multiverseId": "409738", "scryfallId": "f4e12f83-eab8-4113-ab63-3f7a830861d4", "scryfallIllustrationId": "d2e48582-27b5-4a43-a869-c5ef23536944", "scryfallOracleId": "f888f3ba-8316-4c10-bf97-873731f7d364", "tcgplayerProductId": "115270"}, "keywords": ["Delirium", "Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{6}{W}{W}", "manaValue": 8.0, "name": "Angel of Deliverance", "number": "2", "originalText": "Flying\nDelirium — Whenever Angel of Deliverance deals damage, if there are four or more card types among cards in your graveyard, exile target creature an opponent controls.", "originalType": "Creature — Angel", "power": "6", "printings": ["PRM", "PSOI", "SOI"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ee5eb32b4a44a0a3", "cardKingdomFoil": "https://mtgjson.com/links/14eb5407b0888a30", "cardmarket": "https://mtgjson.com/links/47a05b1856c56814", "tcgplayer": "https://mtgjson.com/links/78c4ad1a10fc00b7"}, "rarity": "rare", "rulings": [{"date": "2016-04-08", "text": "If Angel of Deliverance deals damage to multiple creatures, players, or planeswalkers at once (for example, if it’s blocked by two smaller creatures) its last ability triggers only once."}, {"date": "2016-04-08", "text": "If Angel of Deliverance deals damage and is dealt lethal damage at the same time, its ability will trigger."}, {"date": "2016-04-08", "text": "If Angel of Deliverance deals lethal damage to a creature, that creature can’t be targeted by Angel of Deliverance’s triggered ability. It’s already in its owner’s graveyard."}, {"date": "2016-04-08", "text": "If you have three noncreature card types among cards in your graveyard and Angel of Deliverance deals damage at the same time another creature you control is dealt lethal damage, the ability won’t trigger. The creature doesn’t die until after Angel of Deliverance’s ability checks to see if it triggers."}, {"date": "2016-04-08", "text": "The card types in Magic are artifact, creature, enchantment, instant, land, planeswalker, sorcery, and tribal (a card type that appears on some older cards). Supertypes (such as legendary and basic) and subtypes (such as Human and Equipment) are not counted."}, {"date": "2016-04-08", "text": "The number of card types matters, not the number of cards. For example, Wicker Witch (an artifact creature) along with Catalog (an instant) and Chaplain’s Blessing (a sorcery) will enable delirium."}, {"date": "2016-04-08", "text": "Because you consider only the characteristics of a double-faced card’s front face while it’s not on the battlefield, the types of its back face won’t be counted for delirium."}, {"date": "2016-04-08", "text": "In some rare cases, you can have a token or a copy of a spell in your graveyard at the moment that an object’s delirium ability counts the card types among cards in your graveyard, before that token or copy ceases to exist. Because tokens and copies of spells are not cards, even if they are copies of cards, their types will never be counted."}, {"date": "2016-04-08", "text": "Most triggered delirium abilities use an intervening “if” clause. There must be four or more card types among cards in your graveyard in order for these abilities to trigger, otherwise they never trigger at all. There’s no way to have the ability trigger if there aren’t enough card types, even if you intend to raise that number in response to the triggered ability. The number of card types is checked again as the trigger resolves, and if it has become too low somehow, the ability does nothing. If which card types are in your graveyard changes but the quantity of card types stays the same (or increases), then the delirium triggered ability will still resolve."}], "securityStamp": "oval", "setCode": "SOI", "subtypes": ["Angel"], "supertypes": [], "text": "Flying\nDelirium — Whenever Angel of Deliverance deals damage, if there are four or more card types among cards in your graveyard, exile target creature an opponent controls.", "toughness": "6", "type": "Creature — Angel", "types": ["Creature"], "uuid": "c97476d0-8dee-537b-86fc-0ce120e1a19b"}