{"artist": "Zoltan Boros", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 1.0, "edhrecRank": 1521, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 509658, "name": "Gnade des Engels", "text": "Sekundenbruchteil (Solange dieser Zauberspruch sich auf dem Stapel befindet, können Spieler keine Zaubersprüche wirken oder Fähigkeiten aktivieren, die keine Manafähigkeiten sind.)\nDu kannst in diesem Zug die Partie nicht verlieren und deine Gegner können in diesem Zug die Partie nicht gewinnen. Bis zum Ende des Zuges reduziert Schaden, der deinen Lebenspunktestand unter 1 reduzieren würde, ihn stattdessen auf 1.", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 509947, "name": "Gracia del ángel", "text": "Fracción de segundo. (Mientras este hechizo esté en la pila, los jugadores no pueden lanzar hechizos o activar habilidades que no sean habilidades de maná.)\nTú no puedes perder el juego este turno y tus oponentes no pueden ganar el juego este turno. Hasta el final del turno, el daño que fuera a reducir tu total de vidas a menos de 1, en vez de eso, lo reduce a 1.", "type": "Instantáneo"}, {"language": "French", "multiverseId": 510236, "name": "Grâce de l'ange", "text": "Fraction de seconde (Tant que ce sort est sur la pile, les joueurs ne peuvent pas lancer de sorts ou activer de capacités qui ne sont pas des capacités de mana.)\nVous ne pouvez pas perdre la partie ce tour-ci et vos adversaires ne peuvent pas la gagner ce tour-ci. Jusqu'à la fin du tour, les blessures qui devraient réduire votre total de points de vie à moins de 1 le réduisent à 1 à la place.", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 510525, "name": "Grazia dell'Angelo", "text": "Battibaleno (Fintanto che questa magia è in pila, i giocatori non possono lanciare magie o attivare abilità che non siano abilità di mana.)\nIn questo turno, non puoi perdere la partita e i tuoi avversari non possono vincere la partita. Fino alla fine del turno, qualsiasi danno che ridurrebbe i tuoi punti vita a meno di 1 li riduce invece a 1.", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 510814, "name": "天使の嗜み", "text": "刹那（この呪文がスタック上にあるかぎり、プレイヤーは呪文を唱えられず、マナ能力でない起動型能力を起動できない。）\nこのターン、あなたはこのゲームに敗北することはできず、このターン、あなたの対戦相手はこのゲームに勝利することはできない。ターン終了時まで、あなたのライフ総量を１点未満に減少させるダメージは、代わりにあなたのライフ総量を１点に減少させる。", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 511103, "name": "Graça do Anjo", "text": "Fração de segundo (Enquanto esta mágica estiver na pilha, os jogadores não poderão conjurar mágicas ou ativar habilidades que não sejam habilidades de mana.)\nVocê não pode perder o jogo neste turno e seus oponentes não podem vencer o jogo neste turno. Até o final do turno, o dano que reduziria seu total de pontos de vida para menos de 1, em vez disso, o reduz para 1.", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 511392, "name": "Благоволение Ангела", "text": "Мгновение ока (Пока это заклинание находится в стеке, игроки не могут разыгрывать заклинания или активировать способности, которые не являются мана-способностями.)\nВы не можете проиграть партию в этом ходу, а ваши оппоненты не могут выиграть партию в этом ходу. До конца хода повреждения, которые должны снизить количество ваших жизней до значения менее 1, снижают его до 1 вместо этого.", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 511681, "name": "天使恩典", "text": "转瞬（只要此咒语在堆叠上，牌手便不能施放咒语或起动不是法术力异能的异能。）\n本回合中，你这盘游戏不会输，对手也不会赢。直到回合结束，将使你的总生命减少至1以下的伤害，改为将它减少至1。", "type": "瞬间"}, {"language": "Chinese Traditional", "multiverseId": 511970, "name": "天使恩典", "text": "轉瞬（只要此咒語在堆疊上，玩家便不能施放咒語或起動不是魔法力異能的異能。）\n本回合中，你這盤遊戲不會輸，對手也不會贏。直到回合結束，將使你的總生命減少至1以下的傷害，改為將它減少至1。", "type": "瞬間"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "242957", "cardKingdomId": "242452", "cardsphereId": "74629", "mcmId": "542506", "mcmMetaId": "8311", "mtgjsonV4Id": "fcd3b8c0-4454-5a6c-b070-9e7ba0b4b381", "mtgoId": "86371", "multiverseId": "509369", "scryfallId": "e78e39ea-20be-4196-992c-7ed2cb8150c1", "scryfallIllustrationId": "e325c8fa-5971-4ee9-977b-14a3c213dc0a", "scryfallOracleId": "66ca8a60-e028-4a5f-8177-860b888cb9d1", "tcgplayerProductId": "233724"}, "isReprint": true, "keywords": ["Split second"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{W}", "manaValue": 1.0, "name": "Angel's Grace", "number": "4", "originalText": "Split second (As long as this spell is on the stack, players can't cast spells or activate abilities that aren't mana abilities.)\nYou can't lose the game this turn and your opponents can't win the game this turn. Until end of turn, damage that would reduce your life total to less than 1 reduces it to 1 instead.", "originalType": "Instant", "printings": ["MMA", "PLIST", "TSP", "TSR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/669357bed57aa3e1", "cardKingdomFoil": "https://mtgjson.com/links/c14a97875188475b", "cardmarket": "https://mtgjson.com/links/9c60062a80219ed6", "tcgplayer": "https://mtgjson.com/links/f2dccafe40440463"}, "rarity": "rare", "rulings": [{"date": "2021-03-19", "text": "If the resolution of a triggered ability involves casting a spell, that spell can’t be cast if a spell with split second is on the stack."}, {"date": "2021-03-19", "text": "After a spell with split second resolves (or otherwise leaves the stack), players may again cast spells and activate abilities before the next object on the stack resolves."}, {"date": "2021-03-19", "text": "Angel’s Grace doesn’t prevent damage. It only changes the result of damage dealt to you. For example, a 5/5 creature with lifelink that deals damage to you will still cause its controller to gain 5 life, even if that damage reduces your life total from 3 to 1."}, {"date": "2021-03-19", "text": "Angel’s Grace doesn’t stop loss of life from effects that say that you lose life."}, {"date": "2021-03-19", "text": "If you have less than 1 life, damage dealt to you reduces your life total further below 0 (as normal)."}, {"date": "2021-03-19", "text": "You can’t pay more life than you have, even if you won’t lose the game."}, {"date": "2021-03-19", "text": "In a Commander game, combat damage you’re dealt by a commander is still tracked, even if it doesn’t change your life total."}, {"date": "2021-03-19", "text": "Players still get priority while a card with split second is on the stack; their options are just limited to mana abilities and certain special actions."}, {"date": "2021-03-19", "text": "Players may turn face-down creatures face up while a spell with split second is on the stack."}, {"date": "2021-03-19", "text": "Split second doesn’t stop triggered abilities from triggering, such as that of Chalice of the Void. If one does, its controller puts it on the stack and chooses targets for it, if any. Those abilities will resolve as normal."}, {"date": "2021-03-19", "text": "Casting a spell with split second won’t affect spells and abilities that are already on the stack."}], "securityStamp": "oval", "setCode": "TSR", "subtypes": [], "supertypes": [], "text": "Split second (As long as this spell is on the stack, players can't cast spells or activate abilities that aren't mana abilities.)\nYou can't lose the game this turn and your opponents can't win the game this turn. Until end of turn, damage that would reduce your life total to less than 1 reduces it to 1 instead.", "type": "Instant", "types": ["Instant"], "uuid": "69f967db-b2c6-53f4-81f9-7003ba349777"}