{"artist": "Lake Hurwitz", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["deck"], "borderColor": "black", "colorIdentity": ["B", "R"], "colors": ["B", "R"], "convertedManaCost": 5.0, "edhrecRank": 15156, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 441907, "name": "Angraths Zorn", "text": "Zerstöre eine Kreatur deiner Wahl. Angraths Zorn fügt einem Spieler deiner Wahl 3 Schadenspunkte zu. Du kannst deine Bibliothek und/oder deinen Friedhof nach einer Karte namens Angrath, Minotauren-Pirat, durchsuchen, sie offen vorzeigen und auf deine Hand nehmen. Falls du auf diese Weise deine Bibliothek durchsuchst, mische sie danach.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 441916, "name": "Furia de Angrath", "text": "Destruye la criatura objetivo. La Furia de Angrath hace 3 puntos de daño al jugador objetivo. Puedes buscar en tu biblioteca y/o cementerio una carta llamada Angrath, pirata minotauro, mostrarla y ponerla en tu mano. Si buscas en tu biblioteca de esta manera, barájala.", "type": "Conjuro"}, {"language": "French", "multiverseId": 441925, "name": "Fureur d'Angrath", "text": "Détruisez une créature ciblée. La Fureur d'Angrath inflige 3 blessures au joueur ciblé. Vous pouvez chercher dans votre bibliothèque et/ou votre cimetière une carte appelée Angrath, pirate minotaure, la révéler et la mettre dans votre main. Si vous cherchez dans votre bibliothèque de cette manière, mélangez-la.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 441934, "name": "Furia di Angrath", "text": "Distruggi una creatura bersaglio. La Furia di Angrath infligge 3 danni a un giocatore bersaglio. Puoi passare in rassegna il tuo grimorio e/o il tuo cimitero per una carta chiamata Angrath, Pirata Minotauro, rivelarla e aggiungerla alla tua mano. Se passi in rassegna il tuo grimorio in questo modo, rimescolalo.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 441943, "name": "アングラスの憤怒", "text": "クリーチャー１体とプレイヤー１人を対象とし、その前者を破壊する。アングラスの憤怒はその後者に３点のダメージを与える。あなたはあなたのライブラリーやあなたの墓地から「ミノタウルスの海賊、アングラス」という名前のカード１枚を探し、それを公開してあなたの手札に加えてもよい。これによりあなたのライブラリーからカードを探したなら、あなたのライブラリーを切り直す。", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 441952, "name": "앙그라스의 분노", "text": "생물을 목표로 정한다. 그 생물을 파괴한다. 플레이어를 목표로 정한다. 앙그라스의 분노는 그 플레이어에게 피해 3점을 입힌다. 당신은 당신의 서고 및/또는 무덤에서 이름이 미노타우로스 해적 앙그라스인 카드 한 장을 찾아 공개한 후 당신의 손으로 가져갈 수 있다. 당신이 이런 식으로 당신의 서고를 찾아보았다면, 당신의 서고를 섞는다.", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 441961, "name": "Fúria de Angrath", "text": "Destrua a criatura alvo. Fúria de Angrath causa 3 pontos de dano ao jogador alvo. Você pode procurar um card com o nome Angrath, Pirata Minotauro, em seu grimório e/ou cemitério, revelá-lo e colocá-lo em sua mão. Se procurar em seu grimório desta maneira, embaralhe-o.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 441970, "name": "Ярость Анграта", "text": "Уничтожьте целевое существо. Ярость Анграта наносит 3 повреждения целевому игроку. Вы можете найти в вашей библиотеке и (или) на вашем кладбище карту с именем Анграт, Пират-Минотавр, показать ее и положить в вашу руку. Если вы ищете таким образом в вашей библиотеке, перетасуйте ее.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 441979, "name": "安戈斯的怒火", "text": "消灭目标生物。安戈斯的怒火对目标牌手造成3点伤害。你可以从你的牌库和／或坟墓场中搜寻一张名称为牛头怪海盗安戈斯的牌，展示该牌，并将它置于你手上。如果你以此法搜寻你的牌库，则将它洗牌。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 441988, "name": "安戈斯的怒火", "text": "消滅目標生物。安戈斯的怒火對目標玩家造成3點傷害。你可以從你的牌庫和／或墳墓場中搜尋一張名稱為牛頭怪海盜安戈斯的牌，展示該牌，並將它置於你手上。如果你以此法搜尋你的牌庫，則將它洗牌。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "216293", "cardsphereId": "53421", "mcmId": "314466", "mcmMetaId": "235676", "mtgArenaId": "67039", "mtgjsonV4Id": "96931c17-c4d2-5de8-bbc5-74ac3c149405", "mtgoId": "66875", "multiverseId": "441898", "scryfallId": "708006ba-d494-4093-b108-8249b110831e", "scryfallIllustrationId": "f568e396-1fdb-4f95-b738-2f0dd6d8b49e", "scryfallOracleId": "61f3a549-77b4-4403-afa2-a0f02603f2e6", "tcgplayerProductId": "154407"}, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}{R}", "manaValue": 5.0, "name": "Angrath's Fury", "number": "204", "originalText": "Destroy target creature. Angrath's Fury deals 3 damage to target player. You may search your library and/or graveyard for a card named Angrath, Minotaur Pirate, reveal it, and put it into your hand. If you search your library this way, shuffle it.", "originalType": "Sorcery", "printings": ["RIX"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/66425339efb894ba", "cardmarket": "https://mtgjson.com/links/029390ca2a58c1f8", "tcgplayer": "https://mtgjson.com/links/75e2ddc46476b7fc"}, "rarity": "rare", "rulings": [{"date": "2018-01-19", "text": "You can’t cast Angrath’s Fury unless you choose both a target creature and a target player or planeswalker."}, {"date": "2018-01-19", "text": "If either target becomes illegal after you cast Angrath’s Fury but before it resolves, the other is still affected as appropriate and you’ll search for Angrath. However, if both targets become illegal, the spell doesn’t resolve and you won’t search."}], "securityStamp": "oval", "setCode": "RIX", "subtypes": [], "supertypes": [], "text": "Destroy target creature. Angrath's Fury deals 3 damage to target player or planeswalker. You may search your library and/or graveyard for a card named Angrath, Minotaur Pirate, reveal it, and put it into your hand. If you search your library this way, shuffle.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "a6b382c7-4539-57c8-85df-0559c052d9d2"}