{"artist": "Lake Hurwitz", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 2.0, "edhrecRank": 7038, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "237894", "cardsphereId": "71537", "mcmId": "497615", "mcmMetaId": "225269", "mtgjsonV4Id": "3e390854-d802-5794-83cc-ab5d61dbf26d", "scryfallId": "46f810c2-310e-42f5-ab1f-d56396cf5124", "scryfallIllustrationId": "37174da0-47dc-4b29-8481-e831d4a36196", "scryfallOracleId": "4e0b9273-6614-41a8-9738-959349c0717b", "tcgplayerProductId": "222423"}, "isReprint": true, "keywords": ["Embalm"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}", "manaValue": 2.0, "name": "Anointer Priest", "number": "7", "power": "1", "printings": ["AKH", "AKR", "PLIST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d50198391d9976cf", "cardmarket": "https://mtgjson.com/links/dea6b603230662fb", "tcgplayer": "https://mtgjson.com/links/76d9f4fd1a9a4e1a"}, "rarity": "common", "rulings": [{"date": "2017-04-18", "text": "For each card with embalm, a corresponding game play supplement token can be found in some Amonkhet booster packs. These supplements are not required to play with cards with embalm; you can use the same items to represent an embalmed token as you would any other token."}, {"date": "2017-04-18", "text": "The token copies exactly what was printed on the original card and nothing else. It doesn’t copy any information about the object the card was before it was put into your graveyard."}, {"date": "2017-04-18", "text": "If Anointer Priest is a token, most likely because it’s embalmed, it will cause its own ability to trigger when it enters the battlefield."}, {"date": "2017-04-18", "text": "If the card copied by the token had any “when [this permanent] enters the battlefield” abilities, then the token also has those abilities and will trigger them when it’s created. Similarly, any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities that the token has copied will also work."}, {"date": "2017-04-18", "text": "The token is a Zombie in addition to its other types and is white instead of its other colors. It has no mana cost, and thus its mana value is 0. These are copiable values of the token that other effects may copy."}, {"date": "2017-04-18", "text": "If Anointer Priest enters the battlefield at the same time as a creature token, its ability triggers for that other creature. For example, if you control Anointed Procession and embalm Anointer Priest, the triggered ability of each one triggers twice and you gain a total of 4 life."}, {"date": "2017-07-14", "text": "If a spell or ability puts a creature card with embalm into your graveyard during your main phase, you’ll have priority immediately after that spell or ability resolves. You can activate the creature card’s embalm ability before any player can exile it with an effect, such as that of Crook of Condemnation, if it’s legal for you to do so."}, {"date": "2017-07-14", "text": "Once you’ve activated an embalm ability, the card is immediately exiled. Opponents can’t try to stop the ability by exiling the card with an effect such as that of Crook of Condemnatnion."}], "setCode": "PLIST", "subtypes": ["Human", "Cleric"], "supertypes": [], "text": "Whenever a creature token enters the battlefield under your control, you gain 1 life.\nEmbalm {3}{W} ({3}{W}, Exile this card from your graveyard: Create a token that's a copy of it, except it's a white Zombie Human Cleric with no mana cost. Embalm only as a sorcery.)", "toughness": "3", "type": "Creature — Human Cleric", "types": ["Creature"], "uuid": "bfdbca72-a1fd-5686-af3f-b6bd154fe856"}