{"artist": "Svetlin Velinov", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 10.0, "edhrecRank": 1076, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "8b377c80-1c80-58c0-8107-7bd338391bc9", "mtgoId": "86000", "scryfallId": "a5fce965-c246-4ccd-96c5-bcad54bc582d", "scryfallIllustrationId": "d816c8da-36f7-4eb2-adda-0effe4e11502", "scryfallOracleId": "b4d6747c-3516-4e71-be30-af007c6b1dc4"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Cascade"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{8}{G}{G}", "manaValue": 10.0, "name": "Apex Devastator", "number": "86000", "originalReleaseDate": "2020-12-15", "power": "10", "printings": ["CMR", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2020-11-10", "text": "Each of Apex Devastator’s four cascade abilities will look for a nonland card with mana value less than 10 (Apex Devastator’s mana value). This doesn’t change even if one or more of the spells you cast because of those cascade abilities has cascade itself. Each of those additional cascade abilities, if any, will refer to the mana value of the spell that caused it to trigger. In other words, each cascade ability cares only about the spell that caused it to trigger, the stack can get messy, and we wish you luck."}, {"date": "2020-11-10", "text": "Each instance of cascade triggers and resolves separately. The spell you cast due to the first cascade ability will go on the stack on top of the second, third, and fourth cascade abilities. That spell will resolve before you exile cards for the second cascade ability. The spell you cast for the second will resolve before you exile cards for the third, and so on."}, {"date": "2021-03-19", "text": "The mana value of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."}, {"date": "2021-03-19", "text": "If the last card exiled is a card with an Adventure, you may only cast the spell as an Adventure if that spell has a lesser mana cost than the spell with cascade."}, {"date": "2021-03-19", "text": "The mana value of a modal double-faced card in exile is that of its front face. If the last card you exile is a modal double-faced card, you may only cast the back face if the resulting spell would also have a lesser mana value than the spell with cascade."}, {"date": "2021-03-19", "text": "A spell’s mana value is determined only by its mana cost. Ignore any alternative costs, additional costs, cost increases, or cost reductions. For example, Bloodbraid Elf’s mana value is always 4."}, {"date": "2021-03-19", "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."}, {"date": "2021-03-19", "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."}, {"date": "2021-03-19", "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."}, {"date": "2021-03-19", "text": "You exile the cards face up. All players will be able to see them."}, {"date": "2021-03-19", "text": "If you cast a card “without paying its mana cost,” you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those to cast the card."}, {"date": "2021-03-19", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Chimera", "Hydra"], "supertypes": [], "text": "Cascade, cascade, cascade, cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order. Multiple instances of cascade each trigger separately.)", "toughness": "10", "type": "Creature — Chimera Hydra", "types": ["Creature"], "uuid": "d01eb539-b951-596e-abd0-a300bb30086c"}