{"artist": "Jason Rainville", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G", "W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 15198, "faceConvertedManaCost": 2.0, "faceManaValue": 2.0, "faceName": "Authority", "finishes": ["nonfoil", "foil"], "foreignData": [{"faceName": "Autorität", "language": "German", "multiverseId": 431040, "name": "Berufung // Autorität", "text": "Nachhall (Wirke diesen Zauberspruch nur aus deinem Friedhof. Schicke ihn danach ins Exil.)\nTappe bis zu zwei Kreaturen deiner Wahl, die deine Gegner kontrollieren. Kreaturen, die du kontrollierst, erhalten Wachsamkeit bis zum Ende des Zuges.", "type": "Hexerei"}, {"faceName": "Autoridad", "language": "Spanish", "multiverseId": 431239, "name": "Apelar // Autoridad", "text": "Secuela. (Lanza este hechizo solo desde tu cementerio. Luego exílialo.)\nGira hasta dos criaturas objetivo que controlen tus oponentes. Las criaturas que controlas ganan la habilidad de vigilancia hasta el final del turno.", "type": "Conjuro"}, {"faceName": "Autorité", "language": "French", "multiverseId": 431438, "name": "Appel // Autorité", "text": "Répercussion (Ne lancez ce sort que depuis votre cimetière. Exilez-le ensuite.)\nEngagez jusqu'à deux créatures ciblées que vos adversaires contrôlent. Les créatures que vous contrôlez acquièrent la vigilance jusqu'à la fin du tour.", "type": "Rituel"}, {"faceName": "Autorità", "language": "Italian", "multiverseId": 431637, "name": "Appello // Autorità", "text": "Conseguenze (Lancia questa magia solo dal tuo cimitero. Poi esiliala.)\nTAPpa fino a due creature bersaglio controllate dai tuoi avversari. Le creature che controlli hanno cautela fino alla fine del turno.", "type": "Stregoneria"}, {"faceName": "鮮明", "language": "Japanese", "multiverseId": 431836, "name": "旗幟 // 鮮明", "text": "余波（この呪文はあなたの墓地からのみ唱えられる。その後、これを追放する。）\n対戦相手がコントロールするクリーチャー最大２体を対象とし、それらをタップする。ターン終了時まで、あなたがコントロールするクリーチャーは警戒を得る。", "type": "ソーサリー"}, {"faceName": "권위", "language": "Korean", "multiverseId": 432035, "name": "호소 // 권위", "text": "여파 (당신의 무덤에서만 이 주문을 발동할 수 있다. 그 후, 이 카드를 추방한다.)\n상대가 조종하는 생물을 최대 두 개까지 목표로 정한다. 그 생물들을 탭한다. 당신이 조종하는 생물들은 턴종료까지 경계를 얻는다.", "type": "집중마법"}, {"faceName": "Autoridade", "language": "Portuguese (Brazil)", "multiverseId": 432234, "name": "Apelar // Autoridade", "text": "Consequências (Conjure esta mágica somente de seu cemitério. Depois, exile-a.)\nVire até duas criaturas alvo que seus oponentes controlam. As criaturas que você controla ganham vigilância até o final do turno.", "type": "Feitiço"}, {"faceName": "Авторитетам", "language": "Russian", "multiverseId": 432433, "name": "Обращение // Авторитетам", "text": "Последствия (Разыгрывайте это заклинание только из вашего кладбища. Затем изгоните его.)\nПоверните не более двух целевых существ под контролем ваших оппонентов. Существа под вашим контролем получают Бдительность до конца хода.", "type": "Волшебство"}, {"faceName": "权威", "language": "Chinese Simplified", "multiverseId": 432632, "name": "吸引 // 权威", "text": "余响（此咒语只能从你的坟墓场中施放。然后将它放逐。）\n横置至多两个目标由对手操控的生物。由你操控的生物获得警戒异能直到回合结束。", "type": "法术"}, {"faceName": "權威", "language": "Chinese Traditional", "multiverseId": 432831, "name": "吸引 // 權威", "text": "餘響（此咒語只能從你的墳墓場中施放。然後將它放逐。）\n橫置至多兩個目標由對手操控的生物。由你操控的生物獲得警戒異能直到回合結束。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardsphereId": "50178", "mcmId": "298722", "mcmMetaId": "226053", "mtgjsonV4Id": "c360519b-931b-5697-aeab-391c2d1e9c72", "mtgoId": "64808", "multiverseId": "430841", "scryfallId": "2c25b8ef-6331-49df-9457-b8b4e44da2c9", "scryfallIllustrationId": "e47f51f0-a11f-49c6-a816-538757480ff3", "scryfallOracleId": "3ecc4b57-3e0c-48b8-9952-e4b63b6bc45d", "tcgplayerProductId": "136482"}, "keywords": ["Aftermath"], "language": "English", "layout": "aftermath", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}", "manaValue": 3.0, "name": "Appeal // Authority", "number": "152", "originalText": "Aftermath (Cast this spell only from your graveyard. Then exile it.)\nTap up to two target creatures your opponents control. Creatures you control gain vigilance until end of turn.", "originalType": "Sorcery", "otherFaceIds": ["c74b3d87-9240-5181-811d-84c22c2ec873"], "printings": ["AKR", "HOU"], "purchaseUrls": {"cardmarket": "https://mtgjson.com/links/b0e4b6a32364f2dc", "tcgplayer": "https://mtgjson.com/links/c260a3b3f4991552"}, "rarity": "uncommon", "rulings": [{"date": "2017-04-18", "text": "Each split card has two names. If an effect instructs you to choose a card name, you may choose one, but not both."}, {"date": "2017-04-18", "text": "While not on the stack, the characteristics of a split card are the combination of its two halves. For example, Destined // Lead is a green and black card, it is both an instant card and a sorcery card, and its mana value is 6. This means that if an effect allows you to cast a card with mana value 2 from your hand, you can’t cast Destined. This is a change from the previous rules for split cards."}, {"date": "2017-04-18", "text": "If you cast the first half of a split card with aftermath during your turn, you’ll have priority immediately after it resolves. You can cast the half with aftermath from your graveyard before any player can take any other action if it’s legal for you to do so."}, {"date": "2017-04-18", "text": "Split cards with aftermath have a new frame treatment—the half you can cast from your hand is oriented the same as other cards you’d cast from your hand, while the half you can cast from your graveyard is a traditional split card half. This frame treatment is for your convenience and has no rules significance."}, {"date": "2017-04-18", "text": "If another effect allows you to cast a split card with aftermath from a graveyard, you may cast either half. If you cast the half that has aftermath, you’ll exile the card if it would leave the stack."}, {"date": "2017-04-18", "text": "A spell with aftermath cast from a graveyard will always be exiled afterward, whether it resolves, it’s countered, or it leaves the stack in some other way."}, {"date": "2017-04-18", "text": "If another effect allows you to cast a split card with aftermath from any zone other than a graveyard, you can’t cast the half with aftermath."}, {"date": "2017-04-18", "text": "All split cards have two card faces on a single card, and you put a split card onto the stack with only the half you’re casting. The characteristics of the half of the card you didn’t cast are ignored while the spell is on the stack. For example, if an effect prevents you from casting green spells, you can cast Destined of Destined // Lead, but not Lead."}, {"date": "2017-04-18", "text": "Each split card is a single card. For example, if you discard one, you’ve discarded one card, not two. If an effect counts the number of instant and sorcery cards in your graveyard, Destined // Lead counts once, not twice."}, {"date": "2017-07-14", "text": "The value of X is determined only as Appeal begins to resolve. It won’t change later in the turn if the number of creatures you control changes."}, {"date": "2017-07-14", "text": "You may cast Authority without choosing any target creatures. Creatures you control will still gain vigilance until end of turn. However, if you choose any targets and each of those targets become illegal before Authority resolves, the spell won’t resolve and your creatures won’t gain vigilance."}, {"date": "2017-07-14", "text": "Once you’ve started to cast a spell with aftermath from your graveyard, the card is immediately moved to the stack. Opponents can’t try to stop the ability by exiling the card with an effect such as that of Crook of Condemnation."}], "setCode": "HOU", "side": "b", "subtypes": [], "supertypes": [], "text": "Aftermath (Cast this spell only from your graveyard. Then exile it.)\nTap up to two target creatures your opponents control. Creatures you control gain vigilance until end of turn.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "0a894f7b-0dc8-566d-95d4-b780d19d2aa3"}