{"artist": "Daarken", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B", "U"], "colors": ["B", "U"], "convertedManaCost": 3.0, "edhrecRank": 3253, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "23a1208a-cd8e-5fd6-854f-03b7b4368200", "mtgoId": "86270", "scryfallId": "d67b8a29-3f6e-48b2-86a8-56faf271d454", "scryfallIllustrationId": "7abf8066-7501-4bc1-81b0-dff29aa4263b", "scryfallOracleId": "1a62ba93-153c-4bed-9f6a-ff914df360c1"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "paupercommander": "Restricted", "vintage": "Legal"}, "manaCost": "{1}{U}{B}", "manaValue": 3.0, "name": "Araumi of the Dead Tide", "number": "86270", "originalReleaseDate": "2020-12-15", "power": "1", "printings": ["CMR", "PRM"], "purchaseUrls": {}, "rarity": "uncommon", "rulings": [{"date": "2020-11-10", "text": "If the creature card has {X} in its mana cost, you can choose any value for X, but the value you choose won’t apply to the tokens that are created. X will be 0 for those tokens."}, {"date": "2020-11-10", "text": "Exiling the card with encore is a cost to activate the ability. Once you announce that you’re activating it, no player may take actions until you’ve finished. They can’t try to remove the card from your graveyard to stop you from paying the cost."}, {"date": "2020-11-10", "text": "Opponents who have left the game aren’t counted when determining how many tokens to create."}, {"date": "2020-11-10", "text": "The tokens copy only what’s on the original card. Effects that modified that creature when it was previously on the battlefield won’t be copied."}, {"date": "2020-11-10", "text": "Each token must attack the appropriate player if able."}, {"date": "2020-11-10", "text": "If one of the tokens can’t attack for any reason (such as being tapped), then it doesn’t attack. If there’s a cost associated with having it attack, you aren’t forced to pay that cost, so it doesn’t have to attack in that case either."}, {"date": "2020-11-10", "text": "If an effect stops a token from attacking a specific player, that token can attack any player or planeswalker, or not attack at all. If the effect stops the token from attacking a specific player unless a cost is paid, you don’t have to pay that cost unless you want to attack that player."}, {"date": "2020-11-10", "text": "If one of the tokens somehow is under another player’s control as the delayed triggered ability resolves, you can’t sacrifice that token. It remains on the battlefield indefinitely, even if you regain control of it later."}], "setCode": "PRM", "subtypes": ["Merfolk", "Wizard"], "supertypes": ["Legendary"], "text": "{T}, Exile cards from your graveyard equal to the number of opponents you have: Target creature card in your graveyard gains encore until end of turn. The encore cost is equal to its mana cost. (Exile the creature card and pay its mana cost: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)", "toughness": "4", "type": "Legendary Creature — Merfolk Wizard", "types": ["Creature"], "uuid": "4349bbaa-bc55-55d0-8757-b6df5b8bc2b1"}