{"artist": "Daniel Gelon", "availability": ["mtgo"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 4.0, "edhrecRank": 16244, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "740e8b28-3495-5126-aba3-e298adb17c4f", "mtgoFoilId": "33485", "mtgoId": "33484", "multiverseId": "201176", "scryfallId": "8b025952-ba7a-46c7-a597-e716f2475c5c", "scryfallIllustrationId": "c90dd3ac-68a9-48bb-8c53-1ac3bbc28138", "scryfallOracleId": "acb3e93c-a1d3-458f-b8c3-c426cd359fa4"}, "isOnlineOnly": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}{G}", "manaValue": 4.0, "name": "Arboria", "number": "113", "originalText": "Creatures can't attack a player who didn't cast a spell and didn't put a card onto the battlefield during his or her last turn.", "originalType": "World Enchantment", "printings": ["DMR", "LEG", "ME3"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "This effect modifies the announcement of an attack, so it only works if it is on the battlefield at that time."}, {"date": "2008-10-01", "text": "This has the supertype world. When a world permanent enters the battlefield, any world permanents that were already on the battlefield are put into their owners’ graveyards. This is a state-based action called the “world rule.” The new world permanent stays on the battlefield. If two world permanents enter the battlefield at the same time, they’re both put into their owners’ graveyards."}, {"date": "2009-10-01", "text": "Arboria doesn’t stop creatures from attacking planeswalkers, regardless of what their controllers did or didn’t do during their last turns."}, {"date": "2009-10-01", "text": "Arboria’s effect cares whether a player put a nontoken permanent onto the battlefield. It’s unusual for an ability to care who did the putting (as opposed to whose control the permanent entered the battlefield under), and requires careful reading of spells and abilities to see which player is instructed to put something onto the battlefield. For example, Exhume causes each player to return a creature card from their graveyard to the battlefield. If Exhume’s controller has no creature cards in their graveyard, but another player does, only that other player puts a permanent onto the battlefield. It doesn’t matter who controls the effect."}, {"date": "2009-10-01", "text": "Arboria’s effect cares about the actions taken by players, not their results. If a player cast a spell during their last turn but that spell was countered, that player may still be attacked. The same is true if a player put a nontoken permanent onto the battlefield during their last turn, even if it’s no longer on the battlefield by the time that player is attacked."}], "setCode": "ME3", "subtypes": [], "supertypes": ["World"], "text": "Creatures can't attack a player unless that player cast a spell or put a nontoken permanent onto the battlefield during their last turn.", "type": "World Enchantment", "types": ["Enchantment"], "uuid": "c44ca822-2682-5c7a-a369-f13e11e8d743"}