{"artist": "Kekai Kotaki", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": [], "convertedManaCost": 7.0, "edhrecRank": 14321, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "2f74144e-88e0-5681-81fa-edfd3087c2d9", "mtgoId": "105680", "scryfallId": "98cf7cb0-33cb-4515-a7b5-f865c99c0ba1", "scryfallIllustrationId": "9ae9a302-297a-46e0-ac1d-7eef4f0cea61", "scryfallOracleId": "792f8235-f23b-4858-bdd4-c7a186b7a470"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Prototype"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{7}", "manaValue": 7.0, "name": "Arcane Proxy", "number": "105680", "originalReleaseDate": "2022-11-18", "power": "4", "printings": ["BRO", "PBRO", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2022-10-14", "text": "You cast the copy while the ability is resolving and still on the stack. You can’t wait to cast it later in the turn."}, {"date": "2022-10-14", "text": "If you cast a spell “without paying its mana cost,” you can’t pay any alternative costs. You can, however, pay additional costs, such as kicker costs. If the card has any mandatory additional costs, you must pay those."}, {"date": "2022-10-14", "text": "If the spell you cast has {X} in its mana cost, you must choose 0 as the value of X."}, {"date": "2022-10-14", "text": "If you don’t want to cast the copy, you can choose not to; the copy ceases to exist the next time state-based actions are checked."}, {"date": "2022-10-14", "text": "If another effect causes Arcane Proxy’s power to be less than the mana value of the target card as the ability tries to resolve, the target is illegal. The card won’t be exiled, and you won’t get to cast a copy."}, {"date": "2022-10-14", "text": "A prototype card is a colorless card in every zone except the stack or the battlefield, as well as while on the stack or the battlefield if not cast as a prototyped spell. Ignore its alternative characteristics in those cases. For example, while it’s in your graveyard, Blitz Automaton is a colorless creature card with mana value 7. It can’t be the target of Recommission, a spell that targets an artifact or creature card with mana value 3 or less in your graveyard."}, {"date": "2022-10-14", "text": "When cast as a prototyped spell, that spell has the mana cost, power, and toughness characteristics shown in its colored, secondary text box rather than the normal values of those characteristics. Its color and mana value are determined by that mana cost. The permanent that spell becomes as it resolves has the same characteristics. If the spell leaves the stack in any other way, or the permanent it becomes leaves the battlefield, it immediately resumes using its normal characteristics."}, {"date": "2022-10-14", "text": "Regardless of how it was cast, a prototype card always has the same name, abilities, types, and so on. Only the mana cost, mana value, color, power, and toughness change depending on whether the card was cast as a prototyped spell."}, {"date": "2022-10-14", "text": "The prototype ability functions in any zone that the spell could be cast from. For example, if an effect allows you to cast artifact spells from your graveyard, you could cast a prototyped Blitz Automaton from your graveyard."}, {"date": "2022-10-14", "text": "Casting a prototyped spell isn’t the same as casting it for an alternative cost, and an alternative cost may be applied to a spell cast this way. For example, if an effect allows you to cast an artifact card without paying its mana cost, you could either cast Blitz Automaton normally, or as a prototyped spell."}, {"date": "2022-10-14", "text": "When casting a prototyped spell, use only its prototype characteristics to determine whether it’s legal to cast it. For example, if Blitz Automaton is exiled with the last ability of Chandra, Dressed to Kill, you would be able to cast it for {2}{R} (because it’s a red spell), even though you wouldn’t be able to cast it as a colorless spell for its normal cost."}, {"date": "2022-10-14", "text": "If an effect copies a prototyped spell, that copy (as well as the token it becomes on the battlefield) will have the same characteristics as the prototyped spell. Similarly, if an effect creates a token that’s a copy of a prototyped permanent or causes another permanent to become a copy of it, the copy would have the same characteristics as the prototyped permanent."}], "setCode": "PRM", "subtypes": ["Wizard"], "supertypes": [], "text": "Prototype {1}{U}{U} — 2/1 (You may cast this spell with different mana cost, color, and size. It keeps its abilities and types.)\nWhen Arcane Proxy enters the battlefield, if you cast it, exile target instant or sorcery card with mana value less than or equal to Arcane Proxy's power from your graveyard. Copy that card. You may cast the copy without paying its mana cost.", "toughness": "3", "type": "Artifact Creature — Wizard", "types": ["Artifact", "Creature"], "uuid": "e4b58535-79b9-5e64-92f3-e7b2f2de4e91"}