{"artist": "Antonio José Manzanedo", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 6.0, "edhrecRank": 3340, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "1f2ef009-f18b-53a8-b6e0-f25f6df0bf89", "mtgoId": "86002", "scryfallId": "3c3710b1-99e1-4e83-8e6f-34f8ff80816c", "scryfallIllustrationId": "9827d491-3bc2-4e09-9b87-90fe9f878097", "scryfallOracleId": "61f55e39-4028-4c91-910e-16b88c73beb5"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{W}{W}", "manaValue": 6.0, "name": "Archon of Coronation", "number": "86002", "originalReleaseDate": "2020-12-15", "power": "5", "printings": ["CMR", "NCC", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2020-11-10", "text": "While Archon of Coronation's last ability applies, damage dealt to you still has all effects other than causing you to lose life. For example, abilities that trigger on that damage being dealt still trigger; if the source has lifelink, its controller still gains life; and so on."}, {"date": "2020-11-10", "text": "Combat damage dealt to you by a commander is still tracked, even if it didn't cause you to lose life."}, {"date": "2020-11-10", "text": "The game starts with no monarch. Once an effect makes one player the monarch, the game will have exactly one monarch from that point forward. As a player becomes the monarch, the current monarch (if any) ceases being the monarch."}, {"date": "2020-11-10", "text": "There are two inherent triggered abilities associated with being the monarch. These triggered abilities have no source and are controlled by the player who was the monarch at the time the abilities triggered. The full texts of these abilities are “At the beginning of the monarch's end step, that player draws a card” and “Whenever a creature deals combat damage to the monarch, its controller becomes the monarch.”"}, {"date": "2020-11-10", "text": "If the triggered ability that causes the monarch to draw a card goes on the stack and a different player becomes the monarch before that ability resolves, the first player will still draw the card."}, {"date": "2020-11-10", "text": "If the monarch leaves the game during another player's turn, that player becomes the monarch. If the monarch leaves the game during their turn, the next player in turn order becomes the monarch."}, {"date": "2020-11-10", "text": "If combat damage dealt to the monarch causes that player to lose the game, the triggered ability that causes the controller of the attacking creature to become the monarch doesn't resolve. In most cases, the controller of the attacking creature will still become the monarch as it is likely their turn."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Archon"], "supertypes": [], "text": "Flying\nWhen Archon of Coronation enters the battlefield, you become the monarch.\nAs long as you're the monarch, damage doesn't cause you to lose life. (When a creature deals combat damage to you, its controller still becomes the monarch.)", "toughness": "5", "type": "Creature — Archon", "types": ["Creature"], "uuid": "06cd9a47-0a65-5e5f-a008-a91cd613f605"}