{"artist": "Mads Ahm", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 5.0, "edhrecRank": 12923, "finishes": ["nonfoil", "foil"], "flavorText": "\"The Founder Dragons weren't even hatched when this scroll was written!\"", "foreignData": [{"flavorText": "„Die Gründerdrachen waren noch nicht einmal ausgebrütet, als diese Schriftrolle verfasst wurde!\"", "language": "German", "multiverseId": 513860, "name": "Passionierte Staubreimerin", "text": "Immer wenn die Passionierte Staubreimerin angreift, kannst du eine Spontanzauber- oder Hexereikarte aus deinem Friedhof unter deine Bibliothek legen. Falls du dies tust, schicke die obersten zwei Karten deiner Bibliothek ins Exil. Du kannst sie in diesem Zug spielen.", "type": "Kreatur — Minotaurus, Schamane"}, {"flavorText": "\"¡Los dragones fundadores ni siquiera habían roto sus cascarones cuando se escribió este pergamino!\".", "language": "Spanish", "multiverseId": 514151, "name": "Hablante del pasado apasionada", "text": "Siempre que la Hablante del pasado apasionada ataque, puedes poner una carta de instantáneo o de conjuro de tu cementerio en el fondo de tu biblioteca. Si lo haces, exilia las dos primeras cartas de tu biblioteca. Puedes jugar esas cartas este turno.", "type": "Criatura — Chamán minotauro"}, {"flavorText": "« Les Dragons fondateurs n'avaient pas encore éclos quand ce parchemin a été écrit. »", "language": "French", "multiverseId": 514442, "name": "Oratrice de poussière ardente", "text": "À chaque fois que l'Oratrice de poussière ardente attaque, vous pouvez mettre une carte d'éphémère ou de rituel de votre cimetière au-dessous de votre bibliothèque. Si vous faites ainsi, exilez les deux cartes du dessus de votre bibliothèque. Vous pouvez jouer ces cartes ce tour-ci.", "type": "Créature : minotaure et shamane"}, {"flavorText": "\"I Draghi Fondatori non si erano ancora schiusi quando fu scritta questa pergamena!\"", "language": "Italian", "multiverseId": 514733, "name": "Mormorapolvere Entusiasta", "text": "Ogniqualvolta la Mormorapolvere Entusiasta attacca, puoi mettere una carta istantaneo o stregoneria dal tuo cimitero in fondo al tuo grimorio. Se lo fai, esilia le prime due carte del tuo grimorio. Puoi giocare quelle carte in questo turno.", "type": "Creatura — Sciamano Minotauro"}, {"flavorText": "「この巻物は、創始ドラゴンが生まれてもいなかったころの物なのだ！」", "language": "Japanese", "multiverseId": 515024, "name": "献身的な塵語り", "text": "献身的な塵語りが攻撃するたび、あなたは「あなたの墓地からインスタントかソーサリーであるカード１枚をあなたのライブラリーの一番下に置き、あなたのライブラリーの一番上からカード２枚を追放する。このターン、あなたはそれらのカードをプレイしてもよい。」を選んでもよい。", "type": "クリーチャー — ミノタウルス・シャーマン"}, {"flavorText": "\"이 두루마리는 설립자 용들이 알에서 부화조차 하지 않았을 때 쓰여졌지!\"", "language": "Korean", "multiverseId": 515315, "name": "열정적인 먼지연설가", "text": "열정적인 먼지연설가가 공격할 때마다, 당신은 당신의 무덤에 있는 순간마법 또는 집중마법 카드 한 장을 당신의 서고 맨 밑에 넣을 수 있다. 그렇게 한다면, 당신의 서고 맨 위 카드 두 장을 추방한다. 당신은 이 턴에 그 카드들을 플레이할 수 있다.", "type": "생물 — 미노타우로스 주술사"}, {"flavorText": "\"Os Dragões Fundadores sequer haviam chocado quando este pergaminho foi escrito!\"", "language": "Portuguese (Brazil)", "multiverseId": 515606, "name": "Leitor de Pó Fervoroso", "text": "Toda vez que Leitor de Pó Fervoroso ataca, você pode colocar um card de mágica instantânea ou de feitiço de seu cemitério no fundo do seu grimório. Se fizer isso, exile os dois cards do topo de seu grimório. Você pode jogar aqueles cards neste turno.", "type": "Criatura — Minotauro Xamã"}, {"flavorText": "«Драконы-основатели еще даже не вылупились, когда был написан этот свиток!»", "language": "Russian", "multiverseId": 515897, "name": "Пылкая Ведунья Праха", "text": "Каждый раз, когда Пылкая Ведунья Праха атакует, вы можете положить карту мгновенного заклинания или волшебства из вашего кладбища в низ вашей библиотеки. Если вы это делаете, изгоните две верхние карты вашей библиотеки. Вы можете разыграть те карты в этом ходу.", "type": "Существо — Минотавр Шаман"}, {"flavorText": "「这张卷轴写就时，创院巨龙都还没孵出来呢！」", "language": "Chinese Simplified", "multiverseId": 516188, "name": "热诚尘语师", "text": "每当热诚尘语师攻击时，你可以将一张瞬间或法术牌从你的坟墓场置于你的牌库底。若你如此作，则放逐你牌库顶的两张牌。本回合中，你可以使用这些牌。", "type": "生物 ～牛头怪／祭师"}, {"flavorText": "「這張卷軸寫就時，創院巨龍都還沒孵出來呢！」", "language": "Chinese Traditional", "multiverseId": 516479, "name": "熱誠塵語師", "text": "每當熱誠塵語師攻擊時，你可以將一張瞬間或巫術牌從你的墳墓場置於你的牌庫底。若你如此作，則放逐你牌庫頂的兩張牌。本回合中，你可以使用這些牌。", "type": "生物 ～牛頭怪／祭師"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "244744", "cardKingdomId": "244413", "cardsphereId": "75893", "mcmId": "557988", "mcmMetaId": "339060", "mtgArenaId": "76485", "mtgjsonV4Id": "b364595a-c198-5a72-85ae-cde39136aabf", "mtgoId": "88661", "multiverseId": "513569", "scryfallId": "7ff4832a-26c0-4da5-abbb-1941e7084e72", "scryfallIllustrationId": "53c4281a-0bb2-407c-af34-8c73ef65c321", "scryfallOracleId": "370974e7-d242-4f24-a031-cba71c935306", "tcgplayerProductId": "235878"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{R}", "manaValue": 5.0, "name": "Ardent Dustspeaker", "number": "92", "originalText": "Whenever Ardent Dustspeaker attacks, you may put an instant or sorcery card from your graveyard on the bottom of your library. If you do, exile the top two cards of your library. You may play those cards this turn.", "originalType": "Creature — Minotaur Shaman", "power": "3", "printings": ["STX"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/29815607767ad108", "cardKingdomFoil": "https://mtgjson.com/links/b31b65b3e9806ca5", "cardmarket": "https://mtgjson.com/links/6bf6f2c24045d5c0", "tcgplayer": "https://mtgjson.com/links/7247973a7e22c905"}, "rarity": "uncommon", "rebalancedPrintings": ["ba4295ad-9161-5cc3-8f4d-2c0d518d0cf4"], "rulings": [{"date": "2021-04-16", "text": "The cards exiled by Ardent Dustspeaker’s ability are exiled face up."}, {"date": "2021-04-16", "text": "You may play those cards that turn even if Ardent Dustspeaker leaves the battlefield or another player gains control of it."}, {"date": "2021-04-16", "text": "Playing the cards exiled with Ardent Dustspeaker follows the normal rules for playing those cards. You must pay their costs, if any, and you must follow all applicable timing rules. For example, if one of the cards is a creature card, you can cast that card by paying its mana cost only during your main phase while the stack is empty."}, {"date": "2021-04-16", "text": "Unless an effect allows you to play additional lands that turn, you can play land cards exiled with Ardent Dustspeaker only if you haven’t played a land yet that turn. In most cases, if you exile two land cards, you won’t be able to play both."}, {"date": "2021-04-16", "text": "Any cards exiled with Ardent Dustspeaker that you don’t play remain exiled. You will not be able to play them on later turns, even if Ardent Dustspeaker’s ability triggers again."}], "setCode": "STX", "subtypes": ["Minotaur", "Shaman"], "supertypes": [], "text": "Whenever Ardent Dustspeaker attacks, you may put an instant or sorcery card from your graveyard on the bottom of your library. If you do, exile the top two cards of your library. You may play those cards this turn.", "toughness": "4", "type": "Creature — Minotaur Shaman", "types": ["Creature"], "uuid": "229da747-3dc8-542a-9684-36f095f07e74"}