{"artist": "Greg Staples", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 3425, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 464321, "name": "Arie der Flammen", "text": "Wenn die Arie der Flammen ins Spiel kommt, erhält jeder Gegner 10 Lebenspunkte dazu.\nImmer wenn du einen Spontanzauber oder eine Hexerei wirkst, lege eine Lyrikmarke auf die Arie der Flammen, dann fügt sie einem Spieler oder Planeswalker deiner Wahl so viele Schadenspunkte zu, wie Lyrikmarken auf ihr liegen.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 464575, "name": "Aria de la llama", "text": "Cuando el Aria de la llama entre al campo de batalla, cada oponente gana 10 vidas.\nSiempre que lances un hechizo de instantáneo o de conjuro, pon un contador de estrofa sobre el Aria de la llama. Luego, hace una cantidad de daño al jugador o planeswalker objetivo igual a la cantidad de contadores de estrofa sobre ella.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 464829, "name": "Aria de flammes", "text": "Quand l'Aria de flammes arrive sur le champ de bataille, chaque adversaire gagne 10 points de vie.\nÀ chaque fois que vous lancez un sort d'éphémère ou de rituel, mettez un marqueur « verset » sur l'Aria de flammes, puis il inflige un nombre de blessures égal au nombre de marqueurs « verset » sur lui à une cible, joueur ou planeswalker.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 465083, "name": "Assolo di Fiamme", "text": "Quando l'Assolo di Fiamme entra nel campo di battaglia, ogni avversario guadagna 10 punti vita.\nOgniqualvolta lanci una magia istantaneo o stregoneria, metti un segnalino versetto sull'Assolo di Fiamme, poi l'Assolo di Fiamme infligge a un giocatore o a un planeswalker bersaglio danno pari al numero di segnalini versetto su di esso.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 465337, "name": "炎のアリア", "text": "炎のアリアが戦場に出たとき、各対戦相手はそれぞれ10点のライフを得る。\nあなたがインスタントかソーサリーである呪文を唱えるたび、プレイヤー１人かプレインズウォーカー１体を対象とする。炎のアリアの上に詩句カウンターを１個置く。その後、これはそれに、これの上にある詩句カウンターの数に等しい点数のダメージを与える。", "type": "エンチャント"}, {"language": "Korean", "multiverseId": 465591, "name": "불길의 아리아", "text": "불길의 아리아가 전장에 들어올 때, 각 상대는 생명 10점을 얻는다.\n당신이 순간마법 또는 집중마법 주문을 발동할 때마다, 플레이어 또는 플레인즈워커를 목표로 정한다. 불길의 아리아에 운문 카운터 한 개를 올려놓은 후, 불길의 아리아는 그 목표에게 불길의 아리아 위에 놓인 운문 카운터 수만큼 피해를 입힌다.", "type": "부여마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 465845, "name": "Ária de Chamas", "text": "Quando Ária de Chamas entra no campo de batalha, cada oponente ganha 10 pontos de vida.\nToda vez que você conjurar uma mágica instantânea ou um feitiço, coloque um marcador de verso em Ária de Chamas. Em seguida, ela causa ao jogador ou planeswalker alvo uma quantidade de pontos de dano igual ao número de marcadores de verso.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 466099, "name": "Ария Пламени", "text": "Когда Ария Пламени выходит на поле битвы, каждый оппонент получает 10 жизней.\nКаждый раз, когда вы разыгрываете мгновенное заклинание или заклинание волшебства, положите один жетон стиха на Арию Пламени, затем она наносит целевому игроку или planeswalker-у повреждения, равные количеству жетонов стиха на ней.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 466353, "name": "烈火咏叹", "text": "当烈火咏叹进战场时，每位对手各获得10点生命。\n每当你施放瞬间或法术咒语时，在烈火咏叹上放置一个词句指示物，然后它对目标牌手或鹏洛客造成伤害，其数量等同于其上词句指示物的数量。", "type": "结界"}, {"language": "Chinese Traditional", "multiverseId": 466607, "name": "烈火詠歎", "text": "當烈火詠歎進戰場時，每位對手各獲得10點生命。\n每當你施放瞬間或巫術咒語時，在烈火詠歎上放置一個詞句指示物，然後它對目標玩家或鵬洛客造成傷害，其數量等同於其上詞句指示物的數量。", "type": "結界"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "225237", "cardKingdomId": "224933", "cardsphereId": "59813", "mcmId": "374667", "mcmMetaId": "271008", "mtgjsonV4Id": "e6a0cf2b-cca0-5041-84a0-7eec1f45c638", "mtgoId": "72608", "multiverseId": "464067", "scryfallId": "95a96eb1-f87c-4b1d-82c7-f239bcbc62b8", "scryfallIllustrationId": "20defd53-8e62-4847-9169-7b4a782782c4", "scryfallOracleId": "406fad02-e1a6-4c24-b46d-976c548e1c78", "tcgplayerProductId": "190946"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}", "manaValue": 3.0, "name": "Aria of Flame", "number": "118", "originalText": "When Aria of Flame enters the battlefield, each opponent gains 10 life.\nWhenever you cast an instant or sorcery spell, put a verse counter on Aria of Flame, then it deals damage equal to the number of verse counters on it to target player or planeswalker.", "originalType": "Enchantment", "printings": ["MH1"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/451e4c157b937351", "cardKingdomFoil": "https://mtgjson.com/links/5fa35e6983aee8de", "cardmarket": "https://mtgjson.com/links/b40a810345df2cd4", "tcgplayer": "https://mtgjson.com/links/1e11fda460b11363"}, "rarity": "rare", "rulings": [{"date": "2019-06-14", "text": "Aria of Flame’s last ability resolves before the spell that caused it to trigger. It resolves even if that spell is countered."}, {"date": "2019-06-14", "text": "If the target player or planeswalker is an illegal target by the time Aria of Flame’s last ability tries to resolve, the ability doesn’t resolve. You don’t put a verse counter on Aria of Flame."}, {"date": "2019-06-14", "text": "If Aria of Flame leaves the battlefield while its last ability is on the stack, use the number of verse counters it had on it immediately before it left the battlefield to determine how much damage it deals."}, {"date": "2019-06-14", "text": "In a Two-Headed Giant game, Aria of Flame’s first ability causes the opposing team to gain 20 life."}], "securityStamp": "oval", "setCode": "MH1", "subtypes": [], "supertypes": [], "text": "When Aria of Flame enters the battlefield, each opponent gains 10 life.\nWhenever you cast an instant or sorcery spell, put a verse counter on Aria of Flame, then it deals damage equal to the number of verse counters on it to target player or planeswalker.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "5c67b1c5-b9aa-5eeb-b400-de9f955eafd5"}