{"artist": "David Palumbo", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G", "R"], "colors": ["G"], "convertedManaCost": 6.0, "edhrecRank": 12494, "faceConvertedManaCost": 4.0, "faceManaValue": 4.0, "faceName": "Dangerous", "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardsphereId": "13246", "mcmId": "261331", "mcmMetaId": "207819", "mtgjsonV4Id": "5cb97404-f201-59a9-826e-7c369ba493ba", "mtgoId": "48516", "multiverseId": "368989", "scryfallId": "ff7f4fc2-6f76-44e7-a30b-7166a0d10d2a", "scryfallIllustrationId": "5dda4a34-3bd6-4e3c-a849-edfd65821d9b", "scryfallOracleId": "a0593a5b-6f76-4eb3-a1b1-9794d2d36c92", "tcgplayerProductId": "67902"}, "keywords": ["Fuse"], "language": "English", "layout": "split", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{G}", "manaValue": 6.0, "name": "Armed // Dangerous", "number": "122", "originalText": "All creatures able to block target creature this turn do so.\n\nFuse (You may cast one or both halves of this card from your hand.)", "originalType": "Sorcery", "otherFaceIds": ["d0a285c2-890f-55e9-b208-7a58b621c423"], "printings": ["DGM"], "purchaseUrls": {"cardmarket": "https://mtgjson.com/links/05a18a0008faf336", "tcgplayer": "https://mtgjson.com/links/68aa0e8b638934e9"}, "rarity": "uncommon", "rulings": [{"date": "2013-04-15", "text": "To cast a fused split spell, pay both of its mana costs. While the spell is on the stack, its mana value is the total amount of mana in both costs."}, {"date": "2013-04-15", "text": "You can choose the same object as the target of each half of a fused split spell, if appropriate."}, {"date": "2013-04-15", "text": "If you’re casting a split card with fuse from any zone other than your hand, you can’t cast both halves. You’ll only be able to cast one half or the other."}, {"date": "2013-04-15", "text": "When resolving a fused split spell with multiple targets, treat it as you would any spell with multiple targets. If all targets are illegal when the spell tries to resolve, the spell doesn’t resolve and none of its effects happen. If at least one target is still legal at that time, the spell resolves, but an illegal target can’t perform any actions or have any actions performed on it."}, {"date": "2013-04-15", "text": "When a fused split spell resolves, follow the instructions of the left half first, then the instructions on the right half."}, {"date": "2013-04-15", "text": "On the stack, a split spell that hasn’t been fused has only that half’s characteristics and mana value. The other half is treated as though it didn’t exist."}, {"date": "2013-04-15", "text": "Some split cards with fuse have two monocolor halves of different colors. If such a card is cast as a fused split spell, the resulting spell is multicolored. If only one half is cast, the spell is the color of that half. While not on the stack, such a card is multicolored."}, {"date": "2013-04-15", "text": "Some split cards with fuse have two halves that are both multicolored. That card is multicolored no matter which half is cast, or if both halves are cast. It’s also multicolored while not on the stack."}, {"date": "2013-04-15", "text": "If a player names a card, the player may name either half of a split card, but not both. A split card has the chosen name if one of its two names matches the chosen name."}, {"date": "2013-04-15", "text": "If you cast a split card with fuse from your hand without paying its mana cost, you can choose to use its fuse ability and cast both halves without paying their mana costs."}, {"date": "2013-04-15", "text": "Dangerous doesn’t give any creatures the ability to block the target creature. It just forces those creatures that are already able to block the creature to do so."}, {"date": "2013-04-15", "text": "As blockers are declared, any creature that’s tapped or affected by a spell or ability that says it can’t block doesn’t block. If there’s a cost associated with having the creature block, no player is forced to pay that cost, so it doesn’t block if that cost isn’t paid."}], "setCode": "DGM", "side": "b", "subtypes": [], "supertypes": [], "text": "All creatures able to block target creature this turn do so.\nFuse (You may cast one or both halves of this card from your hand.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "56488133-3089-5ca0-ad07-f6a926e3feb9", "watermark": "gruul"}