{"artist": "Daniel Ljunggren", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 3.0, "edhrecRank": 3886, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "0e5485dc-0225-5f79-ae5f-87bc76e06f45", "mtgoId": "86344", "scryfallId": "c7f5c3c5-b2b2-48c8-aabd-f81ce217b995", "scryfallIllustrationId": "6ee19a22-bbc2-4d96-a550-39cb2362b0e3", "scryfallOracleId": "a1464164-fbda-43b5-988e-6e1da9bd9eef"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Partner"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "paupercommander": "Restricted", "vintage": "Legal"}, "manaCost": "{2}{B}", "manaValue": 3.0, "name": "Armix, Filigree Thrasher", "number": "86344", "originalReleaseDate": "2020-12-15", "power": "3", "printings": ["BRC", "CMR", "PRM"], "purchaseUrls": {}, "rarity": "uncommon", "rulings": [{"date": "2020-11-10", "text": "Armix's ability goes on the stack without a target. While that ability is resolving, you may discard a card. If you do, a second ability triggers and you pick one target to get -X/-X. This is different from abilities that say “If you do . . .” in that players may cast spells and activate abilities after you've discarded a card but before the creature gets -X/-X."}, {"date": "2020-11-10", "text": "While resolving Armix's ability, you can't discard more than one card to give more than one creature -X/-X."}, {"date": "2020-11-10", "text": "The value of X is determined only as Armix's ability resolves. Once that happens, the value of X won't change later in the turn, even if the number of artifacts in your graveyard and under your control changes."}, {"date": "2020-11-10", "text": "If the discarded card is an artifact card, it will be counted as you determine the value of X, provided it's still in the graveyard or, optimistically, on the battlefield under your control at that time."}, {"date": "2020-11-10", "text": "If a creature is attacking a planeswalker, that planeswalker's controller is the defending player."}, {"date": "2020-11-10", "text": "If your Commander deck has two commanders, you can only include cards whose own color identities are also found in your commanders' combined color identities. If Falthis and Kediss are your commanders, your deck may contain cards with black and/or red in their color identity, but not cards with green, white, or blue."}, {"date": "2020-11-10", "text": "Both commanders start in the command zone, and the remaining 98 cards (or 58 cards in a Commander Draft game) of your deck are shuffled to become your library."}, {"date": "2020-11-10", "text": "To have two commanders, both must have the partner ability as the game begins. Losing the ability during the game doesn't cause either to cease to be your commander."}, {"date": "2020-11-10", "text": "Once the game begins, your two commanders are tracked separately. If you cast one, you won't have to pay an additional {2} the first time you cast the other. A player loses the game after having been dealt 21 damage from any one of them, not from both of them combined."}, {"date": "2020-11-10", "text": "If something refers to your commander while you have two commanders, it refers to one of them of your choice. If you are instructed to perform an action on your commander (e.g. put it from the command zone into your hand due to Command Beacon), you choose one of your commanders at the time the effect happens."}, {"date": "2020-11-10", "text": "An effect that checks whether you control your commander is satisfied if you control one or both of your two commanders."}, {"date": "2020-11-10", "text": "You can choose two commanders with partner that are the same color or colors. In Commander Draft, you can even choose two of the same commander with partner if you drafted them. If you do this, make sure you keep the number of times you've cast each from the command zone clear for “commander tax” purposes."}], "setCode": "PRM", "subtypes": ["Golem"], "supertypes": ["Legendary"], "text": "Whenever Armix, Filigree Thrasher attacks, you may discard a card. When you do, target creature defending player controls gets -X/-X until end of turn, where X is the number of artifacts you control plus the number of artifact cards in your graveyard.\nPartner (You can have two commanders if both have partner.)", "toughness": "2", "type": "Legendary Artifact Creature — Golem", "types": ["Artifact", "Creature"], "uuid": "465b1812-ade8-5cd3-8e63-b08e3f04c6d3"}