{"artist": "James Paick", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 8131, "finishes": ["nonfoil", "foil"], "flavorText": "With no flesh to tire or resolve to falter, the machines soon became the Academy's preferred trainers.", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "f1da457f-e589-51c1-9a3b-e4823d38040a", "mtgoId": "62367", "scryfallId": "1115c9e1-0d8e-4873-96a0-e53f4cc82675", "scryfallIllustrationId": "534c0dca-c854-4ce8-8637-f3a2d5bcd79a", "scryfallOracleId": "fa3335be-80b1-49d7-9809-5bef13be79f4"}, "isOnlineOnly": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Armory Automaton", "number": "68", "power": "2", "printings": ["C16", "PZ2"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2016-11-08", "text": "The triggered ability triggers both when Armory Automaton enters the battlefield and whenever it attacks. You don’t have to choose only one."}, {"date": "2016-11-08", "text": "You can choose to target no Equipment if you don’t want to attach any to Armory Automaton. Because the ability is optional, you also don’t have to attach the Equipment it targets as you resolve the ability. However, you must either attach all of the target Equipment or attach none of them."}, {"date": "2016-11-08", "text": "Armory Automaton’s ability can cause an Equipment one player controls to become attached to a creature another player controls. The controller of the Equipment can pay the equip cost to move that Equipment to a creature they control, but only any time that player could cast a sorcery. The controller of Armory Automaton can’t pay the equip cost to move Equipment they don’t control."}, {"date": "2016-11-08", "text": "If an Equipment an opponent controls is attached to a creature you control, any ability of that Equipment that says “you” refers to that opponent. However, if the Equipment says that the equipped creature has an ability, the word “you” in that ability refers to you, the controller of the creature."}, {"date": "2016-11-08", "text": "If Armory Automaton leaves the battlefield before its ability resolves, nothing happens to any of the Equipment it targeted. If they were already attached to other creatures, they remain attached to those creatures."}, {"date": "2016-11-08", "text": "An ability of an Equipment that triggers “whenever equipped creature attacks” triggers only if the Equipment was attached to a creature at the moment that creature was declared as an attacker, and any references to “that creature” in the effect refer to the creature the Equipment was attached to when the ability triggered."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": ["Construct"], "supertypes": [], "text": "Whenever Armory Automaton enters the battlefield or attacks, you may attach any number of target Equipment to it. (Control of the Equipment doesn't change.)", "toughness": "2", "type": "Artifact Creature — Construct", "types": ["Artifact", "Creature"], "uuid": "87bfa13b-492e-5ee9-9e21-6de3c33cb086"}