{"artist": "Lie Setiawan", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 1.0, "edhrecRank": 7219, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "67a3b760-c2e3-5d12-a55d-bae3056a2ee7", "mtgoId": "88242", "scryfallId": "28e88cb1-f04e-49bc-979f-41fc98717bc1", "scryfallIllustrationId": "1a69a8ec-6e04-4424-a882-6eb59b5e81bc", "scryfallOracleId": "784c039d-a9b2-4b22-a937-c8f7b475e96a"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{U}", "manaValue": 1.0, "name": "Ascendant Spirit", "number": "88242", "originalReleaseDate": "2021-02-28", "power": "1", "printings": ["KHM", "PKHM", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "None of Ascendant Spirit’s abilities has a duration. If one of them resolves, it will remain in effect until Ascendant Spirit leaves the battlefield or a subsequent effect changes its characteristics."}, {"date": "2021-02-05", "text": "The first and second abilities cause Ascendant Spirit to lose any other creature types it may have. It retains any card types or supertypes it may have."}, {"date": "2021-02-05", "text": "The first and second abilities overwrite any previous effects that set Ascendant Spirit’s base power and toughness to specific values. Any effects that set Ascendant Spirit’s base power and toughness that start to apply after one of these abilities will override the effect of that ability."}, {"date": "2021-02-05", "text": "Activating the second ability after Ascendant Spirit has already been legally blocked by a creature without flying or reach won’t change or undo that block."}, {"date": "2021-02-05", "text": "Any effects that modify Ascendant Spirit’s power or toughness without setting it to a specific value will apply after its base power and toughness are set, regardless of the order in which those effects were created. The same is true of counters that modify its power and toughness."}, {"date": "2021-02-05", "text": "Any of Ascendant Spirit’s abilities may be activated repeatedly. Multiple flying counters on the same permanent provide no additional benefit; however, each time the last ability resolves while Ascendant Spirit is an Angel will give Ascendant Spirit two more +1/+1 counters and cause it to gain another instance of the triggered ability. All of those instances trigger separately."}, {"date": "2021-02-05", "text": "Snow is a supertype, not a card type. It has no rules meaning or function by itself, but spells and abilities may refer to it."}, {"date": "2021-02-05", "text": "The {S} symbol is a generic mana symbol. It represents a cost that can be paid by one mana that was produced by a snow source. That mana can be any color or colorless."}, {"date": "2021-02-05", "text": "Snow isn’t a type of mana. If an effect says you may spend mana as though it were any type, you can’t pay for {S} using mana that wasn’t produced by a snow source."}, {"date": "2021-02-05", "text": "Some cards have additional effects for each {S} spent to cast them. You can cast these spells even if you don’t spend any snow mana to cast them; their additional effects simply won’t do anything."}, {"date": "2021-02-05", "text": "The Kaldheim set doesn’t have any cards with mana costs that include {S}, but some previous sets do. If an effect says such a spell costs {1} less to cast, that reduction doesn’t apply to any {S} costs. This is also true for activated abilities that include {S} in their activation costs and effects that reduce those costs."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Spirit"], "supertypes": ["Snow"], "text": "{S}{S}: Ascendant Spirit becomes a Spirit Warrior with base power and toughness 2/3.\n{S}{S}{S}: If Ascendant Spirit is a Warrior, put a flying counter on it and it becomes a Spirit Warrior Angel with base power and toughness 4/4.\n{S}{S}{S}{S}: If Ascendant Spirit is an Angel, put two +1/+1 counters on it and it gains \"Whenever this creature deals combat damage to a player, draw a card.\"", "toughness": "1", "type": "Snow Creature — Spirit", "types": ["Creature"], "uuid": "3f6245a2-9a4b-5743-a9cf-8cd1afb80879"}