{"artist": "Karla Ortiz", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "U"], "colors": ["B", "U"], "convertedManaCost": 3.0, "edhrecRank": 4961, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 374247, "name": "Ashiok der Albtraumweber", "text": "+2: Schicke die obersten drei Karten der Bibliothek eines Gegners deiner Wahl ins Exil.\n-X: Bringe eine Kreaturenkarte mit umgewandelten Manakosten von X, die von Ashiok dem Albtraumweber ins Exil geschickt wurde, unter deiner Kontrolle ins Spiel. Diese Kreatur ist zusätzlich zu ihren anderen Typen ein Nachtmahr.\n-10: Schicke alle Karten von allen Händen aller Gegner und aus allen Friedhöfen aller Gegner ins Exil.", "type": "Planeswalker — Ashiok"}, {"language": "Spanish", "multiverseId": 375990, "name": "Ashiok, urdidor de pesadillas", "text": "+2: Exilia las tres primeras cartas de la biblioteca del oponente objetivo.\n-X: Pon en el campo de batalla bajo tu control una carta de criatura con un coste de maná convertido de X exiliada con Ashiok, urdidor de pesadillas. Esa criatura es una Pesadilla además de sus otros tipos.\n-10: Exilia todas las cartas de las manos y los cementerios de todos los oponentes.", "type": "Planeswalker — Ashiok"}, {"language": "French", "multiverseId": 374496, "name": "Ashiok, tisseur de cauchemars", "text": "+2 : Exilez les trois cartes du dessus de la bibliothèque de l'adversaire ciblé.\n-X : Mettez sur le champ de bataille, sous votre contrôle, une carte de créature exilée par Ashiok, tisseur de cauchemars avec un coût converti de mana de X. Cette créature est un cheval de cauchemar en plus de ses autres types.\n-10 : Exilez toutes les cartes des mains et des cimetières de tous les adversaires.", "type": "Planeswalker : Ashiok"}, {"language": "Italian", "multiverseId": 374745, "name": "Ashiok, Tessitore di Incubi", "text": "+2: Esilia le prime tre carte del grimorio di un avversario bersaglio.\n-X: Metti sul campo di battaglia sotto il tuo controllo una carta creatura con costo di mana convertito pari a X esiliata con Ashiok, Tessitore di Incubi. Quella creatura è un Incubo in aggiunta ai suoi altri tipi.\n-10: Esilia tutte le carte dalle mani e dai cimiteri di tutti gli avversari.", "type": "Planeswalker — Ashiok"}, {"language": "Japanese", "multiverseId": 374994, "name": "悪夢の織り手、アショク", "text": "+2：対戦相手１人を対象とし、そのプレイヤーのライブラリーの一番上から３枚のカードを追放する。\n-X：悪夢の織り手、アショクによって追放された点数で見たマナ・コストがＸのクリーチャー・カード１枚をあなたのコントロール下で戦場に出す。そのクリーチャーは、他のタイプに加えてナイトメアでもある。\n-10：すべての対戦相手の手札と墓地にある、すべてのカードを追放する。", "type": "プレインズウォーカー — アショク"}, {"language": "Korean", "multiverseId": 375243, "name": "악몽을 부르는 아시오크", "text": "+2: 상대 한 명을 목표로 정한다. 그 상대의 서고 맨 위의 카드 세 장을 추방한다.\n-X: 악몽을 부르는 아시오크에게 추방당한 생물 카드 중 전환마나비용이 X인 생물 카드 한 장을 당신의 조종하에 전장에 놓는다. 그 생물은 자신의 원래 유형에 더불어 나이트메어다.\n-10: 모든 상대의 손과 무덤에 있는 모든 카드들을 추방한다.", "type": "플레인즈워커 — 아시오크"}, {"language": "Portuguese (Brazil)", "multiverseId": 375492, "name": "Ashiok, Tecedor de Pesadelos", "text": "+2: Exile os três cards do topo do grimório do oponente alvo.\n-X: Coloque no campo de batalha sob o seu controle um card de criatura com custo de mana convertido igual a X exilado com Ashiok, Tecedor de Pesadelos. Aquela criatura é um Pesadelo além de seus outros tipos.\n-10: Exile todos os cards das mãos e cemitérios de todos os oponentes.", "type": "Planeswalker — Ashiok"}, {"language": "Russian", "multiverseId": 375741, "name": "Ашиок, Ткач Кошмаров", "text": "+2: изгоните три верхние карты библиотеки целевого оппонента.\n-X: положите карту существа с конвертированной мана-стоимостью X, изгнанную Ашиоком, Ткачом Кошмаров, на поле битвы под вашим контролем. То существо является Кошмаром в дополнение к своим другим типам.\n-10: изгоните все карты из рук и кладбищ всех оппонентов.", "type": "Planeswalker — Ашиок"}, {"language": "Chinese Simplified", "multiverseId": 373749, "name": "织魇师安梭苛", "text": "+2：放逐目标对手牌库顶的三张牌。\n-X：将一张以织魇师安梭苛放逐且总法术力费用为X的生物牌在你的操控下放进战场。该生物额外具有「梦魇」此类别。\n-10：放逐所有对手手上与坟墓场中的所有牌。", "type": "鹏洛客～安梭苛"}, {"language": "Chinese Traditional", "multiverseId": 373998, "name": "織魘師安梭苛", "text": "+2：放逐目標對手牌庫頂的三張牌。\n-X：將一張以織魘師安梭苛放逐且總魔法力費用為X的生物牌在你的操控下放進戰場。該生物額外具有「夢魘」此類別。\n-10：放逐所有對手手上與墳墓場中的所有牌。", "type": "鵬洛客～安梭苛"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "191536", "cardKingdomId": "191198", "cardsphereId": "43593", "mcmId": "264082", "mcmMetaId": "208674", "mtgjsonV4Id": "31b8f1c6-da7b-59e9-a109-d5e8564d60c9", "mtgoFoilId": "50311", "mtgoId": "50310", "multiverseId": "373500", "scryfallId": "599c3c9f-dfb7-4357-9d9c-9a1a4616b103", "scryfallIllustrationId": "e4313c9a-6ccd-4196-b601-fd500b0b01f5", "scryfallOracleId": "b6f52260-9ad5-4024-acf9-d77f3c08c872", "tcgplayerProductId": "71088"}, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "loyalty": "3", "manaCost": "{1}{U}{B}", "manaValue": 3.0, "name": "Ashiok, Nightmare Weaver", "number": "188", "originalText": "+2: Exile the top three cards of target opponent's library.\n-X: Put a creature card with converted mana cost X exiled with Ashiok, Nightmare Weaver onto the battlefield under your control. That creature is a Nightmare in addition to its other types.\n-10: Exile all cards from all opponents' hands and graveyards.", "originalType": "Planeswalker — Ashiok", "printings": ["THS"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/9e28f5a79db7e5f8", "cardKingdomFoil": "https://mtgjson.com/links/21add380d13dda40", "cardmarket": "https://mtgjson.com/links/3164c2499bbefbb2", "tcgplayer": "https://mtgjson.com/links/f3082c21cd9f15d8"}, "rarity": "mythic", "rulings": [{"date": "2013-09-15", "text": "Ashiok’s second ability refers to any creature card exiled because of Ashiok’s first or third ability."}, {"date": "2013-09-15", "text": "Ashiok’s second ability doesn’t target any creature card. You choose which creature card to return when that ability resolves, but you must choose one with mana value equal to the value you chose for X when activating the ability."}, {"date": "2013-09-15", "text": "If Ashiok leaves the battlefield, and later another Ashiok enters the battlefield, it is a new object (even if the two were represented by the same card). Creature cards exiled by the original Ashiok can’t be put onto the battlefield by the second ability of the new Ashiok."}, {"date": "2013-09-15", "text": "If you put a creature card with bestow onto the battlefield, it will be a creature on the battlefield, not an Aura."}, {"date": "2013-09-15", "text": "If you put a creature card with {X} in its mana cost onto the battlefield, the value of that X is 0."}], "setCode": "THS", "subtypes": ["Ashiok"], "supertypes": ["Legendary"], "text": "[+2]: Exile the top three cards of target opponent's library.\n[−X]: Put a creature card with mana value X exiled with Ashiok, Nightmare Weaver onto the battlefield under your control. That creature is a Nightmare in addition to its other types.\n[−10]: Exile all cards from all opponents' hands and graveyards.", "type": "Legendary Planeswalker — Ashiok", "types": ["Planeswalker"], "uuid": "8e0baa3b-a457-53e7-b6e0-27a1e18194f1"}