{"artist": "Igor Kieryluk", "availability": ["arena", "mtgo", "paper"], "borderColor": "black", "colorIdentity": ["B", "W"], "colors": ["B", "W"], "convertedManaCost": 6.0, "edhrecRank": 2442, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 479157, "name": "Athreos der Verhüllte", "text": "Unzerstörbar\nSolange deine Hingabe zu Weiß und Schwarz weniger als sieben beträgt, ist Athreos keine Kreatur.\nZu Beginn deines Endsegments legst du eine Münzenmarke auf eine andere Kreatur deiner Wahl.\nImmer wenn eine Kreatur mit einer Münzenmarke stirbt oder ins Exil geschickt wird, bringe sie unter deiner Kontrolle ins Spiel zurück.", "type": "Legendäre Verzauberungskreatur — Gott"}, {"language": "Spanish", "multiverseId": 479158, "name": "Atreos, cubierto con sudario", "text": "Indestructible.\nMientras tu devoción al blanco y al negro sea menor que siete, Atreos no es una criatura.\nAl comienzo de tu paso final, pon un contador de moneda sobre otra criatura objetivo.\nSiempre que una criatura con un contador de moneda sobre ella muera o vaya al exilio, regresa esa carta al campo de batalla bajo tu control.", "type": "Criatura encantamiento legendaria — Deidad"}, {"language": "French", "multiverseId": 479159, "name": "Athréos, voilé d'un linceul", "text": "Indestructible\nTant que votre dévotion au blanc et au noir est inférieure à sept, Athréos n'est pas une créature.\nAu début de votre étape de fin, mettez un marqueur « pièce » sur une autre créature ciblée.\nÀ chaque fois qu'une créature avec un marqueur « pièce » sur elle meurt ou est mise en exil, renvoyez cette carte sur le champ de bataille sous votre contrôle.", "type": "Créature-enchantement légendaire : dieu"}, {"language": "Italian", "multiverseId": 479160, "name": "Atreo, Velato dal Sudario", "text": "Indistruttibile\nFintanto che la tua devozione al bianco e al nero è inferiore a sette, Atreo non è una creatura.\nAll'inizio della tua sottofase finale, metti un segnalino moneta su un'altra creatura bersaglio.\nOgniqualvolta una creatura con un segnalino moneta muore o viene messa in esilio, rimetti quella carta sul campo di battaglia sotto il tuo controllo.", "type": "Creatura Incantesimo Leggendaria — Dio"}, {"language": "Japanese", "multiverseId": 479161, "name": "埋葬布を纏う者、エイスリオス", "text": "破壊不能\nあなたの白と黒への信心が７未満であるかぎり、埋葬布を纏う者、エイスリオスはクリーチャーではない。\nあなたの終了ステップの開始時に、他のクリーチャー１体を対象とし、それの上に硬貨カウンターを１個置く。\n硬貨カウンターが置かれているクリーチャー１体が死亡するか追放領域に置かれるたび、そのカードをあなたのコントロール下で戦場に戻す。", "type": "伝説のクリーチャー・エンチャント — 神"}, {"language": "Korean", "multiverseId": 479162, "name": "수의에 가려진 자, 에스리오스", "text": "무적\n당신의 백흑 신앙심이 7 미만인 한, 에스리오스는 생물이 아니다.\n당신의 종료단 시작에, 다른 생물을 목표로 정한다. 그 생물에 동전 카운터 한 개를 올려놓는다.\n동전 카운터를 가진 생물이 죽거나 추방될 때마다, 그 카드를 당신의 조종하에 전장으로 되돌린다.", "type": "전설적 부여마법 생물 — 신"}, {"language": "Portuguese (Brazil)", "multiverseId": 479163, "name": "Atreos, Velado pelo Sudário", "text": "Indestrutível\nEnquanto sua devoção ao branco e ao preto for menor que sete, Atreos não será uma criatura.\nNo início da sua etapa final, coloque um marcador de moeda em outra criatura alvo.\nToda vez que uma criatura com um marcador de moeda morrer ou for colocada no exílio, devolva aquele card ao campo de batalha sob seu controle.", "type": "Criatura Encantamento Lendária — Deus"}, {"language": "Russian", "multiverseId": 479164, "name": "Атрей, Укрытый Пеленой", "text": "Неразрушимость\nПока ваша Преданность белому и черному меньше семи, Атрей не является существом.\nВ начале вашего заключительного шага положите один жетон монеты на другое целевое существо.\nКаждый раз, когда существо с жетоном монеты на нем умирает или попадает в изгнание, верните ту карту на поле битвы под вашим контролем.", "type": "Легендарные Чары Существо — Бог"}, {"language": "Chinese Simplified", "multiverseId": 479165, "name": "灵帷雅睿欧斯", "text": "不灭\n只要你的白黑两色献力小于七，雅睿欧斯便不是生物。\n在你的结束步骤开始时，在另一个目标生物上放置一个钱币指示物。\n每当一个其上有钱币指示物的生物死去或进入放逐区时，将该牌在你的操控下移回战场。", "type": "传奇结界生物 ～神"}, {"language": "Chinese Traditional", "multiverseId": 479166, "name": "靈帷雅睿歐斯", "text": "不滅\n只要你的白黑兩色獻力小於七，雅睿歐斯便不是生物。\n在你的結束步驟開始時，在另一個目標生物上放置一個錢幣指示物。\n每當一個其上有錢幣指示物的生物死去或進入放逐區時，將該牌在你的操控下移回戰場。", "type": "傳奇結界生物 ～神"}], "frameEffects": ["nyxtouched", "legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "230721", "cardKingdomId": "230722", "cardsphereId": "65751", "mcmId": "429116", "mtgArenaId": "70784", "mtgjsonV4Id": "939aa843-70e3-5030-9b30-8e22c3379ed4", "mtgoId": "79698", "multiverseId": "479156", "scryfallId": "871c19fc-7d99-4022-9e13-d679a9e3547e", "scryfallIllustrationId": "1b7f61e4-1607-4c48-bbfe-cdcd1c40a4f7", "scryfallOracleId": "9aacc1ce-8d0d-4a24-9a15-74635f2f127d", "tcgplayerProductId": "208041"}, "isPromo": true, "isStarter": true, "keywords": ["Indestructible"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{W}{B}", "manaValue": 6.0, "name": "Athreos, Shroud-Veiled", "number": "269", "originalText": "Indestructible\nAs long as your devotion to white and black is less than seven, Athreos isn't a creature.\nAt the beginning of your end step, put a coin counter on another target creature.\nWhenever a creature with a coin counter on it dies or is put into exile, return that card to the battlefield under your control.", "originalType": "Legendary Enchantment Creature — God", "power": "4", "printings": ["PRM", "THB"], "promoTypes": ["buyabox"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/15ee630ba11c2011", "cardKingdomFoil": "https://mtgjson.com/links/afdb1b6dba44dedd", "tcgplayer": "https://mtgjson.com/links/c595d366ffd4abad"}, "rarity": "mythic", "rulings": [{"date": "2020-01-24", "text": "If a token with a coin counter on it dies or is exiled, Athreos’s last ability triggers, but won’t return it to the battlefield."}, {"date": "2020-01-24", "text": "The creature returns to the battlefield without a coin counter on it."}, {"date": "2020-01-24", "text": "If an effect exiles a creature with a coin counter on it and immediately returns it to the battlefield, Athreos’s last ability triggers but will have no effect. If an effect exiles a creature with a coin counter on it and would return it to the battlefield at a later time, Athreos’s last ability will return that card to the battlefield and it won’t be returned later."}, {"date": "2020-01-24", "text": "If a creature with a coin counter on it is put into a graveyard or exile but leaves that zone before Athreos’s last ability resolves, that card stays in its new zone, even if that zone is also a graveyard or exile. You don’t return it to the battlefield."}, {"date": "2020-01-24", "text": "If Athreos and a creature with a coin counter on it are both put into graveyards and/or exiled at the same time, the other creature will be returned to the battlefield."}, {"date": "2020-01-24", "text": "If Athreos somehow gets a coin counter on itself, its last ability will return it when it dies or is exiled."}, {"date": "2020-01-24", "text": "If Athreos leaves the battlefield, creatures with coin counters on them keep them. The counters won’t have any meaning or effect unless another Athreos is on the battlefield later."}, {"date": "2020-01-24", "text": "If a creature with a coin counter on it stops being a creature, it keeps its coin counter, but Athreos’s last ability won’t trigger when that permanent dies or is exiled unless it’s a creature again by that time."}, {"date": "2020-01-24", "text": "If a creature you don’t own has a coin counter on it, that permanent will return to the battlefield under your control when it dies or is exiled while you control Athreos. In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. If you leave the game, any creatures you control from Athreos’s ability are exiled."}, {"date": "2020-01-24", "text": "In a two-player game, if both players control an Athreos when a creature with a coin counter on it dies, the nonactive player (the one whose turn it isn’t) will return the creature under their control. If that happens in a multiplayer game, the nonactive player closest to the right of the player whose turn it is will return the creature under their control."}, {"date": "2020-01-24", "text": "Colorless and generic mana symbols ({C}, {0}, {1}, {2}, {X}, and so on) in mana costs of permanents you control don’t count toward your devotion to any color."}, {"date": "2020-01-24", "text": "Mana symbols in the text boxes of permanents you control don’t count toward your devotion to any color."}, {"date": "2020-01-24", "text": "Hybrid mana symbols, monocolored hybrid mana symbols, and Phyrexian mana symbols do count toward your devotion to their color(s)."}, {"date": "2020-01-24", "text": "If an activated ability or triggered ability has an effect that depends on your devotion to a color, you count the number of mana symbols of that color among the mana costs of permanents you control as the ability resolves. The permanent with that ability will be counted if it’s still on the battlefield at that time."}, {"date": "2020-01-24", "text": "If you put an Aura on an opponent’s permanent, you still control the Aura, and mana symbols in its mana cost count towards your devotion."}, {"date": "2020-01-24", "text": "Your devotion to two colors is the number of mana symbols among mana costs of permanents you control that are the first color, the second, or both. If an effect counts your devotion to two colors, a hybrid symbol that is both of those colors is counted just once."}, {"date": "2020-01-24", "text": "The type-changing ability that can make a God not be a creature functions only on the battlefield. It’s always a creature card in other zones, regardless of your devotion to its color. It’s always a creature spell while it’s on the stack."}, {"date": "2020-01-24", "text": "As a God enters the battlefield, your devotion to its color will determine whether any replacement effects that affect creatures entering the battlefield apply to that God. Because replacement effects are considered before the God is on the battlefield, the mana symbols in its mana cost won’t be counted when determining this."}, {"date": "2020-01-24", "text": "When a God enters the battlefield, your devotion to its color (including the mana symbols in the mana cost of the God itself) will determine if a creature entered the battlefield or not for abilities that trigger whenever a creature enters the battlefield."}, {"date": "2020-01-24", "text": "If a God stops being a creature, it loses the type creature and the creature type God. It continues to be a legendary enchantment."}, {"date": "2020-01-24", "text": "The abilities of Gods function as long as they’re on the battlefield, regardless of whether they’re creatures."}, {"date": "2020-01-24", "text": "If a God is attacking or blocking and it stops being a creature, it will be removed from combat. It won’t rejoin combat if it resumes being a creature later during that combat."}, {"date": "2020-01-24", "text": "Counters put on a God remain on it while it’s not a creature, even if they have no effect."}, {"date": "2020-01-24", "text": "If an effect causes a God to lose all abilities, its ability that causes it to stop being a creature still applies if appropriate."}], "securityStamp": "oval", "setCode": "THB", "subtypes": ["God"], "supertypes": ["Legendary"], "text": "Indestructible\nAs long as your devotion to white and black is less than seven, Athreos isn't a creature.\nAt the beginning of your end step, put a coin counter on another target creature.\nWhenever a creature with a coin counter on it dies or is put into exile, return that card to the battlefield under your control.", "toughness": "7", "type": "Legendary Enchantment Creature — God", "types": ["Enchantment", "Creature"], "uuid": "5636e28c-6778-5aa9-bf4d-05d545c6edc2"}