{"artist": "Jason A. Engle", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B", "W"], "colors": ["B", "W"], "convertedManaCost": 3.0, "edhrecRank": 1533, "finishes": ["foil"], "foreignData": [], "frameEffects": ["nyxtouched", "legendary", "showcase"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "231894", "cardsphereId": "66048", "mcmId": "440293", "mtgjsonV4Id": "cb200b70-9e70-5f61-b5ce-b8df1dbeec25", "multiverseId": "479505", "scryfallId": "3380a687-c96b-4e1a-bfd9-3849d085b803", "scryfallIllustrationId": "e3100aa4-e29a-46aa-9811-28b4d57dc5be", "scryfallOracleId": "af206aed-1f58-4f5a-ba42-0e0d1f282940", "tcgplayerProductId": "209386"}, "isFullArt": true, "isReprint": true, "isStarter": true, "keywords": ["Indestructible"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}{B}", "manaValue": 3.0, "name": "Athreos, God of Passage", "number": "76", "originalReleaseDate": "2020-02-14", "originalText": "Indestructible\nAs long as your devotion to white and black is less than seven, Athreos isn't a creature.\nWhenever another creature you own dies, return it to your hand unless target opponent pays 3 life.", "originalType": "Legendary Enchantment Creature — God", "power": "5", "printings": ["JOU", "MB1", "SLD"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/b62cc91aabfb4f6f", "tcgplayer": "https://mtgjson.com/links/8cf7fa22988d833c"}, "rarity": "mythic", "rulings": [{"date": "2014-04-26", "text": "Athreos's last ability will trigger if a token creature you own dies. The target opponent has the option to pay 3 life, although the token can't return to your hand."}, {"date": "2014-04-26", "text": "It doesn't matter who controlled the creature when it died. Athreos's last ability will trigger if you owned that creature."}, {"date": "2014-04-26", "text": "The target opponent chooses whether to pay 3 life when Athreos's last ability resolves. You won't return the card to your hand if that player pays 3 life or if the card leaves the graveyard before the ability resolves."}, {"date": "2014-04-26", "text": "If there are no legal targets for Athreos's last ability (perhaps because each of your opponents has hexproof), it will be removed from the stack with no effect. No one may pay 3 life and you won't return the creature card to your hand."}, {"date": "2014-04-26", "text": "You are a creature's owner if the card representing it began the game in your deck, or if it's a token that entered the battlefield under your control."}, {"date": "2020-01-24", "text": "If an effect causes a God to lose all abilities, its ability that causes it to stop being a creature still applies if appropriate."}, {"date": "2020-01-24", "text": "When a God enters the battlefield, your devotion to its color (including the mana symbols in the mana cost of the God itself) will determine if a creature entered the battlefield or not for abilities that trigger whenever a creature enters the battlefield."}, {"date": "2020-01-24", "text": "If a God stops being a creature, it loses the type creature and the creature type God. It continues to be a legendary enchantment."}, {"date": "2020-01-24", "text": "The abilities of Gods function as long as they're on the battlefield, regardless of whether they're creatures."}, {"date": "2020-01-24", "text": "If a God is attacking or blocking and it stops being a creature, it will be removed from combat. It won't rejoin combat if it resumes being a creature later during that combat."}, {"date": "2020-01-24", "text": "Counters put on a God remain on it while it's not a creature, even if they have no effect."}, {"date": "2020-01-24", "text": "Your devotion to two colors is the number of mana symbols among mana costs of permanents you control that are the first color, the second, or both. If an effect counts your devotion to two colors, a hybrid symbol that is both of those colors is counted just once."}, {"date": "2020-01-24", "text": "The type-changing ability that can make a God not be a creature functions only on the battlefield. It's always a creature card in other zones, regardless of your devotion to its color. It's always a creature spell while it's on the stack."}, {"date": "2020-01-24", "text": "As a God enters the battlefield, your devotion to its color will determine whether any replacement effects that affect creatures entering the battlefield apply to that God. Because replacement effects are considered before the God is on the battlefield, the mana symbols in its mana cost won't be counted when determining this."}], "securityStamp": "oval", "setCode": "SLD", "subset": ["Theros Stargazing, Volume III"], "subtypes": ["God"], "supertypes": ["Legendary"], "text": "Indestructible\nAs long as your devotion to white and black is less than seven, Athreos isn't a creature.\nWhenever another creature you own dies, return it to your hand unless target opponent pays 3 life.", "toughness": "4", "type": "Legendary Enchantment Creature — God", "types": ["Enchantment", "Creature"], "uuid": "b17abbf5-8b0d-5723-9f9e-fb69d518ee12"}