{"artist": "Billy Christian", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 3.0, "edhrecRank": 687, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "3cbf62c9-c1d2-5007-8ad9-9a3b1baedd54", "mtgoId": "94028", "scryfallId": "c4fffacd-81c7-44b8-9b59-2c7210022c14", "scryfallIllustrationId": "43f4f5ed-a16c-4868-ad8f-fc32e55bdab1", "scryfallOracleId": "9e774188-caa1-4b62-b9cc-547f8e444b7f"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Coven"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}{G}", "manaValue": 3.0, "name": "Augur of Autumn", "number": "94028", "originalReleaseDate": "2022-01-28", "power": "2", "printings": ["DBL", "MID", "PMID", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-09-24", "text": "Augur of Autumn doesn't change the times when you can play a land card from the top of your library. You can play a land only during your main phase when you have priority and the stack is empty. Doing so counts as your land play for the turn."}, {"date": "2021-09-24", "text": "The top card of your library isn't in your hand, so you can't suspend it, cycle it, discard it, or activate any of its activated abilities."}, {"date": "2021-09-24", "text": "Essentially, Augur of Autumn lets you play with the top card of your library revealed only to you. Knowing what that card is becomes part of the information you have access to, just like you can look at the cards in your hand. You may look at the top card of your library whenever you want, even if you don't have priority. This action doesn't use the stack."}, {"date": "2021-09-24", "text": "If the top card of your library changes during the process of casting a spell or activating an ability, you can't look at the new top card until the process of casting the spell or activating the ability ends (all targets are chosen, all costs are paid, and so on)."}, {"date": "2021-09-24", "text": "While you have three creatures with different powers, Augur of Autumn allows you to cast the top card of your library if it's a creature card, it's your main phase, and the stack is empty. If that creature card has flash, you'll be able to cast it any time you could cast an instant, even on an opponent's turn."}, {"date": "2021-09-24", "text": "You still pay all costs for that spell, including additional costs. You may also pay alternative costs."}, {"date": "2021-09-24", "text": "A creature has different power from another if their powers are different numbers. For example, a 1/1 creature and a 2/1 creature have different powers."}, {"date": "2021-09-24", "text": "For three creatures to have different powers from one another, each of their powers needs to be different. A 1/1 creature, a 2/1 creature, and another 2/1 creature aren't three creatures with different powers, even though both 2/1 creatures have different power than the 1/1 creature."}, {"date": "2021-09-24", "text": "Many coven abilities, such as that of Dawnhart Wardens above, are triggered abilities with intervening if clauses. You must control three or more creatures with different powers at the time the ability triggers and at the time the ability tries to resolve. They do not, however, need to be the same set of creatures in both cases."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Human", "Druid"], "supertypes": [], "text": "You may look at the top card of your library any time.\nYou may play lands from the top of your library.\nCoven — As long as you control three or more creatures with different powers, you may cast creature spells from the top of your library.", "toughness": "3", "type": "Creature — Human Druid", "types": ["Creature"], "uuid": "f3570c7c-0798-5d8f-8fa9-72de24f30bfb"}