{"artist": "Caio Monteiro", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 6.0, "edhrecRank": 3925, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "335a9f2c-61f0-5064-88b7-8cb9339c1fb3", "mtgoId": "86026", "scryfallId": "a4bb5187-95fb-49b5-9128-d7c5da3bce8f", "scryfallIllustrationId": "ac1b240c-427d-48c1-b1a2-9df6a635efde", "scryfallOracleId": "a98cc4d0-a322-4142-aee0-83f39b137616"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Cascade", "Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{R}{R}", "manaValue": 6.0, "name": "Aurora Phoenix", "number": "86026", "originalReleaseDate": "2020-12-15", "power": "5", "printings": ["CLB", "CMR", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-11-10", "text": "An ability that triggers when a player casts a spell resolves before the spell that caused it to trigger. It resolves even if that spell is countered."}, {"date": "2020-11-10", "text": "The cascade ability of the spell you cast and Aurora Phoenix's return ability can be put on the stack in either order. If you return Aurora Phoenix to your hand first, you do so before exiling any cards for the cascade ability. If the cascade ability resolves first, the spell you cast because of that cascade ability will resolve before you return Aurora Phoenix to your hand. Either way, this all happens before the original spell with cascade resolves."}, {"date": "2020-11-10", "text": "Aurora Phoenix's last ability triggers only if it's in your graveyard immediately after you finish casting the spell with cascade."}, {"date": "2021-06-18", "text": "The mana value of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."}, {"date": "2021-06-18", "text": "If you cast a card “without paying its mana cost,” you can't choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those to cast the card."}, {"date": "2021-06-18", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2021-06-18", "text": "Due to a recent rules change to cascade, not only do you stop exiling cards if you exile a nonland card with lesser mana value than the spell with cascade, but the resulting spell you cast must also have lesser mana value. Previously, in cases where a card's mana value differed from the resulting spell, such as with some modal double-faced cards or cards with an Adventure, you could cast a spell with a higher mana value than the exiled card."}, {"date": "2021-06-18", "text": "A spell's mana value is determined only by its mana cost. Ignore any alternative costs, additional costs, cost increases, or cost reductions."}, {"date": "2021-06-18", "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."}, {"date": "2021-06-18", "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."}, {"date": "2021-06-18", "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."}, {"date": "2021-06-18", "text": "You exile the cards face up. All players will be able to see them."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Phoenix"], "supertypes": [], "text": "Flying\nCascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)\nWhenever you cast a spell with cascade, return Aurora Phoenix from your graveyard to your hand.", "toughness": "3", "type": "Creature — Phoenix", "types": ["Creature"], "uuid": "212d44c7-c4d1-595f-96a7-8b3c6781e45d"}