{"artist": "Victor Adame Minguez", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 4721, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 545874, "name": "Avacyns Richtspruch", "text": "Wahnsinn {X}{R} (Falls du diese Karte abwirfst, wirf sie ins Exil ab. Wenn du dies tust, wirke sie für ihre Wahnsinn-Kosten oder lege sie auf deinen Friedhof.)\nAvacyns Richtspruch fügt 2 Schadenspunkte zu, deren Aufteilung auf eine beliebige Anzahl an Zielen deiner Wahl du bestimmst. Falls die Wahnsinn-Kosten dieses Zauberspruchs bezahlt wurden, fügt er stattdessen X Schadenspunkte zu, deren Aufteilung auf eine beliebige Anzahl jener bleibenden Karten und/oder Spieler du bestimmst.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 545986, "name": "Juicio de Avacyn", "text": "Demencia {X}{R}. (Si descartas esta carta, exíliala. Cuando lo hagas, lánzala por su coste de demencia o ponla en tu cementerio.)\nEl Juicio de Avacyn hace 2 puntos de daño divididos como elijas entre cualquier cantidad de objetivos. Si se pagó el coste de demencia de este hechizo, en vez de eso, hace X puntos de daño divididos como elijas entre esos permanentes y/o jugadores.", "type": "Conjuro"}, {"language": "French", "multiverseId": 546098, "name": "Jugement selon Avacyn", "text": "Folie {X}{R} (Si vous vous défaussez de cette carte, défaussez-vous en vers l'exil. Quand vous faites ainsi, lancez-la pour son coût de folie ou mettez-la dans votre cimetière.)\nLe Jugement selon Avacyn inflige 2 blessures réparties comme vous le désirez entre n'importe quel nombre de cibles. Si le coût de folie de ce sort a été payé, il inflige X blessures réparties comme vous le désirez entre ces permanents et/ou joueurs à la place.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 546210, "name": "Verdetto di Avacyn", "text": "Follia {X}{R} (Se scarti questa carta, scartala in esilio. Quando lo fai, lanciala pagando il suo costo di follia o mettila nel tuo cimitero.)\nIl Verdetto di Avacyn infligge 2 danni divisi a tua scelta tra un qualsiasi numero di bersagli. Se è stato pagato il costo di follia di questa magia, essa infligge invece X danni divisi a tua scelta tra quei permanenti e/o giocatori.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 546322, "name": "アヴァシンの裁き", "text": "マッドネス{X}{R}（あなたがこのカードを捨てるなら、これを追放領域に捨てる。そうしたとき、これをマッドネス・コストで唱えるか、あなたの墓地に置く。）\nクリーチャーやプレインズウォーカーやプレイヤーのうち望む数を対象とし、２点分をあなたの望むように割り振る。これのマッドネス・コストが支払われていたなら、代わりに、望む数を対象とし、Ｘ点分をあなたの望むように割り振る。\nアヴァシンの裁きはそれらにその割り振った点数のダメージを与える。", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 546434, "name": "Julgamento de Avacyn", "text": "Loucura {X}{R} (Se você descartar este card, descarte-o para o exílio. Quando fizer isso, conjure-o por seu custo de loucura ou coloque-o em seu cemitério.)\nJulgamento de Avacyn causa 2 pontos de dano distribuídos à sua escolha entre qualquer número de alvos. Se o custo de loucura desta mágica foi pago, em vez disso, ela causa X pontos de dano distribuídos à sua escolha entre aquelas permanentes e/ou jogadores.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 546546, "name": "Правосудие Авацины", "text": "Бешенство {X}{R} (Если вы сбрасываете эту карту, сбросьте ее в изгнание. Когда вы это делаете, разыграйте ее за ее стоимость Бешенства или положите на ваше кладбище.)\nПравосудие Авацины наносит 2 повреждения, разделенные по вашему выбору между любым количеством целей. Если стоимость Бешенства этого заклинания была оплачена, то вместо этого оно наносит X повреждений, разделенных по вашему выбору между теми перманентами и/или игроками.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 546658, "name": "艾维欣的裁决", "text": "疯魔{X}{R}（如果你弃掉此牌，将之弃到放逐区。当你如此作时，支付其疯魔费用施放之，否则便将其置入你的坟墓场。）\n艾维欣的裁决对任意数量的目标造成共2点伤害，你可以任意分配。如果曾支付此咒语的疯魔费用，则改为它对该些永久物和／或牌手造成共X点伤害，你可以任意分配。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 546770, "name": "艾維欣的裁決", "text": "瘋魔{X}{R}（如果你棄掉此牌，將之棄到放逐區。當你如此作時，支付其瘋魔費用施放之，否則便將其置入你的墳墓場。）\n艾維欣的裁決對任意數量的目標造成共2點傷害，你可以任意分配。如果曾支付此咒語之瘋魔費用，則改為它對該些永久物和／或玩家造成共X點傷害，你可以任意分配。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "253411", "cardsphereId": "82495", "mcmId": "584122", "mtgjsonV4Id": "80362b81-58e2-565e-8521-9cd934c6b230", "multiverseId": "545762", "scryfallId": "2642eb44-becf-4e99-934f-7241fcc32dee", "scryfallIllustrationId": "b5deed52-6768-4797-a4d3-e37fb50b3cb8", "scryfallOracleId": "f3ae58ed-8ef7-4e0a-945f-1f622157236b", "tcgplayerProductId": "254243"}, "isReprint": true, "isStarter": true, "keywords": ["Madness"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}", "manaValue": 2.0, "name": "Avacyn's Judgment", "number": "142", "originalText": "Madness {X}{R} (If you discard this card, discard it into exile. When you do, cast it for its madness cost or put it into your graveyard.)\nAvacyn's Judgment deals 2 damage divided as you choose among any number of targets. If this spell's madness cost was paid, it deals X damage divided as you choose among those permanents and/or players instead.", "originalType": "Sorcery", "printings": ["C19", "PSOI", "SOI", "VOC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/a775c07add3387dc", "tcgplayer": "https://mtgjson.com/links/f0b75af211af7ab2"}, "rarity": "rare", "rulings": [{"date": "2016-04-08", "text": "You announce how the damage will be divided as part of casting Avacyn's Judgment. Each chosen target must receive at least 1 damage."}, {"date": "2016-04-08", "text": "If Avacyn's Judgment has multiple targets, and some but not all of them are illegal targets when Avacyn's Judgment resolves, Avacyn's Judgment will still deal damage to the remaining legal targets according to the original damage division."}, {"date": "2016-04-08", "text": "Cards are discarded in a Magic game only from a player's hand. Effects that put cards from a player's library into that player's graveyard do not cause those cards to be discarded."}, {"date": "2016-04-08", "text": "A spell cast for its madness cost is put onto the stack like any other spell. It can be countered, copied, and so on. As it resolves, it's put onto the battlefield if it's a permanent card or into its owner's graveyard if it's an instant or sorcery card."}, {"date": "2016-04-08", "text": "Casting a spell for its madness cost doesn't change its mana cost or its mana value. You just pay the madness cost instead."}, {"date": "2016-04-08", "text": "Effects that cause you to pay more or less for a spell will cause you to pay that much more or less for its madness cost, too."}, {"date": "2016-04-08", "text": "Madness works independently of why you're discarding the card. You could discard it to pay a cost, because a spell or ability tells you to, or even because you have too many cards in your hand at the end of your turn. You can't discard a card with madness just because you want to, though."}, {"date": "2016-04-08", "text": "When you cast a card with madness, it was still discarded. If it was discarded to pay a cost, that cost is still paid. Abilities that trigger when a card is discarded will still trigger."}, {"date": "2016-04-08", "text": "If you choose not to cast a card with madness when the madness triggered ability resolves, it's put into your graveyard. You don't get another chance to cast it later."}, {"date": "2016-04-08", "text": "If you discard a card with madness to pay the cost of a spell or activated ability, that card's madness trigger (and the spell that card becomes, if you choose to cast it) will resolve before the spell or ability the discard paid for."}, {"date": "2016-04-08", "text": "If you discard a card with madness while resolving a spell or ability, it moves immediately to exile. Continue resolving that spell or ability—the card is not in your graveyard at this time. Its madness trigger will be placed onto the stack once that spell or ability has completely resolved."}], "securityStamp": "oval", "setCode": "VOC", "subtypes": [], "supertypes": [], "text": "Madness {X}{R} (If you discard this card, discard it into exile. When you do, cast it for its madness cost or put it into your graveyard.)\nAvacyn's Judgment deals 2 damage divided as you choose among any number of targets. If this spell's madness cost was paid, it deals X damage divided as you choose among those permanents and/or players instead.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "9328b41a-e0aa-59ed-9c38-125406204006"}