{"artist": "Jesper Ejsing", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U", "W"], "colors": ["U", "W"], "convertedManaCost": 3.0, "edhrecRank": 8265, "finishes": ["nonfoil"], "flavorText": "\"If the skies are our only refuge, I will see all of us take wing.\"", "foreignData": [{"flavorText": "„Wenn der Himmel unsere einzige Zuflucht ist, muss ich euch das Fliegen beibringen.\"", "language": "German", "multiverseId": 560158, "name": "Avior-Wandelmagier", "text": "Fliegend\nZu Beginn deines Versorgungssegments kannst du eine Federmarke auf eine Kreatur deiner Wahl legen. Falls du dies tust, hat die Kreatur Basis-Stärke und -Widerstandskraft 3/1 und Flugfähigkeit, solange eine Federmarke auf ihr liegt.", "type": "Kreatur — Vogel, Zauberer"}, {"flavorText": "\"Si el cielo es nuestro único refugio, me aseguraré que todos podamos volar\".", "language": "Spanish", "multiverseId": 560415, "name": "Mimeomante aven", "text": "Vuela.\nAl comienzo de tu mantenimiento, puedes poner un contador de pluma sobre la criatura objetivo. Si lo haces, esa criatura tiene una fuerza y resistencia base de 3/1 y tiene la habilidad de volar mientras tenga un contador de pluma sobre ella.", "type": "Criatura — Hechicero ave"}, {"flavorText": "« Si les cieux sont notre seul refuge, je m'assurerai que nous prenions tous notre essor. »", "language": "French", "multiverseId": 560672, "name": "Ronéomancien avemain", "text": "Vol\nAu début de votre entretien, vous pouvez mettre un marqueur « plume » sur une créature ciblée. Si vous faites ainsi, cette créature a une force et une endurance de base de 3/1 et elle a le vol tant qu'elle a un marqueur « plume » sur elle.", "type": "Créature : oiseau et sorcier"}, {"flavorText": "\"Se i cieli sono la nostra unica possibilità di salvezza, farò in modo che a tutti noi spuntino le ali.\"", "language": "Italian", "multiverseId": 560929, "name": "Duplicomante Aviano", "text": "Volare\nAll'inizio del tuo mantenimento, puoi mettere un segnalino piuma su una creatura bersaglio. Se lo fai, quella creatura ha forza e costituzione base 3/1 e ha volare fintanto che ha un segnalino piuma.", "type": "Creatura — Mago Uccello"}, {"flavorText": "「空にしか逃げ場が無いようなら、皆に羽根を与えよう。」", "language": "Japanese", "multiverseId": 561186, "name": "エイヴンの擬態術士", "text": "飛行\nあなたのアップキープの開始時に、クリーチャー１体を対象とする。あなたはそれの上に羽根カウンター１個を置いてもよい。そうしたなら、それの上にカウンターがあり続けているかぎり、そのクリーチャーは基本のパワーとタフネスが３/１であり飛行を持つ。", "type": "クリーチャー — 鳥・ウィザード"}, {"flavorText": "\"Se os céus são nosso único refúgio, farei com que todos tenhamos asas.\"", "language": "Portuguese (Brazil)", "multiverseId": 561443, "name": "Mimeomante Aviano", "text": "Voar\nNo início de sua manutenção, você pode colocar um marcador de pena na criatura alvo. Se fizer isso, aquela criatura terá poder e resistência básicos 3/1 e terá voar enquanto tiver um marcador de pena.", "type": "Criatura — Ave Mago"}, {"flavorText": "«Если небеса — наш единственный приют, то я позабочусь, чтобы у каждого из нас были крылья».", "language": "Russian", "multiverseId": 561700, "name": "Крылатый Мимеомант", "text": "Полет\nВ начале вашего шага поддержки вы можете положить один жетон пера на целевое существо. Если вы это делаете, то существо имеет базовую силу и выносливость 3/1 и имеет Полет, пока на нем есть жетон пера.", "type": "Существо — Птица Чародей"}, {"flavorText": "「若天空是唯一的避难所，我将看见大家振翅高飞。」", "language": "Chinese Simplified", "multiverseId": 561957, "name": "艾文分印术士", "text": "飞行\n在你的维持开始时，你可以在目标生物上放置一个飞羽指示物。若你如此作，则于该生物上有飞羽指示物的时段内，它的基础力量与防御力为3/1且具有飞行异能。", "type": "生物 ～鸟／法术师"}, {"flavorText": "「若天空是唯一的避難所，我將看見大家振翅高飛。」", "language": "Chinese Traditional", "multiverseId": 562214, "name": "艾文分印術士", "text": "飛行\n在你的維持開始時，你可以在目標生物上放置一個飛羽指示物。若你如此作，則於該生物上有飛羽指示物的時段內，它的基礎力量與防禦力為3/1且具有飛行異能。", "type": "生物 ～鳥／魔法師"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "259323", "cardsphereId": "87287", "mcmId": "652913", "mtgjsonV4Id": "2d78a71c-7e87-591e-bf74-35faadd538a8", "multiverseId": "559901", "scryfallId": "c50162a7-a791-4afc-a129-d259cd4419f2", "scryfallIllustrationId": "70aa96b3-c215-4b1f-ba3a-656518a63df3", "scryfallOracleId": "176c0ca2-0ca1-45e2-8412-86de5dbead48", "tcgplayerProductId": "269451"}, "isReprint": true, "keywords": ["Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}{U}", "manaValue": 3.0, "name": "Aven Mimeomancer", "number": "329", "originalText": "Flying\nAt the beginning of your upkeep, you may put a feather counter on target creature. If you do, that creature has base power and toughness 3/1 and has flying for as long as it has a feather counter on it.", "originalType": "Creature — Bird Wizard", "power": "3", "printings": ["ARB", "NCC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/0e50aa78b9e86cf2", "tcgplayer": "https://mtgjson.com/links/621f9f55e29454a6"}, "rarity": "rare", "rulings": [{"date": "2009-05-01", "text": "If the second ability affects a creature, it doesn't cause that creature to lose any of its abilities. It just gives that creature flying as well."}, {"date": "2009-05-01", "text": "The affected creature remains 3/1 and has flying as long as it has a feather counter on it. The effect continues even if Aven Mimeomancer leaves the battlefield."}, {"date": "2009-05-01", "text": "You may put a feather counter on a creature that already has a feather counter on it. Doing so has no visible effect unless some other effect has changed the creature's power or toughness, or caused it to lose flying, since the last feather counter was put on it."}, {"date": "2009-05-01", "text": "If all feather counters on a creature are moved to a different creature, the ability doesn't follow them. The first creature stops being affected by the ability because it no longer has a feather counter on it. The second creature is not affected by the ability because Aven Mimeomancer didn't target it."}, {"date": "2009-10-01", "text": "The effect from the ability overwrites other effects that set power and/or toughness if and only if those effects existed before the ability resolved. It will not overwrite effects that modify power or toughness (whether from a static ability, counters, or a resolved spell or ability), nor will it overwrite effects that set power and toughness which come into existence after the ability resolves. Effects that switch the creature's power and toughness are always applied after any other power or toughness changing effects, including this one, regardless of the order in which they are created."}], "securityStamp": "oval", "setCode": "NCC", "subtypes": ["Bird", "Wizard"], "supertypes": [], "text": "Flying\nAt the beginning of your upkeep, you may put a feather counter on target creature. If you do, that creature has base power and toughness 3/1 and has flying for as long as it has a feather counter on it.", "toughness": "1", "type": "Creature — Bird Wizard", "types": ["Creature"], "uuid": "f98844fd-7d43-5a3b-b4ee-662fb61dedad"}