{"artist": "Borja Pindado", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 5.0, "edhrecRank": 11126, "finishes": ["nonfoil", "foil"], "flavorText": "\"I will remember my friends. But you? You won't be remembered at all.\"", "foreignData": [{"flavorText": "„Ich werde meiner Freunde gedenken. Aber an dich wird sich niemand erinnern.\"", "language": "German", "multiverseId": 563458, "name": "Rachejäger", "text": "Verursacht Trampelschaden\nWenn der Rachejäger ins Spiel kommt, übernimmst du die Initiative.", "type": "Kreatur — Drache, Waldläufer"}, {"flavorText": "\"Yo recordaré a mis amigos. Pero a ti no te recordará nadie\".", "language": "Spanish", "multiverseId": 563818, "name": "Cazador vengativo", "text": "Arrolla.\nCuando el Cazador vengativo entre al campo de batalla, tomas la iniciativa.", "type": "Criatura — Guardabosque dragón"}, {"flavorText": "« Je me souviendrai de mes amis. Mais toi ? Nul ne se souviendra de toi. »", "language": "French", "multiverseId": 564178, "name": "Chasseur vengeur", "text": "Piétinement\nQuand le Chasseur vengeur arrive sur le champ de bataille, vous prenez l'initiative.", "type": "Créature : dragon et ranger"}, {"flavorText": "\"Io serberò il ricordo dei miei amici. Ma tu? Nessuno si ricorderà di te.\"", "language": "Italian", "multiverseId": 564538, "name": "Cacciatore Vendicatore", "text": "Travolgere\nQuando il Cacciatore Vendicatore entra nel campo di battaglia, prendi l'iniziativa.", "type": "Creatura — Ranger Drago"}, {"flavorText": "「私は友を忘れない。だが貴様はどうだ？忘れ去られてしまうだろうな。」", "language": "Japanese", "multiverseId": 564898, "name": "復讐する狩人", "text": "トランプル\n復讐する狩人が戦場に出たとき、あなたはイニシアチブを得る。", "type": "クリーチャー — ドラゴン・レインジャー"}, {"flavorText": "\"난 내 친구들을 기억할 거야. 하지만 넌 어떻지? 넌 전혀 기억되지 않겠지.\"", "language": "Korean", "multiverseId": 565258, "name": "보복하는 사냥꾼", "text": "돌진\n보복하는 사냥꾼이 전장에 들어올 때, 당신이 이니셔티브를 차지한다.", "type": "생물 — 용 레인저"}, {"flavorText": "\"Meus amigos se lembrarão de mim. Mas de você? Ninguém se lembrará.\"", "language": "Portuguese (Brazil)", "multiverseId": 565618, "name": "Caçador Vingador", "text": "Atropelar\nQuando Caçador Vingador entra no campo de batalha, você assume a dianteira.", "type": "Criatura — Dragão Guardião"}, {"flavorText": "«Я буду помнить своих друзей. А вот тебя... Тебя не запомнит никто».", "language": "Russian", "multiverseId": 565978, "name": "Мстительный Охотник", "text": "Пробивной удар\nКогда Мстительный Охотник выходит на поле битвы, вы получаете инициативу.", "type": "Существо — Дракон Следопыт"}, {"flavorText": "「我会缅怀我的朋友。而你呢？谁都不会缅怀你。」", "language": "Chinese Simplified", "multiverseId": 566338, "name": "寻仇猎人", "text": "践踏\n当寻仇猎人进战场时，你掌握先制。", "type": "生物 ～龙／游侠"}, {"flavorText": "「我會緬懷我的朋友。而你呢？誰都不會緬懷你。」", "language": "Chinese Traditional", "multiverseId": 566698, "name": "尋仇獵人", "text": "踐踏\n當尋仇獵人進戰場時，你掌握先制。", "type": "生物 ～龍／遊俠"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "261487", "cardKingdomId": "260931", "cardsphereId": "88819", "mcmId": "659226", "mcmMetaId": "408385", "mtgjsonV4Id": "7f98e2ae-4f56-5378-bea4-daa5d1a00bf1", "mtgoId": "100458", "multiverseId": "563098", "scryfallId": "f4072640-0f9b-4f0a-84cc-eda415cc92e7", "scryfallIllustrationId": "96435f8d-b5a4-4ce1-b349-6de2506a1ed4", "scryfallOracleId": "e0aa5e3d-17c0-4ac7-9d76-9ce579d1eb2b", "tcgplayerProductId": "272747"}, "keywords": ["Trample"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "pauper": "Legal", "paupercommander": "Legal", "vintage": "Legal"}, "manaCost": "{4}{G}", "manaValue": 5.0, "name": "Avenging Hunter", "number": "215", "originalText": "Trample\nWhen Avenging Hunter enters the battlefield, you take the initiative.", "originalType": "Creature — Dragon Ranger", "power": "5", "printings": ["CLB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6d595b2cbc8d5c50", "cardKingdomFoil": "https://mtgjson.com/links/b4240fa4fd6d9c5c", "cardmarket": "https://mtgjson.com/links/f1b47ff1204b7e1f", "tcgplayer": "https://mtgjson.com/links/2913a3b39b0ed466"}, "rarity": "common", "rulings": [{"date": "2022-06-10", "text": "The initiative is a designation a player can have. A player with the initiative designation is said to “have the initiative.” The initiative carries two inherent rules. First, whenever a player takes the initiative, and at the beginning of the upkeep of the player with the initiative, that player ventures into Undercity. Second, whenever one or more creatures a player controls deal combat damage to the player who has the initiative, the first player takes the initiative. Also, some abilities will refer to having the initiative and provide other benefits."}, {"date": "2022-06-10", "text": "There is no initiative in a game until an effect instructs a player to take the initiative. Once a player is instructed to do this, they have the initiative until another player takes the initiative."}, {"date": "2022-06-10", "text": "Only one player can have the initiative at a time. As one player takes the initiative, any other player that had the initiative ceases to have it."}, {"date": "2022-06-10", "text": "A player who currently has the initiative may take the initiative again. This causes that player to venture into Undercity again, but does not cause them to have multiple initiative designations."}, {"date": "2022-06-10", "text": "If the player with the initiative leaves the game, the active player takes the initiative at the same time that player leaves the game. If the active player is leaving the game or if there is no active player, the next player in turn order takes the initiative."}, {"date": "2022-06-10", "text": "In a Two-Headed Giant game, if both players on a team deal combat damage to the player that has the initiative at the same time, the player with the initiative will choose the order of the triggered abilities. Then, as those abilities resolve, one team member takes the initiative (and ventures into Undercity) and then the other team member does the same. The last player to take the initiative keeps it until the initiative changes again."}, {"date": "2022-06-10", "text": "You cannot venture into Undercity unless instructed to do so, either because you have the initiative at the beginning of your upkeep or because you take the initiative. Notably, if you aren’t in a dungeon and an effect instructs you to venture into the dungeon (not venture into Undercity), you can’t start Undercity."}, {"date": "2022-06-10", "text": "Similarly, when instructed to venture into Undercity, you can’t start a dungeon that isn’t Undercity."}, {"date": "2022-06-10", "text": "If you aren’t in a dungeon when instructed to venture into Undercity, you will put Undercity into the command zone and move your venture marker to Secret Entrance (the first room)."}, {"date": "2022-06-10", "text": "If you’re already in a dungeon when instructed to venture into Undercity, you move to the next room of that dungeon. If you are already in the last room, you will complete that dungeon and start Undercity. This is true whether you’re already in Undercity or any other dungeon."}], "setCode": "CLB", "subtypes": ["Dragon", "Ranger"], "supertypes": [], "text": "Trample\nWhen Avenging Hunter enters the battlefield, you take the initiative.", "toughness": "4", "type": "Creature — Dragon Ranger", "types": ["Creature"], "uuid": "d0ac15f2-0d57-5d5c-b3ba-987d6603e101"}