{"artist": "Lucas Graciano", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G", "R", "U"], "colors": ["G", "R", "U"], "convertedManaCost": 3.0, "edhrecRank": 3924, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "36ffa426-11bc-5858-bef8-2a8457daef78", "mtgoId": "86330", "scryfallId": "d761e2e2-42c5-4ad5-bb67-c5c21a7b9139", "scryfallIllustrationId": "d165a050-22d3-44b0-b8c4-c66700285eb7", "scryfallOracleId": "23695bc2-86d3-4d78-b374-9e83c4cc9cc4"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{G}{U}{R}", "manaValue": 3.0, "name": "Averna, the Chaos Bloom", "number": "86330", "originalReleaseDate": "2020-12-15", "power": "4", "printings": ["CMR", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-11-10", "text": "If you don’t cast the nonland card you reveal, or if you don’t reveal any nonland cards with lesser mana value, you can still put a land card onto the battlefield before you finish cascading."}, {"date": "2020-11-10", "text": "Averna’s ability isn’t the same as playing a land. You may do this even if you’ve already played a land during your turn and even if it isn’t your turn at all."}, {"date": "2021-03-19", "text": "The mana value of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."}, {"date": "2021-03-19", "text": "If the last card exiled is a card with an Adventure, you may only cast the spell as an Adventure if that spell has a lesser mana cost than the spell with cascade."}, {"date": "2021-03-19", "text": "The mana value of a modal double-faced card in exile is that of its front face. If the last card you exile is a modal double-faced card, you may only cast the back face if the resulting spell would also have a lesser mana value than the spell with cascade."}, {"date": "2021-03-19", "text": "A spell’s mana value is determined only by its mana cost. Ignore any alternative costs, additional costs, cost increases, or cost reductions. For example, Bloodbraid Elf’s mana value is always 4."}, {"date": "2021-03-19", "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."}, {"date": "2021-03-19", "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."}, {"date": "2021-03-19", "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."}, {"date": "2021-03-19", "text": "You exile the cards face up. All players will be able to see them."}, {"date": "2021-03-19", "text": "If you cast a card “without paying its mana cost,” you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those to cast the card."}, {"date": "2021-03-19", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Elemental", "Shaman"], "supertypes": ["Legendary"], "text": "As you cascade, you may put a land card from among the exiled cards onto the battlefield tapped. (Do this after the last card is exiled but before deciding whether to cast a nonland card.)", "toughness": "2", "type": "Legendary Creature — Elemental Shaman", "types": ["Creature"], "uuid": "2ea28e05-7214-5f70-bd9b-ce6b5d73a99a"}