{"artist": "Bastien L. Deharme", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 6.0, "edhrecRank": 7570, "finishes": ["nonfoil", "foil"], "flavorText": "The Church of Dusk teaches there is no gain without loss, no triumph without sacrifice, no drink of exquisite crimson without a dying gasp.", "foreignData": [{"flavorText": "Die Kirche des Zwielichts lehrt uns, dass für alles ein Preis gezahlt werden muss. Es gibt keinen Triumph ohne Opfer, keinen roten Trunk ohne einen letzten Atemzug.", "language": "German", "multiverseId": 435453, "name": "Achse der Sterblichkeit", "text": "Zu Beginn deines Versorgungssegments kannst du die Lebenspunktestände von zwei Spielern deiner Wahl vertauschen.", "type": "Verzauberung"}, {"flavorText": "La Iglesia del Crepúsculo enseña que no hay bonanza sin pérdida, que no hay triunfo sin sacrificio y que no es posible tomar una sola copa de la exquisita bebida carmesí sin un gemido de agonía.", "language": "Spanish", "multiverseId": 437546, "name": "Eje de la mortalidad", "text": "Al comienzo de tu mantenimiento, puedes hacer que dos jugadores objetivo intercambien su total de vidas.", "type": "Encantamiento"}, {"flavorText": "L'Église du crépuscule enseigne qu'il n'y a pas de gain sans perte, pas de triomphe sans sacrifice, pas de délicieux breuvage vermeil sans râle d'agonie.", "language": "French", "multiverseId": 435752, "name": "Axe de mortalité", "text": "Au début de votre entretien, vous pouvez faire que deux joueurs ciblés échangent leur total de points de vie.", "type": "Enchantement"}, {"flavorText": "La Chiesa del Vespro insegna che non esiste guadagno senza perdita, né trionfo senza sacrificio, né delizioso nettare scarlatto senza un anelito morente.", "language": "Italian", "multiverseId": 436051, "name": "Fulcro della Caducità", "text": "All'inizio del tuo mantenimento, puoi far scambiare i punti vita a due giocatori bersaglio.", "type": "Incantesimo"}, {"flavorText": "損失なくば増加はなく、犠牲なくば勝利はなく、死の恐怖なくば美血はないと、薄暮教会は説いている。", "language": "Japanese", "multiverseId": 436350, "name": "定命の枢軸", "text": "あなたのアップキープの開始時に、プレイヤー２人を対象とする。あなたは「その両者はライフ総量を交換する。」を選んでもよい。", "type": "エンチャント"}, {"flavorText": "황혼의 교회에서는 잃지 않으면 얻을 수 없고, 희생 없이는 승리할 수 없으며, 죽어가는 마지막 숨결 없이는 신선한 선홍빛 피를 마실 수 없다고 가르친다.", "language": "Korean", "multiverseId": 436649, "name": "필멸의 축", "text": "당신의 유지단 시작에, 플레이어 두 명을 목표로 정한다. 당신은 그 플레이어들이 생명 총점을 교환하도록 할 수 있다.", "type": "부여마법"}, {"flavorText": "A Igreja do Crepúsculo ensina que não há ganho sem perda, triunfo sem sacrifício, dose de refinado carmesim sem arquejo de morte.", "language": "Portuguese (Brazil)", "multiverseId": 436948, "name": "Eixo da Mortalidade", "text": "No início de sua manutenção, você pode fazer com que dois jogadores alvo permutem seus totais de pontos de vida.", "type": "Encantamento"}, {"flavorText": "Церковь Заката учит, что нет приобретений без потерь, нет триумфа без жертвы и нет глотка драгоценной киновари без предсмертного хрипа.", "language": "Russian", "multiverseId": 437247, "name": "Ось Бренности", "text": "В начале вашего шага поддержки вы можете заставить двух целевых игроков обменяться количеством жизней.", "type": "Чары"}, {"flavorText": "暮影教会教导信徒：有所失才有所得，有牺牲才有胜利，经濒死挣扎才得享鲜红佳酿。", "language": "Chinese Simplified", "multiverseId": 437845, "name": "凡命旋轴", "text": "在你的维持开始时，你可以令两位目标牌手彼此交换总生命。", "type": "结界"}, {"flavorText": "暮影教會教導信徒：有所失才有所得，有犧牲才有勝利，經瀕死掙扎才得享鮮紅佳釀。", "language": "Chinese Traditional", "multiverseId": 438144, "name": "凡命旋軸", "text": "在你的維持開始時，你可以令兩位目標玩家彼此交換總生命。", "type": "結界"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "214387", "cardKingdomId": "214098", "cardsphereId": "51106", "mcmId": "301719", "mcmMetaId": "226953", "mtgArenaId": "65965", "mtgjsonV4Id": "428b4aa7-f77c-5aeb-9d25-dd31f67b03d4", "mtgoFoilId": "65017", "mtgoId": "65016", "multiverseId": "435154", "scryfallId": "3b9d72a8-8acf-42c6-8adf-cbaecb4a985a", "scryfallIllustrationId": "c579ca76-a145-4995-87e4-7f634ec2aa5c", "scryfallOracleId": "158cb888-a115-4d50-a82f-746622f0578e", "tcgplayerProductId": "145683"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{W}{W}", "manaValue": 6.0, "name": "Axis of Mortality", "number": "3", "originalText": "At the beginning of your upkeep, you may have two target players exchange life totals.", "originalType": "Enchantment", "printings": ["PXLN", "XLN"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/25a56616e3d53e67", "cardKingdomFoil": "https://mtgjson.com/links/12e55ddeb7ae5286", "cardmarket": "https://mtgjson.com/links/07ea92b7fd6ccb13", "tcgplayer": "https://mtgjson.com/links/a7bebe90ca27fa9d"}, "rarity": "mythic", "rulings": [{"date": "2017-09-29", "text": "If one of the targeted players is an illegal target when the triggered ability of Axis of Mortality tries to resolve, the exchange won’t happen. Neither player’s life total will change."}, {"date": "2017-09-29", "text": "When the life totals are exchanged, each player gains or loses the amount of life necessary to equal the other player’s previous life total. For example, if player A has 5 life and player B has 3 life before the exchange, player A will lose 2 life and player B will gain 2 life. Replacement effects may modify these gains and losses, and triggered abilities may trigger on them."}, {"date": "2017-09-29", "text": "If a player can’t gain life, that player can’t exchange life totals with a player with a higher life total. If a player can’t lose life, that player can’t exchange life totals with a player with a lower life total. In either of these cases, neither player’s life total will change."}, {"date": "2017-09-29", "text": "In a Two-Headed Giant game, each player is considered to have the same life total as their team. If the two targeted players are on different teams, those players gain or lose the appropriate amount of life so that the teams end up exchanging life totals. If the two targeted players are teammates, they can’t exchange life totals."}], "securityStamp": "oval", "setCode": "XLN", "subtypes": [], "supertypes": [], "text": "At the beginning of your upkeep, you may have two target players exchange life totals.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "0bd4b1f5-c131-5b41-9c21-63f63af87cea"}