{"artist": "Sidharth Chaturvedi", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 5746, "finishes": ["nonfoil", "foil"], "flavorText": "\"Your concern for my safety is touching, but as long as your gunners remain reliably erratic, I see no reason to change course.\"\n—Admiral Yelise, to Commodore Axurik", "foreignData": [{"flavorText": "„Deine Sorge um meine Sicherheit ist rührend, aber solange deine Kanoniere verlässlich unberechenbar bleiben, sehe ich keinen Grund, den Kurs zu ändern.\"\n—Admiralin Yelise zu Kommodore Axurik", "language": "German", "multiverseId": 497939, "name": "Azurflotten-Admiralin", "text": "Wenn die Azurflotten-Admiralin ins Spiel kommt, wirst du zum Monarchen.\nDie Azurflotten-Admiralin kann von Kreaturen, die der Monarch kontrolliert, nicht geblockt werden.", "type": "Kreatur — Mensch, Pirat"}, {"flavorText": "\"Su preocupación por mi seguridad es conmovedora, pero mientras sus artilleros sigan siendo de tan poca confianza, no veo motivo para cambiar de rumbo\".\n—La almirante Yelise, al comodoro Axurik", "language": "Spanish", "multiverseId": 498300, "name": "Almirante de la Flota Azur", "text": "Cuando la Almirante de la Flota Azur entre al campo de batalla, te conviertes en el monarca.\nLa Almirante de la Flota Azur no puede ser bloqueada por criaturas que controla el monarca.", "type": "Criatura — Pirata humano"}, {"flavorText": "« Je suis touchée que vous vous souciiez de ma sécurité, mais tant que le comportement de vos canonniers restera imprévisible, je ne verrai pas de raison de changer de cap. »\n—Amirale Yélise, au commodore Axurik", "language": "French", "multiverseId": 498661, "name": "Amirale de la Flotte d'azur", "text": "Quand l'Amirale de la Flotte d'azur arrive sur le champ de bataille, vous devenez le monarque.\nL'Amirale de la Flotte d'azur ne peut pas être bloquée par les créatures que le monarque contrôle.", "type": "Créature : humain et pirate"}, {"flavorText": "\"La tua premura per la mia incolumità è commovente, ma finché posso contare sull'affidabile inettitudine dei tuoi artiglieri, non vedo perché dovrei cambiare rotta.\"\n—Ammiraglia Yelise al Commodoro Axurik", "language": "Italian", "multiverseId": 499022, "name": "Ammiraglia della Flotta Azzurra", "text": "Quando l'Ammiraglia della Flotta Azzurra entra nel campo di battaglia, diventi il monarca.\nL'Ammiraglia della Flotta Azzurra non può essere bloccata dalle creature controllate dal monarca.", "type": "Creatura — Pirata Umano"}, {"flavorText": "「こっちのことを心配してくれるなんて感謝の極みね。でも、あんたの砲手がいつも通りの下手くそ揃いなら、進路を変える必要はなさそうだわ。」\n――イェリゼ提督からアスリク准将へ", "language": "Japanese", "multiverseId": 499383, "name": "蒼穹艦隊の提督", "text": "蒼穹艦隊の提督が戦場に出たとき、あなたが統治者になる。\n蒼穹艦隊の提督は、統治者がコントロールしているクリーチャーによってはブロックされない。", "type": "クリーチャー — 人間・海賊"}, {"flavorText": "\"Sua preocupação com a minha segurança é tocante, mas enquanto seus artilheiros permanecerem firmemente erráticos, não vejo motivo para mudar o curso.\"\n— Almirante Yelise, ao Comodoro Axurik", "language": "Portuguese (Brazil)", "multiverseId": 499744, "name": "Almirante da Frota Cerúlea", "text": "Quando Almirante da Frota Cerúlea entra no campo de batalha, você se torna o monarca.\nAlmirante da Frota Cerúlea não pode ser bloqueado por criaturas que o monarca controla.", "type": "Criatura — Humano Pirata"}, {"flavorText": "「阁下关怀敝舰安危，谨表谢忱。倘若贵舰炮手持续稳定射偏，则并无改道理由。」\n～耶莉兹总帅复讯亚胥雷准将", "language": "Chinese Simplified", "multiverseId": 500105, "name": "碧蓝舰队总帅", "text": "当碧蓝舰队总帅进战场时，你成为君主。\n碧蓝舰队总帅不能被由君主操控的生物阻挡。", "type": "生物 ～人类／海盗"}, {"flavorText": "「閣下關懷敝艦安危，謹表謝忱。倘若貴艦炮手持續穩定射偏，則並無改道理由。」\n～耶莉茲總帥覆訊亞胥雷准將", "language": "Chinese Traditional", "multiverseId": 500466, "name": "碧藍艦隊總帥", "text": "當碧藍艦隊總帥進戰場時，你成為君主。\n碧藍艦隊總帥不能被由君主操控的生物阻擋。", "type": "生物 ～人類／海盜"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "239626", "cardKingdomId": "239235", "cardsphereId": "72520", "mcmId": "513915", "mcmMetaId": "323320", "mtgjsonV4Id": "ec60aa8f-9a69-5e28-b6f1-9a4bbbf99d28", "mtgoId": "84898", "multiverseId": "497578", "scryfallId": "c0889e22-deab-48ba-bbd6-f0d49bee5d9c", "scryfallIllustrationId": "af70030f-995d-4be1-8c27-a618dd28107c", "scryfallOracleId": "b39f228f-d146-49c6-bab4-5304e0f742d8", "tcgplayerProductId": "227194"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "pauper": "Legal", "paupercommander": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Azure Fleet Admiral", "number": "58", "originalText": "When Azure Fleet Admiral enters the battlefield, you become the monarch.\nAzure Fleet Admiral can't be blocked by creatures the monarch controls.", "originalType": "Creature — Human Pirate", "power": "3", "printings": ["CMR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7d89833ed44f5ad0", "cardKingdomFoil": "https://mtgjson.com/links/f959f29024038a3f", "cardmarket": "https://mtgjson.com/links/1ee10649b25d0f80", "tcgplayer": "https://mtgjson.com/links/4f60a12759f22612"}, "rarity": "common", "rulings": [{"date": "2020-11-10", "text": "Azure Fleet Admiral’s last ability normally means that it can’t be blocked while attacking the monarch or a planeswalker the monarch controls. In some variants with shared team turns, such as Two-Headed Giant, creatures controlled by the monarch’s teammate can block Azure Fleet Admiral, even if it’s attacking the monarch."}, {"date": "2020-11-10", "text": "The game starts with no monarch. Once an effect makes one player the monarch, the game will have exactly one monarch from that point forward. As a player becomes the monarch, the current monarch (if any) ceases being the monarch."}, {"date": "2020-11-10", "text": "There are two inherent triggered abilities associated with being the monarch. These triggered abilities have no source and are controlled by the player who was the monarch at the time the abilities triggered. The full texts of these abilities are “At the beginning of the monarch’s end step, that player draws a card” and “Whenever a creature deals combat damage to the monarch, its controller becomes the monarch.”"}, {"date": "2020-11-10", "text": "If the triggered ability that causes the monarch to draw a card goes on the stack and a different player becomes the monarch before that ability resolves, the first player will still draw the card."}, {"date": "2020-11-10", "text": "If the monarch leaves the game during another player’s turn, that player becomes the monarch. If the monarch leaves the game during their turn, the next player in turn order becomes the monarch."}, {"date": "2020-11-10", "text": "If combat damage dealt to the monarch causes that player to lose the game, the triggered ability that causes the controller of the attacking creature to become the monarch doesn’t resolve. In most cases, the controller of the attacking creature will still become the monarch as it is likely their turn."}], "setCode": "CMR", "subtypes": ["Human", "Pirate"], "supertypes": [], "text": "When Azure Fleet Admiral enters the battlefield, you become the monarch.\nAzure Fleet Admiral can't be blocked by creatures the monarch controls.", "toughness": "3", "type": "Creature — Human Pirate", "types": ["Creature"], "uuid": "aa75b6c7-4797-5706-884f-c97762a11e09"}