{"artist": "Rudy Siswanto", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 5.0, "edhrecRank": 3500, "finishes": ["nonfoil"], "flavorText": "Memories burn with the brightest flames.", "foreignData": [{"flavorText": "Erinnerungen lodern in den hellsten Flammen.", "language": "German", "multiverseId": 470871, "name": "Explosiver Höllendrache", "text": "Fliegend\nImmer wenn der Explosive Höllendrache angreift, erhält jede Spontanzauber- und Hexereikarte in deinem Friedhof Rückblende bis zum Ende des Zuges. Die Rückblendekosten sind gleich ihrer Manakosten.", "type": "Kreatur — Drache"}, {"flavorText": "Las llamas de los recuerdos son las más brillantes.", "language": "Spanish", "multiverseId": 471173, "name": "Engendro retroexplosivo", "text": "Vuela.\nSiempre que el Engendro retroexplosivo ataque, cada carta de instantáneo y de conjuro en tu cementerio gana la habilidad de retrospectiva hasta el final del turno. Su coste de retrospectiva es igual a su coste de maná.", "type": "Criatura — Dragón"}, {"flavorText": "Les souvenirs brûlent des flammes les plus ardentes.", "language": "French", "multiverseId": 471475, "name": "Escouflenfer des vents contraires", "text": "Vol\nÀ chaque fois que l'Escouflenfer des vents contraires attaque, chaque carte d'éphémère et de rituel de votre cimetière acquiert le flashback jusqu'à la fin du tour. Le coût de flashback est égal à son coût de mana.", "type": "Créature : dragon"}, {"flavorText": "I ricordi bruciano con le fiamme più vive.", "language": "Italian", "multiverseId": 471777, "name": "Nibbio Infernale della Controfiammata", "text": "Volare\nOgniqualvolta il Nibbio Infernale della Controfiammata attacca, ogni carta istantaneo e stregoneria nel tuo cimitero ha flashback fino alla fine del turno. Il costo di flashback è pari al suo costo di mana.", "type": "Creatura — Drago"}, {"flavorText": "記憶は最も明るい炎を上げて燃える。", "language": "Japanese", "multiverseId": 472079, "name": "逆噴射のヘルカイト", "text": "飛行\n逆噴射のヘルカイトが攻撃するたび、ターン終了時まで、あなたの墓地にありインスタントかソーサリーである各カードはそれぞれフラッシュバックを得る。そのフラッシュバック・コストは、それのマナ・コストに等しい。", "type": "クリーチャー — ドラゴン"}, {"flavorText": "As chamas das lembranças são as mais brilhantes.", "language": "Portuguese (Brazil)", "multiverseId": 472381, "name": "Dragão Avérneo do Retrofluxo", "text": "Voar\nToda vez que Dragão Avérneo do Retrofluxo ataca, cada card de mágica instantânea e de feitiço no seu cemitério ganha recapitular até o final do turno. O custo de recapitular é igual ao seu custo de mana.", "type": "Criatura — Dragão"}, {"flavorText": "Воспоминания горят самым ярким пламенем.", "language": "Russian", "multiverseId": 472683, "name": "Распаляющий Змей", "text": "Полет\nКаждый раз, когда Распаляющий Змей атакует, каждая карта мгновенного заклинания и волшебства на вашем кладбище получает Воспоминание до конца хода. Стоимость Воспоминания равна ее мана-стоимости.", "type": "Существо — Дракон"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "227030", "cardsphereId": "61154", "mcmId": "391652", "mcmMetaId": "278692", "mtgjsonV4Id": "e3d70570-f987-595d-89dd-abe8b39a8abc", "mtgoId": "77100", "multiverseId": "470569", "scryfallId": "2af9027d-c1d2-49b6-b303-04e37d38e010", "scryfallIllustrationId": "7bbd3105-1c46-45a9-b6e7-c6f6e6ea6821", "scryfallOracleId": "fcf9057a-4975-4a7d-85f5-3fdc80942fcd", "tcgplayerProductId": "196484"}, "isStarter": true, "keywords": ["Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}{R}", "manaValue": 5.0, "name": "Backdraft Hellkite", "number": "23", "originalText": "Flying\nWhenever Backdraft Hellkite attacks, each instant and sorcery card in your graveyard gains flashback until end of turn. The flashback cost is equal to its mana cost.", "originalType": "Creature — Dragon", "power": "4", "printings": ["2X2", "C19"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d2c054a0b397b04f", "cardmarket": "https://mtgjson.com/links/35fe8ef683024e14", "tcgplayer": "https://mtgjson.com/links/cbfb3c8cb8bd6e97"}, "rarity": "rare", "rulings": [{"date": "2019-08-23", "text": "Only instant and sorcery cards in your graveyard when Backdraft Hellkite’s triggered ability resolves will gain flashback. Instant and sorcery cards that are put into your graveyard later in the turn won’t gain flashback."}, {"date": "2019-08-23", "text": "Once Backdraft Hellkite has attacked, its ability will resolve and grant the appropriate cards flashback even if Backdraft Hellkite leaves the battlefield before the ability resolves or after it resolves but before you cast the spells."}, {"date": "2021-03-19", "text": "If a card with no mana cost gains flashback, it has no flashback cost. It can’t be cast this way."}, {"date": "2021-03-19", "text": "If a split card gains flashback, you pay only the cost of the half you’re casting."}, {"date": "2021-03-19", "text": "If you cast an instant or sorcery with {X} in its mana cost this way, you still choose the value of X as part of casting the spell and pay that cost."}, {"date": "2021-03-19", "text": "“Flashback [cost]” means “You may cast this card from your graveyard by paying [cost] rather than paying its mana cost” and “If the flashback cost was paid, exile this card instead of putting it anywhere else any time it would leave the stack.”"}, {"date": "2021-03-19", "text": "You must still follow any timing restrictions and permissions, including those based on the card’s type. For instance, you can cast a sorcery using flashback only when you could normally cast a sorcery."}, {"date": "2021-03-19", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a flashback cost) you’re paying, add any cost increases, then apply any cost reductions. The mana value of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2021-03-19", "text": "A spell cast using flashback will always be exiled afterward, whether it resolves, is countered, or leaves the stack in some other way."}, {"date": "2021-03-19", "text": "You can cast a spell using flashback even if it was somehow put into your graveyard without having been cast."}, {"date": "2021-03-19", "text": "If a card with flashback is put into your graveyard during your turn, you can cast it if it’s legal to do so before any other player can take any actions."}, {"date": "2021-03-19", "text": "If you cast a spell with flashback, you can’t pay any alternative costs such as overload costs. You can pay additional costs such as kicker costs. If the spell has any mandatory additional costs, you must pay those to cast the spell with flashback."}, {"date": "2021-03-19", "text": "If a card has multiple instances of flashback, you may choose any of its flashback costs to pay."}], "securityStamp": "oval", "setCode": "C19", "subtypes": ["Dragon"], "supertypes": [], "text": "Flying\nWhenever Backdraft Hellkite attacks, each instant and sorcery card in your graveyard gains flashback until end of turn. The flashback cost is equal to its mana cost.", "toughness": "4", "type": "Creature — Dragon", "types": ["Creature"], "uuid": "27df97f2-c6e4-5d67-bf7f-29f9c3da37ca"}