{"artist": "Kev Walker", "availability": ["mtgo"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 2.0, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "8ca83279-282b-5d2d-83d1-b249f6c10bd1", "mtgoFoilId": "53242", "mtgoId": "53241", "multiverseId": "382853", "scryfallId": "8bf4940c-e83d-434a-80bb-48b087165379", "scryfallIllustrationId": "e7cdb27c-ae05-4365-b4ff-be5f25949bce", "scryfallOracleId": "17fa98cd-ed8f-483f-9525-7e989a82ebb2"}, "isOnlineOnly": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Banned", "duel": "Legal", "legacy": "Banned", "premodern": "Banned", "vintage": "Restricted"}, "manaCost": "{1}{W}", "manaValue": 2.0, "name": "Balance", "number": "14", "originalText": "Each player chooses a number of lands he or she controls equal to the number of lands controlled by the player who controls the fewest, then sacrifices the rest. Players discard cards and sacrifice creatures the same way.", "originalType": "Sorcery", "printings": ["2ED", "30A", "3ED", "4BB", "4ED", "CED", "CEI", "EMA", "FBB", "G04", "LEA", "LEB", "ME4", "OLEP", "PRM", "PTC", "SLD", "SUM", "V09", "VMA"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2016-06-08", "text": "First the player whose turn it is chooses which lands (if any) to keep, then each other player in turn order does the same. Each player will know the choices made by the players who chose before them. All of the unchosen lands are then sacrificed simultaneously. Then the process is repeated for cards in hand, except that no cards are revealed until all players have chosen what to discard, at which point those cards are all discarded simultaneously. Lastly, the process is repeated for creatures, and players will again know earlier choices made when deciding what to sacrifice. All of the unchosen creatures are then sacrificed simultaneously."}, {"date": "2016-06-08", "text": "Balance doesn’t have targets, so permanents that can’t be targeted, such as a creature with shroud or protection from white, are valid choices to be sacrificed."}, {"date": "2016-06-08", "text": "Each type of object is counted during the corresponding part of the process. Cards in hand are counted after lands have been sacrificed, and creatures on the battlefield are counted after cards have been discarded. Thus, a land creature sacrificed to the first part of the spell would not be counted when determining how many creatures are on the battlefield for the last part."}], "securityStamp": "oval", "setCode": "VMA", "subtypes": [], "supertypes": [], "text": "Each player chooses a number of lands they control equal to the number of lands controlled by the player who controls the fewest, then sacrifices the rest. Players discard cards and sacrifice creatures the same way.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "adcafcbb-03b0-59a4-8446-de0373f972f8"}