{"artist": "Paolo Parente", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 15468, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 127231, "name": "Balduvianischer Kriegsfürst", "text": "{T}: Entferne eine blockende Kreatur deiner Wahl aus dem Kampf. Kreaturen, die von ihr und keiner anderen Kreatur sonst geblockt wurden, gelten jetzt nicht mehr als geblockt. Dann blockt sie eine angreifende Kreatur, die du bestimmst. Spiele diese Fähigkeit nur während des Blocker-deklarieren-Segments.", "type": "Kreatur — Mensch, Barbar"}, {"language": "Spanish", "multiverseId": 128006, "name": "Señor de la guerra balduviano", "text": "{T}: Remueve del combate la criatura bloqueadora objetivo. Las criaturas a las que bloqueaba que ninguna otra criatura bloqueó este combate se convierten en no bloqueadas, luego bloquea a una criatura atacante de tu elección. Juega esta habilidad sólo durante el paso de declarar bloqueadores.", "type": "Criatura — Bárbaro humano"}, {"language": "French", "multiverseId": 127076, "name": "Seigneur de guerre balduvian", "text": "{T} : Retirez la créature bloqueuse ciblée du combat. Les créatures qu'elle bloquait et qu'aucune autre créature ne bloquait pendant ce combat deviennent non-bloquées. Cette créature bloque ensuite une créature attaquante de votre choix. Ne jouez cette capacité que pendant l'étape de déclaration des bloqueurs.", "type": "Créature : humain et barbare"}, {"language": "Italian", "multiverseId": 127386, "name": "Signore della Guerra di Balduvia", "text": "{T}: Rimuovi dal combattimento una creatura bloccante bersaglio. Le creature che ha bloccato e che non sono state bloccate da altre creature in questo combattimento diventano non bloccate, poi essa blocca una creatura attaccante a tua scelta. Gioca questa abilità solo durante la dichiarazione delle creature bloccanti.", "type": "Creatura — Barbaro Umano"}, {"language": "Japanese", "multiverseId": 127541, "name": "バルデュヴィアの大将軍", "text": "{T}：ブロックしているクリーチャー１体を対象とし、それを戦闘から取り除く。 それがブロックしていたクリーチャーのうち、この戦闘で他のクリーチャーがブロックしていないものは、ブロックされていない状態になる。その後、それはあなたが選んだいずれかの攻撃クリーチャーをブロックする。 この能力は、ブロック・クリーチャー指定ステップにのみプレイできる。", "type": "クリーチャー — 人間・バーバリアン"}, {"language": "Portuguese (Brazil)", "multiverseId": 127696, "name": "Comandante Balduviano", "text": "{T}: Remova de combate a criatura alvo bloqueadora. As criaturas por ela bloqueadas que não foram bloqueadas por nenhuma outra criatura neste combate se tornam desbloqueadas e, em seguida, ela bloqueia uma criatura atacante de sua escolha. Use esta habilidade somente durante a etapa de declaração de bloqueadores.", "type": "Criatura — Bárbaro Humano"}, {"language": "Chinese Simplified", "multiverseId": 126921, "name": "博都维军阀", "text": "{T}：将目标进行阻挡的生物移出战斗。 在本次战斗中被它阻挡、且未受其它生物阻挡的生物成为未受阻挡状态，然后你选择它应阻挡哪一个进行攻击的生物。 只能于宣告阻挡者步骤中使用此异能。", "type": "生物～人类／野蛮人"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "120876", "cardKingdomId": "120721", "cardsphereId": "8542", "mcmId": "13612", "mcmMetaId": "8165", "mtgjsonV4Id": "5250c9d5-10d8-53e9-bfc4-b94887ec9951", "mtgoFoilId": "24790", "mtgoId": "24789", "multiverseId": "122056", "scryfallId": "a3286dbd-c8b8-45cb-98e4-d572289f2c14", "scryfallIllustrationId": "aaa201ad-06fe-4506-b08f-dcadb221c477", "scryfallOracleId": "f73d1525-ab0b-4772-9dfa-66e1c84c3ea4", "tcgplayerProductId": "14005"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "vintage": "Legal"}, "manaCost": "{3}{R}", "manaValue": 4.0, "name": "Balduvian Warlord", "number": "77", "originalText": "{T}: Remove target blocking creature from combat. Creatures it blocked that no other creature blocked this combat become unblocked, then it blocks an attacking creature of your choice. Play this ability only during the declare blockers step.", "originalType": "Creature - Human Barbarian", "power": "3", "printings": ["CSP"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/a0f7795d26ecbc94", "cardKingdomFoil": "https://mtgjson.com/links/dbbae139f2397c9a", "cardmarket": "https://mtgjson.com/links/d5e3ec3942eb5a79", "tcgplayer": "https://mtgjson.com/links/e7d2e550ebd47636"}, "rarity": "uncommon", "rulings": [{"date": "2006-07-15", "text": "Balduvian Warlord’s ability may be activated during any player’s turn."}, {"date": "2006-07-15", "text": "The targeted creature that’s removed from combat may then block the attacking creature that it was originally blocking. If so, that creature will no longer be unblocked."}, {"date": "2006-07-15", "text": "If an attacking creature becomes unblocked this way and remains unblocked, it will deal its combat damage to the defending player. Abilities that say “When this creature attacks and isn’t blocked” won’t trigger."}, {"date": "2006-07-15", "text": "If the targeted creature has a “When this creature blocks” ability, it will trigger when Balduvian Warlord’s ability resolves and the creature blocks again."}, {"date": "2006-07-15", "text": "If an attacking creature has an ability that triggers “When this creature becomes blocked,” it triggers when a creature blocks it due to the Warlord’s ability only if it was unblocked at that point."}, {"date": "2006-07-15", "text": "If an attacking creature has a “When this creature becomes blocked by [a creature]” ability, it triggers when a creature blocks it due to the Warlord’s ability."}, {"date": "2006-07-15", "text": "The attacking creature will become unblocked only if the targeted creature was the only one that blocked it this combat, even if all the other creatures that were blocking it are no longer on the battlefield or are no longer blocking it (even those removed with other Balduvian Warlords’ abilities)."}], "setCode": "CSP", "subtypes": ["Human", "Barbarian"], "supertypes": [], "text": "{T}: Remove target blocking creature from combat. Creatures it was blocking that hadn't become blocked by another creature this combat become unblocked, then it blocks an attacking creature of your choice. Activate only during the declare blockers step.", "toughness": "2", "type": "Creature — Human Barbarian", "types": ["Creature"], "uuid": "92d7336b-490b-515f-a206-7d5fff2fb27c"}