{"artist": "Michael Komarck", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210252", "mcmId": "294410", "mtgjsonV4Id": "d17a46f0-363d-5501-accd-c5b648bbba12", "multiverseId": "423596", "scryfallId": "434a2d09-5776-4168-b863-f3b0a736d19b", "scryfallIllustrationId": "37d62f5a-f174-48ca-9678-9e1ec7002686", "scryfallOracleId": "82e67c57-6d7a-44cc-ba63-77ce887ab075", "tcgplayerProductId": "125575"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Bant", "number": "15", "originalText": "All creatures have exalted. (Whenever a creature attacks alone, it gets +1/+1 until end of turn for each instance of exalted among permanents its controller controls.)\nWhenever you roll {Chaos}, put a divinity counter on target green, white, or blue creature. That creature has indestructible for as long as it has a divinity counter on it.", "originalType": "Plane — Alara", "printings": ["OHOP", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/415c7ea369f6289b", "tcgplayer": "https://mtgjson.com/links/601c8559ef5cb002"}, "rarity": "common", "rulings": [{"date": "2009-10-01", "text": "The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."}, {"date": "2009-10-01", "text": "If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}, {"date": "2009-10-01", "text": "If you declare exactly one creature as an attacker, each exalted ability on each permanent you control (including, perhaps, the attacking creature itself) will trigger. Note that if a creature has multiple instances of exalted, each one triggers separately. The bonuses are given to the attacking creature, not to the permanent with exalted. Ultimately, the attacking creature will wind up with +1/+1 for each of your exalted abilities."}, {"date": "2009-10-01", "text": "If you attack with multiple creatures, but then all but one are removed from combat, your exalted abilities won’t trigger."}, {"date": "2009-10-01", "text": "A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"}, {"date": "2009-10-01", "text": "Some effects put creatures onto the battlefield attacking. Since those creatures were never declared as attackers, they’re ignored by exalted abilities. They won’t cause exalted abilities to trigger. If any exalted abilities have already triggered (because exactly one creature was declared as an attacker), those abilities will resolve as normal even though there may now be multiple attackers."}, {"date": "2009-10-01", "text": "Exalted bonuses last until the turn ends. If an effect creates an additional combat phase during your turn, a creature that attacked alone during the first combat phase will still have its exalted bonuses in that new phase. If a creature attacks alone during the second combat phase, all your exalted abilities will trigger again."}, {"date": "2009-10-01", "text": "In a Two-Headed Giant game, a creature “attacks alone” if it’s the only creature declared as an attacker by your entire team. If you control that attacking creature, your exalted abilities will trigger but your teammate’s exalted abilities won’t."}, {"date": "2009-10-01", "text": "Exalted abilities will resolve before blockers are declared."}, {"date": "2009-10-01", "text": "A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."}, {"date": "2013-07-01", "text": "A creature with a divinity counter put on it due to the chaos ability retains indestructible even after Bant stops being the face-up plane card."}, {"date": "2013-07-01", "text": "If all divinity counters on a creature are moved to a different creature, the indestructible ability doesn’t move along with them. The first creature no longer has indestructible because it no longer has a divinity counter on it. The second creature doesn’t have indestructible because the chaos ability didn’t target it."}], "setCode": "OPCA", "subtypes": ["Alara"], "supertypes": [], "text": "All creatures have exalted. (Whenever a creature attacks alone, it gets +1/+1 until end of turn for each instance of exalted among permanents its controller controls.)\nWhenever you roll {CHAOS}, put a divinity counter on target green, white, or blue creature. That creature has indestructible for as long as it has a divinity counter on it.", "type": "Plane — Alara", "types": ["Plane"], "uuid": "8d2b7ddb-cca1-5ee3-9800-5ee6ee1fb5a8"}