{"artist": "Karl Kopinski", "availability": ["arena"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 7.0, "edhrecRank": 14911, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"mtgArenaId": "75799", "mtgjsonV4Id": "d335dc8b-c9a3-5961-a597-4caa8b04811f", "scryfallId": "0cd9e984-9719-4918-be8f-4ffab8f2ba20", "scryfallIllustrationId": "fad5bfe3-3549-4888-be5c-7b275a9eff9e", "scryfallOracleId": "93491d5c-8579-42ed-a700-e5c6f4238dea"}, "isOnlineOnly": true, "isReprint": true, "keywords": ["Improvise"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{7}", "manaValue": 7.0, "name": "Barricade Breaker", "number": "222", "power": "7", "printings": ["AER", "KLR"], "purchaseUrls": {}, "rarity": "uncommon", "rulings": [{"date": "2017-02-09", "text": "If, during your declare attackers step, Barricade Breaker is tapped or is affected by a spell or ability that says it can’t attack, then it doesn’t attack. If there’s a cost associated with having it attack, you aren’t forced to pay that cost, so it doesn’t have to attack in that case either."}, {"date": "2017-02-09", "text": "Improvise doesn’t change a spell’s mana cost or mana value."}, {"date": "2017-02-09", "text": "When calculating a spell’s total cost, include any alternative costs, additional costs, or anything else that increases or reduces the cost to cast the spell. Improvise applies after the total cost is calculated."}, {"date": "2017-02-09", "text": "Because improvise isn’t an alternative cost, it can be used in conjunction with alternative costs."}, {"date": "2017-02-09", "text": "Improvise can’t pay for {W}, {U}, {B}, {R}, {G}, or {C} mana symbols in a spell’s total cost."}, {"date": "2017-02-09", "text": "Improvise can’t be used to pay for anything other than the cost of casting the spell. For example, it can’t be used during the resolution of an ability that says “Counter target spell unless its controller pays {3}.”"}, {"date": "2017-02-09", "text": "If an artifact you control has a mana ability with {T} in the cost, activating that ability while casting a spell with improvise will result in the artifact being tapped when you pay the spell’s costs. You won’t be able to tap it again for improvise. Similarly, if you sacrifice an artifact to activate a mana ability while casting a spell with improvise, that artifact won’t be on the battlefield when you pay the spell’s costs, so you won’t be able to tap it for improvise."}, {"date": "2017-02-09", "text": "Tapping an artifact won’t cause its abilities to stop applying unless those abilities say so."}, {"date": "2017-02-09", "text": "Equipment attached to a creature doesn’t become tapped when that creature becomes tapped, and tapping that Equipment doesn’t cause the creature to become tapped."}], "setCode": "KLR", "subtypes": ["Juggernaut"], "supertypes": [], "text": "Improvise (Your artifacts can help cast this spell. Each artifact you tap after you're done activating mana abilities pays for {1}.)\nBarricade Breaker attacks each combat if able.", "toughness": "5", "type": "Artifact Creature — Juggernaut", "types": ["Artifact", "Creature"], "uuid": "4e496ab8-eea2-507d-88d0-ed4629c64fa9"}