{"artist": "Igor Kieryluk", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["G", "W"], "colors": ["G", "W"], "convertedManaCost": 3.0, "edhrecRank": 5178, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "241529", "cardsphereId": "74284", "mcmId": "535817", "mtgjsonV4Id": "19503e3c-2c02-564b-b6a9-ff08405e7733", "scryfallId": "624b66e3-8bc2-4e3f-88a6-f634853f2820", "scryfallIllustrationId": "a747c1b3-5f2c-4d65-86a2-acd3ca26ae29", "scryfallOracleId": "8294539d-7982-4ec9-8392-99eed78542f5", "tcgplayerProductId": "231607"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "saga", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}{W}", "manaValue": 3.0, "name": "Battle for Bretagard", "number": "203s", "printings": ["KHM", "PKHM"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/363165d8c17e69f8", "tcgplayer": "https://mtgjson.com/links/ed5df443020a0964"}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "The chapter III ability doesn’t target any of the tokens. You choose which ones you’re copying as the ability resolves."}, {"date": "2021-02-05", "text": "Unless the effect that creates a token specifies a different name, the name of a token is the same as its creature types. In particular, a Human Warrior creature token has a different name than an Elf Warrior creature token, and you may create a copy of each using the chapter III ability."}, {"date": "2021-02-05", "text": "Each token you create copies the original characteristics of the token it’s copying as stated by the effect that created that token. The newly created token doesn’t copy whether the original token is tapped or untapped, whether it has any counters on it, whether it has any Auras and/or Equipment attached to it, or any non-copy effects that changed its power, toughness, types, color, and so on."}, {"date": "2021-02-05", "text": "If the original token is copying something else, the token you create will use the copiable values of the original token. In most cases, it will be a copy of whatever the original token is copying. If it’s copying a permanent or card with {X} in its mana cost, X is 0."}, {"date": "2021-02-05", "text": "Any enters-the-battlefield abilities of tokens you create will trigger when they enter the battlefield. Any “As [this permanent] enters the battlefield” or “[This permanent] enters the battlefield with” abilities of the tokens will also work."}, {"date": "2021-02-05", "text": "As a Saga enters the battlefield, its controller puts a lore counter on it. As your precombat main phase begins (immediately after your draw step), you put another lore counter on each Saga you control. Putting a lore counter on a Saga in either of these ways doesn’t use the stack."}, {"date": "2021-02-05", "text": "Each symbol on the left of a Saga’s text box represents a chapter ability. A chapter ability is a triggered ability that triggers when a lore counter that is put on the Saga causes the number of lore counters on the Saga to become equal to or greater than the ability’s chapter number. Chapter abilities are put onto the stack and may be responded to."}, {"date": "2021-02-05", "text": "A chapter ability doesn’t trigger if a lore counter is put on a Saga that already had a number of lore counters greater than or equal to that chapter’s number. For example, the third lore counter put on a Saga causes the chapter III ability to trigger, but chapters I and II won’t trigger again."}, {"date": "2021-02-05", "text": "Once a chapter ability has triggered, the ability on the stack won’t be affected if the Saga gains or loses counters, or if it leaves the battlefield."}, {"date": "2021-02-05", "text": "If multiple chapter abilities trigger at the same time, their controller puts them on the stack in any order. If any of them require targets, those targets are chosen as you put the abilities on the stack, before any of those abilities resolve."}, {"date": "2021-02-05", "text": "Removing lore counters won’t cause a previous chapter ability to trigger. If lore counters are removed from a Saga, the appropriate chapter abilities will trigger again when the Saga receives more lore counters."}, {"date": "2021-02-05", "text": "Once the number of lore counters on a Saga is greater than or equal to the greatest number among its chapter abilities, the Saga’s controller sacrifices it as soon as its chapter ability has left the stack, most likely by resolving or being countered. This state-based action doesn’t use the stack."}], "securityStamp": "oval", "setCode": "PKHM", "subtypes": ["Saga"], "supertypes": [], "text": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI — Create a 1/1 white Human Warrior creature token.\nII — Create a 1/1 green Elf Warrior creature token.\nIII — Choose any number of artifact tokens and/or creature tokens you control with different names. For each of them, create a token that's a copy of it.", "type": "Enchantment — Saga", "types": ["Enchantment"], "uuid": "659372d5-c9da-5e00-a132-9665599f3ffb", "variations": ["a2202763-e818-5e2f-9769-5ab48f408f0b"]}