{"artist": "Chris Rallis", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 1.0, "edhrecRank": 9111, "finishes": ["foil"], "flavorText": "\"This is bigger than you. All of you.\"\n—Tezzeret", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "210923", "cardsphereId": "48216", "mcmId": "295034", "mtgjsonV4Id": "8e28fc68-522a-57e1-bab0-3b6354cf2d71", "scryfallId": "aef6009c-8d93-4b33-b468-dc021290164b", "scryfallIllustrationId": "030a6a55-ad6b-41d4-9f5b-05ccd98c91da", "scryfallOracleId": "3d63ad3a-4e9f-4968-a576-4be063f4ecbf", "tcgplayerProductId": "126826"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Improvise"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{X}{B}", "manaValue": 1.0, "name": "Battle at the Bridge", "number": "53s", "printings": ["AER", "PAER"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/fced072a87b64fdb", "tcgplayer": "https://mtgjson.com/links/0b0452506da83350"}, "rarity": "rare", "rulings": [{"date": "2017-02-09", "text": "Improvise doesn’t change a spell’s mana cost or mana value."}, {"date": "2017-02-09", "text": "When calculating a spell’s total cost, include any alternative costs, additional costs, or anything else that increases or reduces the cost to cast the spell. Improvise applies after the total cost is calculated."}, {"date": "2017-02-09", "text": "Because improvise isn’t an alternative cost, it can be used in conjunction with alternative costs."}, {"date": "2017-02-09", "text": "Improvise can’t pay for {W}, {U}, {B}, {R}, {G}, or {C} mana symbols in a spell’s total cost."}, {"date": "2017-02-09", "text": "If the target creature becomes an illegal target, Battle at the Bridge doesn’t resolve and none of its effects happen. You won’t gain life."}, {"date": "2017-02-09", "text": "If an artifact you control has a mana ability with {T} in the cost, activating that ability while casting a spell with improvise will result in the artifact being tapped when you pay the spell’s costs. You won’t be able to tap it again for improvise. Similarly, if you sacrifice an artifact to activate a mana ability while casting a spell with improvise, that artifact won’t be on the battlefield when you pay the spell’s costs, so you won’t be able to tap it for improvise."}, {"date": "2017-02-09", "text": "Tapping an artifact won’t cause its abilities to stop applying unless those abilities say so."}, {"date": "2017-02-09", "text": "Equipment attached to a creature doesn’t become tapped when that creature becomes tapped, and tapping that Equipment doesn’t cause the creature to become tapped."}, {"date": "2017-02-09", "text": "When using improvise to cast a spell with {X} in its mana cost, first choose the value for X. That choice, plus any cost increases or decreases, will determine the spell’s total cost. Then you can tap artifacts you control to help pay that cost. For example, if you cast Whir of Invention (a spell with improvise and mana cost {X}{U}{U}{U}) and choose X to be 3, the total cost is {3}{U}{U}{U}. If you tap two artifacts, you’ll have to pay {1}{U}{U}{U}."}, {"date": "2017-02-09", "text": "Improvise can’t be used to pay for anything other than the cost of casting the spell. For example, it can’t be used during the resolution of an ability that says “Counter target spell unless its controller pays {3}.”"}, {"date": "2018-01-19", "text": "There are many important moments in the story, but the most crucial—called “story spotlights”—are shown on cards. These cards have the Planeswalker symbol in their text box; this symbol has no effect on gameplay. You can read more about these events in the official Magic fiction at http://www.mtgstory.com."}], "securityStamp": "oval", "setCode": "PAER", "subtypes": [], "supertypes": [], "text": "Improvise (Your artifacts can help cast this spell. Each artifact you tap after you're done activating mana abilities pays for {1}.)\nTarget creature gets -X/-X until end of turn. You gain X life.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "440758e9-4509-5f4e-812a-0257c3040afe", "watermark": "planeswalker"}