{"artist": "Titus Lunter", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R", "U"], "colors": ["R", "U"], "convertedManaCost": 3.0, "edhrecRank": 7397, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 453163, "name": "Signalturm-Blitz", "text": "Der Signalturm-Blitz fügt einer Kreatur deiner Wahl Schaden in Höhe der Gesamtanzahl an Spontanzauber- und Hexerei-Karten zu, die du besitzt und die sich im Exil oder in deinem Friedhof befinden.\nKatalyse (Du kannst diese Karte aus deinem Friedhof wirken, indem du zusätzlich zu ihren anderen Kosten eine Karte abwirfst. Schicke sie danach ins Exil.)", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 453422, "name": "Rayo de la atalaya", "text": "El Rayo de la atalaya hace una cantidad de daño a la criatura objetivo igual a la cantidad total de cartas de instantáneo y de conjuro en tu cementerio y en el exilio de las cuales eres propietario.\nRecargar. (Puedes lanzar esta carta desde tu cementerio descartando una carta además de pagar sus otros costes. Luego, exilia esta carta.)", "type": "Conjuro"}, {"language": "French", "multiverseId": 453681, "name": "Éclair du flambeau", "text": "L'Éclair du flambeau inflige à une créature ciblée un nombre de blessures égal au nombre total de cartes d'éphémère et de rituel que vous possédez en exil et dans votre cimetière.\nRelancez (Vous pouvez lancer cette carte depuis votre cimetière en vous défaussant d'une carte en plus de payer ses autres coûts. Puis exilez cette carte.)", "type": "Rituel"}, {"language": "Italian", "multiverseId": 453940, "name": "Saetta del Faro", "text": "La Saetta del Faro infligge a una creatura bersaglio danno pari al numero totale di carte istantaneo e stregoneria che possiedi in esilio e nel tuo cimitero.\nCarica d'avvio (Puoi lanciare questa carta dal tuo cimitero scartando una carta oltre a pagare i suoi altri costi. Poi esilia questa carta.)", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 454199, "name": "標の稲妻", "text": "クリーチャー１体を対象とする。標の稲妻はそれに、追放領域かあなたの墓地にあり、あなたがオーナーであり、インスタントかソーサリーであるカードの枚数に等しい点数のダメージを与える。\n再活（あなたはあなたの墓地から、このカードを、これの他のコストの支払いに加えてカード１枚を捨てることで唱えてもよい。その後、このカードを追放する。）", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 454458, "name": "봉화의 번개", "text": "생물을 목표로 정한다. 봉화의 번개는 그 생물에게 추방 영역과 당신의 무덤에 있는 당신이 소유한 순간마법과 집중마법 카드 수의 합만큼 피해를 입힌다.\n강제 시동 (당신은 이 카드의 다른 비용들을 지불하는 것에 추가로 카드를 한 장 버리는 것으로 이 카드를 당신의 무덤에서 발동할 수 있다. 그 후 이 카드를 추방한다.)", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 454717, "name": "Raio do Farol", "text": "Raio do Farol causa à criatura alvo dano igual ao número total de cards de mágica instantânea ou feitiço que você possui no exílio e em seu cemitério.\nRecarregar (Você pode conjurar este card de seu cemitério descartando um card além de pagar seus outros custos. Depois, exile este card.)", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 454976, "name": "Сигнальный Разряд", "text": "Сигнальный Разряд наносит целевому существу повреждения, равные суммарному количеству принадлежащих вам карт мгновенных заклинаний и волшебства в изгнании и на вашем кладбище.\nИмпульс (Вы можете разыграть эту карту из вашего кладбища, сбросив карту в дополнение к оплате других ее стоимостей. Затем изгоните эту карту.)", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 455235, "name": "信标电击", "text": "信标电击对目标生物造成伤害，其数量等同于放逐区中由你拥有之瞬间与法术牌数量和你坟墓场中这两类牌数量的加总。\n再起（你可以从你的坟墓场施放此牌，但必须支付其所需费用并额外弃一张牌。然后放逐此牌。）", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 455494, "name": "信標電擊", "text": "信標電擊對目標生物造成傷害，其數量等同於放逐區中由你擁有之瞬間與巫術牌數量和你墳墓場中這兩類牌數量的加總。\n再起（你可以從你的墳墓場施放此牌，但必須支付其所需費用並額外棄一張牌。然後放逐此牌。）", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "221862", "cardKingdomId": "221589", "cardsphereId": "56859", "mcmId": "364198", "mcmMetaId": "265406", "mtgArenaId": "68615", "mtgjsonV4Id": "34b50961-dd25-54b3-b0e2-1c8071189342", "mtgoId": "69681", "multiverseId": "452904", "scryfallId": "39c9e4b5-364b-4c0b-bb47-266563a6abf2", "scryfallIllustrationId": "c2ce83a1-ddba-429c-9f7b-7e02585ea99d", "scryfallOracleId": "884686dd-515c-4484-a324-e7d126903a42", "tcgplayerProductId": "176857"}, "keywords": ["Jump-start"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}{R}", "manaValue": 3.0, "name": "Beacon Bolt", "number": "154", "originalText": "Beacon Bolt deals damage to target creature equal to the total number of instant and sorcery cards you own in exile and in your graveyard.\nJump-start (You may cast this card from your graveyard by discarding a card in addition to paying its other costs. Then exile this card.)", "originalType": "Sorcery", "printings": ["GRN"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/30488d7f95d54346", "cardKingdomFoil": "https://mtgjson.com/links/e0fde43746cc1b21", "cardmarket": "https://mtgjson.com/links/7017b3dc4746a10a", "tcgplayer": "https://mtgjson.com/links/21dfc75e775dde47"}, "rarity": "uncommon", "rulings": [{"date": "2018-10-05", "text": "Beacon Bolt is still on the stack while you count your instant and sorcery cards in your graveyard and in exile. It doesn’t count itself."}, {"date": "2018-10-05", "text": "If any exiled cards you own are face down, they have no characteristics. If they’re normally instants or sorceries, they won’t be counted."}, {"date": "2018-10-05", "text": "You must still follow any timing restrictions and permissions, including those based on the card’s type. For instance, you can cast a sorcery using jump-start only when you could normally cast a sorcery."}, {"date": "2018-10-05", "text": "A spell cast using jump-start will always be exiled afterward, whether it resolves, it’s countered, or it leaves the stack in some other way."}, {"date": "2018-10-05", "text": "If an effect allows you to pay an alternative cost rather than a spell’s mana cost, you may pay that alternative cost when you jump-start a spell. You’ll still discard a card as an additional cost to cast it."}, {"date": "2018-10-05", "text": "If a card with jump-start is put into your graveyard during your turn, you’ll be able to cast it right away if it’s legal to do so, before an opponent can take any actions."}], "setCode": "GRN", "subtypes": [], "supertypes": [], "text": "Beacon Bolt deals damage to target creature equal to the total number of instant and sorcery cards you own in exile and in your graveyard.\nJump-start (You may cast this card from your graveyard by discarding a card in addition to paying its other costs. Then exile this card.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "83db81aa-2e76-5609-bad2-a0adf5427274", "watermark": "izzet"}