{"artist": "Jason A. Engle", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 7.0, "edhrecRank": 24183, "faceConvertedManaCost": 3.0, "faceManaValue": 3.0, "faceName": "Fertile Footsteps", "finishes": ["nonfoil"], "foreignData": [{"faceName": "Blühender Schritt", "language": "German", "multiverseId": 496133, "name": "Bohnenranken-Riese // Blühender Schritt", "text": "Durchsuche deine Bibliothek nach einer Standardland-Karte, bringe sie ins Spiel und mische dann deine Bibliothek. (Schicke diese Karte dann ins Exil. Du kannst sie später als Kreatur aus dem Exil wirken.)", "type": "Hexerei — Abenteuer"}, {"faceName": "Pasos fértiles", "language": "Spanish", "multiverseId": 496267, "name": "Gigante tallo de habichuelas // Pasos fértiles", "text": "Busca en tu biblioteca una carta de tierra básica, ponla en el campo de batalla y luego baraja tu biblioteca. (Luego, exilia esta carta. Puedes lanzar la criatura más adelante desde el exilio.)", "type": "Conjuro — Aventura"}, {"faceName": "Pas fertiles", "language": "French", "multiverseId": 496401, "name": "Géant de tige de haricot // Pas fertiles", "text": "Cherchez dans votre bibliothèque une carte de terrain de base, mettez-la sur le champ de bataille et mélangez ensuite votre bibliothèque. (Puis exilez cette carte. Vous pouvez lancer la créature plus tard depuis l'exil.)", "type": "Rituel : aventure"}, {"faceName": "Passi Fertili", "language": "Italian", "multiverseId": 496535, "name": "Gigante dei Fagioli // Passi Fertili", "text": "Passa in rassegna il tuo grimorio per una carta terra base, mettila sul campo di battaglia, poi rimescola il tuo grimorio. (Poi esilia questa carta. Puoi lanciare la creatura in seguito dall'esilio.)", "type": "Stregoneria — Avventura"}, {"faceName": "肥（ひ）沃（よく）な足（あし）跡（あと）", "language": "Japanese", "multiverseId": 496669, "name": "豆の木の巨人 // 肥（ひ）沃（よく）な足（あし）跡（あと）", "text": "あなたのライブラリーから基本土地・カード１枚を探し、戦場に出す。その後、あなたのライブラリーを切り直す。（その後、このカードを追放する。あなたは後で追放領域からこのクリーチャーを唱えてもよい。）", "type": "ソーサリー ― 出来事"}, {"faceName": "Pegadas Férteis", "language": "Portuguese (Brazil)", "multiverseId": 496803, "name": "Gigante do Pé de Feijão // Pegadas Férteis", "text": "Procure em seu grimório um card de terreno básico, coloque-o no campo de batalha e depois embaralhe seu grimório. (Depois, exile este card. Você pode conjurar a criatura posteriormente do exílio.)", "type": "Feitiço — Aventura"}, {"faceName": "Шаги Плодородия", "language": "Russian", "multiverseId": 496937, "name": "Великан Бобового Ростка // Шаги Плодородия", "text": "Найдите в вашей библиотеке карту базовой земли, положите ее на поле битвы, затем перетасуйте вашу библиотеку. (Затем изгоните эту карту. Позже вы можете разыграть эту карту как существо из изгнания.)", "type": "Волшебство — Приключение"}, {"faceName": "丰沃脚步", "language": "Chinese Simplified", "multiverseId": 497071, "name": "豆茎巨人 // 丰沃脚步", "text": "从你的牌库中搜寻一张基本地牌，将之放进战场，然后将你的牌库洗牌。（然后放逐此牌。之后你还可以从放逐区中施放该生物。）", "type": "法术～历险"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardsphereId": "71080", "mcmId": "504280", "mtgjsonV4Id": "f9c7b0ce-0b85-548c-8000-70df0a626791", "multiverseId": "495999", "scryfallId": "1f4495c3-46be-4b9c-bedf-7998e313662b", "scryfallIllustrationId": "45c422bc-0d57-4909-b5f1-8d2873b5861a", "scryfallOracleId": "22c75ad5-237c-4dbd-bbc4-3058a3db408f", "tcgplayerProductId": "222668"}, "isReprint": true, "isStarter": true, "language": "English", "layout": "adventure", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}", "manaValue": 7.0, "name": "Beanstalk Giant // Fertile Footsteps", "number": "61", "originalText": "Search your library for a basic land card, put it onto the battlefield, then shuffle your library. (Then exile this card. You may cast the creature later from exile.)", "originalType": "Sorcery — Adventure", "otherFaceIds": ["a8af2f7e-3b17-56fe-8bbb-e11e47e6c147"], "printings": ["CLB", "ELD", "PLIST", "PRM", "ZNC"], "purchaseUrls": {"tcgplayer": "https://mtgjson.com/links/ae2f7e3f2f62bcb9"}, "rarity": "uncommon", "rulings": [{"date": "2019-10-04", "text": "The ability that defines Beanstalk Giant's power and toughness works in all zones, not just the battlefield."}, {"date": "2019-10-04", "text": "An adventurer card is a creature card in every zone except the stack, as well as while on the stack if not cast as an Adventure. Ignore its alternative characteristics in those cases. For example, while it's in your graveyard, Giant Killer is a white creature card whose mana value is 1. It can't be the target of the triggered ability of Mystic Sanctuary."}, {"date": "2019-10-04", "text": "When casting a spell as an Adventure, use the alternative characteristics and ignore all of the card's normal characteristics. The spell's color, mana cost, mana value, and so on are determined by only those alternative characteristics. If the spell leaves the stack, it immediately resumes using its normal characteristics."}, {"date": "2019-10-04", "text": "If you cast an adventurer card as an Adventure, use only its alternative characteristics to determine whether it's legal to cast that spell. For example, if Giant Killer is exiled with the last ability of Vivien, Champion of the Wilds, you can't cast it as Chop Down."}, {"date": "2019-10-04", "text": "If a spell is cast as an Adventure, its controller exiles it instead of putting it into its owner's graveyard as it resolves. For as long as it remains exiled, that player may cast it as a creature spell. If an Adventure spell leaves the stack in any way other than resolving (most likely by being countered or by failing to resolve because its targets have all become illegal), that card won't be exiled and the spell's controller won't be able to cast it as a creature later."}, {"date": "2019-10-04", "text": "If an adventurer card ends up in exile for any other reason than by exiling itself while resolving, it won't give you permission to cast it as a creature spell."}, {"date": "2019-10-04", "text": "You must still follow any timing restrictions and permissions for the creature spell you cast from exile. Normally, you'll be able to cast it only during your main phase while the stack is empty."}, {"date": "2019-10-04", "text": "If an effect copies an Adventure spell, that copy is exiled as it resolves. It ceases to exist as a state-based action; it's not possible to cast the copy as a creature."}, {"date": "2019-10-04", "text": "If an object becomes a copy of an object that has an Adventure, the copy also has an Adventure. If it changes zones, it will either cease to exist (if it's a token) or cease to be a copy (if it's a nontoken permanent), and so you won't be able to cast it as an Adventure."}, {"date": "2019-10-04", "text": "If an effect instructs you to choose a card name, you may choose the alternative Adventure name. Consider only the alternative characteristics to determine whether that is an appropriate name to choose."}, {"date": "2019-10-04", "text": "Casting a card as an Adventure isn't casting it for an alternative cost. Effects that allow you to cast a spell for an alternative cost or without paying its mana cost may allow you to apply those to the Adventure."}], "setCode": "ZNC", "side": "b", "subtypes": ["Adventure"], "supertypes": [], "text": "Search your library for a basic land card, put it onto the battlefield, then shuffle. (Then exile this card. You may cast the creature later from exile.)", "type": "Sorcery — Adventure", "types": ["Sorcery"], "uuid": "18a68f9e-d386-5ed8-ae04-00fb2ddcf89f"}