{"artist": "Richard Luong", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 5.0, "edhrecRank": 374, "faceName": "Harnfel, Horn of Bounty", "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "b083d0c8-0e62-5614-b714-f9a6b9b8a0a9", "mtgoId": "88320", "scryfallId": "8d10fc47-9551-4643-bb3c-d35b858a6844", "scryfallIllustrationId": "36f36166-7851-451e-b6fa-4adfc8be43f6", "scryfallOracleId": "fb81e4d3-1d8c-4779-be62-87cf49277e51"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "modal_dfc", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{R}", "manaValue": 5.0, "name": "Birgi, God of Storytelling // Harnfel, Horn of Bounty", "number": "88320", "originalReleaseDate": "2021-02-28", "otherFaceIds": ["568db571-1196-528d-b967-38ca13527979"], "printings": ["KHM", "PKHM", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "Birgi’s first ability uses the stack and can be responded to. It isn’t a mana ability."}, {"date": "2021-02-05", "text": "You must still attack with a creature you control to activate its boast ability."}, {"date": "2021-02-05", "text": "The cards exiled by Harnfel’s activated ability are exiled face up."}, {"date": "2021-02-05", "text": "You may play those cards that turn even if Harnfel leaves the battlefield or another player gains control of it."}, {"date": "2021-02-05", "text": "There is a single triangle icon in the top left corner of the front face. There is a double triangle icon in the top left corner of the back face."}, {"date": "2021-02-05", "text": "To determine whether it is legal to play a modal double-faced card, consider only the characteristics of the face you’re playing and ignore the other face’s characteristics."}, {"date": "2021-02-05", "text": "If an effect allows you to play a specific modal double-faced card, you may cast it as a spell or play it as a land, as determined by which face you choose to play. If an effect allows you to cast (rather than “play”) a specific modal double-faced card, you can’t play it as a land."}, {"date": "2021-02-05", "text": "If an effect allows you to play a land or cast a spell from among a group of cards, you may play or cast a modal double-faced card with any face that fits the criteria of that effect."}, {"date": "2021-02-05", "text": "The mana value of a modal double-faced card is based on the characteristics of the face that’s being considered. On the stack and battlefield, consider whichever face is up. In all other zones, consider only the front face. This is different than how the mana value of a transforming double-faced card is determined."}, {"date": "2021-02-05", "text": "A modal double-faced card can’t be transformed or be put onto the battlefield transformed. Ignore any instruction to transform a modal double-faced card or to put one onto the battlefield transformed."}, {"date": "2021-02-05", "text": "If an effect puts a double-faced card onto the battlefield, it enters with its front face up. If that front face can’t be put onto the battlefield, it doesn’t enter the battlefield."}, {"date": "2021-02-05", "text": "If an effect instructs a player to choose a card name, the name of either face may be chosen. If that effect or a linked ability refers to a spell with the chosen name being cast and/or a land with the chosen name being played, it considers only the chosen name, not the other face’s name."}, {"date": "2021-02-05", "text": "In the Commander variant, a double-faced card’s color identity is determined by the mana costs and mana symbols in the rules text of both faces combined. If either face has a color indicator or basic land type, those are also considered."}, {"date": "2021-02-05", "text": "Playing the cards exiled with Harnfel follows the normal rules for playing those cards. You must pay their costs, if any, and you must follow all applicable timing rules. For example, if one of the cards is a creature card, you can cast that card by paying its mana cost only during your main phase while the stack is empty."}, {"date": "2021-02-05", "text": "Unless an effect allows you to play additional lands that turn, you can play land cards exiled with Harnfel only if you haven’t played a land yet that turn. In most cases, if you exile two land cards with Harnfel, you won’t be able to play both."}, {"date": "2021-02-05", "text": "Any cards exiled with Harnfel that you don’t play remain exiled."}, {"date": "2021-02-05", "text": "The card you discard to activate the ability isn’t part of “those cards” and can’t be played, even if it somehow ends up in exile."}], "securityStamp": "oval", "setCode": "PRM", "side": "b", "subtypes": [], "supertypes": ["Legendary"], "text": "Discard a card: Exile the top two cards of your library. You may play those cards this turn.", "type": "Legendary Artifact", "types": ["Artifact"], "uuid": "b527e209-d388-51c0-9500-82eec62d24ab"}