{"artist": "Andreas Zafiratos", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 3.0, "edhrecRank": 6755, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "90383970-e6fb-5c15-8634-9c3c198e3df9", "mtgoId": "97961", "scryfallId": "d293c64b-5498-4d1c-9ba8-8250f5fa02a3", "scryfallIllustrationId": "a3ea4a72-af69-4a6a-a551-f5280a6949c0", "scryfallOracleId": "5c22447b-7a7f-4a27-8d3b-1bb664ea94c3"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Ninjutsu"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}", "manaValue": 3.0, "name": "Biting-Palm Ninja", "number": "97961", "originalReleaseDate": "2022-02-19", "power": "3", "printings": ["NEO", "PNEO", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2022-02-18", "text": "If you choose to remove a menace counter from Biting-Palm Ninja as its triggered ability resolves, a second triggered ability will go on the stack, and players may respond to it with spells and abilities. When that second ability resolves, the player will reveal their hand."}, {"date": "2022-02-18", "text": "The ninjutsu ability can be activated only after blockers have been declared. Before then, attacking creatures are neither blocked nor unblocked."}, {"date": "2022-02-18", "text": "As you activate a ninjutsu ability, you reveal the Ninja card in your hand and return the attacking creature. The Ninja card stays revealed and isn't put onto the battlefield until the ability resolves. If it leaves your hand before then, it won't enter the battlefield at all."}, {"date": "2022-02-18", "text": "The creature with ninjutsu enters the battlefield attacking the same player or planeswalker that the returned creature was attacking. This is a rule specific to ninjutsu; in other cases, when a creature is put onto the battlefield attacking, that creature's controller chooses which player or planeswalker it's attacking."}, {"date": "2022-02-18", "text": "Although the Ninja is attacking, it was never declared as an attacking creature (for purposes of abilities that trigger whenever a creature attacks, for example)."}, {"date": "2022-02-18", "text": "The ninjutsu ability can be activated during the declare blockers step, combat damage step, or end of combat step. In most cases (see below), if you wait until the combatdamage step or end of combat step, it will be after combat damage has been dealt, so the Ninja won't deal combat damage."}, {"date": "2022-02-18", "text": "If a creature in combat has first strike or double strike, you can activate the ninjutsu ability during the first-strike combat damage step. The Ninja will deal combat damage during the regular combat damage step, even if it has first strike."}, {"date": "2022-02-18", "text": "Puff of smoke not included."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Human", "Ninja"], "supertypes": [], "text": "Ninjutsu {2}{B}\nBiting-Palm Ninja enters the battlefield with a menace counter on it.\nWhenever Biting-Palm Ninja deals combat damage to a player, you may remove a menace counter from it. When you do, that player reveals their hand and you choose a nonland card from it. Exile that card.", "toughness": "3", "type": "Creature — Human Ninja", "types": ["Creature"], "uuid": "86e662c3-76a9-58ab-91fe-9965e225c4b3"}