{"artist": "Aaron Miller", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 5.0, "edhrecRank": 8192, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "218735", "cardsphereId": "55415", "mcmId": "358737", "mtgjsonV4Id": "8c1b272b-1dcc-58ca-83d5-7698eb6ffaeb", "multiverseId": "446820", "scryfallId": "26387ab4-74da-49d7-965e-352da48d6a90", "scryfallIllustrationId": "8283187f-2cb9-462d-9908-de37c7edc7fe", "scryfallOracleId": "e4add901-3f2b-4f92-bb26-7f599e288802", "tcgplayerProductId": "166735"}, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{R}", "manaValue": 5.0, "name": "Bitter Feud", "number": "84", "originalText": "As Bitter Feud enters the battlefield, choose two players.\nIf a source controlled by one of the chosen players would deal damage to the other chosen player or a permanent that player controls, that source deals double that damage to that player or permanent instead.", "originalType": "Enchantment", "printings": ["C14", "CM2"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2a496f090e938003", "tcgplayer": "https://mtgjson.com/links/675f7e31c7852899"}, "rarity": "rare", "rulings": [{"date": "2014-11-07", "text": "Bitter Feud applies to damage dealt by any source controlled by one of the chosen players, not just combat damage."}, {"date": "2014-11-07", "text": "The source of the damage doesn’t change. A spell that deals damage will specify the source of the damage. This is usually the spell itself. An ability that deals damage will specify the source of the damage, although it will never be the ability itself. Usually the source of the ability is also the source of the damage."}, {"date": "2014-11-07", "text": "If there are two Bitter Feuds on the battlefield, and the same two players were chosen for each, damage dealt will be doubled for each. So, two Bitter Feuds will end up multiplying the damage by four, three will multiply the damage by eight, and four by sixteen."}, {"date": "2014-11-07", "text": "If multiple effects modify how damage is dealt, the player being dealt damage, or the controller of the permanent being dealt damage, chooses the order in which to apply the effects. For example, the ability of Decorated Griffin says “{1}{W}: Prevent the next 1 combat damage that would be dealt to you this turn.” Suppose you control a Decorated Griffin, and you and an opponent are the chosen players for a Bitter Feud. If a creature that player controls would deal 3 combat damage to you, and Decorated Griffin’s ability has resolved once, you can choose to either (a) apply the effect from Decorated Griffin first and prevent 1 damage, and then let Bitter Feud’s effect double the remaining 2 damage, for a result 4 damage being dealt to you, or (b) let Bitter Feud’s effect apply first and double the damage to 6, and then apply the effect from Decorated Griffin to prevent 1 damage, for a result of 5 damage being dealt to you."}], "securityStamp": "oval", "setCode": "CM2", "subtypes": [], "supertypes": [], "text": "As Bitter Feud enters the battlefield, choose two players.\nIf a source controlled by one of the chosen players would deal damage to the other chosen player or a permanent that player controls, that source deals double that damage to that player or permanent instead.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "937848e5-daf6-52f7-880c-8daed0421582"}