{"artist": "Alan Pollack", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 2.0, "edhrecRank": 1487, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "dd3f32b7-b864-5660-b1df-27b51065fbfd", "mtgoId": "59065", "scryfallId": "c7ebc33b-c1e7-4a21-887d-fca2b7600fed", "scryfallIllustrationId": "b5bcf0e7-a7fe-4c04-b3ec-17d189df0dbc", "scryfallOracleId": "9c329f3d-4d0a-4012-8aa6-92afdd120a52"}, "isOnlineOnly": true, "isReprint": true, "isStarter": true, "keywords": ["Equip"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}", "manaValue": 2.0, "name": "Blade of Selves", "number": "121", "printings": ["C15", "CLB", "CM2", "PCLB", "PZ1"], "purchaseUrls": {}, "rarity": "uncommon", "rulings": [{"date": "2015-11-04", "text": "If a creature has multiple instances of myriad, each triggers separately. You'll get two tokens per opponent other than the defending player."}, {"date": "2015-11-04", "text": "If the tokens aren't creatures (perhaps because the equipped creature was an animated land), they'll enter the battlefield but they won't be attacking. You'll still exile those tokens at end of combat."}, {"date": "2015-11-04", "text": "If the equipped creature is legendary, the tokens will all enter the battlefield. Then you'll choose one of them to remain on the battlefield. The others will be put into your graveyard. Any enters-the-battlefield or dies triggers of the tokens will work."}, {"date": "2015-11-04", "text": "The term “defending player” in the myriad rules (or any other ability of an attacking creature) refers to the player the creature with myriad was attacking at the time it became an attacking creature this combat, or the controller of the planeswalker the creature was attacking at the time it became an attacking creature this combat."}, {"date": "2015-11-04", "text": "If the defending player is your only opponent, no tokens are put onto the battlefield."}, {"date": "2015-11-04", "text": "You choose whether each token is attacking the player or a planeswalker they control as the token is created."}, {"date": "2015-11-04", "text": "Although the tokens enter the battlefield attacking, they were never declared as attackers. Abilities that trigger whenever a creature attacks won't trigger, including the myriad ability of the tokens. If there any costs to have a creature attack, those costs won't apply to the tokens."}, {"date": "2015-11-04", "text": "The token creatures all enter the battlefield at the same time."}, {"date": "2015-11-04", "text": "Each token copies exactly what was printed on the original creature and nothing else. It doesn't copy whether that creature is tapped or untapped, whether it has any counters on it or Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, and so on."}, {"date": "2015-11-04", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when the token enters the battlefield. Any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities of the copied creature will also work."}, {"date": "2015-11-04", "text": "If myriad creates more than one token for any given player (due to an effect such as the one Doubling Season creates), you may choose separately for each token whether it's attacking the player or a planeswalker they control."}], "setCode": "PZ1", "subtypes": ["Equipment"], "supertypes": [], "text": "Equipped creature has myriad. (Whenever it attacks, for each opponent other than defending player, you may create a token that's a copy of that creature that's tapped and attacking that player or a planeswalker they control. Exile the tokens at end of combat.)\nEquip {4}", "type": "Artifact — Equipment", "types": ["Artifact"], "uuid": "6ff83081-0a6e-5f25-8d76-f2783552f956"}