{"artist": "Jason A. Engle", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 2.0, "edhrecRank": 6104, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "65233d44-d947-5d23-8952-c02a6468168e", "mtgoId": "97979", "scryfallId": "c4ac2118-9a11-43a3-b736-71c809003950", "scryfallIllustrationId": "89ebac1f-4950-49ee-8937-a10760c3c29a", "scryfallOracleId": "6d9ac636-3c6c-40ca-90f3-1a3387836bb4"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Menace", "Reconfigure"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{1}{B}", "manaValue": 2.0, "name": "Blade of the Oni", "number": "97979", "originalReleaseDate": "2022-02-19", "power": "3", "printings": ["NEO", "PNEO", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2022-02-18", "text": "Blade of the Oni will overwrite any previous effects that set the equipped creature's power and toughness to specific numbers. Effects that otherwise modify the equipped creature's power and toughness will still apply no matter when they took effect. The same is true for +1/+1 counters."}, {"date": "2022-02-18", "text": "Reconfigure represents two activated abilities. Reconfigure [cost] means “[Cost]: Attach this permanent to another target creature you control. Activate only as a sorcery,” and “[Cost]: Unattach this permanent. Activate only if this permanent is attached to a creature and only as a sorcery.”"}, {"date": "2022-02-18", "text": "Attaching an Equipment with reconfigure to a creature causes that Equipment to stop being a creature until it becomes unattached. It also loses any creature subtypes it had."}, {"date": "2022-02-18", "text": "An Equipment doesn't become tapped when the permanent it's attached to becomes tapped. For example, if you attack with a creature that is equipped with Acquisition Octopus, then use reconfigure to unattach Acquisition Octopus after combat, the Octopus will be untapped and could be used to block during your opponent's turn."}, {"date": "2022-02-18", "text": "Similarly, if an Equipment is tapped, its reconfigure abilities may still be activated and it may still become attached to creatures. Becoming attached doesn't untap it. In most cases, an attached Equipment being tapped won't affect gameplay, but it will be relevant if it becomes unattached again before it untaps."}, {"date": "2022-02-18", "text": "If an Equipment with reconfigure somehow loses its abilities while it is attached, the effect causing it to not be a creature continues to apply until it becomes unattached."}, {"date": "2022-02-18", "text": "As soon as an Equipment creature with reconfigure stops being a creature, any Equipment and Auras with enchant creature abilities become unattached. Auras that can enchant an Equipment that isn't a creature remain attached to it."}, {"date": "2022-02-18", "text": "An Equipment creature with reconfigure can be attached to creatures by effects other than its reconfigure ability, such as the activated ability of Brass Squire."}, {"date": "2022-02-18", "text": "Although it causes an Equipment to become attached to a creature, reconfigure is not an “equip ability” for the purpose of cards like Fighter Class and Leonin Shikari."}, {"date": "2022-02-18", "text": "An Equipment creature can never become attached to itself. If an effect tries to do this, nothing happens."}, {"date": "2022-02-18", "text": "If a permanent with reconfigure is somehow still a creature after it becomes attached (perhaps due to an effect like that of March of the Machines), it immediately becomes unattached from the equipped creature."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Equipment", "Demon"], "supertypes": [], "text": "Menace\nEquipped creature has base power and toughness 5/5, has menace, and is a black Demon in addition to its other colors and types.\nReconfigure {2}{B}{B} ({2}{B}{B}: Attach to target creature you control; or unattach from a creature. Reconfigure only as a sorcery. While attached, this isn't a creature.)", "toughness": "1", "type": "Artifact Creature — Equipment Demon", "types": ["Artifact", "Creature"], "uuid": "f163831f-77ce-502b-b4ce-4d27ca16aa93"}