{"artist": "Kev Walker", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 14304, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "200963", "cardsphereId": "37055", "mcmId": "282059", "mtgjsonV4Id": "77094eff-1398-511c-8d06-9e59f133bc16", "scryfallId": "6f17070a-9102-4bfd-86d1-78dff65f6ba2", "scryfallIllustrationId": "ee7492aa-1ca7-4c7a-80be-0df330138de9", "scryfallOracleId": "ca29588c-f117-418e-be9e-fa2ee89862ca", "tcgplayerProductId": "97045"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Rebound"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Blessed Reincarnation", "number": "47s", "printings": ["DTK", "PDTK"], "promoTypes": ["setpromo", "datestamped", "prerelease"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/62615a0cecf6dd40", "tcgplayer": "https://mtgjson.com/links/780ef908b4828757"}, "rarity": "rare", "rulings": [{"date": "2015-02-25", "text": "If there are no creature cards in the library, it will be revealed and shuffled. The target creature will remain exiled."}, {"date": "2015-02-25", "text": "Casting the card again due to the delayed triggered ability is optional. If you choose not to cast the card, or if you can’t (perhaps because there are no legal targets available), the card will stay exiled. You won’t get another chance to cast it on a future turn."}, {"date": "2015-02-25", "text": "If a spell with rebound that you cast from your hand doesn’t resolve for any reason (either because another spell or ability counters it or because all its targets are illegal as it tries to resolve), none of its effects will happen, including rebound. The spell will be put into its owner’s graveyard and you won’t get to cast it again on your next turn."}, {"date": "2015-02-25", "text": "At the beginning of your upkeep, all delayed triggered abilities created by rebound effects trigger. You may handle them in any order. If you want to cast a card this way, you do so as part of the resolution of its delayed triggered ability. Timing restrictions based on the card’s type (if it’s a sorcery) are ignored. Other restrictions, such as “Cast [this spell] only during combat,” must be followed."}, {"date": "2015-02-25", "text": "As long as you cast a spell with rebound from your hand, rebound will work regardless of whether you paid its mana cost or an alternative cost you were permitted to pay."}, {"date": "2015-02-25", "text": "If you cast a spell with rebound from any zone other than your hand (including your opponent’s hand), rebound will have no effect."}, {"date": "2015-02-25", "text": "If a replacement effect (such as the one created by Rest in Peace) would cause a spell with rebound that you cast from your hand to be put somewhere other than into your graveyard as it resolves, you can choose whether to apply the rebound effect or the other effect as the spell resolves."}, {"date": "2015-02-25", "text": "Rebound will have no effect on copies of spells because you don’t cast them from your hand."}, {"date": "2015-02-25", "text": "If you cast a card from exile this way, it will go to its owner’s graveyard when it resolves, fails to resolve, or is countered. It won’t go back to exile."}], "securityStamp": "oval", "setCode": "PDTK", "subtypes": [], "supertypes": [], "text": "Exile target creature an opponent controls. That player reveals cards from the top of their library until a creature card is revealed. The player puts that card onto the battlefield, then shuffles the rest into their library.\nRebound (If you cast this spell from your hand, exile it as it resolves. At the beginning of your next upkeep, you may cast this card from exile without paying its mana cost.)", "type": "Instant", "types": ["Instant"], "uuid": "9ced7019-eab6-57c9-a687-4732709298dd", "watermark": "ojutai"}