{"artist": "Jaime Jones", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 5.0, "edhrecRank": 8076, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"mtgjsonV4Id": "c0a9c3a2-6f55-5a5e-b366-2378ba104205", "mtgoId": "58265", "scryfallId": "2da4a670-4544-425b-ac37-c851f8840267", "scryfallIllustrationId": "9e90e1b5-60fe-492f-9d8b-86753b37d011", "scryfallOracleId": "3159d289-b822-4657-919a-d712623e622e"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{5}", "manaValue": 5.0, "name": "Blight Herder", "number": "58265", "originalReleaseDate": "2017-05-31", "power": "4", "printings": ["BFZ", "PBFZ", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2015-08-25", "text": "If a spell or ability requires that you put more than one exiled card into the graveyard, you may choose cards owned by different opponents. Each card chosen will be put into its owner’s graveyard."}, {"date": "2015-08-25", "text": "If a replacement effect will cause cards that would be put into a graveyard from anywhere to be exiled instead (such as the one created by Anafenza, the Foremost), you can still put an exiled card into its opponent’s graveyard. The card becomes a new object and remains in exile. In this situation, you can’t use a single exiled card if required to put more than one exiled card into the graveyard. Conversely, you could use the same card in this situation if two separate spells or abilities each required you to put a single exiled card into its owner’s graveyard."}, {"date": "2015-08-25", "text": "You can’t look at face-down cards in exile unless an effect allows you to."}, {"date": "2015-08-25", "text": "Face-down cards in exile are grouped using two criteria: what caused them to be exiled face down and when they were exiled face down. If you want to put a face-down card in exile into its owner’s graveyard, you must first choose one of these groups and then choose a card from within that group at random. For example, say an artifact causes your opponent to exile their hand of three cards face down. Then on a later turn, that artifact causes your opponent to exile another two cards face down. If you use Wasteland Strangler to put one of those cards into their graveyard, you would pick the first or second pile and put a card chosen at random from that pile into the graveyard."}, {"date": "2015-08-25", "text": "Eldrazi Scions are similar to Eldrazi Spawn, seen in the Zendikar block. Note that Eldrazi Scions are 1/1, not 0/1."}, {"date": "2015-08-25", "text": "Eldrazi and Scion are each separate creature types. Anything that affects Eldrazi will affect these tokens, for example."}, {"date": "2015-08-25", "text": "Sacrificing an Eldrazi Scion creature token to add {C} to your mana pool is a mana ability. It doesn’t use the stack and can’t be responded to."}, {"date": "2015-08-25", "text": "Some instants and sorceries that create Eldrazi Scions require targets. If all targets for such a spell have become illegal by the time that spell tries to resolve, the spell won’t resolve and none of its effects will happen. You won’t get any Eldrazi Scions."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Eldrazi", "Processor"], "supertypes": [], "text": "When you cast this spell, you may put two cards your opponents own from exile into their owners' graveyards. If you do, create three 1/1 colorless Eldrazi Scion creature tokens. They have \"Sacrifice this creature: Add {C}.\"", "toughness": "5", "type": "Creature — Eldrazi Processor", "types": ["Creature"], "uuid": "d45d5019-f15f-59e4-afd6-3fe0b17ed592"}