{"artist": "Zack Stella", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 11515, "finishes": ["nonfoil", "foil"], "flavorText": "The sound of Vadrok's gigantic wings is ominous. But the true terror is when they fall silent.", "foreignData": [{"flavorText": "Der Klang von Vadroks gigantischen Flügeln ist bedrohlich. Aber der wahre Schrecken beginnt, wenn sie verstummen.", "language": "German", "multiverseId": 479888, "name": "Blitz des Donnerraptors", "text": "Der Blitz des Donnerraptors fügt einer Kreatur oder einem Planeswalker deiner Wahl so viele Schadenspunkte zu, wie Spontanzauber- und Hexereikarten in deinem Friedhof sind. Falls die Kreatur bzw. der Planeswalker in diesem Zug sterben würde, schicke sie bzw. ihn stattdessen ins Exil.", "type": "Spontanzauber"}, {"flavorText": "El sonido de las gigantescas alas de Vadrok es un mal augurio. Pero el auténtico terror llega cuando se hace el silencio.", "language": "Spanish", "multiverseId": 480147, "name": "Picado de la Rapaz del Trueno", "text": "El Picado de la Rapaz del Trueno hace una cantidad de daño a la criatura o planeswalker objetivo igual a la cantidad de cartas de instantáneo y de conjuro en tu cementerio. Si esa criatura o planeswalker fuera a morir este turno, en vez de eso, exílialo.", "type": "Instantáneo"}, {"flavorText": "Le bruit des immenses ailes de Vadrok est particulièrement menaçant. Mais le plus terrifiant, c'est quand on ne l'entend plus.", "language": "French", "multiverseId": 480406, "name": "Attaque éclair du Raptor de tonnerre", "text": "L'Attaque éclair du Raptor de tonnerre inflige à la cible, créature ou au planeswalker, un nombre de blessures égal au nombre de cartes d'éphémère et de rituel dans votre cimetière. Si cette créature ou ce planeswalker devait mourir ce tour-ci, exilez-le à la place.", "type": "Éphémère"}, {"flavorText": "Il rumore delle gigantesche ali di Vadrok è inquietante, ma il vero terrore inizia quando cessa ogni suono.", "language": "Italian", "multiverseId": 480665, "name": "Incursione del Tuonoraptor", "text": "L'Incursione del Tuonoraptor infligge a una creatura o a un planeswalker bersaglio danno pari al numero di carte istantaneo e stregoneria nel tuo cimitero. Se quella creatura o quel planeswalker stanno per morire in questo turno, invece esiliali.", "type": "Istantaneo"}, {"flavorText": "ヴァドロックの巨大な翼の音は気味が悪い。しかし本当に恐ろしいのは、それが静まったときだ。", "language": "Japanese", "multiverseId": 480924, "name": "雷猛竜の襲撃", "text": "クリーチャー１体かプレインズウォーカー１体を対象とする。雷猛竜の襲撃はそれに、あなたの墓地にありインスタントやソーサリーであるカードの枚数に等しい点数のダメージを与える。このターン、そのクリーチャーやプレインズウォーカーが死亡するなら、代わりにそれを追放する。", "type": "インスタント"}, {"flavorText": "바드로크의 거대한 날개 소리는 불길하다. 하지만 진정한 공포는 그 소리가 없어졌을 때이다.", "language": "Korean", "multiverseId": 481183, "name": "천둥 랩터의 습격", "text": "생물 또는 플레인즈워커를 목표로 정한다. 천둥 랩터의 습격은 그 목표에게 당신의 무덤에 있는 순간마법 및 집중마법 카드의 수만큼 피해를 입힌다. 그 생물 또는 플레인즈워커가 이 턴에 죽는다면, 대신 추방한다.", "type": "순간마법"}, {"flavorText": "O som das gigantescas asas de Vadrok é assustador. Mas o verdadeiro terror vem com o silêncio.", "language": "Portuguese (Brazil)", "multiverseId": 481442, "name": "Blitz do Raptor Tonante", "text": "Blitz do Raptor Tonante causa à criatura ou ao planeswalker alvo uma quantidade de dano igual ao número de cards de mágica instantânea e feitiço no seu cemitério. Se aquela criatura ou aquele planeswalker morreria neste turno, em vez disso, exile-o.", "type": "Mágica Instantânea"}, {"flavorText": "Звук исполинских крыльев Вадрока пугает. Но настоящий ужас начинается, когда они смолкают.", "language": "Russian", "multiverseId": 481701, "name": "Рывок Громового Хищника", "text": "Рывок Громового Хищника наносит целевому существу или planeswalker'у повреждения, равные количеству карт мгновенных заклинаний и волшебства на вашем кладбище. Если то существо или planeswalker должно умереть в этом ходу, изгоните его вместо этого.", "type": "Мгновенное заклинание"}, {"flavorText": "瓦卓克扇动巨翼的声音固然是不详预兆，但翼声沉寂之后，恐怖时刻才真正来临。", "language": "Chinese Simplified", "multiverseId": 481960, "name": "雷鸣龙闪击", "text": "雷鸣龙闪击对目标生物或鹏洛客造成伤害，其数量等同于你坟墓场中瞬间和法术牌的数量加总。如果本回合中该生物或鹏洛客将死去，则改为将它放逐。", "type": "瞬间"}, {"flavorText": "瓦卓克扇動巨翼的聲音固然是不祥預兆，但翼聲沉寂之後，恐怖時刻才真正來臨。", "language": "Chinese Traditional", "multiverseId": 482219, "name": "雷鳴龍閃擊", "text": "雷鳴龍閃擊對目標生物或鵬洛客造成傷害，其數量等同於你墳墓場中瞬間和巫術牌的數量加總。如果本回合中該生物或鵬洛客將死去，則改為將它放逐。", "type": "瞬間"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "232978", "cardKingdomId": "232587", "cardsphereId": "66750", "mcmId": "453193", "mcmMetaId": "301298", "mtgArenaId": "71176", "mtgjsonV4Id": "8b6e8d64-71fe-5519-bfc5-6f007b6a78cc", "mtgoId": "80227", "multiverseId": "479629", "scryfallId": "a0174556-9f9b-4756-84ca-d14a5a60720c", "scryfallIllustrationId": "95d36f60-bf95-4fb3-9f1d-88337f868b2e", "scryfallOracleId": "d2db3f9c-26fe-487b-bbb7-8bc6f33456f1", "tcgplayerProductId": "212286"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}", "manaValue": 2.0, "name": "Blitz of the Thunder-Raptor", "number": "109", "originalText": "Blitz of the Thunder-Raptor deals damage to target creature or planeswalker equal to the number of instant and sorcery cards in your graveyard. If that creature or planeswalker would die this turn, exile it instead.", "originalType": "Instant", "printings": ["IKO"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ad41afa774a010b6", "cardKingdomFoil": "https://mtgjson.com/links/55cf4abcf465c29a", "cardmarket": "https://mtgjson.com/links/3aa41706466962cb", "tcgplayer": "https://mtgjson.com/links/5e3e0e9088755452"}, "rarity": "uncommon", "rulings": [{"date": "2020-04-17", "text": "Blitz of the Thunder-Raptor is still on the stack while you determine how much damage is dealt. It isn’t in your graveyard to contribute to that amount of damage."}, {"date": "2020-04-17", "text": "Blitz of the Thunder-Raptor’s replacement effect will exile the target creature or planeswalker if it would die this turn for any reason, not just due to lethal damage. It applies to the target creature or planeswalker even if Blitz of the Thunder-Raptor deals no damage to it (most likely because you have no instant or sorcery cards in your graveyard)."}], "setCode": "IKO", "subtypes": [], "supertypes": [], "text": "Blitz of the Thunder-Raptor deals damage to target creature or planeswalker equal to the number of instant and sorcery cards in your graveyard. If that creature or planeswalker would die this turn, exile it instead.", "type": "Instant", "types": ["Instant"], "uuid": "3ac10a7d-419a-578e-a047-3c5fd983fac9"}