{"artist": "Simon Dominic", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": [], "convertedManaCost": 7.0, "edhrecRank": 17875, "finishes": ["nonfoil", "foil"], "flavorText": "While Urza's machines favored defense, Mishra built his to end the war quickly.", "foreignData": [{"flavorText": "Während Urzas Maschinen auf Verteidigung setzten, richtete Mishra seine darauf aus, den Krieg schnell zu beenden.", "language": "German", "multiverseId": 584004, "name": "Blitzroboter", "text": "Eile\n//PRT-Prototype_Mech//\n{2}{R}\nPrototyp (Du kannst diesen Zauberspruch mit anderen Manakosten, Farben und anderer Größe wirken. Er behält seine Fähigkeiten und Typen.)\n3/2", "type": "Artefaktkreatur — Konstrukt"}, {"flavorText": "Mientras que las máquinas de Urza se orientaban hacia la defensa, Mishra construía las suyas para poner fin a la guerra rápidamente.", "language": "Spanish", "multiverseId": 584265, "name": "Autómata relámpago", "text": "Prisa.\n//PRT-Prototype_Mech//\n{2}{R}\nPrototipo. (Puedes lanzar este hechizo con un coste de maná, color y tamaño distintos. Sus habilidades y tipos no cambian.)\n3/2", "type": "Criatura artefacto — Constructo"}, {"flavorText": "Alors que les machines d'Urza favorisaient la défense, Mishra construisait les siennes pour finir la guerre au plus vite.", "language": "French", "multiverseId": 584526, "name": "Automate à l'attaque-éclair", "text": "Célérité\n//PRT-Prototype_Mech//\n{2}{R}\nPrototype (Vous pouvez lancer ce sort avec un coût de mana, une couleur et une taille différents. Il garde ses capacités et ses types.)\n3/2", "type": "Créature-artefact : construction"}, {"flavorText": "Mentre le macchine di Urza prediligevano la difesa, Mishra costruì le sue con l'obiettivo di porre rapidamente fine alla guerra.", "language": "Italian", "multiverseId": 584787, "name": "Automa da Incursione", "text": "Rapidità\n//PRT-Prototype_Mech//\n{2}{R}\nPrototipo (Puoi lanciare questa magia con costo di mana, colore e dimensione diversi. Mantiene le sue abilità e i suoi tipi.)\n3/2", "type": "Creatura Artefatto — Costrutto"}, {"flavorText": "ウルザの機械が防御を重視したのに対し、ミシュラは速やかに戦争を終わらせる目的で機械を作った。", "language": "Japanese", "multiverseId": 585048, "name": "奇襲用自動機械", "text": "速攻\n//PRT-Prototype_Mech//\n{2}{R}\n試作（あなたはこの呪文を、異なるマナ・コスト、色、サイズで唱えてもよい。これは能力とタイプを保持する。）\n３/２", "type": "アーティファクト・クリーチャー — 構築物"}, {"flavorText": "Enquanto as máquinas de Urza favoreciam a defesa, Mishra construía as dele para acabar rápido com a guerra.", "language": "Portuguese (Brazil)", "multiverseId": 585309, "name": "Autômato da Blitz", "text": "Ímpeto\n//PRT-Prototype_Mech//\n{2}{R}\nProtótipo (Você pode conjurar esta mágica com custo de mana, cor e tamanho diferentes. Ela permanece com suas habilidades e tipos.)\n3/2", "type": "Criatura Artefato — Constructo"}, {"flavorText": "克撒建造机械时更注重其防御性能，而米斯拉打造的机械则胜于快速结束战斗。", "language": "Chinese Simplified", "multiverseId": 585570, "name": "闪击自动械", "text": "敏捷\n//PRT-Prototype_Mech//\n{2}{R}\n试作（你施放此咒语时可选不同法术力费用、颜色和攻防的版本，其异能与类别不变。）\n3/2", "type": "神器生物 ～组构体"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "269205", "cardKingdomId": "268911", "cardsphereId": "95423", "mcmId": "683420", "mcmMetaId": "414124", "mtgArenaId": "83691", "mtgjsonV4Id": "0858500f-a1f5-5094-a7be-7ab7f953adb4", "mtgoId": "104934", "multiverseId": "583743", "scryfallId": "e4e5529a-848b-486c-97fb-1def35df7837", "scryfallIllustrationId": "100e1bdb-37c5-49fc-bea7-17c005267da2", "scryfallOracleId": "19f344ee-031d-4346-9553-c5d32b02df43", "tcgplayerProductId": "453230"}, "keywords": ["Haste", "Prototype"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{7}", "manaValue": 7.0, "name": "Blitz Automaton", "number": "158", "originalText": "Haste\n//PRT-Prototype_\nMech//\n{2}{R}\nPrototype (You may cast this spell with different mana cost, color, and size. It keeps its abilities and types.)\n3/2", "originalType": "Artifact Creature — Construct", "power": "6", "printings": ["BRO"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/12631e642eead20d", "cardKingdomFoil": "https://mtgjson.com/links/7ef20b597d231d18", "cardmarket": "https://mtgjson.com/links/590a47c54a1b0782", "tcgplayer": "https://mtgjson.com/links/0f96b82e114faaa8"}, "rarity": "common", "rulings": [{"date": "2022-10-14", "text": "A prototype card is a colorless card in every zone except the stack or the battlefield, as well as while on the stack or the battlefield if not cast as a prototyped spell. Ignore its alternative characteristics in those cases. For example, while it’s in your graveyard, Blitz Automaton is a colorless creature card with mana value 7. It can’t be the target of Recommission, a spell that targets an artifact or creature card with mana value 3 or less in your graveyard."}, {"date": "2022-10-14", "text": "When cast as a prototyped spell, that spell has the mana cost, power, and toughness characteristics shown in its colored, secondary text box rather than the normal values of those characteristics. Its color and mana value are determined by that mana cost. The permanent that spell becomes as it resolves has the same characteristics. If the spell leaves the stack in any other way, or the permanent it becomes leaves the battlefield, it immediately resumes using its normal characteristics."}, {"date": "2022-10-14", "text": "Regardless of how it was cast, a prototype card always has the same name, abilities, types, and so on. Only the mana cost, mana value, color, power, and toughness change depending on whether the card was cast as a prototyped spell."}, {"date": "2022-10-14", "text": "The prototype ability functions in any zone that the spell could be cast from. For example, if an effect allows you to cast artifact spells from your graveyard, you could cast a prototyped Blitz Automaton from your graveyard."}, {"date": "2022-10-14", "text": "Casting a prototyped spell isn’t the same as casting it for an alternative cost, and an alternative cost may be applied to a spell cast this way. For example, if an effect allows you to cast an artifact card without paying its mana cost, you could either cast Blitz Automaton normally, or as a prototyped spell."}, {"date": "2022-10-14", "text": "When casting a prototyped spell, use only its prototype characteristics to determine whether it’s legal to cast it. For example, if Blitz Automaton is exiled with the last ability of Chandra, Dressed to Kill, you would be able to cast it for {2}{R} (because it’s a red spell), even though you wouldn’t be able to cast it as a colorless spell for its normal cost."}, {"date": "2022-10-14", "text": "If an effect copies a prototyped spell, that copy (as well as the token it becomes on the battlefield) will have the same characteristics as the prototyped spell. Similarly, if an effect creates a token that’s a copy of a prototyped permanent or causes another permanent to become a copy of it, the copy would have the same characteristics as the prototyped permanent."}], "setCode": "BRO", "subtypes": ["Construct"], "supertypes": [], "text": "Prototype {2}{R} - 3/2 (You may cast this spell with different mana cost, color, and size. It keeps its abilities and types.)\nHaste", "toughness": "4", "type": "Artifact Creature — Construct", "types": ["Artifact", "Creature"], "uuid": "b6c4533d-f98e-5288-b55d-1f214323c5d3"}