{"artist": "Alex Horley-Orlandelli", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 6.0, "edhrecRank": 3880, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 204161, "name": "Bluttribut", "text": "Bonus — Tappe einen ungetappten Vampir, den du kontrollierst. (Du kannst zusätzlich zu allen anderen Kosten einen Vampir tappen, den du kontrollierst, sowie du diesen Zauberspruch wirkst.)\nEin Gegner deiner Wahl verliert die Hälfte seiner Lebenspunkte, aufgerundet. Falls die Bonuskosten des Bluttributs bezahlt wurden, erhältst du so viele Lebenspunkte dazu, wie auf diese Weise Lebenspunkte verloren wurden.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 202816, "name": "Tributo de sangre", "text": "Estímulo—Girar un Vampiro enderezado que controles. (Puedes girar un Vampiro que controles adicionalmente a cualquier otro coste en cuanto lances este hechizo.)\nEl oponente objetivo pierde la mitad de sus vidas, redondeado hacia arriba. Si el Tributo de sangre fue estimulado, ganas vidas igual a la cantidad de vidas perdidas de esta manera.", "type": "Conjuro"}, {"language": "French", "multiverseId": 204430, "name": "Hommage de sang", "text": "Kick — Engagez un vampire dégagé que vous contrôlez. (Vous pouvez engager un vampire que vous contrôlez en supplément de tous autres coûts quand vous lancez ce sort.)\nL'adversaire ciblé perd la moitié de ses points de vie, arrondie à l'unité supérieure. Si l'Hommage de sang a été kické, vous gagnez autant de points de vie que ceux perdus de cette manière.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 203085, "name": "Tributo di Sangue", "text": "Potenziamento—TAPpa un Vampiro STAPpato che controlli. (Puoi TAPpare un Vampiro che controlli oltre a qualsiasi altro costo quando lanci questa magia.)\nUn avversario bersaglio perde metà dei suoi punti vita, arrotondati per eccesso. Se il Tributo di Sangue è stato potenziato, guadagni tanti punti vita quanti sono i punti vita persi in questo modo.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 203892, "name": "血の貢ぎ物", "text": "キッカー ― あなたがコントロールするアンタップ状態の吸血鬼を１体タップする。 （この呪文を唱えるに際し、あなたは他のコストに加えてあなたがコントロールする吸血鬼を１体タップしてもよい。）\n対戦相手１人を対象とする。そのプレイヤーはライフの半分を失う（端数切り上げ）。 血の貢ぎ物がキッカーされている場合、あなたはこれにより失われたライフに等しい点数のライフを得る。", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 203623, "name": "Tributo de Sangue", "text": "Reforçar — Vire um Vampiro desvirado que você controla. (Você pode virar um Vampiro que controla além de quaisquer outros custos ao conjurar esta mágica.)\nO oponente alvo perde metade de seus pontos de vida, arredondada para cima. Se Tributo de Sangue foi reforçado, você ganha uma quantidade de pontos de vida igual aos pontos de vida perdidos dessa maneira.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 203354, "name": "Кровавый Оброк", "text": "Усилитель — Поверните неповернутого Вампира под вашим контролем. (Вы можете повернуть Вампира под вашим контролем в дополнение к оплате любых других стоимостей при разыгрывании этого заклинания.)\nЦелевой оппонент теряет половину своих жизней с округлением в большую сторону. Если Кровавый Оброк получил Усилитель, вы получаете столько жизней, сколько их было потеряно таким образом.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 204699, "name": "鲜血献礼", "text": "增幅～横置一个由你操控且未横置的吸血鬼。 （你施放此咒语时可以额外横置一个由你操控的吸血鬼，并支付任何其他费用。）\n目标对手失去一半数量的生命，该数量小数点后进位。 如果鲜血献礼已增幅，则你获得若干生命，其数量等同于以此法失去的生命。", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "128084", "cardKingdomId": "127828", "cardsphereId": "47655", "mcmId": "21738", "mcmMetaId": "10735", "mtgjsonV4Id": "ba9982a4-9d19-5eb5-81b4-17ea0db58a54", "mtgoFoilId": "34379", "mtgoId": "34378", "multiverseId": "170995", "scryfallId": "c76487d3-1d52-4c31-917e-eb929907218d", "scryfallIllustrationId": "8170de69-c2f2-4162-ab5f-9be1a21f6789", "scryfallOracleId": "aa2da79c-b36c-4120-8d7d-f5571e87e45e", "tcgplayerProductId": "33264"}, "keywords": ["Kicker"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{B}{B}", "manaValue": 6.0, "name": "Blood Tribute", "number": "81", "originalText": "Kicker—\nTap an untapped Vampire you control. (You may tap a Vampire you control in addition to any other costs as you cast this spell.)\nTarget opponent loses half his or her life, rounded up. If Blood Tribute was kicked, you gain life equal to the life lost this way.", "originalType": "Sorcery", "printings": ["C17", "ZEN"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/c587195ec71b6b97", "cardKingdomFoil": "https://mtgjson.com/links/caf43f3a2bf736de", "cardmarket": "https://mtgjson.com/links/1d358f13fdbc8f95", "tcgplayer": "https://mtgjson.com/links/da36ba811964bb12"}, "rarity": "rare", "rulings": [{"date": "2009-10-01", "text": "You can tap a creature that hasn’t been under your control since your most recent turn began to pay the kicker cost."}], "setCode": "ZEN", "subtypes": [], "supertypes": [], "text": "Kicker—Tap an untapped Vampire you control. (You may tap a Vampire you control in addition to any other costs as you cast this spell.)\nTarget opponent loses half their life, rounded up. If this spell was kicked, you gain life equal to the life lost this way.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "1a5c7633-14e2-521f-8d6c-2cb7eccd4154"}