{"artist": "Dominick Domingo", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G", "R"], "colors": ["G", "R"], "convertedManaCost": 4.0, "edhrecRank": 3021, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 512459, "name": "Blutzopf-Elf", "text": "Eile\nKaskade (Wenn du diesen Zauberspruch wirkst, schicke so lange die oberste Karte deiner Bibliothek ins Exil, bis du eine Nichtland-Karte ins Exil schickst, die weniger kostet als dieser Zauberspruch. Du kannst sie wirken, ohne ihre Manakosten zu bezahlen. Lege die so ins Exil geschickten Karten in zufälliger Reihenfolge unter deine Bibliothek.)", "type": "Kreatur — Elf, Berserker"}, {"language": "Spanish", "multiverseId": 512580, "name": "Elfo trenzas sangrientas", "text": "Prisa.\nCascada. (Cuando lances este hechizo, exilia cartas de la parte superior de tu biblioteca hasta que exilies una carta que no sea tierra y que cueste menos. Puedes lanzarla sin pagar su coste de maná. Pon las cartas exiliadas en el fondo de tu biblioteca en un orden aleatorio.)", "type": "Criatura — Berserker elfo"}, {"language": "French", "multiverseId": 512701, "name": "Elfe aux Nattes sanguinolentes", "text": "Célérité\nCascade (Quand vous lancez ce sort, exilez les cartes du dessus de votre bibliothèque jusqu'à ce que vous exiliez une carte non-terrain d'un coût inférieur. Vous pouvez la lancer sans payer son coût de mana. Mettez les cartes exilées au-dessous de votre bibliothèque dans un ordre aléatoire.)", "type": "Créature : elfe et berserker"}, {"language": "Italian", "multiverseId": 512822, "name": "Elfa dalle Trecce Rosse", "text": "Rapidità\nCascata (Quando lanci questa magia, esilia carte dalla cima del tuo grimorio finché non esili una carta non terra che costa meno. Puoi lanciarla senza pagare il suo costo di mana. Metti le carte esiliate in fondo al tuo grimorio in ordine casuale.)", "type": "Creatura — Berserker Elfo"}, {"language": "Japanese", "multiverseId": 512943, "name": "血編み髪のエルフ", "text": "速攻\n続唱（あなたがこの呪文を唱えたとき、コストがこれより低く土地でないカードが追放されるまで、あなたのライブラリーの一番上からカードを追放する。あなたはそれをそのマナ・コストを支払うことなく唱えてもよい。追放したすべてのカードをあなたのライブラリーの一番下に無作為の順番で置く。）", "type": "クリーチャー — エルフ・狂戦士"}, {"language": "Portuguese (Brazil)", "multiverseId": 513064, "name": "Elfa Tranças-de-sangue", "text": "Ímpeto\nCascata (Quando conjurar esta mágica, exile os cards do topo do seu grimório até exilar um que não seja terreno e que tenha custo inferior. Você pode conjurá-lo sem pagar seu custo de mana. Coloque os cards exilados no fundo de seu grimório em ordem aleatória.)", "type": "Criatura — Elfo Amoque"}, {"language": "Russian", "multiverseId": 513185, "name": "Кровавокосый Эльф", "text": "Ускорение\nКаскад (Когда вы разыгрываете это заклинание, изгоняйте карты с верха вашей библиотеки до тех пор, пока не изгоните не являющуюся землей и стоящую меньше карту. Вы можете разыграть ее без уплаты ее мана-стоимости. Положите изгнанные карты в низ вашей библиотеки в случайном порядке.)", "type": "Существо — Эльф Берсерк"}, {"language": "Chinese Simplified", "multiverseId": 513306, "name": "血辫妖精", "text": "敏捷\n倾曳（当你施放此咒语时，从你的牌库顶开始放逐牌，直到放逐一张费用比此咒语低的非地牌为止。你可以施放该牌，且不需支付其法术力费用。将所放逐的牌以随机顺序置于你的牌库底。）", "type": "生物 ～妖精／狂战士"}, {"language": "Chinese Traditional", "multiverseId": 513427, "name": "血辮妖精", "text": "敏捷\n傾曳（當你施放此咒語時，從你的牌庫頂開始放逐牌，直到放逐一張費用比此咒語低的非地牌為止。你可以施放該牌，且不需支付其魔法力費用。將所放逐的牌以隨機順序置於你的牌庫底。）", "type": "生物 ～妖精／狂戰士"}], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "243227", "cardKingdomId": "242798", "cardsphereId": "75418", "mcmId": "547696", "mtgjsonV4Id": "f8778bc2-bdcf-5405-9d7d-56011e9a5b2a", "mtgoId": "87121", "multiverseId": "512338", "scryfallId": "9445d57a-da77-4456-9e69-c898c4d57853", "scryfallIllustrationId": "5493c08d-f6c9-4c20-9382-56edb4e34e8f", "scryfallOracleId": "3f0c9466-5ab9-4205-a84f-b4b27b5a678e", "tcgplayerProductId": "234092"}, "isReprint": true, "keywords": ["Cascade", "Haste"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}{G}", "manaValue": 4.0, "name": "Bloodbraid Elf", "number": "372", "originalText": "Haste\nCascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)", "originalType": "Creature — Elf Berserker", "power": "3", "printings": ["2X2", "ARB", "C16", "CLB", "EMA", "F10", "MB1", "PC2", "PCA", "PRM", "SLC", "TSR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/e2e9691fafe63252", "cardKingdomFoil": "https://mtgjson.com/links/7af3f3373fb3f589", "tcgplayer": "https://mtgjson.com/links/da5eeb02ec7f7852"}, "rarity": "special", "rulings": [{"date": "2021-06-18", "text": "A spell's mana value is determined only by its mana cost. Ignore any alternative costs, additional costs, cost increases, or cost reductions."}, {"date": "2021-06-18", "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."}, {"date": "2021-06-18", "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."}, {"date": "2021-06-18", "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."}, {"date": "2021-06-18", "text": "You exile the cards face up. All players will be able to see them."}, {"date": "2021-06-18", "text": "If you cast a card “without paying its mana cost,” you can't choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those to cast the card."}, {"date": "2021-06-18", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2021-06-18", "text": "Due to a recent rules change to cascade, not only do you stop exiling cards if you exile a nonland card with lesser mana value than the spell with cascade, but the resulting spell you cast must also have lesser mana value. Previously, in cases where a card's mana value differed from the resulting spell, such as with some modal double-faced cards or cards with an Adventure, you could cast a spell with a higher mana value than the exiled card."}, {"date": "2021-06-18", "text": "The mana value of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."}], "setCode": "TSR", "subtypes": ["Elf", "Berserker"], "supertypes": [], "text": "Haste\nCascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)", "toughness": "2", "type": "Creature — Elf Berserker", "types": ["Creature"], "uuid": "2d4acc41-7e5a-5426-8ea3-b7e9fdfbbf09"}