{"artist": "Martina Fackova", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 6.0, "edhrecRank": 2755, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "d6281abf-276b-5138-ab07-4bca8f2656d2", "mtgoId": "88284", "scryfallId": "8000e566-66dc-48b3-922b-4df620fd2964", "scryfallIllustrationId": "e18fdadd-085a-428b-b86c-0f3e7f54df20", "scryfallOracleId": "45f386ba-ad62-4c0e-b6ad-ae02ca8f2bec"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{B}{B}", "manaValue": 6.0, "name": "Blood on the Snow", "number": "88284", "originalReleaseDate": "2021-02-28", "printings": ["KHM", "PKHM", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "You choose a mode for Blood on the Snow as you cast it. The last part of the effect (returning a card to the battlefield) happens no matter which mode you choose."}, {"date": "2021-02-05", "text": "Blood on the Snow doesn’t target any creature or planeswalker card in your graveyard. You choose which one to return to the battlefield, if any, as Blood on the Snow resolves. Notably, you could return one of the creatures or planeswalkers that was just destroyed by Blood on the Snow."}, {"date": "2021-02-05", "text": "If a card in a graveyard has {X} in its mana cost, X is considered to be 0."}, {"date": "2021-02-05", "text": "If you cast Blood on the Snow without spending snow mana, you can return only a creature or planeswalker card with mana value 0. (Planeswalker cards with mana value 0 likely not coming soon.)"}, {"date": "2021-02-05", "text": "If Blood on the Snow is copied, no mana was spent to cast the copy, so you can return only a creature or planeswalker card with mana value 0."}, {"date": "2021-02-05", "text": "Snow is a supertype, not a card type. It has no rules meaning or function by itself, but spells and abilities may refer to it."}, {"date": "2021-02-05", "text": "The {S} symbol is a generic mana symbol. It represents a cost that can be paid by one mana that was produced by a snow source. That mana can be any color or colorless."}, {"date": "2021-02-05", "text": "Snow isn’t a type of mana. If an effect says you may spend mana as though it were any type, you can’t pay for {S} using mana that wasn’t produced by a snow source."}, {"date": "2021-02-05", "text": "Some cards have additional effects for each {S} spent to cast them. You can cast these spells even if you don’t spend any snow mana to cast them; their additional effects simply won’t do anything."}, {"date": "2021-02-05", "text": "The Kaldheim set doesn’t have any cards with mana costs that include {S}, but some previous sets do. If an effect says such a spell costs {1} less to cast, that reduction doesn’t apply to any {S} costs. This is also true for activated abilities that include {S} in their activation costs and effects that reduce those costs."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": ["Snow"], "text": "Choose one —\n• Destroy all creatures.\n• Destroy all planeswalkers.\nThen return a creature or planeswalker card with mana value X or less from your graveyard to the battlefield, where X is the amount of {S} spent to cast this spell. ({S} is mana from a snow source.)", "type": "Snow Sorcery", "types": ["Sorcery"], "uuid": "e35c7b4f-38ee-52e8-b9a5-f861f648b05b"}