{"artist": "Adam Rex", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 7017, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 85806, "name": "Blutsprecher", "text": "Zu Beginn deines Versorgungssegments kannst du den Blutsprecher opfern. Falls du dies tust, durchsuche deine Bibliothek nach einer Dämonenkarte, zeige die Karte offen vor und nimm sie auf deine Hand. Mische danach deine Bibliothek.\nImmer wenn ein Dämon unter deiner Kontrolle ins Spiel kommt, kannst du den Blutsprecher aus deinem Friedhof auf deine Hand zurücknehmen.", "type": "Kreatur - Oger, Schamane"}, {"language": "Spanish", "multiverseId": 87034, "name": "Portavoz de la sangre", "text": "Al comienzo de tu mantenimiento, puedes sacrificar el Portavoz de la sangre. Si lo haces, busca en tu biblioteca una carta de Demonio, muéstrala y ponla en tu mano. Luego baraja tu biblioteca.\nSiempre que un Demonio entre en juego bajo tu control, regresa el Portavoz de la sangre de tu cementerio a tu mano.", "type": "Criatura - Chamán ogro"}, {"language": "French", "multiverseId": 85499, "name": "Orateur de sang", "text": "Au début de votre entretien, vous pouvez sacrifier l'Orateur de sang. Si vous faites ainsi, cherchez dans votre bibliothèque une carte de démon, révélez-la et mettez-la dans votre main. Mélangez ensuite votre bibliothèque.\nÀ chaque fois qu'un démon arrive en jeu sous votre contrôle, renvoyez l'Orateur de sang depuis votre cimetière dans votre main.", "type": "Créature : ogre et shamane"}, {"language": "Italian", "multiverseId": 86113, "name": "Voce del Sangue", "text": "All'inizio del tuo mantenimento, puoi sacrificare la Voce del Sangue. Se lo fai, passa in rassegna il tuo grimorio, scegli una carta Demone, rivela quella carta e aggiungila alla tua mano. Poi rimescola il tuo grimorio.\nOgniqualvolta un Demone entra in gioco sotto il tuo controllo, riprendi in mano la Voce del Sangue dal tuo cimitero.", "type": "Creatura - Sciamano Ogre"}, {"language": "Japanese", "multiverseId": 86420, "name": "血の語り部", "text": "あなたのアップキープの開始時に、あなたは血の語り部を生け贄に捧げてもよい。そうした場合、あなたのライブラリーからデーモン・カードを１枚探し、それを公開してあなたの手札に加える。その後、あなたのライブラリーを切り直す。\nデーモンがあなたのコントロール下で場に出るたび、血の語り部をあなたの墓地から手札に戻す。", "type": "クリーチャー — オーガ・シャーマン"}, {"language": "Portuguese (Brazil)", "multiverseId": 86727, "name": "Orador do Sangue", "text": "No início de sua manutenção, você pode sacrificar Orador do Sangue. Se o fizer, procure em seu grimório por um card de Demônio, revele-o e coloque-o na sua mão. Depois, embaralhe o seu grimório.\nToda vez que um Demônio entrar em jogo sob o seu controle, devolva Orador do Sangue de seu cemitério para a sua mão.", "type": "Criatura - Xamã Ogre"}, {"language": "Chinese Simplified", "multiverseId": 85192, "name": "鲜血祷师", "text": "在你的维持开始时，你可以牺牲鲜血祷师。若你如此作，从你的牌库中搜寻一张恶魔牌，展示该牌，并置于你手上。然后将你的牌库洗牌。\n每当一个恶魔在你的操控下进场时，将鲜血祷师从你的坟墓场移回你手上。", "type": "生物～食人魔／祭师"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "112070", "cardKingdomId": "111771", "cardsphereId": "7782", "mcmId": "11970", "mcmMetaId": "6942", "mtgjsonV4Id": "b26c5dff-c416-5bf3-a8eb-bd92fc5b93ad", "mtgoFoilId": "21378", "mtgoId": "21377", "multiverseId": "79166", "scryfallId": "f218bb94-d5a2-41f6-8bca-b689dcd09a43", "scryfallIllustrationId": "2c61b104-1847-4872-84de-9752b2b1472e", "scryfallOracleId": "2659c0ea-9ae0-4be3-b9f7-5a38230815ad", "tcgplayerProductId": "11951"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}", "manaValue": 4.0, "name": "Blood Speaker", "number": "103", "originalText": "At the beginning of your upkeep, you may sacrifice Blood Speaker. If you do, search your library for a Demon card, reveal that card, and put it into your hand. Then shuffle your library.\nWhenever a Demon comes into play under your control, return Blood Speaker from your graveyard to your hand.", "originalType": "Creature - Ogre Shaman", "power": "3", "printings": ["CHK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2089c013f7e2bd1c", "cardKingdomFoil": "https://mtgjson.com/links/41ac1eafed13fbe2", "cardmarket": "https://mtgjson.com/links/122f8bb216e95539", "tcgplayer": "https://mtgjson.com/links/16fc0c1e3c9dd68d"}, "rarity": "uncommon", "rulings": [{"date": "2004-12-01", "text": "The return-to-hand triggered ability triggers while Blood Speaker is in your graveyard, no matter how it got there."}], "setCode": "CHK", "subtypes": ["Ogre", "Shaman"], "supertypes": [], "text": "At the beginning of your upkeep, you may sacrifice Blood Speaker. If you do, search your library for a Demon card, reveal that card, put it into your hand, then shuffle.\nWhenever a Demon enters the battlefield under your control, return Blood Speaker from your graveyard to your hand.", "toughness": "2", "type": "Creature — Ogre Shaman", "types": ["Creature"], "uuid": "7d40e039-e287-53e8-8b55-08a425c62aab"}