{"artist": "Adi Granov", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 1.0, "edhrecRank": 1455, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 204162, "name": "Aufstieg des Bluthäuptlings", "text": "Zu Beginn jedes Endsegments kannst du eine Quest-Marke auf den Aufstieg des Bluthäuptlings legen, falls ein Gegner in diesem Zug 2 Lebenspunkte oder mehr verloren hat. (Schaden verursacht den Verlust von Lebenspunkten.)\nImmer wenn eine Karte von irgendwoher auf den Friedhof eines Gegners gelegt wird, kannst du diesen Spieler 2 Lebenspunkte verlieren lassen, falls auf dem Aufstieg des Bluthäuptlings drei oder mehr Quest-Marken liegen. Falls du dies tust, erhältst du 2 Lebenspunkte dazu.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 202817, "name": "Ascenso del jefe de sangre", "text": "Al comienzo de cada paso final, si un oponente perdió 2 o más vidas este turno, puedes poner un contador de búsqueda sobre el Ascenso del jefe de sangre. (El daño causa pérdida de vidas.)\nSiempre que una carta vaya al cementerio de un oponente desde cualquier parte, si el Ascenso del jefe de sangre tiene tres o más contadores de búsqueda sobre él, puedes hacer que ese jugador pierda 2 vidas. Si lo haces, ganas 2 vidas.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 204431, "name": "Ascension du chef de sang", "text": "Au début de chaque étape de fin, si un adversaire a perdu au moins 2 points de vie ce tour-ci, vous pouvez mettre un marqueur « quête » sur l'Ascension du chef de sang. (Les blessures provoquent la perte de points de vie.)\nÀ chaque fois qu'une carte est mise dans le cimetière d'un adversaire d'où qu'elle vienne, si l'Ascension du chef de sang a au moins trois marqueurs « quête » sur elle, vous pouvez faire que ce joueur perde 2 points de vie. Si vous faites ainsi, vous gagnez 2 points de vie.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 203086, "name": "Ascensione del Capo Sanguinario", "text": "All'inizio di ogni sottofase finale, se un avversario ha perso 2 o più punti vita in questo turno, puoi mettere un segnalino ricerca sull'Ascensione del Capo Sanguinario. (Il danno provoca la perdita di punti vita.)\nOgniqualvolta una carta viene messa nel cimitero di un avversario da qualsiasi zona, se l'Ascensione del Capo Sanguinario ha tre o più segnalini ricerca, puoi far perdere 2 punti vita a quel giocatore. Se lo fai, guadagni 2 punti vita.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 203893, "name": "血の長の昇天", "text": "各終了ステップの開始時に、このターンいずれかの対戦相手が２点以上のライフを失っている場合、あなたは血の長の昇天の上に探索カウンターを１個置いてもよい。 （ダメージによりライフは失われる。）\nカードが１枚いずれかの領域からいずれかの対戦相手の墓地に置かれるたび、血の長の昇天の上に探索カウンターが３個以上置かれている場合、あなたは「そのプレイヤーは２点のライフを失う。」を選んでもよい。 そうした場合、あなたは２点のライフを得る。", "type": "エンチャント"}, {"language": "Portuguese (Brazil)", "multiverseId": 203624, "name": "Ascensão do Grão-Vampiro", "text": "No início de cada etapa final, se um oponente perdeu 2 ou mais pontos de vida neste turno, você pode colocar um marcador de busca em Ascensão do Grão-Vampiro. (Dano causa perda de pontos de vida.)\nToda vez que um card for colocado no cemitério do oponente vindo de qualquer lugar, se Ascensão do Grão-Vampiro tiver três ou mais marcadores de busca nele, você poderá fazer com que aquele jogador perca 2 pontos de vida. Se fizer isso, você ganhará 2 pontos de vida.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 203355, "name": "Возвышение Кровавого Вождя", "text": "В начале каждого заключительного шага, если оппонент потерял 2 или более жизни в этом ходу, вы можете положить жетон странствий на Возвышение Кровавого Вождя. (Повреждения вызывают потерю жизней.)\nКаждый раз, когда карта попадает откуда-либо на кладбище оппонента, если на Возвышении Кровавого Вождя есть не менее трех жетонов странствий, вы можете заставить того игрока потерять 2 жизни. Если вы это делаете, вы получаете 2 жизни.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 204700, "name": "血侯腾扬", "text": "在每个结束步骤开始时，若本回合中某对手失去了2点或更多生命，你可以在血侯腾扬上放置一个探索指示物。 （伤害会导致失去生命。）\n每当一张牌从任何地方置入对手的坟墓场时，若血侯腾扬上有三个或更多探索指示物，则你可以令该牌手失去2点生命。 若你如此作，则你获得2点生命。", "type": "结界"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "128150", "cardKingdomId": "127899", "cardsphereId": "47657", "mcmId": "21895", "mcmMetaId": "10876", "mtgjsonV4Id": "5a629ca6-8989-5d33-8882-6cdfcac96dff", "mtgoFoilId": "34823", "mtgoId": "34822", "multiverseId": "197892", "scryfallId": "aa213dbb-c52a-4084-92aa-d0b5d97a97d9", "scryfallIllustrationId": "ab96c2a4-1653-4455-a9dd-b1e9f70eb768", "scryfallOracleId": "d5ea905b-4bb6-48d0-9082-c472703db550", "tcgplayerProductId": "33265"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{B}", "manaValue": 1.0, "name": "Bloodchief Ascension", "number": "82", "originalText": "At the beginning of each end step, if an opponent lost 2 or more life this turn, you may put a quest counter on Bloodchief Ascension. (Damage causes loss of life.)\nWhenever a card is put into an opponent's graveyard from anywhere, if Bloodchief Ascension has three or more quest counters on it, you may have that player lose 2 life. If you do, you gain 2 life.", "originalType": "Enchantment", "printings": ["PLIST", "ZEN"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/60aff8d8cd73d762", "cardKingdomFoil": "https://mtgjson.com/links/6d1c94659bba891e", "cardmarket": "https://mtgjson.com/links/8a789459fa088a12", "tcgplayer": "https://mtgjson.com/links/992b5bb06c02735e"}, "rarity": "rare", "rulings": [{"date": "2009-10-01", "text": "Bloodchief Ascension’s first ability has an “intervening ‘if’ clause.” It won’t trigger at all unless an opponent has already lost 2 or more life by the time the end step begins."}, {"date": "2009-10-01", "text": "Bloodchief Ascension’s first ability checks how much life was lost by each opponent over the course of the entire turn, even if Bloodchief Ascension wasn’t on the battlefield the whole time."}, {"date": "2009-10-01", "text": "For the first ability to trigger, a single opponent must have lost 2 life. Two opponents each losing 1 life won’t cause it to trigger. It will trigger a maximum of once per turn, no matter how many opponents have lost 2 or more life."}, {"date": "2009-10-01", "text": "Bloodchief Ascension’s first ability checks only whether life was lost. It doesn’t care whether life was also gained. For example, if an opponent lost 4 life and gained 6 life during the turn, that player will have a higher life total than they started the turn with — but Bloodchief Ascension’s first ability will still trigger."}, {"date": "2009-10-01", "text": "Bloodchief Ascension’s second ability doesn’t behave like a leaves-the-battlefield triggered ability, since the card put into an opponent’s graveyard may come from anywhere. If a Bloodchief Ascension with three quest counters on it and a permanent an opponent owns are destroyed at the same time, for example, the game will not “look back in time” at the game state, and Bloodchief Ascension’s second ability won’t trigger."}], "setCode": "ZEN", "subtypes": [], "supertypes": [], "text": "At the beginning of each end step, if an opponent lost 2 or more life this turn, you may put a quest counter on Bloodchief Ascension. (Damage causes loss of life.)\nWhenever a card is put into an opponent's graveyard from anywhere, if Bloodchief Ascension has three or more quest counters on it, you may have that player lose 2 life. If you do, you gain 2 life.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "8132184d-a780-5c7d-8a72-2ce4a71eaf90"}