{"artist": "Scott Kirschner", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 3.0, "edhrecRank": 15394, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "name": "Knochentänzer", "text": "0: Bringe die oberste Kreaturenkarte aus dem Friedhof des verteidigenden Spielers direkt unter Deiner Kontrolle ins Spiel. Der Knochentänzer fügt in diesem Zug keinen Kampfschaden zu. Benutze diese Fähigkeit nur, wenn der Knochentänzer angreift und nicht geblockt wird, und nur einmal pro Zug.", "type": "Beschwörung eines Zombies"}, {"language": "Spanish", "name": "Danzarín de hueso"}, {"language": "French", "name": "Ostéodanseur"}, {"language": "Italian", "name": "Danzatore d'Ossa"}, {"language": "Japanese", "name": "骨の踊り手"}, {"language": "Portuguese (Brazil)", "name": "Dançarino de Ossos"}], "frameVersion": "1997", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "33028", "cardsphereId": "47084", "mcmId": "8572", "mcmMetaId": "644", "mtgjsonV4Id": "1bfd6882-7b41-501e-84d4-bd7d1fa379f8", "mtgoFoilId": "9278", "mtgoId": "9277", "multiverseId": "4450", "scryfallId": "207bb4cd-4525-47e0-b412-0d0e29717d44", "scryfallIllustrationId": "48247f26-4b21-4c87-b7a6-e5c27cb0e3a2", "scryfallOracleId": "13b5c9ef-d0e3-453d-ae5e-8de4f310cc38", "tcgplayerProductId": "5995"}, "isReserved": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{1}{B}{B}", "manaValue": 3.0, "name": "Bone Dancer", "number": "62", "originalText": "o0: Put the top creature card of defending player's graveyard into play under your control. Bone Dancer deals no combat damage this turn. Use this ability only if Bone Dancer is attacking and unblocked and only once each turn.", "originalType": "Summon - Zombie", "power": "2", "printings": ["WTH"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d3997201aeaaed0b", "cardmarket": "https://mtgjson.com/links/69be95390d0eaede", "tcgplayer": "https://mtgjson.com/links/3ac100047ad639ea"}, "rarity": "rare", "rulings": [{"date": "2008-04-01", "text": "The “top” card of your graveyard is the card that was put there most recently."}, {"date": "2008-04-01", "text": "Players may not rearrange the cards in their graveyards. This is a little-known rule because new cards that care about graveyard order haven’t been printed in years."}, {"date": "2008-04-01", "text": "If an effect or rule puts two or more cards into the same graveyard at the same time, the owner of those cards may arrange them in any order."}, {"date": "2008-04-01", "text": "The last thing that happens to a resolving instant or sorcery spell is that it’s put into its owner’s graveyard. —Example: You cast Wrath of God. All creatures on the battlefield are destroyed. You arrange all the cards put into your graveyard this way in any order you want. The other players in the game do the same to the cards that are put into their graveyards. Then you put Wrath of God into your graveyard, on top of the other cards."}, {"date": "2008-04-01", "text": "Say you’re the owner of both a permanent and an Aura that’s attached to it. If both the permanent and the Aura are destroyed at the same time (by Akroma’s Vengeance, for example), you decide the order they’re put into your graveyard. If just the enchanted permanent is destroyed, it’s put into your graveyard first. Then, after state-based actions are checked, the Aura (which is no longer attached to anything) is put into your graveyard on top of it."}, {"date": "2013-04-15", "text": "An ability that triggers when something “attacks and isn’t blocked” triggers in the declare blockers step after blockers are declared if (1) that creature is attacking and (2) no creatures are declared to block it. It will trigger even if that creature was put onto the battlefield attacking rather than having been declared as an attacker in the declare attackers step."}], "setCode": "WTH", "subtypes": ["Zombie"], "supertypes": [], "text": "Whenever Bone Dancer attacks and isn't blocked, you may put the top creature card of defending player's graveyard onto the battlefield under your control. If you do, Bone Dancer assigns no combat damage this turn.", "toughness": "2", "type": "Creature — Zombie", "types": ["Creature"], "uuid": "d5e5cfbd-067a-53d5-b9fa-8184307233de"}