{"artist": "Andreas Zafiratos", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 8140, "finishes": ["nonfoil", "foil"], "flavorText": "Teferi stepped calmly into the fray. Suddenly the sun paused in the sky and the werewolves' snarls froze on their faces.", "foreignData": [{"flavorText": "Teferi schritt ruhig ins Getümmel. Plötzlich hielt die Sonne am Himmel inne, und die knurrenden Gesichter der Werwölfe erstarrten.", "language": "German", "multiverseId": 535075, "name": "Geschenkte Zeit", "text": "Wenn die Geschenkte Zeit ins Spiel kommt, schicke eine bleibende Karte deiner Wahl, die kein Land ist und die ein Gegner kontrolliert, ins Exil, bis die Geschenkte Zeit das Spiel verlässt.", "type": "Verzauberung"}, {"flavorText": "Teferi se unió a la batalla con calma. De repente, el sol se detuvo en el cielo y los gruñidos de los licántropos quedaron congelados en sus caras.", "language": "Spanish", "multiverseId": 535391, "name": "Tiempo prestado", "text": "Cuando el Tiempo prestado entre al campo de batalla, exilia el permanente objetivo que no sea tierra que controla un oponente hasta que el Tiempo prestado deje el campo de batalla.", "type": "Encantamiento"}, {"flavorText": "Téfeiri s'avança d'un pas tranquille au cœur du combat. Soudain, la course du soleil dans le ciel s'interrompit et le rictus des loups-garous se figea.", "language": "French", "multiverseId": 535707, "name": "Sursis", "text": "Quand le Sursis arrive sur le champ de bataille, exilez un permanent non-terrain ciblé qu'un adversaire contrôle jusqu'à ce que le Sursis quitte le champ de bataille.", "type": "Enchantement"}, {"flavorText": "Teferi avanzò con calma. Improvvisamente il sole si fermò nel cielo e il ringhio dei mannari si congelò sui loro volti.", "language": "Italian", "multiverseId": 536023, "name": "Tempo Rubato", "text": "Quando il Tempo Rubato entra nel campo di battaglia, esilia un permanente non terra bersaglio controllato da un avversario finché il Tempo Rubato non lascia il campo di battaglia.", "type": "Incantesimo"}, {"flavorText": "テフェリーは平然と戦場に踏み込んだ。すると突如、太陽は宙に留まり、人狼の唸りもその口から動かなくなった。", "language": "Japanese", "multiverseId": 536339, "name": "仮初めの時間", "text": "仮初めの時間が戦場に出たとき、対戦相手がコントロールしていて土地でないパーマネント１つを対象とする。仮初めの時間が戦場を離れるまで、それを追放する。", "type": "エンチャント"}, {"flavorText": "테페리는 침착하게 싸움 속으로 걸어 들어갔다. 갑자기 태양이 하늘에서 멈췄고 늑대인간들의 으르렁거리는 소리는 그들의 얼굴에서 얼어붙었다.", "language": "Korean", "multiverseId": 536655, "name": "빌린 시간", "text": "빌린 시간이 전장에 들어올 때, 상대가 조종하는 대지가 아닌 지속물을 목표로 정한다. 그 지속물을 빌린 시간이 전장을 떠날 때까지 추방한다.", "type": "부여마법"}, {"flavorText": "Teferi entrou calmamente na briga. Subitamente, o sol parou no céu e os rosnados dos lobisomens congelaram em seus rostos.", "language": "Portuguese (Brazil)", "multiverseId": 536971, "name": "Tempo Extra", "text": "Quando Tempo Extra entrar no campo de batalha, exile a permanente alvo não de terreno que um oponente controla até que Tempo Extra deixe o campo de batalha.", "type": "Encantamento"}, {"flavorText": "Тефери спокойно ступил в гущу битвы. Вдруг солнце остановилось в небе и оскал оборотней застыл на их мордах.", "language": "Russian", "multiverseId": 537287, "name": "Время Взаймы", "text": "Когда Время Взаймы выходит на поле битвы, изгоните целевой не являющийся землей перманент под контролем оппонента до тех пор, пока Время Взаймы не покинет поле битвы.", "type": "Чары"}, {"flavorText": "泰菲力平静地踏入战局。空中太阳登时停滞不前，狼人脸上狰狞面容也凝固不动。", "language": "Chinese Simplified", "multiverseId": 537603, "name": "暂免危难", "text": "当暂免危难进战场时，放逐目标由对手操控的非地永久物，直到暂免危难离开战场为止。", "type": "结界"}, {"flavorText": "泰菲力平靜地踏入戰局。空中太陽登時停滯不前，狼人臉上猙獰面容也凝固不動。", "language": "Chinese Traditional", "multiverseId": 537919, "name": "暫免危難", "text": "當暫免危難進戰場時，放逐目標由對手操控的非地永久物，直到暫免危難離開戰場為止。", "type": "結界"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "250907", "cardKingdomId": "250509", "cardsphereId": "80827", "mcmId": "574938", "mcmMetaId": "345437", "mtgArenaId": "78330", "mtgjsonV4Id": "6435d35a-35d5-5a18-b505-62f9a3b5101e", "mtgoId": "92932", "multiverseId": "534759", "scryfallId": "3eeef24b-b937-408e-a32e-1a546d3e7b0f", "scryfallIllustrationId": "72d9285d-bf4f-4675-be14-0abf6e1aa829", "scryfallOracleId": "f1ac4e0e-5633-46e4-9a21-d3924e481d13", "tcgplayerProductId": "248131"}, "isStorySpotlight": true, "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}", "manaValue": 3.0, "name": "Borrowed Time", "number": "6", "originalText": "When Borrowed Time enters the battlefield, exile target nonland permanent an opponent controls until Borrowed Time leaves the battlefield.", "originalType": "Enchantment", "printings": ["DBL", "MID"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/3f68c949a727b782", "cardKingdomFoil": "https://mtgjson.com/links/24e10a6b74724021", "cardmarket": "https://mtgjson.com/links/42a565da9e97e012", "tcgplayer": "https://mtgjson.com/links/dd7f9cb794a32847"}, "rarity": "uncommon", "rulings": [{"date": "2021-09-24", "text": "Borrowed Time's ability is a single ability that creates two one-shot effects: one that exiles the permanent when the ability resolves, and another that returns the exiled card to the battlefield immediately after Borrowed Time leaves the battlefield."}, {"date": "2021-09-24", "text": "If Borrowed Time leaves the battlefield before its enters-the-battlefield ability resolves, the target permanent won't be exiled."}, {"date": "2021-09-24", "text": "Auras attached to the exiled permanent will be put into their owners' graveyards. Equipment attached to an exiled creature will become unattached and remain on the battlefield. Any counters on the exiled permanent will cease to exist."}, {"date": "2021-09-24", "text": "If a token is exiled, it ceases to exist. It won't be returned to the battlefield."}, {"date": "2021-09-24", "text": "In a multiplayer game, if Borrowed Time's owner leaves the game, the exiled card will return to the battlefield. Because the one-shot effect that returns the card isn't an ability that goes on the stack, it won't cease to exist along with the leaving player's spells and abilities on the stack."}], "setCode": "MID", "subtypes": [], "supertypes": [], "text": "When Borrowed Time enters the battlefield, exile target nonland permanent an opponent controls until Borrowed Time leaves the battlefield.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "521e339e-756d-5f38-bf2b-f4070e304ee6"}