{"artist": "Kev Walker", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 9944, "finishes": ["nonfoil", "foil"], "flavorText": "In spite of their hunger, they're slow eaters.", "foreignData": [{"flavorText": "Obwohl sie so großen Hunger haben, sind sie langsame Esser.", "language": "German", "multiverseId": 140482, "name": "Hirnverschlinger", "text": "Wenn du die Hirnverschlinger spielst, kann jeder Spieler eine Kreatur opfern. Falls ein Spieler das tut, neutralisiere die Hirnverschlinger.\nWahnsinn {1}{B} (Falls du diese Karte aus deiner Hand abwirfst, kannst du sie für ihre Wahnsinn-Kosten spielen, anstatt sie auf deinen Friedhof zu legen.)", "type": "Kreatur — Zombie"}, {"flavorText": "A pesar de su hambre, son lentos para comer.", "language": "Spanish", "multiverseId": 141202, "name": "Devoradores de cerebros", "text": "Cuando juegues los Devoradores de cerebros, cualquier jugador puede sacrificar una criatura. Si un jugador lo hace, contrarresta a los Devoradores de cerebros.\nDemencia {1}{B} (Si descartas esta carta, puedes jugarla por su coste de demencia en vez de ponerla en tu cementerio.)", "type": "Criatura — Zombie"}, {"flavorText": "Ils vous dévorent lentement, lobe par lobe.", "language": "French", "multiverseId": 140362, "name": "Avaleurs de cerveau", "text": "Quand vous jouez les Avaleurs de cerveau, n'importe quel joueur peut sacrifier une créature. Si un joueur fait ainsi, contrecarrez les Avaleurs de cerveau.\nFolie {1}{B} (Si vous vous défaussez de cette carte, vous pouvez la jouer pour son coût de folie à la place de la mettre dans votre cimetière.)", "type": "Créature : zombie"}, {"flavorText": "Nonostante la loro fame, mangiano molto lentamente.", "language": "Italian", "multiverseId": 140602, "name": "Divoracervelli", "text": "Quando giochi i Divoracervelli, qualsiasi giocatore può sacrificare una creatura. Se un giocatore lo fa, neutralizza i Divoracervelli.\nFollia {1}{B} (Se scarti questa carta, puoi giocarla pagando il suo costo di follia invece di metterla nel tuo cimitero.)", "type": "Creatura — Zombie"}, {"flavorText": "飢えてはいるが、食うのは遅い。", "language": "Japanese", "multiverseId": 140842, "name": "脳喰らい", "text": "あなたが脳喰らいをプレイしたとき、いずれのプレイヤーもクリーチャーを１体生け贄に捧げてもよい。 いずれかのプレイヤーがそうした場合、脳喰らいを打ち消す。\nマッドネス {1}{B} （あなたがこのカードを捨てる場合、あなたはそれをあなたの墓地に置く代わりに、マッドネス・コストでそれをプレイしてもよい。）", "type": "クリーチャー — ゾンビ"}, {"flavorText": "Apesar de sua fome, eles são lentos para comer.", "language": "Portuguese (Brazil)", "multiverseId": 140962, "name": "Devoradores de Cérebro", "text": "Quando você joga Devoradores de Cérebro, qualquer jogador pode sacrificar uma criatura. Se um jogador o fizer, anule Devoradores de Cérebro.\nLoucura {1}{B} (Se descartar este card, você poderá jogá-lo pagando seu custo de loucura, em vez de colocá-lo em seu cemitério.)", "type": "Criatura — Zumbi"}, {"flavorText": "Несмотря на свой голод, они едят медленно.", "language": "Russian", "multiverseId": 141082, "name": "Мыслеглот", "text": "Когда вы играете Мыслеглота, каждый игрок может пожертвовать существо. Если игрок это сделает, отмените Мыслеглота.\nБешенство {1}{B} (Если вы сбрасываете эту карту, то вы можете играть ее за ее стоимость Бешенства вместо того, чтобы положить ее на ваше кладбище.)", "type": "Существо — Зомби"}, {"flavorText": "即使饥肠辘辘，它们依旧慢慢地吃。", "language": "Chinese Simplified", "multiverseId": 141322, "name": "吞脑尸鬼", "text": "当你使用吞脑尸鬼时，任意牌手可以牺牲一个生物。 若有牌手如此做，则反击吞脑尸鬼。\n疯魔{1}{B}（如果你弃掉此牌，可以改为使用它并支付其疯魔费用，而非直接将它置入你的坟墓场。）", "type": "生物～灵俑"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "122155", "cardKingdomId": "121981", "cardsphereId": "35177", "mcmId": "14244", "mcmMetaId": "8651", "mtgjsonV4Id": "a4aa3260-77a7-57b8-802b-9dbf8865865a", "mtgoFoilId": "26322", "mtgoId": "26321", "multiverseId": "124040", "scryfallId": "b02161f4-505c-4c01-ae33-5c61598c71d7", "scryfallIllustrationId": "075b1daf-0ac0-40b6-b07a-f8972e19eb36", "scryfallOracleId": "3b9369ae-8827-45d1-af85-c777cde8e1bc", "tcgplayerProductId": "14694"}, "keywords": ["Madness"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}", "manaValue": 4.0, "name": "Brain Gorgers", "number": "65", "originalText": "When you play Brain Gorgers, any player may sacrifice a creature. If a player does, counter Brain Gorgers.\nMadness {1}{B} (If you discard this card, you may play it for its madness cost instead of putting it into your graveyard.)", "originalType": "Creature - Zombie", "power": "4", "printings": ["PLC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/eb9c0e15ed174826", "cardKingdomFoil": "https://mtgjson.com/links/2519270429acbdb0", "cardmarket": "https://mtgjson.com/links/5e0c16fd6a6f3ee1", "tcgplayer": "https://mtgjson.com/links/3fa69a27cb854cbb"}, "rarity": "common", "rulings": [{"date": "2007-02-01", "text": "When this spell is cast, its “when you cast” ability triggers and goes on the stack on top of it."}, {"date": "2007-02-01", "text": "As the triggered ability resolves, the active player gets the option to perform the action. If that player declines, the next player in turn order gets the option. As soon as any player performs the action, the spell is countered, but the remaining players still get the option. If all players decline, the spell remains on the stack."}, {"date": "2013-07-01", "text": "A player can’t choose to sacrifice a creature unless they actually control a creature that can be sacrificed. For example, if the action were “discard three cards,” a player with two or fewer cards in hand couldn’t take the option to counter the spell."}], "setCode": "PLC", "subtypes": ["Zombie"], "supertypes": [], "text": "When you cast this spell, any player may sacrifice a creature. If a player does, counter Brain Gorgers.\nMadness {1}{B} (If you discard this card, discard it into exile. When you do, cast it for its madness cost or put it into your graveyard.)", "toughness": "2", "type": "Creature — Zombie", "types": ["Creature"], "uuid": "84be87e8-594e-5717-8699-2bc0c84e063e"}