{"artist": "Brent Hollowell", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 7.0, "edhrecRank": 3212, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 567263, "name": "Gehirndieb-Drache", "text": "Fliegend\nZu Beginn deines Endsegments schickst du die oberste Karte der Bibliothek jedes Gegners ins Exil. Du kannst die Karten spielen, solange sie im Exil bleiben. Falls du auf diese Weise einen Zauberspruch wirkst, kannst du Mana ausgeben, als wäre es Mana einer beliebigen Farbe, um ihn zu wirken.\nImmer wenn eine bleibende Karte, die kein Land ist und die ein Gegner besitzt, unter deiner Kontrolle ins Spiel kommt, verliert der Gegner Lebenspunkte in Höhe ihres Manabetrags.", "type": "Kreatur — Drache, Schrecken"}, {"language": "Spanish", "multiverseId": 567291, "name": "Dragón robacerebros", "text": "Vuela.\nAl comienzo de tu paso final, exilia la primera carta de la biblioteca de cada oponente. Puedes jugar esas cartas mientras permanezcan exiliadas. Si lanzas un hechizo de esta manera, puedes usar maná como si fuera maná de cualquier color para lanzarlo.\nSiempre que un permanente que no sea tierra y que sea propiedad de un oponente entre al campo de batalla bajo tu control, ese oponente pierde una cantidad de vidas igual a su valor de maná.", "type": "Criatura — Horror dragón"}, {"language": "French", "multiverseId": 567319, "name": "Dragon voleur d'esprit", "text": "Vol\nAu début de votre étape de fin, exilez la carte du dessus de la bibliothèque de chaque adversaire. Vous pouvez jouer ces cartes tant qu'elles restent exilées. Si vous lancez un sort de cette manière, vous pouvez dépenser du mana comme si c'était du mana de n'importe quelle couleur pour le lancer.\nÀ chaque fois qu'un permanent non-terrain qu'un adversaire possède arrive sur le champ de bataille sous votre contrôle, il perd un nombre de points de vie égal à sa valeur de mana.", "type": "Créature : dragon et horreur"}, {"language": "Italian", "multiverseId": 567347, "name": "Drago Rubacervello", "text": "Volare\nAll'inizio della tua sottofase finale, esilia la prima carta del grimorio di ogni avversario. Puoi giocare quelle carte fintanto che rimangono esiliate. Se lanci una magia in questo modo, puoi spendere mana come se fosse mana di qualsiasi colore per lanciarla.\nOgniqualvolta un permanente non terra posseduto da un avversario entra nel campo di battaglia sotto il tuo controllo, quell'avversario perde punti vita pari al suo valore di mana.", "type": "Creatura — Orrore Drago"}, {"language": "Japanese", "multiverseId": 567375, "name": "ブレインスティーラー・ドラゴン", "text": "飛行\nあなたの終了ステップの開始時に、各対戦相手それぞれのライブラリーの一番上にあるカード１枚を追放する。それらのカードが追放され続けているかぎり、あなたはそれらのカードをプレイしてもよい。これによりあなたが呪文を唱えるなら、あなたはそれを唱えるためにマナを望む色のマナであるかのように支払ってもよい。\n対戦相手がオーナーであり土地でないパーマネント１つがあなたのコントロール下で戦場に出るたび、それのオーナーはそれのマナ総量に等しい点数のライフを失う。", "type": "クリーチャー — ドラゴン・ホラー"}, {"language": "Portuguese (Brazil)", "multiverseId": 567403, "name": "Dragão Ladrão de Cérebros", "text": "Voar\nNo início de sua etapa final, exile o card do topo do grimório de cada oponente. Você poderá jogar aqueles cards enquanto eles permanecerem exilados. Se você conjurar uma mágica dessa forma, você poderá gastar mana como se fosse de qualquer cor para conjurá-la.\nToda vez que uma permanente não de terreno que um oponente possui entra no campo de batalha sob seu controle, aquele oponente perde uma quantidade de pontos de vida igual ao valor de mana daquela permanente.", "type": "Criatura — Dragão Horror"}, {"language": "Russian", "multiverseId": 567431, "name": "Дракон-Мозгокрад", "text": "Полет\nВ начале вашего заключительного шага изгоните верхнюю карту библиотеки каждого оппонента. Вы можете разыгрывать те карты, пока они остаются в изгнании. Если вы разыгрываете таким образом заклинание, то можете тратить ману на его разыгрывание, как если бы это была мана любого цвета.\nКаждый раз, когда не являющийся землей перманент, принадлежащий оппоненту, выходит на поле битвы под вашим контролем, тот оппонент теряет количество жизней, равное его мановой ценности.", "type": "Существо — Дракон Ужас"}, {"language": "Chinese Simplified", "multiverseId": 567459, "name": "夺脑龙", "text": "飞行\n在你的结束步骤开始时，放逐每位对手的牌库顶牌。于这些牌持续放逐的时段内，你可以使用它们。如果你以此法施放咒语，则你可以将法术力视同任意颜色的法术力来支付施放它的费用。\n每当一个由对手拥有的非地永久物在你操控下进战场时，该对手失去等同于其法术力值的生命。", "type": "生物 ～龙／惊惧兽"}, {"language": "Chinese Traditional", "multiverseId": 567487, "name": "奪腦龍", "text": "飛行\n在你的結束步驟開始時，放逐每位對手的牌庫頂牌。於這些牌持續放逐的時段內，你可以使用它們。如果你以此法施放咒語，則你可以將魔法力視同任意顏色的魔法力來支付施放它的費用。\n每當一個由對手擁有的非地永久物在你操控下進戰場時，該對手失去等同於其魔法力值的生命。", "type": "生物 ～龍／驚懼獸"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "261891", "mcmId": "661295", "mtgjsonV4Id": "e7355019-a987-54c7-99a6-e0a2a0fc48a7", "mtgoId": "101436", "multiverseId": "567235", "scryfallId": "0984b1f1-dfc8-4cb9-90a3-e084950438bf", "scryfallIllustrationId": "ca061161-ac7c-4436-9fe9-6cb53ece80b6", "scryfallOracleId": "13cb958f-1e66-4219-901a-ff58275c8475", "tcgplayerProductId": "273890"}, "keywords": ["Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{5}{B}{B}", "manaValue": 7.0, "name": "Brainstealer Dragon", "number": "670", "originalText": "Flying\nAt the beginning of your end step, exile the top card of each opponent's library. You may play those cards for as long as they remain exiled. If you cast a spell this way, you may spend mana as though it were mana of any color to cast it.\nWhenever a nonland permanent an opponent owns enters the battlefield under your control, they lose life equal to its mana value.", "originalType": "Creature — Dragon Horror", "power": "6", "printings": ["CLB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/cc30e30708f04693", "tcgplayer": "https://mtgjson.com/links/15d460dda47bc140"}, "rarity": "rare", "rulings": [], "securityStamp": "oval", "setCode": "CLB", "subtypes": ["Dragon", "Horror"], "supertypes": [], "text": "Flying\nAt the beginning of your end step, exile the top card of each opponent's library. You may play those cards for as long as they remain exiled. If you cast a spell this way, you may spend mana as though it were mana of any color to cast it.\nWhenever a nonland permanent an opponent owns enters the battlefield under your control, they lose life equal to its mana value.", "toughness": "6", "type": "Creature — Dragon Horror", "types": ["Creature"], "uuid": "fb6ce31f-4dbc-5470-8899-7942167deca3", "variations": ["128d4dac-b685-548e-a1dc-6403141d2196"]}