{"artist": "Dave Dorman", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R", "W"], "colors": ["R", "W"], "convertedManaCost": 4.0, "edhrecRank": 10888, "finishes": ["nonfoil", "foil"], "flavorText": "\"Let the pyres of the unbelievers light our way.\"\n—Razia", "foreignData": [{"flavorText": "„Die Scheiterhaufen der Ungläubigen sollen unseren Weg beleuchten.\" —Razia", "language": "German", "multiverseId": 111615, "name": "Helle Flamme", "text": "Ausstrahlung Die Helle Flamme fügt einer Kreatur deiner Wahl und allen anderen Kreaturen, die mit ihr eine Farbe gemeinsam haben, X Schadenspunkte zu. Du erhältst so viele Lebenspunkte dazu, wie auf diese Weise Schadenspunkte zugefügt wurden.", "type": "Hexerei"}, {"flavorText": "\"Que las piras de los infieles iluminen nuestro camino.\" —Razia", "language": "Spanish", "multiverseId": 113145, "name": "Flama brillante", "text": "Irradiar La Flama brillante hace X puntos de daño a la criatura objetivo y a cada una de las otras criaturas que compartan un color con ella. Ganas una cantidad de vida igual al daño hecho de esta manera.", "type": "Conjuro"}, {"flavorText": "« Que les bûchers funéraires des infidèles éclairent notre chemin. » —Razia", "language": "French", "multiverseId": 111921, "name": "Claireflamme", "text": "Irradiance La Claireflamme inflige X blessures à la créature ciblée et à chaque autre créature qui partage une couleur avec elle. Vous gagnez autant de points de vie que de blessures infligées de cette manière.", "type": "Rituel"}, {"flavorText": "\"Che i roghi dei miscredenti illuminino la nostra strada.\" —Razia", "language": "Italian", "multiverseId": 112227, "name": "Fiamma Radiosa", "text": "Radianza La Fiamma Radiosa infligge X danni a una creatura bersaglio e a ogni altra creatura che abbia almeno un colore in comune con essa. Guadagni un ammontare di punti vita pari ai danni inflitti in questo modo.", "type": "Stregoneria"}, {"flavorText": "信じざる者たちを焼く炎で我らが道を示さん。 ――ラジア", "language": "Japanese", "multiverseId": 112533, "name": "光り輝く炎", "text": "光輝 ― クリーチャー１体を対象とする。光り輝く炎は、それ、およびそれと共通の色を持つ他の各クリーチャーにそれぞれＸ点のダメージを与える。 あなたはこれにより与えたダメージに等しい点数のライフを得る。", "type": "ソーサリー"}, {"flavorText": "\"A pira dos descrentes iluminará o nosso caminho.\" —Razia", "language": "Portuguese (Brazil)", "multiverseId": 112839, "name": "Chama de Luz", "text": "Radiação Chama de Luz causa X pontos de dano à criatura alvo e a cada outra criatura que compartilhe uma cor com ela. Você ganha uma quantidade de pontos de vida igual ao dano causado desta maneira.", "type": "Feitiço"}, {"flavorText": "\"Пусть наш путь освещают костры, на которых горят неверующие\". —Разия", "language": "Russian", "multiverseId": 114247, "name": "Яркое пламя", "text": "Сияние — Яркое пламя наносит Х повреждений целевому существу и всем остальным существам того же цвета. Вы получаете столько пунктов жизни, сколько нанесено повреждений.", "type": "Волшебство"}, {"flavorText": "「异教徒之葬火将照亮我们的路。」 ～拉基雅", "language": "Chinese Simplified", "multiverseId": 111309, "name": "眩目烈焰", "text": "辉耀～眩目烈焰对目标生物和每个与该生物有共通颜色的其它生物造成X点伤害。 你获得等同于以此法所造成的伤害之生命。", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "118672", "cardKingdomId": "118381", "cardsphereId": "37905", "mcmId": "13319", "mcmMetaId": "7897", "mtgjsonV4Id": "3b86f6e1-63c7-501e-a738-1f3412296ed3", "mtgoFoilId": "23459", "mtgoId": "23458", "multiverseId": "89068", "scryfallId": "9a3acf27-5d07-48e6-8e19-a2e6d4cd49d1", "scryfallIllustrationId": "827848ec-0be4-4959-9ad7-3ded2b1772f9", "scryfallOracleId": "6473eac1-6786-47dd-8124-9f1c4b790ddf", "tcgplayerProductId": "13216"}, "keywords": ["Radiance"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{X}{R}{R}{W}{W}", "manaValue": 4.0, "name": "Brightflame", "number": "194", "originalText": "Radiance Brightflame deals X damage to target creature and each other creature that shares a color with it. You gain life equal to the damage dealt this way.", "originalType": "Sorcery", "printings": ["GK1", "RAV"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/fad8fc2036b76855", "cardKingdomFoil": "https://mtgjson.com/links/c4165d0525b16159", "cardmarket": "https://mtgjson.com/links/ccd5c3f38a350de2", "tcgplayer": "https://mtgjson.com/links/6429169b6b98a3ff"}, "rarity": "rare", "rulings": [{"date": "2005-10-01", "text": "You gain life equal to the total damage dealt by Brightflame to all creatures. You don’t gain life for any damage that was prevented."}, {"date": "2005-10-01", "text": "All creatures that share a color are affected, even your own."}, {"date": "2005-10-01", "text": "A creature “shares a color” with any creature that is at least one of its colors. For example, a green-white creature shares a color with creatures that are green, white, green-white, red-white, black-green, and so on."}, {"date": "2005-10-01", "text": "If it targets a colorless creature, it doesn’t affect any other creatures. A colorless creature shares a color with nothing, not even other colorless creatures."}, {"date": "2005-10-01", "text": "You check which creatures share a color with the target when the spell resolves."}, {"date": "2005-10-01", "text": "Only one creature is targeted. If that creature leaves the battlefield or otherwise becomes an illegal target, the entire spell doesn’t resolve. No other creatures are affected."}], "setCode": "RAV", "subtypes": [], "supertypes": [], "text": "Radiance — Brightflame deals X damage to target creature and each other creature that shares a color with it. You gain life equal to the damage dealt this way.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "d031d813-2876-56d6-a4f8-2b01220c95ab", "watermark": "boros"}