{"artist": "Mark Poole", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G", "U"], "colors": ["G", "U"], "convertedManaCost": 5.0, "edhrecRank": 3013, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "bea33daf-486b-51cc-8b0f-3a5cefae1646", "mtgoId": "102309", "scryfallId": "d4661ab0-9541-4a45-9da5-b4b8fb9ca06c", "scryfallIllustrationId": "a010781d-e6d8-410d-b465-1cadc3ba76c6", "scryfallOracleId": "67183256-23cc-4af5-991e-d7148e942c63"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Converge"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{G}{U}", "manaValue": 5.0, "name": "Bring to Light", "number": "102309", "originalReleaseDate": "2022-07-08", "printings": ["2X2", "BFZ", "PBFZ", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2015-08-25", "text": "If you cast an instant or sorcery card this way, it goes to your graveyard as normal. It doesn’t return to exile."}, {"date": "2015-08-25", "text": "If you cast the exiled card, you do so as part of the resolution of Bring to Light. You can’t wait to cast it later in the turn. Timing restrictions based on the card’s type are ignored, but other restrictions (such as “Cast [this card] only during combat”) are not."}, {"date": "2015-08-25", "text": "If you cast a card “without paying its mana cost,” you can’t choose to cast it for any alternative costs, such as awaken costs. You can, however, pay additional costs, such as kicker costs. If the card has any mandatory additional costs, you must pay those to cast the card."}, {"date": "2015-08-25", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X."}, {"date": "2015-08-25", "text": "If you don’t cast the card, it remains exiled."}, {"date": "2015-08-25", "text": "The maximum number of colors of mana you can spend to cast a spell is five. Colorless is not a color. Note that the cost of a spell with converge may limit how many colors of mana you can spend."}, {"date": "2015-08-25", "text": "Unless a spell or ability allows you to, you can’t choose to pay more mana for a spell with a converge ability just to spend more colors of mana. Likewise, if a spell or ability reduces the amount of mana it costs you to cast a spell with converge, you can’t ignore that cost reduction in order to spend more colors of mana."}, {"date": "2015-08-25", "text": "If there are any alternative or additional costs to cast a spell with a converge ability, the mana spent to pay those costs will count. For example, if an effect makes sorcery spells cost {1} more to cast, you could pay {W}{U}{B}{R} to cast Radiant Flames and deal 4 damage to each creature."}, {"date": "2015-08-25", "text": "If you cast a spell with converge without spending any mana to cast it (perhaps because an effect allowed you to cast it without paying its mana cost), then the number of colors spent to cast it will be zero."}, {"date": "2015-08-25", "text": "If a spell with a converge ability is copied, no mana was spent to cast the copy, so the number of colors of mana spent to cast the spell will be zero. The number of colors spent to cast the original spell is not copied."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Converge — Search your library for a creature, instant, or sorcery card with mana value less than or equal to the number of colors of mana spent to cast this spell, exile that card, then shuffle. You may cast that card without paying its mana cost.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "1fc3e905-35f9-5542-b5d8-3d409253d44b"}