{"artist": "Mathias Kollros", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 4.0, "edhrecRank": 8430, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "266230", "cardsphereId": "94129", "mtgjsonV4Id": "0c2b0a91-d045-5bea-9fa5-4455e201a2e7", "scryfallId": "9a4bf3cd-6348-4bac-b863-ee4b835c006d", "scryfallIllustrationId": "e1167a1c-4f69-4940-a389-0093da602486", "scryfallOracleId": "e3a73311-25f7-4bd7-af1d-ab7b83ad01f2", "tcgplayerProductId": "285838"}, "isAlternative": true, "isStarter": true, "keywords": ["Brood Telepathy", "Ravenous"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{X}{3}{G}", "manaValue": 4.0, "name": "Broodlord", "number": "89★", "power": "3", "printings": ["40K"], "promoTypes": ["surgefoil"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/254f59dad4b65c9d", "tcgplayer": "https://mtgjson.com/links/57a5ef89ffdc6541"}, "rarity": "rare", "rulings": [{"date": "2022-10-07", "text": "You choose how many targets Broodlord’s triggered ability has and how the counters are distributed as you put the ability onto the stack. Each target must receive at least one counter."}, {"date": "2022-10-07", "text": "If some of the creatures are illegal targets as Broodlord’s triggered ability tries to resolve, the original distribution of counters still applies and the counters that would have been put on the illegal targets are lost. They won’t be put instead on a legal target."}, {"date": "2022-10-07", "text": "A creature with ravenous gets its counters as it enters the battlefield. It doesn’t enter the battlefield first and then get its counters. Any triggered ability that looks for a creature with a certain power or toughness entering the battlefield will see the counters when it checks to see if it should trigger."}, {"date": "2022-10-07", "text": "The triggered ability that checks to see if X is 5 or greater refers to the value of X that was chosen as the spell was cast, which may be different from the number of counters it entered with if there are replacement effects involved. This is also true for any other ability that it has which refers to X and triggers when it enters the battlefield."}, {"date": "2022-10-07", "text": "If another permanent enters the battlefield as a copy of a creature with Ravenous, it will not enter with any counters from the ravenous ability."}, {"date": "2022-10-07", "text": "If a permanent spell with ravenous is copied, the copy will have the same value for X, and the token permanent that the spell becomes as it enters the battlefield will enter with X counters."}], "securityStamp": "triangle", "setCode": "40K", "subtypes": ["Tyranid"], "supertypes": [], "text": "Ravenous (This creature enters the battlefield with X +1/+1 counters on it. If X is 5 or more, draw a card when it enters.)\nBrood Telepathy — When Broodlord enters the battlefield, distribute X +1/+1 counters among any number of other target creatures you control.", "toughness": "3", "type": "Creature — Tyranid", "types": ["Creature"], "uuid": "2f9f2663-17df-548d-ac5a-d78d4152fc94", "variations": ["aa485c2b-1f80-5f44-adaf-5497a1a61c7a"]}