{"artist": "Karl Kopinski", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R", "W"], "colorIndicator": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 9584, "faceConvertedManaCost": 0.0, "faceManaValue": 0.0, "faceName": "Moonrage Brute", "finishes": ["foil"], "foreignData": [], "frameEffects": ["sunmoondfc"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardsphereId": "81818", "mcmId": "575677", "mtgjsonV4Id": "360259fb-e45f-56f0-875e-6994063cf238", "scryfallId": "449d53ab-5e75-4370-a16a-5b03b0c16cc7", "scryfallIllustrationId": "8950ccc2-cc67-4ea7-a99d-44e0c17274d5", "scryfallOracleId": "1ed2d8e0-462b-468e-8fd3-1f3c6d99fb8a", "tcgplayerProductId": "249413"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["First strike", "Nightbound", "Ward"], "language": "English", "layout": "transform", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaValue": 3.0, "name": "Brutal Cathar // Moonrage Brute", "number": "7s", "otherFaceIds": ["fcfd9986-ad46-5824-93ee-27ad00d62219"], "power": "3", "printings": ["DBL", "MID", "PMID"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {"tcgplayer": "https://mtgjson.com/links/d7974ca6aaa303c9"}, "rarity": "rare", "rulings": [{"date": "2021-09-24", "text": "Brutal Cathar's ability creates two one-shot effects: one that exiles the creature when the ability resolves, and another that returns the exiled card to the battlefield immediately after Brutal Cathar (or Moonrage Brute) leaves the battlefield."}, {"date": "2021-09-24", "text": "If Brutal Cathar leaves the battlefield before its enters-the-battlefield/transforms-into ability resolves, the target creature won't be exiled."}, {"date": "2021-09-24", "text": "A transforming permanent doesn't leave the battlefield as it transforms. If Brutal Cathar transforms into Moonrage Brute, the exiled cards remain exiled. If it transforms with its triggered ability on the stack, that ability will still exile the target creature."}, {"date": "2021-09-24", "text": "Auras attached to the exiled creature will be put into their owners' graveyards. Equipment attached to the exiled creature will become unattached and remain on the battlefield. Any counters on the exiled creature will cease to exist."}, {"date": "2021-09-24", "text": "If a creature token is exiled, it ceases to exist. It won't be returned to the battlefield."}, {"date": "2021-09-24", "text": "The exiled card returns to the battlefield immediately after this creature leaves the battlefield. Nothing happens between the two events, including state-based actions. The two creatures aren't on the battlefield at the same time. For example, if the returning creature is a Clone, it can't enter the battlefield as a copy of Brutal Cathar or Moonrage Brute."}, {"date": "2021-09-24", "text": "In a multiplayer game, if Brutal Cathar's owner leaves the game, the exiled card will return to the battlefield. Because the one-shot effect that returns the card isn't an ability that goes on the stack, it won't cease to exist along with the leaving player's spells and abilities on the stack."}, {"date": "2021-09-24", "text": "Day and night are designations that the game itself can have. The game starts as neither. Once the game becomes day (or less commonly, night), the game will be exactly one of them—day or night—going back and forth for the rest of the game."}, {"date": "2021-09-24", "text": "Before a player untaps their permanents during the untap step, the game checks to see if the day/night designation should change."}, {"date": "2021-09-24", "text": "If it is day, and the active player of the previous turn cast no spells during their turn, it becomes night."}, {"date": "2021-09-24", "text": "If it is night, and the active player of the previous turn cast two or more spells during their turn, it becomes day."}, {"date": "2021-09-24", "text": "For more information about Day and Night and the Daybound and Nightbound abilities, please see the Innistrad: Midnight Hunt Mechanics atricle (https://magic.wizards.com/en/articles/archive/feature/innistrad-midnight-hunt-mechanics-2021-09-02)."}, {"date": "2021-09-24", "text": "Double-faced permanents with daybound transform to their nightbound faces as it becomes night. Similarly, double-faced permanents with nightbound transform to their daybound faces as it becomes day. This happens immediately and is not a state-based action. It happens any time it becomes day or night, not just during the untap step."}, {"date": "2021-09-24", "text": "If you cast a spell with daybound during night, that spell will be front face up (that is, daybound face up) on the stack. However, it will enter the battlefield with its back face up (that is, with its nightbound face up). It won't enter with its daybound face up and then transform."}, {"date": "2021-09-24", "text": "If it is night, permanents with daybound that enter the battlefield without being cast will enter with their nightbound faces up."}, {"date": "2021-09-24", "text": "Permanents with daybound and nightbound can't transform via any means other than their daybound and nightbound abilities. Notably, older cards such as Moonmist that instruct a player to transform permanents don't affect permanents with daybound or nightbound."}, {"date": "2021-09-24", "text": "If it's neither day nor night, and a creature with daybound and a creature with nightbound somehow appear on the battlefield at the same time, it becomes day. The creature with nightbound will transform."}, {"date": "2021-09-24", "text": "Moonrage Brute leaving the battlefield will also cause the exiled card to return to the battlefield."}], "securityStamp": "oval", "setCode": "PMID", "side": "b", "subtypes": ["Werewolf"], "supertypes": [], "text": "First strike\nWard—Pay 3 life.\nNightbound (If a player casts at least two spells during their own turn, it becomes day next turn.)", "toughness": "3", "type": "Creature — Werewolf", "types": ["Creature"], "uuid": "6751be8c-afca-5433-aab3-671e2b68deca"}