{"artist": "Karl Kopinski", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 11372, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 399311, "name": "Kalkulierte Zurückweisung", "text": "Neutralisiere einen Zauberspruch deiner Wahl, falls sein Beherrscher nicht {3} bezahlt.Zauberkunst — Falls sich zwei oder mehr Spontanzauber- und/oder Hexerei-Karten in deinem Friedhof befinden, wende Hellsicht 2 an. (Betrachte für Hellsicht 2 die obersten zwei Karten deiner Bibliothek und lege dann eine beliebige Anzahl davon unter deine Bibliothek und den Rest in beliebiger Reihenfolge oben darauf.)", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 401250, "name": "Anulación calculada", "text": "Contrarresta el hechizo objetivo a menos que su controlador pague {3}.Dominio de hechizos — Si hay dos o más cartas de instantáneo y/o de conjuro en tu cementerio, adivina 2. (Para adivinar 2, mira las dos primeras cartas de tu biblioteca, luego pon cualquier cantidad de ellas en el fondo de tu biblioteca y el resto en la parte superior en cualquier orden.)", "type": "Instantáneo"}, {"language": "French", "multiverseId": 399588, "name": "Rejet calculé", "text": "Contrecarrez le sort ciblé à moins que son contrôleur ne paie {3}.Maîtrise de sort — S'il y a au moins deux cartes d'éphémère et/ou de rituel dans votre cimetière, regard 2. (Pour appliquer regard 2, regardez les deux cartes du dessus de votre bibliothèque. Mettez n'importe quel nombre d'entre elles au-dessous de votre bibliothèque et le reste au-dessus, dans n'importe quel ordre.)", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 399865, "name": "Annullamento Premeditato", "text": "Neutralizza una magia bersaglio a meno che il suo controllore non paghi {3}.Arte magica — Se nel tuo cimitero ci sono due o più carte istantaneo e/o stregoneria, profetizza 2. (Per profetizzare 2, guarda le prime due carte del tuo grimorio, poi mettine un qualsiasi numero in fondo al tuo grimorio e le altre in cima in qualsiasi ordine.)", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 400142, "name": "計算された放逐", "text": "呪文１つを対象とする。それのコントローラーが{3}を支払わないかぎり、それを打ち消す。魔巧 ― あなたの墓地にインスタント・カードやソーサリー・カードが合わせて２枚以上あるなら、占術２を行う。（占術２を行うには、あなたのライブラリーの一番上から２枚のカードを見て、そのうちの望む枚数のカードを望む順番であなたのライブラリーの一番下に置き、残りを望む順番で一番上に置く。）", "type": "インスタント"}, {"language": "Korean", "multiverseId": 400419, "name": "계산된 일축", "text": "주문을 목표로 정한다. 그 주문의 조종자가 {3}을 지불하지 않으면 그 주문을 무효화한다.주문 숙련 — 당신의 무덤에 집중마법 그리고/또는 순간마법 카드가 두 장 이상 있다면, 점술 2를 한다. (점술 2를 하려면 당신의 서고 맨 위의 카드 두 장을 본다. 당신은 그 카드들 중 원하는 만큼을 당신의 서고 맨 밑에 놓고 나머지를 당신의 서고 맨 위에 원하는 순서대로 놓을 수 있다.)", "type": "순간마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 400696, "name": "Dispensa Calculada", "text": "Anule a mágica alvo, a menos que seu controlador pague {3}.Maestria em magia — Se houver dois ou mais cards de mágica instantânea ou feitiço no seu cemitério, use vidência 2. (Para usar vidência 2, olhe os dois cards do topo do seu grimório. Depois, coloque qualquer número deles no fundo do seu grimório e o restante no topo em qualquer ordem.)", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 400973, "name": "Просчитанный Отказ", "text": "Отмените целевое заклинание, если только контролирующий его игрок не заплатит {3}.Мастерство заклинаний — Если на вашем кладбище есть не менее двух карт мгновенных заклинаний и (или) волшебства, предскажите 2. (Чтобы предсказать 2, посмотрите две верхние карты вашей библиотеки, затем положите любое количество из них в низ вашей библиотеки, а остальные на верх вашей библиотеки в любом порядке.)", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 398757, "name": "精心驱散", "text": "除非目标咒语的操控者支付{3}，否则反击之。精熟咒语～如果你坟墓场中有两张或更多的瞬间和／或法术牌，则占卜2。（占卜2的流程是检视你牌库顶的两张牌，然后将其中任意数量的牌以任意顺序置于你牌库底，其余则以任意顺序置于你牌库顶。）", "type": "瞬间"}, {"language": "Chinese Traditional", "multiverseId": 399034, "name": "精心驅散", "text": "除非目標咒語的操控者支付{3}，否則反擊之。精熟咒語～如果你墳墓場中有兩張或更多的瞬間和／或巫術牌，則占卜2。（占卜2的流程是檢視你牌庫頂的兩張牌，然後將其中任意數量的牌以任意順序置於你牌庫底，其餘則以任意順序置於你牌庫頂。）", "type": "瞬間"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "202140", "cardKingdomId": "201855", "cardsphereId": "28900", "mcmId": "283586", "mcmMetaId": "220301", "mtgjsonV4Id": "f7b7d10c-b585-5ebe-8be1-34c358a82644", "mtgoFoilId": "57893", "mtgoId": "57892", "multiverseId": "398480", "scryfallId": "2c42ab35-6050-42b2-9c3c-3252f2e69442", "scryfallIllustrationId": "b1e8dc33-1034-4d64-b784-de568ad3ae2f", "scryfallOracleId": "d8e63065-9ebc-419d-b7af-5867fd81edff", "tcgplayerProductId": "100355"}, "keywords": ["Scry", "Spell mastery"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}", "manaValue": 3.0, "name": "Calculated Dismissal", "number": "48", "originalText": "Counter target spell unless its controller pays {3}.\nSpell mastery — If there are two or more instant and/or sorcery cards in your graveyard, scry 2. (To scry 2, look at the top two cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)", "originalType": "Instant", "printings": ["MB1", "ORI"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ad5219e5541e7315", "cardKingdomFoil": "https://mtgjson.com/links/1ea7df7256348aea", "cardmarket": "https://mtgjson.com/links/e8796146e7b7866a", "tcgplayer": "https://mtgjson.com/links/980fccdeae8b1ee5"}, "rarity": "common", "rulings": [{"date": "2015-06-22", "text": "If the spell mastery ability applies, you’ll scry 2 even if the controller of the spell pays {3}."}, {"date": "2015-06-22", "text": "In one unusual situation, you can cast Calculated Dismissal targeting an instant or sorcery spell you control while there is one instant or sorcery card in your graveyard. In this situation, if you decline to pay {3}, the spell will be countered and put into your graveyard. The spell mastery ability will then apply and you’ll scry 2."}, {"date": "2015-06-22", "text": "Check to see if there are two or more instant and/or sorcery cards in your graveyard as the spell resolves to determine whether the spell mastery ability applies. The spell itself won’t count because it’s still on the stack as you make this check."}], "setCode": "ORI", "subtypes": [], "supertypes": [], "text": "Counter target spell unless its controller pays {3}.\nSpell mastery — If there are two or more instant and/or sorcery cards in your graveyard, scry 2. (To scry 2, look at the top two cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)", "type": "Instant", "types": ["Instant"], "uuid": "696723b9-a62d-5020-a08a-c774095472b6"}