{"artist": "Evan Shipard", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 12680, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "35274a37-ee74-55ae-aee6-f08b350bd088", "mtgoId": "91289", "scryfallId": "74811f08-09b4-4504-9e13-af80ef74f2ae", "scryfallIllustrationId": "e810345e-3f94-4fd9-8451-9bea8bbd4248", "scryfallOracleId": "d9f5fc77-40df-4872-b633-6bf5a22a8831"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Flashback"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}", "manaValue": 3.0, "name": "Calibrated Blast", "number": "91289", "originalReleaseDate": "2021-06-19", "printings": ["MH2", "PMH2", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-06-18", "text": "Calibrated Blast goes on the stack without a target. When you reveal a nonland card during its resolution, its reflexive triggered ability triggers and you pick a target to be dealt damage. You'll know the mana value of the revealed nonland card and how much damage will be dealt."}, {"date": "2021-06-18", "text": "The nonland card revealed this way ends up on the bottom of the library with the other cards."}, {"date": "2021-06-18", "text": "“Flashback [cost]” means “You may cast this card from your graveyard by paying [cost] rather than paying its mana cost” and “If the flashback cost was paid, exile this card instead of putting it anywhere else any time it would leave the stack.”"}, {"date": "2021-06-18", "text": "You must still follow any timing restrictions and permissions, including those based on the card's type. For instance, you can cast a sorcery using flashback only when you could normally cast a sorcery."}, {"date": "2021-06-18", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a flashback cost) you're paying, add any cost increases, then apply any cost reductions. The mana value of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2021-06-18", "text": "A spell cast using flashback will always be exiled afterward, whether it resolves, is countered, or leaves the stack in some other way."}, {"date": "2021-06-18", "text": "You can cast a spell using flashback even if it was somehow put into your graveyard without having been cast."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Reveal cards from the top of your library until you reveal a nonland card. Put the revealed cards on the bottom of your library in a random order. When you reveal a nonland card this way, Calibrated Blast deals damage equal to that card's mana value to any target.\nFlashback {3}{R}{R} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", "type": "Instant", "types": ["Instant"], "uuid": "09562095-f7ee-5f68-a519-fe2c93898ddd"}