{"artist": "Randy Gallegos", "availability": ["mtgo"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 2.0, "edhrecRank": 22352, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "a6c9fa48-d6af-537c-8b12-f16706fb513c", "mtgoFoilId": "33659", "mtgoId": "33658", "multiverseId": "201147", "scryfallId": "1a772cac-c853-4621-a61f-a9b06f2e2dec", "scryfallIllustrationId": "a8eb66c9-f083-410a-9516-51f170f8e1ce", "scryfallOracleId": "72eaaa73-3263-46e9-aa86-5862d3aed20a"}, "isOnlineOnly": true, "isReprint": true, "isReserved": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "penny": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}", "manaValue": 2.0, "name": "Call to Arms", "number": "4", "originalText": "As Call to Arms enters the battlefield, choose a color and an opponent.\nWhite creatures get +1/+1.\nWhen the chosen color isn't the most common color among permanents the chosen player controls, sacrifice Call to Arms.", "originalType": "Enchantment", "printings": ["ICE", "ME3"], "purchaseUrls": {}, "rarity": "uncommon", "rulings": [{"date": "2004-10-04", "text": "You can’t choose “colorless” as a color."}, {"date": "2009-10-01", "text": "Call to Arms affects all white creatures, not just white creatures you control."}, {"date": "2009-10-01", "text": "If Call to Arms changes controllers, it will continue to check the nontoken permanents controlled by the player chosen as it entered the battlefield, even if that player isn’t an opponent of its current controller."}, {"date": "2009-10-01", "text": "The game continually counts the number of nontoken permanents of each color the chosen player controls. Multicolored ones are counted for each of their colors; colorless ones are ignored. The moment the number of nontoken permanents of the chosen color that player controls is less than or equal to the number of permanents of one of the other colors that player controls, Call to Arms’s second ability stops giving white creatures +1/+1 and its third ability triggers. Call to Arms will be sacrificed when the third ability resolves, even if those numbers have changed by then."}, {"date": "2009-10-01", "text": "Call to Arms’s third ability is a “state trigger.” Once a state trigger triggers, it won’t trigger again as long as the ability is on the stack. If the ability is countered and the trigger condition is still true, it will immediately trigger again."}], "setCode": "ME3", "subtypes": [], "supertypes": [], "text": "As Call to Arms enters the battlefield, choose a color and an opponent.\nWhite creatures get +1/+1 as long as the chosen color is the most common color among nontoken permanents the chosen player controls but isn't tied for most common.\nWhen the chosen color isn't the most common color among nontoken permanents the chosen player controls or is tied for most common, sacrifice Call to Arms.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "222e6f50-4dab-5226-b114-7a5991dd9c47"}