{"artist": "Bryan Sola", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B", "U"], "colors": ["B", "U"], "convertedManaCost": 6.0, "edhrecRank": 9935, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "266459", "cardsphereId": "94359", "mtgjsonV4Id": "ad1f8d69-b122-5925-a5c5-7b7e3e9243c5", "scryfallId": "595c08f6-d889-4b03-8f48-1f0fae1f29d2", "scryfallIllustrationId": "fd1fde98-f511-4719-bcfe-379a39e2a7bf", "scryfallOracleId": "4240dab9-ace7-490d-97c3-489a9fd52038", "tcgplayerProductId": "286596"}, "isAlternative": true, "keywords": ["Flash", "Polymorphine"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U}{B}", "manaValue": 6.0, "name": "Callidus Assassin", "number": "109★", "power": "3", "printings": ["40K"], "promoTypes": ["surgefoil"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/6d921c7b56078cfd", "tcgplayer": "https://mtgjson.com/links/048c6efaa3e35051"}, "rarity": "rare", "rulings": [{"date": "2022-10-07", "text": "Callidus Assassin copies exactly what was printed on the original creature (unless that creature is copying something else or is a token; see below) and it has the triggered ability. It doesn’t copy whether that creature is tapped or untapped, whether it has any counters on it or any Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, or so on."}, {"date": "2022-10-07", "text": "The triggered ability that Callidus Assassin has is part of its copy effect and is a copiable value that other effects may copy."}, {"date": "2022-10-07", "text": "If the chosen creature is copying something else (for example, if the chosen creature is another Callidus Assassin), then your Callidus Assassin enters the battlefield as whatever the chosen creature copied."}, {"date": "2022-10-07", "text": "If the chosen creature is a token, Callidus Assassin copies the original characteristics of that token as stated by the effect that created the token. Callidus Assassin is not a token in this case."}, {"date": "2022-10-07", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when Callidus Assassin enters the battlefield. You get to choose the order of those abilities and the triggered ability it has due to its copy effect. Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities of the chosen creature will also work."}, {"date": "2022-10-07", "text": "If Callidus Assassin somehow enters the battlefield at the same time as another creature, Callidus Assassin can’t become a copy of that creature. You may choose only a creature that’s already on the battlefield."}, {"date": "2022-10-07", "text": "You can choose not to copy anything. In that case, Callidus Assassin enters the battlefield as a 3/3 creature. Notably, it does not have “When this creature enters the battlefield, destroy up to one other target creature with the same name as this creature.”"}], "securityStamp": "triangle", "setCode": "40K", "subtypes": ["Human", "Shapeshifter", "Assassin"], "supertypes": [], "text": "Flash\nPolymorphine — You may have Callidus Assassin enter the battlefield tapped as a copy of any creature on the battlefield, except it has \"When this creature enters the battlefield, destroy up to one other target creature with the same name as this creature.\"", "toughness": "3", "type": "Creature — Human Shapeshifter Assassin", "types": ["Creature"], "uuid": "c2470b1c-5c04-52a3-9cdb-502360df09c8", "variations": ["e08cd869-99f6-53e5-bcf6-640821a9475e"]}