{"artist": "Adam Paquette", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "U"], "colors": ["B", "U"], "convertedManaCost": 4.0, "edhrecRank": 10514, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2003", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "250648", "mcmId": "575982", "mcmMetaId": "207079", "mtgjsonV4Id": "d77cb64a-95df-567b-914b-3f25178d9b99", "scryfallId": "c39c19de-4463-420e-820a-3f1f173b0134", "scryfallIllustrationId": "9ad5a7d1-2e76-4e9d-a147-93ae59f8b5b0", "scryfallOracleId": "919d21ad-3d1e-4f80-8005-64e3f8bf64d1", "tcgplayerProductId": "248730"}, "isReprint": true, "keywords": ["Cipher"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{B}", "manaValue": 4.0, "name": "Call of the Nightwing", "number": "555", "originalReleaseDate": "2021-09-25", "printings": ["GK1", "GTC", "MB1", "PLIST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/83d6a9ea9cf7fd56", "cardmarket": "https://mtgjson.com/links/c455fbf0b5031e38", "tcgplayer": "https://mtgjson.com/links/5210d69e25cb869e"}, "rarity": "uncommon", "rulings": [{"date": "2013-01-24", "text": "You can exile Call of the Nightwing encoded on the Horror creature token it just created."}, {"date": "2013-04-15", "text": "If a creature with an encoded card deals combat damage to more than one player simultaneously (perhaps because some of the combat damage was redirected), the triggered ability will trigger once for each player it deals combat damage to. Each ability will create a copy of the exiled card and allow you to cast it."}, {"date": "2013-04-15", "text": "The spell with cipher is encoded on the creature as part of that spell’s resolution, just after the spell’s other effects. That card goes directly from the stack to exile. It never goes to the graveyard."}, {"date": "2013-04-15", "text": "You choose the creature as the spell resolves. The cipher ability doesn’t target that creature, although the spell with cipher may target that creature (or a different creature) because of its other abilities."}, {"date": "2013-04-15", "text": "If the spell with cipher doesn’t resolve, none of its effects will happen, including cipher. The card will go to its owner’s graveyard and won’t be encoded on a creature."}, {"date": "2013-04-15", "text": "If the creature leaves the battlefield, the exiled card will no longer be encoded on any creature. It will stay exiled."}, {"date": "2013-04-15", "text": "If you want to encode the card with cipher onto a noncreature permanent such as a Keyrune that can turn into a creature, that permanent has to be a creature before the spell with cipher starts resolving. You can choose only a creature to encode the card onto."}, {"date": "2013-04-15", "text": "The copy of the card with cipher is created in and cast from exile."}, {"date": "2013-04-15", "text": "You cast the copy of the card with cipher during the resolution of the triggered ability. Ignore timing restrictions based on the card’s type."}, {"date": "2013-04-15", "text": "If you choose not to cast the copy, or you can’t cast it (perhaps because there are no legal targets available), the copy will cease to exist the next time state-based actions are performed. You won’t get a chance to cast the copy at a later time."}, {"date": "2013-04-15", "text": "The exiled card with cipher grants a triggered ability to the creature it’s encoded on. If that creature loses that ability and subsequently deals combat damage to a player, the triggered ability won’t trigger. However, the exiled card will continue to be encoded on that creature."}, {"date": "2013-04-15", "text": "If another player gains control of the creature, that player will control the triggered ability. That player will create a copy of the encoded card and may cast it."}], "setCode": "PLIST", "subtypes": [], "supertypes": [], "text": "Create a 1/1 blue and black Horror creature token with flying.\nCipher (Then you may exile this spell card encoded on a creature you control. Whenever that creature deals combat damage to a player, its controller may cast a copy of the encoded card without paying its mana cost.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "cc8cf2a4-4b8f-5a54-98d7-009353ec5808", "watermark": "dimir"}