{"artist": "Kev Walker", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R", "U", "W"], "colors": ["W", "R"], "convertedManaCost": 9.0, "edhrecRank": 16206, "faceConvertedManaCost": 6.0, "faceManaValue": 6.0, "faceName": "Release", "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardsphereId": "13292", "mcmId": "261492", "mcmMetaId": "207911", "mtgjsonV4Id": "b8dc3622-89c8-5282-8ce0-062bc0b09a57", "mtgoId": "48512", "multiverseId": "368982", "scryfallId": "29968873-56f3-4528-ab0b-f11dd67dd162", "scryfallIllustrationId": "cc953d3c-7790-4cec-818a-1a112ad57a2e", "scryfallOracleId": "a7df5dc0-2564-4288-bc53-59affd896f79", "tcgplayerProductId": "67947"}, "keywords": ["Fuse"], "language": "English", "layout": "split", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{R}{W}", "manaValue": 9.0, "name": "Catch // Release", "number": "125", "originalText": "Each player sacrifices an artifact, a creature, an enchantment, a land, and a planeswalker.\n\nFuse (You may cast one or both halves of this card from your hand.)", "originalType": "Sorcery", "otherFaceIds": ["ed55a9ee-f1bb-5178-9259-3160b7c65c83"], "printings": ["DGM"], "purchaseUrls": {"cardmarket": "https://mtgjson.com/links/41678bda974b892f", "tcgplayer": "https://mtgjson.com/links/a270bef8b23cd742"}, "rarity": "rare", "rulings": [{"date": "2013-04-15", "text": "Catch can target any permanent, including one that’s untapped or one you already control."}, {"date": "2013-04-15", "text": "If a player names a card, the player may name either half of a split card, but not both. A split card has the chosen name if one of its two names matches the chosen name."}, {"date": "2013-04-15", "text": "If you cast Catch/Release as a fused split spell, you can sacrifice the permanent you just gained control of."}, {"date": "2013-04-15", "text": "If you’re casting a split card with fuse from any zone other than your hand, you can’t cast both halves. You’ll only be able to cast one half or the other."}, {"date": "2013-04-15", "text": "To cast a fused split spell, pay both of its mana costs. While the spell is on the stack, its mana value is the total amount of mana in both costs."}, {"date": "2013-04-15", "text": "You can choose the same object as the target of each half of a fused split spell, if appropriate."}, {"date": "2013-04-15", "text": "When resolving a fused split spell with multiple targets, treat it as you would any spell with multiple targets. If all targets are illegal when the spell tries to resolve, the spell doesn’t resolve and none of its effects happen. If at least one target is still legal at that time, the spell resolves, but an illegal target can’t perform any actions or have any actions performed on it."}, {"date": "2013-04-15", "text": "When a fused split spell resolves, follow the instructions of the left half first, then the instructions on the right half."}, {"date": "2013-04-15", "text": "On the stack, a split spell that hasn’t been fused has only that half’s characteristics and mana value. The other half is treated as though it didn’t exist."}, {"date": "2013-04-15", "text": "Some split cards with fuse have two monocolor halves of different colors. If such a card is cast as a fused split spell, the resulting spell is multicolored. If only one half is cast, the spell is the color of that half. While not on the stack, such a card is multicolored."}, {"date": "2013-04-15", "text": "Some split cards with fuse have two halves that are both multicolored. That card is multicolored no matter which half is cast, or if both halves are cast. It’s also multicolored while not on the stack."}, {"date": "2013-04-15", "text": "If you cast a split card with fuse from your hand without paying its mana cost, you can choose to use its fuse ability and cast both halves without paying their mana costs."}, {"date": "2013-04-15", "text": "To resolve Release, the active player chooses a permanent they control for each of the listed types, then each other player in turn order does the same, then all the chosen permanents are sacrificed simultaneously."}, {"date": "2013-04-15", "text": "If you control an artifact creature, a nonartifact creature, and no other artifacts or creatures, you must sacrifice both permanents. You must choose the artifact creature as the artifact and the nonartifact creature as the creature. The same is true for any combination of types—you sacrifice a number of permanents as close to five as possible."}], "setCode": "DGM", "side": "b", "subtypes": [], "supertypes": [], "text": "Each player sacrifices an artifact, a creature, an enchantment, a land, and a planeswalker.\nFuse (You may cast one or both halves of this card from your hand.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "44a70943-7e2e-5c3b-9453-5a085dced28f", "watermark": "izzet"}