{"artist": "Anna Steinbauer", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 5.0, "edhrecRank": 12428, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 473314, "name": "Geschenk des Kessels", "text": "Adamant — Falls drei oder mehr schwarze Mana ausgegeben wurden, um diesen Zauberspruch zu wirken, lege die obersten vier Karten deiner Bibliothek auf deinen Friedhof.\nDu kannst eine Kreaturenkarte in deinem Friedhof bestimmen. Falls du dies tust, bringe sie mit einer zusätzlichen +1/+1-Marke ins Spiel zurück.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 473583, "name": "Regalo del Caldero", "text": "Tesón — Si se usaron al menos tres manás negros para lanzar este hechizo, pon las cuatro primeras cartas de tu biblioteca en tu cementerio.\nPuedes elegir una carta de criatura en tu cementerio. Si lo haces, regrésala al campo de batalla con un contador +1/+1 adicional sobre ella.", "type": "Conjuro"}, {"language": "French", "multiverseId": 473852, "name": "Don du chaudron", "text": "Inflexible — Si au moins trois manas noirs ont été dépensés pour lancer ce sort, mettez les quatre cartes du dessus de votre bibliothèque dans votre cimetière.\nVous pouvez choisir une carte de créature dans votre cimetière. Si vous faites ainsi, renvoyez-la sur le champ de bataille avec un marqueur +1/+1 supplémentaire sur elle.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 474121, "name": "Dono del Calderone", "text": "Adamantino — Se sono stati spesi almeno tre mana neri per lanciare questa magia, metti nel tuo cimitero le prime quattro carte del tuo grimorio.\nPuoi scegliere una carta creatura nel tuo cimitero. Se lo fai, rimettila sul campo di battaglia con un segnalino +1/+1 addizionale.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 474390, "name": "大釜の贈り物", "text": "一徹 ― この呪文を唱えるために黒マナが３点以上支払われていたなら、あなたのライブラリーの一番上からカードを４枚あなたの墓地に置く。\nあなたはあなたの墓地にあるクリーチャー・カード１枚を選んでもよい。そうしたなら、それを＋１/＋１カウンターが追加で１個置かれた状態で戦場に戻す。", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 474659, "name": "가마솥의 선물", "text": "단호 — 이 주문을 발동하는 데 적어도 흑색 마나 세 개가 지불되었다면, 당신의 서고 맨 위 카드 네 장을 당신의 무덤에 넣는다.\n당신은 당신의 무덤에서 생물 카드 한 장을 선택할 수 있다. 그렇게 한다면, 그 카드를 +1/+1 카운터 한 개를 추가로 가진 채로 전장으로 되돌린다.", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 474928, "name": "Dádiva do Caldeirão", "text": "Obstinação — Se ao menos três manas pretos tiverem sido gastos para conjurar esta mágica, coloque os quatro cards do topo de seu grimório em seu cemitério.\nVocê pode escolher um card de criatura em seu cemitério. Se fizer isso, devolva-o ao campo de batalha com um marcador +1/+1 adicional.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 475197, "name": "Дар Котла", "text": "Твердость — Если на разыгрывание этого заклинания было потрачено три или больше черной маны, положите четыре верхние карты вашей библиотеки на ваше кладбище.\nВы можете выбрать карту существа на вашем кладбище. Если вы это делаете, верните ее на поле битвы с одним дополнительным жетоном +1/+1 на ней.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 475466, "name": "鼎镬赋礼", "text": "固色～如果施放此咒语时支付过至少三点黑色法术力，则将你牌库顶的四张牌置入你的坟墓场。\n你可以选择一张在你坟墓场中的生物牌。如果你如此作，则将它移回战场，且上面额外有一个+1/+1指示物。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 475735, "name": "鼎鑊賦禮", "text": "固色～如果施放此咒語時支付過至少三點黑色魔法力，則將你牌庫頂的四張牌置入你的墳墓場。\n你可以選擇一張在你墳墓場中的生物牌。如果你如此作，則將它移回戰場，且上面額外有一個+1/+1指示物。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "227902", "cardKingdomId": "227601", "cardsphereId": "62151", "mcmId": "401194", "mcmMetaId": "282264", "mtgArenaId": "70230", "mtgjsonV4Id": "80afd4ae-290a-5650-9b41-db5a05041fd0", "mtgoId": "78278", "multiverseId": "473045", "scryfallId": "5db19a94-1170-45a0-9f06-893bf58b7233", "scryfallIllustrationId": "7fa3fa36-3d32-41e1-b8e6-e4d713614de5", "scryfallOracleId": "152bbb62-195b-4de1-90c6-10dd953f8c4b", "tcgplayerProductId": "199278"}, "keywords": ["Adamant", "Mill"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{B}", "manaValue": 5.0, "name": "Cauldron's Gift", "number": "83", "originalText": "Adamant — If at least three black mana was spent to cast this spell, put the top four cards of your library into your graveyard.\nYou may choose a creature card in your graveyard. If you do, return it to the battlefield with an additional +1/+1 counter on it.", "originalType": "Sorcery", "printings": ["ELD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/f4f22b7b989b025e", "cardKingdomFoil": "https://mtgjson.com/links/036b42ecc43e011a", "cardmarket": "https://mtgjson.com/links/38a7a9404a37a412", "tcgplayer": "https://mtgjson.com/links/9f9347847cd5777f"}, "rarity": "uncommon", "rulings": [{"date": "2019-10-04", "text": "The creature card you return with Cauldron's Gift may be one that you just put into your graveyard with its adamant ability. This is because Cauldron's Gift doesn't target the card that you'll return."}, {"date": "2019-10-04", "text": "No player may take actions between the time you put cards into your graveyard, the time you choose a creature card to return, and the time you return that card to the battlefield."}, {"date": "2019-10-04", "text": "If the creature would enter the battlefield with no +1/+1 counters on it, it enters with one +1/+1 counter on it."}, {"date": "2019-10-04", "text": "If an instant or sorcery spell has an adamant ability, you perform the spell's instructions in order. You don't perform the adamant instruction before the spell resolves or before any other effects printed above it."}, {"date": "2019-10-04", "text": "If an effect allows you to cast a spell without paying its mana cost, you can't choose to cast it and pay unless another rule or effect allows you to cast that spell for a cost. Similarly, you can't waive a cost reduction unless that effect says you may."}, {"date": "2019-10-04", "text": "Adamant effects check what mana was actually spent to cast a spell. If an effect allows you to spend mana “as though it were mana” of any color or type, that allows you to spend mana you couldn't otherwise spend, but it doesn't change what mana you spent to cast the spell."}, {"date": "2019-10-04", "text": "If you copy a spell that has an adamant ability, no mana was spent to cast the copy at all, so that ability won't apply."}], "setCode": "ELD", "subtypes": [], "supertypes": [], "text": "Adamant — If at least three black mana was spent to cast this spell, mill four cards.\nYou may choose a creature card in your graveyard. If you do, return it to the battlefield with an additional +1/+1 counter on it.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "92e12af9-81f7-53c4-ab48-bcaa708da3d5"}