{"artist": "Brandon Kitkouski", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "W"], "colors": ["B", "W"], "convertedManaCost": 2.0, "edhrecRank": 9962, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 181612, "name": "Dämpfe aus dem Kessel", "text": "Bestimme eine beliebige Anzahl an Kreaturen deiner Wahl. Jede dieser Kreaturen erhält Beharrlichkeit bis zum Ende des Zuges. (Wenn sie aus dem Spiel auf einen Friedhof gelegt wird und keine -1/-1-Marke auf ihr lag, bringe sie mit einer -1/-1-Marke unter der Kontrolle ihres Besitzers ins Spiel zurück.)", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 180712, "name": "Bruma del caldero", "text": "Elige cualquier cantidad de criaturas objetivo. Cada una de esas criaturas gana la habilidad de persistir hasta el final del turno. (Cuando vaya a un cementerio desde el juego, si no tiene contadores -1/-1 sobre ella, regrésala al juego bajo el control de su propietario con un contador -1/-1.)", "type": "Instantáneo"}, {"language": "French", "multiverseId": 181792, "name": "Brume du chaudron", "text": "Choisissez n'importe quel nombre de créatures ciblées. Chacune de ces créatures acquiert la persistance jusqu'à la fin du tour. (Quand elle est mise dans un cimetière depuis le jeu, si elle n'avait pas de marqueurs -1/-1 sur elle, renvoyez-la en jeu sous le contrôle de son propriétaire avec un marqueur -1/-1 sur elle.)", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 181432, "name": "Foschia del Calderone", "text": "Scegli un qualsiasi numero di creature bersaglio. Ognuna di quelle creature ha persistere fino alla fine del turno. (Quando questa creatura viene messa in un cimitero dal gioco, se non aveva segnalini -1/-1, rimettila in gioco sotto il controllo del suo proprietario con un segnalino -1/-1.)", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 181072, "name": "大鍋のもや", "text": "望む数のクリーチャーを対象とする。 それらの各クリーチャーはターン終了時まで頑強を得る。 （それが場からいずれかの墓地に置かれたとき、それの上に－１/－１カウンターが置かれていない場合、それを－１/－１カウンターが１個置かれた状態でオーナーのコントロール下で場に戻す。）", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 181972, "name": "Nevoeiro do Caldeirão", "text": "Escolha um número qualquer de criaturas alvo. Cada uma dessas criaturas ganha persistir até o final do turno. (Quando for colocada num cemitério vinda do jogo, se ela não tiver nenhum marcador -1/-1, devolva-a para o jogo sob o controle de seu dono com um marcador -1/-1.)", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 181252, "name": "Пелена над Котлом", "text": "Выберите любое количество целевых существ. Каждое из тех существ получает Упорство до конца хода. (Когда оно попадает из игры на кладбище, если на нем не было жетонов -1/-1, верните его в игру под контролем его владельца с одним жетоном -1/-1 на нем.)", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 180892, "name": "鼎镬迷雾", "text": "选择任意数量的目标生物。 这些生物获得留存异能直到回合结束。 （当它从场上置入坟墓场时，若其上没有-1/-1指示物，则将它在其拥有者的操控下返回场上，且其上有一个-1/-1指示物。）", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "125390", "cardKingdomId": "125184", "cardsphereId": "16842", "mcmId": "19546", "mcmMetaId": "9934", "mtgjsonV4Id": "3f339b1a-8dbb-55e6-a74b-572e0061b78d", "mtgoFoilId": "29959", "mtgoId": "29958", "multiverseId": "151060", "scryfallId": "a8d0def7-42dd-46f4-8499-d79876783a39", "scryfallIllustrationId": "6c41588b-b460-4715-ab84-35b2de0accb9", "scryfallOracleId": "56309bbe-86aa-4003-a531-0ef1e318ba15", "tcgplayerProductId": "27081"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W/B}", "manaValue": 2.0, "name": "Cauldron Haze", "number": "84", "originalText": "Choose any number of target creatures. Each of those creatures gains persist until end of turn. (When it's put into a graveyard from play, if it had no -1/-1 counters on it, return it to play under its owner's control with a -1/-1 counter on it.)", "originalType": "Instant", "printings": ["EVE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/4bd5df003a6e8979", "cardKingdomFoil": "https://mtgjson.com/links/28ba4ed9845b2c4f", "cardmarket": "https://mtgjson.com/links/54cae2a5de8f7b61", "tcgplayer": "https://mtgjson.com/links/a6b4486360745607"}, "rarity": "uncommon", "rulings": [{"date": "2008-08-01", "text": "If a nontoken creature that gains persist this way is put into a graveyard, that card will be returned to the battlefield with a -1/-1 counter on it. However, because it’s a new object with no relation to its previous existence, that permanent will not have persist."}, {"date": "2008-08-01", "text": "If a creature has multiple instances of persist, the result is largely the same as having just one instance of persist. When the creature is put into a graveyard, each persist ability will trigger. The first one to resolve will return the creature to the battlefield with a -1/-1 counter on it. The rest will do nothing."}, {"date": "2013-06-07", "text": "The persist ability triggers when the permanent is put into a graveyard. Its last known information (that is, how the creature last existed on the battlefield) is used to determine whether it had a -1/-1 counter on it."}, {"date": "2013-06-07", "text": "When a permanent with persist returns to the battlefield, it’s a new object with no memory of or connection to its previous existence."}, {"date": "2013-06-07", "text": "If multiple creatures with persist are put into the graveyard at the same time (due to combat damage or a spell that destroys all creatures, for example), the active player (the player whose turn it is) puts all of their persist triggers on the stack in any order, then each other player in turn order does the same. The last trigger put on the stack is the first one that resolves. That means that in a two-player game, the nonactive player’s persist creatures will return to the battlefield first, then the active player’s persist creatures do the same. The creatures return to the battlefield one at a time."}, {"date": "2013-06-07", "text": "If a creature with persist that has +1/+1 counters on it receives enough -1/-1 counters to cause it to be destroyed by lethal damage or put into its owner’s graveyard for having 0 or less toughness, persist won’t trigger and the card won’t return to the battlefield. That’s because persist checks the creature’s existence just before it leaves the battlefield, and it still has all those counters on it at that point."}, {"date": "2013-06-07", "text": "If a permanent has multiple instances of persist, they’ll each trigger separately, but the redundant instances will have no effect. If one instance returns the card to the battlefield, the next to resolve will do nothing."}, {"date": "2013-06-07", "text": "If a creature with persist stops being a creature, persist will still work."}, {"date": "2013-06-07", "text": "If a token with no -1/-1 counters on it has persist, the ability will trigger when the token is put into the graveyard. However, the token will cease to exist and can’t return to the battlefield."}], "setCode": "EVE", "subtypes": [], "supertypes": [], "text": "Choose any number of target creatures. Each of those creatures gains persist until end of turn. (When it dies, if it had no -1/-1 counters on it, return it to the battlefield under its owner's control with a -1/-1 counter on it.)", "type": "Instant", "types": ["Instant"], "uuid": "53b0d15c-92cb-5678-8c94-0c5e12b98206"}