{"artist": "Marcela Medeiros", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 8431, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "262354", "cardsphereId": "88241", "mcmId": "662171", "mtgjsonV4Id": "0de83c30-1330-57fd-94ba-f3d5da75f4ad", "scryfallId": "e909fe36-e95c-4094-9029-a292a8fcf73a", "scryfallIllustrationId": "e76d2d2e-3c45-478d-91e2-2e0deec9e4ad", "scryfallOracleId": "e4d2dcbb-9910-482e-9e46-dfed2097509b", "tcgplayerProductId": "274483"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Trample"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}", "manaValue": 4.0, "name": "Caves of Chaos Adventurer", "number": "167s", "power": "5", "printings": ["CLB", "PCLB"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/d866d5a750dfbcc3", "tcgplayer": "https://mtgjson.com/links/f03e238f179165b5"}, "rarity": "rare", "rulings": [{"date": "2022-06-10", "text": "Caves of Chaos Adventurer's last ability checks to see if you've completed a dungeon at the time you exile a card. If you haven't completed a dungeon at that time, you can't cast it without paying its mana cost, even if you complete a dungeon later during the same turn."}, {"date": "2022-06-10", "text": "If you have completed a dungeon when Caves of Chaos Adventurer's last ability resolves, you can only play the exiled card without paying its mana cost. You can't choose to play it normally."}, {"date": "2022-06-10", "text": "The initiative is a designation a player can have. A player with the initiative designation is said to “have the initiative.” The initiative carries two inherent rules. First, whenever a player takes the initiative, and at the beginning of the upkeep of the player with the initiative, that player ventures into Undercity. Second, whenever one or more creatures a player controls deal combat damage to the player who has the initiative, the first player takes the initiative. Also, some abilities will refer to having the initiative and provide other benefits."}, {"date": "2022-06-10", "text": "There is no initiative in a game until an effect instructs a player to take the initiative. Once a player is instructed to do this, they have the initiative until another player takes the initiative."}, {"date": "2022-06-10", "text": "Only one player can have the initiative at a time. As one player takes the initiative, any other player that had the initiative ceases to have it."}, {"date": "2022-06-10", "text": "A player who currently has the initiative may take the initiative again. This causes that player to venture into Undercity again, but does not cause them to have multiple initiative designations."}, {"date": "2022-06-10", "text": "If the player with the initiative leaves the game, the active player takes the initiative at the same time that player leaves the game. If the active player is leaving the game or if there is no active player, the next player in turn order takes the initiative."}, {"date": "2022-06-10", "text": "In a Two-Headed Giant game, if both players on a team deal combat damage to the player that has the initiative at the same time, the player with the initiative will choose the order of the triggered abilities. Then, as those abilities resolve, one team member takes the initiative (and ventures into Undercity) and then the other team member does the same. The last player to take the initiative keeps it until the initiative changes again."}, {"date": "2022-06-10", "text": "You cannot venture into Undercity unless instructed to do so, either because you have the initiative at the beginning of your upkeep or because you take the initiative. Notably, if you aren’t in a dungeon and an effect instructs you to venture into the dungeon (not venture into Undercity), you can’t start Undercity."}, {"date": "2022-06-10", "text": "Similarly, when instructed to venture into Undercity, you can’t start a dungeon that isn’t Undercity."}, {"date": "2022-06-10", "text": "If you aren’t in a dungeon when instructed to venture into Undercity, you will put Undercity into the command zone and move your venture marker to Secret Entrance (the first room)."}, {"date": "2022-06-10", "text": "If you’re already in a dungeon when instructed to venture into Undercity, you move to the next room of that dungeon. If you are already in the last room, you will complete that dungeon and start Undercity. This is true whether you’re already in Undercity or any other dungeon."}], "securityStamp": "oval", "setCode": "PCLB", "subtypes": ["Human", "Barbarian"], "supertypes": [], "text": "Trample\nWhen Caves of Chaos Adventurer enters the battlefield, you take the initiative.\nWhenever Caves of Chaos Adventurer attacks, exile the top card of your library. If you've completed a dungeon, you may play that card this turn without paying its mana cost. Otherwise, you may play that card this turn.", "toughness": "3", "type": "Creature — Human Barbarian", "types": ["Creature"], "uuid": "abaff45f-3405-5d58-aca4-1a27030a0c56"}