{"artist": "Omar Rayyan", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "U"], "colors": ["B", "U"], "convertedManaCost": 3.0, "edhrecRank": 12176, "finishes": ["nonfoil", "foil"], "flavorText": "\"'Tis a strange creature indeed that chooses the vanquished over the victor.\"\n—Awylla, elvish safewright", "foreignData": [{"flavorText": "„Das ist schon eine seltsame Kreatur, die sich am Unterlegenen orientiert, nicht am Sieger.\" —Awylla, elfische Sichermacherin", "language": "German", "multiverseId": 174635, "name": "Friedhofsphooka", "text": "Immer wenn eine Kreatur aus dem Spiel auf einen Friedhof gelegt wird, kannst du {1} bezahlen. Falls du dies tust, wird der Friedhofsphooka zu einer Kopie dieser Kreatur und erhält diese Fähigkeit.", "type": "Kreatur — Gestaltwandler"}, {"flavorText": "\"Es una criatura muy extraña... prefiere al vencido sobre el vencedor.\" —Awylla, refugiante élfica", "language": "Spanish", "multiverseId": 172829, "name": "Puca del cementerio", "text": "Siempre que una criatura vaya a un cementerio desde el juego, puedes pagar {1}. Si lo haces, el Puca del cementerio es una copia de esa criatura y gana esta habilidad.", "type": "Criatura — Metamorfo"}, {"flavorText": "« C'est une bien étrange créature qui choisit le vaincu au lieu du vainqueur. » —Awylla, protecturge elfe", "language": "French", "multiverseId": 173431, "name": "Pucca de cimetière", "text": "À chaque fois qu'une créature est mise dans un cimetière depuis le jeu, vous pouvez payer {1}. Si vous faites ainsi, le Pucca de cimetière devient une copie de cette créature et acquiert cette capacité.", "type": "Créature : changeforme"}, {"flavorText": "\"'Davvero una strana creatura, preferisce lo sconfitto al vincitore.\" —Awylla, salvaincanti elfica", "language": "Italian", "multiverseId": 173732, "name": "Puca del Cimitero", "text": "Ogniqualvolta una creatura viene messa in un cimitero dal gioco, puoi pagare {1}. Se lo fai, il Puca del Cimitero diventa una copia di quella creatura e ha questa abilità.", "type": "Creatura — Polimorfo"}, {"flavorText": "「勝者に屠られるを選ぶは何と奇怪なる生き物か。」 ――エルフの守美者、アウィラ", "language": "Japanese", "multiverseId": 174033, "name": "墓地のプーカ", "text": "いずれかのクリーチャーが場からいずれかの墓地に置かれるたび、あなたは{1}を支払ってもよい。 そうした場合、墓地のプーカはそのクリーチャーのコピーになるとともにこの能力を得る。", "type": "クリーチャー — 多相の戦士"}, {"flavorText": "\"Só uma criatura muito estranha prefere o derrotado ao vencedor.\" — Awylla, pulcro-protetora élfica", "language": "Portuguese (Brazil)", "multiverseId": 172227, "name": "Puca de Cemitério", "text": "Toda vez que uma criatura é colocada num cemitério vinda do jogo, você pode pagar {1}. Se fizer isso, Puca de Cemitério se tornará uma cópia daquela criatura e ganhará esta habilidade.", "type": "Criatura — Metamorfo"}, {"flavorText": "«Это очень странное существо оно выбирает побежденных, а не победителя». — Авилла, эльфийская охранительница", "language": "Russian", "multiverseId": 172528, "name": "Кладбищенский Пука", "text": "Каждый раз, когда существо попадает на кладбище из игры, вы можете заплатить {1}. Если вы это делаете, Кладбищенский Пука становится копией того существа и получает эту способность.", "type": "Существо — Имитатор"}, {"flavorText": "「这真是个怪家伙，宁愿选败者而不选胜者。」 ～地精美境卫艾薇拉", "language": "Chinese Simplified", "multiverseId": 173130, "name": "墓地铺卡", "text": "每当一个生物从场上置入坟墓场时，你可以支付{1}。 如果你如此作，则墓地铺卡成为该生物的复制，并获得此异能。", "type": "生物～变形兽"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "124817", "cardKingdomId": "124531", "cardsphereId": "41061", "mcmId": "19172", "mcmMetaId": "9721", "mtgjsonV4Id": "5f17f381-f7b9-5eda-8961-769c048f2f25", "mtgoFoilId": "29838", "mtgoId": "29837", "multiverseId": "158767", "scryfallId": "eec3b06b-d8c5-459c-aae5-3e51059cfdf1", "scryfallIllustrationId": "acdf37ca-cbad-4e96-8c77-e20ca340b3ae", "scryfallOracleId": "7e93ea61-bc16-4d22-a5e5-e6ba0f7ae14f", "tcgplayerProductId": "18587"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U/B}{U/B}", "manaValue": 3.0, "name": "Cemetery Puca", "number": "158", "originalText": "Whenever a creature is put into a graveyard from play, you may pay {1}. If you do, Cemetery Puca becomes a copy of that creature and gains this ability.", "originalType": "Creature - Shapeshifter", "power": "1", "printings": ["SHM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1dccfc9e110daff1", "cardKingdomFoil": "https://mtgjson.com/links/e574d78f8d8a219b", "cardmarket": "https://mtgjson.com/links/925fb29887f4873a", "tcgplayer": "https://mtgjson.com/links/7d52e4325911ef4e"}, "rarity": "rare", "rulings": [{"date": "2008-05-01", "text": "This effect has no duration. If you use the ability, Cemetery Puca will remain a copy of the creature until it leaves the battlefield or you use the ability again. If it becomes a copy of a different creature card, the new copy will overwrite the old copy."}, {"date": "2008-05-01", "text": "Cemetery Puca copies the printed values of the creature, plus any copy effects that have been applied to it. It won’t copy other effects that have changed the creature’s power, toughness, types, color, or so on. It also won’t copy counters on the creature (it’ll just retain the counters it already has)."}, {"date": "2008-05-01", "text": "If Cemetery Puca becomes a copy of a token, it copies the original characteristics of that token as stated by the effect that put it onto the battlefield. It does not become a token."}, {"date": "2008-05-01", "text": "Cemetery Puca’s ability isn’t targeted. It can copy a creature with shroud or protection."}, {"date": "2008-05-01", "text": "If multiple creatures are put into their owners’ graveyards at the same time, Cemetery Puca’s ability will trigger once for each of those creatures. You choose the order that those abilities will resolve. It’s possible to pay {1}, have Cemetery Puca become a copy of something, activate an activated ability of that creature, then pay {1} again, for example. It will end up a copy of the last creature card paid for."}], "setCode": "SHM", "subtypes": ["Shapeshifter"], "supertypes": [], "text": "Whenever a creature dies, you may pay {1}. If you do, Cemetery Puca becomes a copy of that creature, except it has this ability.", "toughness": "2", "type": "Creature — Shapeshifter", "types": ["Creature"], "uuid": "1e400076-578c-545e-810d-1a342552c429"}