{"artist": "Kev Walker", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 16079, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 231130, "name": "Gehirnausbruch", "text": "Ein Gegner deiner Wahl zeigt die oberste Karte seiner Bibliothek offen vor. Der Gehirnausbruch fügt diesem Spieler und allen Kreaturen, die er kontrolliert, so viele Schadenspunkte zu, wie die umgewandelten Manakosten der vorgezeigten Karte betragen. Falls auf diese Weise ein Land vorgezeigt wird, bringe den Gehirnausbruch auf die Hand seines Besitzers zurück.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 232624, "name": "Erupción cerebral", "text": "El oponente objetivo muestra la primera carta de su biblioteca. La Erupción cerebral hace daño igual al coste de maná convertido de la carta mostrada a ese jugador y a cada criatura que controla. Si se muestra una carta de tierra de esta manera, regresa la Erupción cerebral a la mano de su propietario.", "type": "Conjuro"}, {"language": "French", "multiverseId": 231877, "name": "Éruption cérébrale", "text": "L'adversaire ciblé révèle la carte du dessus de sa bibliothèque. L'Éruption cérébrale inflige un nombre de blessures égal au coût converti de mana de la carte révélée à ce joueur et à chaque créature qu'il contrôle. Si une carte de terrain est révélée de cette manière, renvoyez l'Éruption cérébrale dans la main de son propriétaire.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 232873, "name": "Eruzione Cerebrale", "text": "Un avversario bersaglio rivela la prima carta del suo grimorio. L'Eruzione Cerebrale infligge danno pari al costo di mana convertito della carta rivelata a quel giocatore e a ogni creatura che controlla. Se una carta terra viene rivelata in questo modo, fai tornare l'Eruzione Cerebrale in mano al suo proprietario.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 231628, "name": "知性の爆発", "text": "対戦相手１人を対象とする。そのプレイヤーは自分のライブラリーの一番上のカードを公開する。 知性の爆発はそのプレイヤーとそのプレイヤーがコントロールする各クリーチャーに、その公開されたカードの点数で見たマナ・コストに等しい点数のダメージを与える。 これにより土地カードが公開された場合、知性の爆発をオーナーの手札に戻す。", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 230881, "name": "Erupção Cerebral", "text": "O oponente alvo revela o primeiro card do topo de seu próprio grimório. Erupção Cerebral causa uma quantidade de dano àquele jogador, e a cada criatura que ele controla, igual ao custo de mana convertido do card revelado. Se um card de terreno for revelado dessa maneira, devolva Erupção Cerebral para a mão de seu dono.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 231379, "name": "Мозговое Извержение", "text": "Целевой оппонент показывает верхнюю карту своей библиотеки. Мозговое Извержение наносит повреждения, равные конвертированной мана-стоимости показанной карты, тому игроку и каждому существу под его контролем. Если таким образом показывается карта земли, верните Мозговое Извержение в руку его владельца.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 232375, "name": "脑力爆发", "text": "目标对手展示其牌库顶牌。 脑力爆发对该玩家与每个由他操控的生物各造成伤害，其数量等同于所展示之牌的总法术力费用。 如果以此法展示出地牌，则将脑力爆发移回其拥有者手上。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 232126, "name": "腦力爆發", "text": "目標對手展示其牌庫頂牌。 腦力爆發對該玩家與每個由他操控的生物各造成傷害，其數量等同於所展示之牌的總魔法力費用。 如果以此法展示出地牌，則將腦力爆發移回其擁有者手上。", "type": "巫術"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "132458", "cardKingdomId": "132224", "cardsphereId": "40268", "mcmId": "242788", "mcmMetaId": "200846", "mtgjsonV4Id": "a7e40747-1971-50b5-98c8-5ca27f2600bf", "mtgoFoilId": "38414", "mtgoId": "38413", "multiverseId": "215073", "scryfallId": "77161159-ee2c-485d-8674-d8590ccc62e1", "scryfallIllustrationId": "6b8de08f-f0a4-4290-85f1-453216389665", "scryfallOracleId": "8143642e-ce93-47f1-a601-3a4f5731e1d7", "tcgplayerProductId": "36470"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}{R}", "manaValue": 4.0, "name": "Cerebral Eruption", "number": "86", "originalText": "Target opponent reveals the top card of his or her library. Cerebral Eruption deals damage equal to the revealed card's converted mana cost to that player and each creature he or she controls. If a land card is revealed this way, return Cerebral Eruption to its owner's hand.", "originalType": "Sorcery", "printings": ["SOM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/dee84259f454425e", "cardKingdomFoil": "https://mtgjson.com/links/77e899382af25182", "cardmarket": "https://mtgjson.com/links/c1789a442fdf38c7", "tcgplayer": "https://mtgjson.com/links/59cbe3ab0c48abf2"}, "rarity": "rare", "rulings": [{"date": "2011-01-01", "text": "If the targeted opponent is an illegal target by the time Cerebral Eruption resolves, the spell doesn’t resolve. No cards will be revealed and no damage will be dealt."}, {"date": "2011-01-01", "text": "Once the card is revealed, it’s too late for players to respond. The targeted opponent can’t, for example, see how much damage will be dealt, then cast a damage prevention spell or activate a regeneration ability. All such actions must be done before Cerebral Eruption starts to resolve."}, {"date": "2011-01-01", "text": "The mana value of the revealed card is determined solely by the mana symbols printed in its upper right corner. The mana value is the total amount of mana in that cost, regardless of color. For example, a card with mana cost {3}{U}{U} has mana value 5."}, {"date": "2011-01-01", "text": "If the mana cost of the revealed card includes {X}, X is considered to be 0."}, {"date": "2011-01-01", "text": "If the revealed card has no mana symbols in its upper right corner (because it’s a land card, for example), its mana value is 0."}, {"date": "2011-01-01", "text": "If a land card is revealed this way, Cerebral Eruption is returned to its owner’s hand from the stack. It finishes resolving, but it isn’t put into the graveyard."}], "setCode": "SOM", "subtypes": [], "supertypes": [], "text": "Target opponent reveals the top card of their library. Cerebral Eruption deals damage equal to the revealed card's mana value to that player and each creature that player controls. If a land card is revealed this way, return Cerebral Eruption to its owner's hand.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "5468467a-d7c5-5640-bab7-80bf5c59bbb2", "watermark": "mirran"}