{"artist": "Vincent Proce", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 12626, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 443239, "name": "Chainers Qualen", "text": "(Je eine Sagenmarke beim Ins-Spiel-Kommen und nach deinem Ziehsegment. Opfern nach III.)\nI, II — Chainers Qualen fügt jedem Gegner 2 Schadenspunkte zu, und du erhältst 2 Lebenspunkte dazu.\nIII — Erzeuge einen X/X schwarzen Nachtmahr-Schrecken-Kreaturenspielstein, wobei X gleich der Hälfte deines Lebenspunktestands, aufgerundet, ist. Er fügt dir X Schadenspunkte zu.", "type": "Verzauberung — Sage"}, {"language": "Spanish", "multiverseId": 443508, "name": "Tormento de Cadenero", "text": "(En cuanto esta Saga entre y después de tu paso de robar, agrega un contador de sabiduría. Sacrifícala después de III.)\nI, II — El Tormento de Cadenero hace 2 puntos de daño a cada oponente y tú ganas 2 vidas.\nIII — Crea una ficha de criatura Horror Pesadilla negra X/X, donde X es la mitad de tu total de vidas, redondeando hacia arriba. Te hace X puntos de daño.", "type": "Encantamiento — Saga"}, {"language": "French", "multiverseId": 443777, "name": "Tourment de Chaînes", "text": "(Au moment où cette saga arrive sur le champ de bataille et après votre étape de pioche, ajoutez un marqueur « sapience ». Sacrifiez après III.)\nI, II — Le Tourment de Chaînes inflige 2 blessures à chaque adversaire et vous gagnez 2 points de vie.\nIII — Créez un jeton de créature X/X noire Cauchemar et Horreur, X étant la moitié de vos points de vie, arrondie à l'unité supérieure. Il vous inflige X blessures.", "type": "Enchantement : saga"}, {"language": "Italian", "multiverseId": 444046, "name": "Tormento di Chainer", "text": "(Mentre questa Saga entra e dopo la tua sottofase di acquisizione, aggiungi un segnalino sapere. Sacrifica dopo III.)\nI, II — Il Tormento di Chainer infligge 2 danni a ogni avversario e tu guadagni 2 punti vita.\nIII — Crea una pedina creatura Orrore Incubo X/X nera, dove X è pari a metà dei tuoi punti vita, arrotondati per eccesso. Ti infligge X danni.", "type": "Incantesimo — Saga"}, {"language": "Japanese", "multiverseId": 444315, "name": "チェイナーの苦悩", "text": "（この英雄譚が出た際とあなたのドロー・ステップの後に、伝承カウンターを１個加える。IIIの後に、生け贄に捧げる。）\nI, II ― チェイナーの苦悩は各対戦相手にそれぞれ２点のダメージを与え、あなたは２点のライフを得る。\nIII ― 黒のＸ/Ｘのナイトメア・ホラー・クリーチャー・トークンを１体生成する。Ｘはあなたのライフ総量の端数を切り上げた半分に等しい。それはあなたにＸ点のダメージを与える。", "type": "エンチャント — 英雄譚"}, {"language": "Korean", "multiverseId": 444584, "name": "체이너의 고뇌", "text": "(이 서사시가 들어오면서 그리고 당신의 뽑기단 후에, 전승 카운터 한 개를 추가한다. III 이후에 희생한다.)\nI, II — 체이너의 고뇌는 각 상대에게 피해 2점을 입히고 당신은 생명 2점을 얻는다.\nIII — X/X 흑색 나이트메어 괴수 생물 토큰 한 개를 만든다. X는 당신의 생명 총점의 절반을 올림한 값이다. 그 생물은 당신에게 피해 X점을 입힌다.", "type": "부여마법 — 서사시"}, {"language": "Portuguese (Brazil)", "multiverseId": 444853, "name": "Tormento de Chainer", "text": "(Conforme esta Saga entra e após sua etapa de compra, adicione um marcador de conhecimento. Sacrifique-a após III.)\nI, II — Tormento de Chainer causa 2 pontos de dano a cada oponente e você ganha 2 pontos de vida.\nIII — Crie uma ficha de criatura preta X/X do tipo Pesadelo Horror, sendo X metade de seu total de pontos de vida, arredondada para cima. Ela causa X pontos de dano a você.", "type": "Encantamento — Saga"}, {"language": "Russian", "multiverseId": 445122, "name": "Муки Цепника", "text": "(При выходе этой Саги и после вашего шага взятия карты добавьте один жетон знаний. Пожертвуйте после III.)\nI, II — Муки Цепника наносят 2 повреждения каждому оппоненту, а вы получаете 2 жизни.\nIII — Создайте одну фишку существа X/X черный Кошмар Ужас, где X — половина вашего количества жизней, округленная в большую сторону. Она наносит вам X повреждений.", "type": "Чары — Сага"}, {"language": "Chinese Simplified", "multiverseId": 445391, "name": "崔纳的绝境", "text": "（于此传纪进战场时及于你抓牌步骤后，加一个学问指示物。到III后牺牲之。）\nI, II — 崔纳的绝境向每位对手各造成2点伤害且你获得2点生命。\nIII — 派出一个X/X黑色梦魇／惊惧兽衍生生物，X为你总生命的一半，小数点后进位。它对你造成X点伤害。", "type": "结界 ～传纪"}, {"language": "Chinese Traditional", "multiverseId": 445660, "name": "崔納的絕境", "text": "（於此傳紀進戰場時及於你抽牌步驟後，加一個學問指示物。到III後犧牲之。）\nI, II — 崔納的絕境向每位對手各造成2點傷害且你獲得2點生命。\nIII — 派出一個X/X黑色夢魘／驚懼獸衍生生物，X為你總生命的一半，小數點後進位。它對你造成X點傷害。", "type": "結界 ～傳紀"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "218129", "cardKingdomId": "217758", "cardsphereId": "54242", "mcmId": "319761", "mcmMetaId": "239400", "mtgArenaId": "67268", "mtgjsonV4Id": "6e261863-7253-5781-a513-daa992d2d701", "mtgoId": "67629", "multiverseId": "442970", "scryfallId": "f42beafb-2fba-482c-a86a-7d668fa7cb4b", "scryfallIllustrationId": "3eb16c4e-3987-4b9b-8a73-1a515270cd90", "scryfallOracleId": "3c18113f-8d1e-4c63-a759-8cfc94e90876", "tcgplayerProductId": "162149"}, "language": "English", "layout": "saga", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}", "manaValue": 4.0, "name": "Chainer's Torment", "number": "82", "originalText": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI, II — Chainer's Torment deals 2 damage to each opponent and you gain 2 life.\nIII — Create an X/X black Nightmare Horror creature token, where X is half your life total, rounded up. It deals X damage to you.", "originalType": "Enchantment — Saga", "printings": ["DOM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/f2f05b000cdf35dc", "cardKingdomFoil": "https://mtgjson.com/links/a8dd0c95e5b106bf", "cardmarket": "https://mtgjson.com/links/942b244581673b31", "tcgplayer": "https://mtgjson.com/links/27a57aaacdbe687f"}, "rarity": "uncommon", "rulings": [{"date": "2018-04-27", "text": "If another effect causes the Nightmare Horror token’s power or toughness to be a number other than X immediately after it enters the battlefield, the amount of damage it deals to you is still X, not its modified power or toughness."}, {"date": "2018-04-27", "text": "If an effect such as that of Anointed Procession causes the final chapter ability of Chainer’s Torment to create two Nightmare Horror tokens, each will deal X damage to you."}, {"date": "2018-04-27", "text": "In a Two-Headed Giant game, the first chapter abilities of Chainer’s Torment each cause the opposing team to lose 4 life and you to gain 2 life."}, {"date": "2018-04-27", "text": "As a Saga enters the battlefield, its controller puts a lore counter on it. As your precombat main phase begins (immediately after your draw step), you put another lore counter on each Saga you control. Putting a lore counter on a Saga in either of these ways doesn’t use the stack."}, {"date": "2018-04-27", "text": "Each symbol on the left of a Saga’s text box represents a chapter ability. A chapter ability is a triggered ability that triggers when a lore counter that is put on the Saga causes the number of lore counters on the Saga to become equal to or greater than the ability’s chapter number. Chapter abilities are put onto the stack and may be responded to."}, {"date": "2018-04-27", "text": "A chapter ability doesn’t trigger if a lore counter is put on a Saga that already had a number of lore counters greater than or equal to that chapter’s number. For example, the third lore counter put on a Saga causes the III chapter ability to trigger, but I and II won’t trigger again."}, {"date": "2018-04-27", "text": "Once a chapter ability has triggered, the ability on the stack won’t be affected if the Saga gains or loses counters, or if it leaves the battlefield."}, {"date": "2018-04-27", "text": "If multiple chapter abilities trigger at the same time, their controller puts them on the stack in any order. If any of them require targets, those targets are chosen as you put the abilities on the stack, before any of those abilities resolve."}, {"date": "2018-04-27", "text": "If counters are removed from a Saga, the appropriate chapter abilities will trigger again when the Saga receives lore counters. Removing lore counters won’t cause a previous chapter ability to trigger."}, {"date": "2018-04-27", "text": "Once the number of lore counters on a Saga is greater than or equal to the greatest number among its chapter abilities—in the Dominaria set, this is always three—the Saga’s controller sacrifices it as soon as its chapter ability has left the stack, most likely by resolving or being countered. This state-based action doesn’t use the stack."}], "setCode": "DOM", "subtypes": ["Saga"], "supertypes": [], "text": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI, II — Chainer's Torment deals 2 damage to each opponent and you gain 2 life.\nIII — Create an X/X black Nightmare Horror creature token, where X is half your life total, rounded up. It deals X damage to you.", "type": "Enchantment — Saga", "types": ["Enchantment"], "uuid": "3a0aeb64-f0fb-5cc8-a165-604abd522208"}