{"artist": "Daarken", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 2.0, "edhrecRank": 7474, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"mtgjsonV4Id": "daac9208-f349-5601-a896-a3966afc54d2", "mtgoId": "65646", "scryfallId": "db7a0517-b0ef-4fc2-be62-40f0dada02a5", "scryfallIllustrationId": "532d36c4-4b92-4757-996f-3affa2441835", "scryfallOracleId": "eae87919-6322-4bd2-ae9c-b1ce25d686da"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "isReserved": true, "keywords": ["Mill"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{1}{B}", "manaValue": 2.0, "name": "Chains of Mephistopheles", "number": "65646", "originalReleaseDate": "2017-09-17", "printings": ["LEG", "ME1", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "The effect is cumulative. If there are two of these on the battlefield, each of them will modify each draw (after the first one if during the draw step), and will cause the player to discard or to “mill” a card from their library. As they resolve in order, the player must discard if possible. Once the player fails to discard and instead “mills” a card, all further effects of additional Chains of Mephistopheles will not do anything. This is because the “mill” also replaces the draw effect and the player is no longer drawing a card. You handle them in order. Each one makes you discard first and then continue or else mill a card and lose the draw."}, {"date": "2004-10-04", "text": "Cards which are drawn as a cost are affected by this card because replacement effects can alter the payment of costs."}, {"date": "2007-09-16", "text": "If a spell or ability would cause a player to draw multiple cards, this is treated as a number of individual “draw one card” actions. Apply the effect of Chains of Mephistopheles to each one."}, {"date": "2007-09-16", "text": "A player’s normal card draw on their turn is exempt from this effect. All other draws will be affected."}, {"date": "2007-09-16", "text": "Here’s what happens when Chains of Mephistopheles replaces a player’s draw: — If that player has at least one card in their hand, they discard a card and then draws a card. — If that player’s hand is empty, they put the top card of their library into their graveyard. The player doesn’t draw a card at all."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "If a player would draw a card except the first one they draw in each of their draw steps, that player discards a card instead. If the player discards a card this way, they draw a card. If the player doesn't discard a card this way, they mill a card.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "595f7982-78d7-5f55-8905-d7c33924bd38"}