{"artist": "Stephen Tappin", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 8.0, "edhrecRank": 15146, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 111621, "name": "Gesang aus Vitu-Ghazi", "text": "Einberufen (Jede Kreatur, die du tappst, während du diesen Zauberspruch spielst, reduziert dessen Kosten um {1} oder um ein Mana der Farbe jener Kreatur.)\nVerhindere allen Schaden, der in diesem Zug von Kreaturen zugefügt würde. Du erhältst 1 Lebenspunkt für jeden auf diese Weise verhinderten Schadenspunkt dazu.", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 113151, "name": "Cántico de Vitu-Ghazi", "text": "Convocar (Cada criatura que gires al jugar este hechizo reduce su coste en {1} o en un maná del color de esa criatura.)\nPrevén todo el daño que fueran a hacer las criaturas este turno. Ganas 1 vida por cada punto de daño prevenido de esta manera.", "type": "Instantáneo"}, {"language": "French", "multiverseId": 111927, "name": "Cantique de Vitu-Ghazi", "text": "Convocation (Chaque créature que vous engagez en jouant ce sort réduit son coût de {1} ou d'un mana de la couleur de cette créature.)\nPrévenez toutes les blessures qui devraient être infligées par des créatures ce tour-ci. Vous gagnez 1 point de vie pour chaque blessure prévenue de cette manière.", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 112233, "name": "Canto di Vitu-Ghazi", "text": "Convocazione (Ciascuna creatura che TAPpi mentre giochi questa magia riduce il suo costo di {1} o di un mana del colore di quella creatura.)\nPrevieni tutto il danno che verrebbe inflitto dalle creature in questo turno. Guadagni un punto vita per ogni danno prevenuto in questo modo.", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 112539, "name": "ヴィトゥ＝ガジーの詠唱", "text": "召集 （あなたがこの呪文をプレイする段階であなたがタップした各クリーチャーにつき、この呪文のコストはそのクリーチャーの色のマナ１点か{1}少なくなる。）\nこのターン、クリーチャーから与えられるすべてのダメージを軽減し、０にする。 あなたはこれにより軽減されたダメージ１点につき１点のライフを得る。", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 112845, "name": "Canto de Vitu-Ghazi", "text": "Convocar (Cada criatura que você vira ao jogar esta mágica reduz seu custo em {1} ou em um mana da cor daquela criatura.)\nPrevine todo o dano que seria causado por criaturas neste turno. Você ganha 1 ponto de vida para cada ponto de dano prevenido dessa maneira.", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 114253, "name": "Напев Виту-Гази", "text": "Созыв (Когда вы разыгрываете это заклинание, каждое повернутое существо уменьшает стоимость заклинания на {1} или на один пункт маны цвета этого существа).\nПредотвратите все повреждения, которые будут нанесены существами в этот ход. Вы получаете 1 пункт жизни за каждое предотвращенное повреждение.", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 111315, "name": "维图加基吟颂", "text": "召集（使用此咒语时，你每为它横置一个生物，便可以少支付{1}，或一点所横置生物颜色的法术力。）\n防止生物于本回合中将造成的所有伤害。 每以此法防止1点伤害，你便获得1点生命。", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "118678", "cardKingdomId": "118387", "cardsphereId": "37917", "mcmId": "13325", "mcmMetaId": "7903", "mtgjsonV4Id": "4b1ce43e-a6ba-57e8-97db-b14635846de2", "mtgoFoilId": "23241", "mtgoId": "23240", "multiverseId": "87957", "scryfallId": "23c22d01-1d14-4f73-a2db-a77f96a9a0e3", "scryfallIllustrationId": "eb72e6ee-7b20-40c8-ad2d-96c42a83b7a3", "scryfallOracleId": "e245a736-5f65-4159-8e39-e279e1f8794f", "tcgplayerProductId": "13222"}, "keywords": ["Convoke"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{6}{W}{W}", "manaValue": 8.0, "name": "Chant of Vitu-Ghazi", "number": "7", "originalText": "Convoke (Each creature you tap while playing this spell reduces its cost by {1} or by one mana of that creature's color.)\nPrevent all damage that would be dealt by creatures this turn. You gain 1 life for each damage prevented this way.", "originalType": "Instant", "printings": ["RAV"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/0f662729035e9f35", "cardKingdomFoil": "https://mtgjson.com/links/d12ee5ee2c159135", "cardmarket": "https://mtgjson.com/links/801c73031f493d21", "tcgplayer": "https://mtgjson.com/links/1bc433d19f320d05"}, "rarity": "uncommon", "rulings": [{"date": "2005-10-01", "text": "The damage prevention shield lasts for the rest of the turn, and you gain life each time that shield prevents 1 or more damage."}, {"date": "2021-03-19", "text": "You can tap any untapped creature you control to convoke a spell, even one you haven’t controlled continuously since the beginning of your most recent turn."}, {"date": "2021-03-19", "text": "When calculating a spell’s total cost, include any alternative costs, additional costs, or anything else that increases or reduces the cost to cast the spell. Convoke applies after the total cost is calculated. Convoke doesn’t change a spell’s mana cost or mana value."}, {"date": "2021-03-19", "text": "If a creature you control has a mana ability with {T} in the cost, activating that ability while casting a spell with convoke will result in the creature being tapped before you pay the spell’s costs. You won’t be able to tap it again for convoke. Similarly, if you sacrifice a creature to activate a mana ability while casting a spell with convoke, that creature won’t be on the battlefield when you pay the spell’s costs, so you won’t be able to tap it for convoke."}], "setCode": "RAV", "subtypes": [], "supertypes": [], "text": "Convoke (Your creatures can help cast this spell. Each creature you tap while casting this spell pays for {1} or one mana of that creature's color.)\nPrevent all damage that would be dealt by creatures this turn. You gain life equal to the damage prevented this way.", "type": "Instant", "types": ["Instant"], "uuid": "173e1b87-7df8-5b15-b0a2-bfac3855a5e7", "watermark": "selesnya"}