{"artist": "Ekaterina Burmak", "availability": ["arena", "mtgo", "paper"], "borderColor": "borderless", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 5197, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 544418, "name": "Chandra, todschick", "text": "+1: Erzeuge {R}. Chandra, todschick, fügt bis zu einem Spieler oder Planeswalker deiner Wahl 1 Schadenspunkt zu.\n+1: Schicke die oberste Karte deiner Bibliothek ins Exil. Falls sie rot ist, kannst du sie in diesem Zug wirken.\n−7: Schicke die obersten fünf Karten deiner Bibliothek ins Exil. Bis zum Ende des Zuges kannst du davon rote Zaubersprüche wirken. Du erhältst ein Emblem mit „Immer wenn du einen roten Zauberspruch wirkst, fügt dieses Emblem einem Ziel deiner Wahl X Schadenspunkte zu, wobei X gleich der Menge Mana ist, die ausgegeben wurde, um den Zauberspruch zu wirken.\"", "type": "Legendärer Planeswalker — Chandra"}, {"language": "Spanish", "multiverseId": 544421, "name": "Chandra, vestida para matar", "text": "+1: Agrega {R}. Chandra, vestida para matar hace 1 punto de daño a hasta un jugador o planeswalker objetivo.\n+1: Exilia la primera carta de tu biblioteca. Si es roja, puedes lanzarla este turno.\n−7: Exilia las cinco primeras cartas de tu biblioteca. Puedes lanzar hechizos rojos de entre ellas este turno. Obtienes un emblema con \"Siempre que lances un hechizo rojo, este emblema hace X puntos de daño a cualquier objetivo, donde X es la cantidad de maná usado para lanzar ese hechizo\".", "type": "Planeswalker legendario — Chandra"}, {"language": "French", "multiverseId": 544424, "name": "Chandra, tout feu tout flamme", "text": "+1: Ajoutez {R}. Chandra, tout feu tout flamme inflige 1 blessure à jusqu'à une cible, joueur ou planeswalker.\n+1: Exilez la carte du dessus de votre bibliothèque. Si elle est rouge, vous pouvez la lancer ce tour-ci.\n-7: Exilez les cinq cartes du dessus de votre bibliothèque. Parmi elles, vous pouvez lancer des sorts rouges ce tour-ci. Vous gagnez un emblème avec « À chaque fois que vous lancez un sort rouge, cet emblème inflige X blessures à n'importe quelle cible, X étant la quantité de mana dépensée pour lancer ce sort. »", "type": "Planeswalker légendaire : Chandra"}, {"language": "Italian", "multiverseId": 544427, "name": "Chandra dall'Eleganza Letale", "text": "+1: Aggiungi {R}. Scegli fino a un giocatore o a un planeswalker bersaglio. Chandra dall'Eleganza Letale infligge 1 danno a quel giocatore o planeswalker.\n+1: Esilia la prima carta del tuo grimorio. Se è rossa, puoi lanciarla in questo turno.\n−7: Esilia le prime cinque carte del tuo grimorio. Puoi lanciare magie rosse scelte tra esse in questo turno. Ottieni un emblema con \"Ogniqualvolta lanci una magia rossa, questo emblema infligge X danni a un qualsiasi bersaglio, dove X è pari al mana speso per lanciare quella magia\".", "type": "Planeswalker Leggendario — Chandra"}, {"language": "Japanese", "multiverseId": 544430, "name": "勝負服纏い、チャンドラ", "text": "+1：{R}を加える。プレイヤーやプレインズウォーカーのうち最大１つを対象とする。勝負服纏い、チャンドラはそれに１点のダメージを与える。\n+1：あなたのライブラリーの一番上にあるカード１枚を追放する。それが赤であるなら、あなたはそれを唱えてもよい。\n−7：あなたのライブラリーの一番上にあるカード５枚を追放する。このターン、あなたはその中から望む数の赤の呪文を唱えてもよい。あなたは「あなたが赤の呪文を唱えるたび、クリーチャーやプレインズウォーカーやプレイヤーのうち１つを対象とする。この紋章はそれにＸ点のダメージを与える。Ｘはその呪文を唱えるために支払ったマナの点数に等しい。」を持つ紋章を得る。", "type": "伝説のプレインズウォーカー — チャンドラ"}, {"language": "Korean", "multiverseId": 544433, "name": "죽이는 차림새를 한 찬드라", "text": "+1: {R}를 추가한다. 플레이어 또는 플레인즈워커를 최대 한 개까지 목표로 정한다. 죽이는 차림새를 한 찬드라는 그 목표에게 피해 1점을 입힌다.\n+1: 당신의 서고 맨 위 카드를 추방한다. 그 카드가 적색이라면, 당신은 이 턴에 그 카드를 발동할 수 있다.\n−7: 당신의 서고 맨 위 카드 다섯 장을 추방한다. 당신은 이 턴에 그 카드들 중에서 적색 주문들을 발동할 수 있다. 당신은 \"당신이 적색 주문을 발동할 때마다, 원하는 목표를 정한다. 이 휘장은 그 목표에게 피해 X점을 입힌다. X는 당신이 그 주문을 발동하기 위해 지불한 마나의 양이다.\"를 가진 휘장을 얻는다.", "type": "전설적 플레인즈워커 — 찬드라"}, {"language": "Portuguese (Brazil)", "multiverseId": 544436, "name": "Chandra, Vestida para Matar", "text": "+1: Adicione {R}. Chandra, Vestida para Matar, causa 1 ponto de dano a até um jogador ou planeswalker alvo.\n+1: Exile o card do topo de seu grimório. Se ele for vermelho, você pode conjurá-lo neste turno.\n−7: Exile os cinco cards do topo de seu grimório. Você pode conjurar mágicas vermelhas dentre eles neste turno. Você recebe um emblema com \"Toda vez que você conjura uma mágica vermelha, este emblema causa X pontos de dano a qualquer alvo, sendo X a quantidade de mana gasta para conjurar aquela mágica\".", "type": "Planeswalker Lendário — Chandra"}, {"language": "Russian", "multiverseId": 544439, "name": "Чандра, Сражающая Наповал", "text": "+1: добавьте {R}. Чандра, Сражающая Наповал наносит 1 повреждение не более чем одному целевому игроку или planeswalker'у.\n+1: изгоните верхнюю карту вашей библиотеки. Если она красная, то вы можете разыграть ее в этом ходу.\n—7: изгоните пять верхних карт вашей библиотеки. Вы можете разыграть находящиеся среди них красные заклинания в этом ходу. Вы получаете эмблему со способностью «Каждый раз, когда вы разыгрываете красное заклинание, эта эмблема наносит X повреждений любой цели, где X — количество маны, потраченной на разыгрывание того заклинания».", "type": "Легендарный Planeswalker — Чандра"}, {"language": "Chinese Simplified", "multiverseId": 544442, "name": "盛装茜卓", "text": "+1：加{R}。盛装茜卓对至多一位目标牌手或鹏洛客造成1点伤害。\n+1：放逐你的牌库顶牌。如果它是红色，则本回合中，你可以施放它。\n−7：放逐你牌库顶的五张牌。本回合中，你可以从其中施放红色咒语。你获得具有以下异能的徽记～「每当你施放红色咒语时，此徽记对任意一个目标造成X点伤害，X为施放该咒语时所支付的法术力数量。」", "type": "传奇鹏洛客 ～茜卓"}, {"language": "Chinese Traditional", "multiverseId": 544445, "name": "盛裝茜卓", "text": "+1：加{R}。盛裝茜卓對至多一位目標玩家或鵬洛客造成1點傷害。\n+1：放逐你的牌庫頂牌。如果它是紅色，則本回合中，你可以施放它。\n−7：放逐你牌庫頂的五張牌。本回合中，你可以從其中施放紅色咒語。你獲得具有以下異能的徽記～「每當你施放紅色咒語時，此徽記對任意一個目標造成X點傷害，X為施放該咒語時所支付的魔法力數量。」", "type": "傳奇鵬洛客 ～茜卓"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "253189", "cardKingdomId": "252473", "cardsphereId": "82692", "mcmId": "581655", "mcmMetaId": "346655", "mtgArenaId": "79126", "mtgjsonV4Id": "e5701d26-deaf-5169-ba77-a885cb7a5d83", "multiverseId": "544415", "scryfallId": "7129a358-4628-4426-ae3b-e3d9288a6355", "scryfallIllustrationId": "b4fcebe7-4046-4184-86b6-7b933db0727b", "scryfallOracleId": "4686f776-2055-470c-bd99-7c4bb32902c0", "tcgplayerProductId": "252921"}, "isStarter": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": true, "commander": false, "oathbreaker": true}, "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "loyalty": "3", "manaCost": "{1}{R}{R}", "manaValue": 3.0, "name": "Chandra, Dressed to Kill", "number": "279", "originalText": "+1: Add {R}. Chandra, Dressed to Kill deals 1 damage to up to one target player or planeswalker.\n+1: Exile the top card of your library. If it's red, you may cast it this turn.\n−7: Exile the top five cards of your library. You may cast red spells from among them this turn. You get an emblem with \"Whenever you cast a red spell, this emblem deals X damage to any target, where X is the amount of mana spent to cast that spell.\"", "originalType": "Legendary Planeswalker — Chandra", "printings": ["DBL", "PRM", "PVOW", "VOW"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/569c762562fc5261", "cardKingdomFoil": "https://mtgjson.com/links/5f97b12dc0f1e665", "cardmarket": "https://mtgjson.com/links/565c26248fb2a4ba", "tcgplayer": "https://mtgjson.com/links/fde3d8bb670f6de3"}, "rarity": "mythic", "rulings": [{"date": "2021-11-19", "text": "Chandra's first ability uses the stack and can be responded to, even if no targets were chosen. It doesn't count as a mana ability."}, {"date": "2021-11-19", "text": "Chandra's second ability checks the characteristics of the card you exiled to see if it's red. If the spell that card becomes somehow isn't red, you may still cast it. For example, Rowan, Scholar of Sparks, the front face of a modal double-faced card, is red. Will, Scholar of Frost, the back face of the same card, is blue. In exile, that card is red, so you may cast either face if you exile it with this ability."}, {"date": "2021-11-19", "text": "Chandra's last ability, by contrast, only allows you to cast spells that are red when you cast them, no matter what the card in exile is. If Rowan, Scholar of Sparks is exiled by this ability, you won't be able to cast Will, Scholar of Frost this way because it would be a blue spell."}, {"date": "2021-11-19", "text": "You must pay all costs for spells cast via Chandra's last two abilities. For the middle ability, you must also follow all timing restrictions."}, {"date": "2021-11-19", "text": "The emblem's triggered ability looks for the actual amount of mana spent to cast the spell. If an effect caused you to pay more or less mana for that spell as you cast it, that will be taken into account when determining the value of X. If an effect would counter that spell unless you pay some amount of mana, that mana doesn't count as mana spent to cast it."}], "securityStamp": "oval", "setCode": "VOW", "subtypes": ["Chandra"], "supertypes": ["Legendary"], "text": "[+1]: Add {R}. Chandra, Dressed to Kill deals 1 damage to up to one target player or planeswalker.\n[+1]: Exile the top card of your library. If it's red, you may cast it this turn.\n[−7]: Exile the top five cards of your library. You may cast red spells from among them this turn. You get an emblem with \"Whenever you cast a red spell, this emblem deals X damage to any target, where X is the amount of mana spent to cast that spell.\"", "type": "Legendary Planeswalker — Chandra", "types": ["Planeswalker"], "uuid": "484d9c02-f7e0-5bd0-930d-1bca26f74b5d", "variations": ["29ce18c1-48d3-5692-ba14-c5cf79e3adc4"]}