{"artist": "Jeff Miracola", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 5.0, "edhrecRank": 9086, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 154486, "name": "Wandelwicht-Held", "text": "Wandelwicht (Diese Karte hat zu jedem Zeitpunkt alle Kreaturentypen.)\nBeschütze eine Kreatur (Wenn diese Karte ins Spiel kommt, opfere sie, falls du nicht eine andere Kreatur, die du kontrollierst, ganz aus dem Spiel entfernst. Wenn diese Karte das Spiel verlässt, kehrt jene Karte ins Spiel zurück.)\nLebensverknüpfung (Immer wenn diese Kreatur Schaden zufügt, erhältst du ebenso viele Lebenspunkte dazu.)", "type": "Kreatur — Gestaltwandler"}, {"language": "Spanish", "multiverseId": 156603, "name": "Héroe cambiaformas", "text": "Cambiaformas. (Esta carta es de todos los tipos de criatura en todo momento.)\nAmparar una criatura. (Cuando esto entre en juego, sacrifícalo a menos que remuevas del juego otra criatura que controlas. Cuando esto deje el juego, esa carta regresa al juego.)\nVínculo vital. (Siempre que esta criatura haga daño, ganas esa cantidad de vida.)", "type": "Criatura — Metamorfo"}, {"language": "French", "multiverseId": 155399, "name": "Héros changelin", "text": "Changelin (Cette carte a tous les types de créature à tout moment.)\nAppui de créature (Quand ce permanent arrive en jeu, sacrifiez-le à moins que vous ne retiriez de la partie une autre créature que vous contrôlez. Quand ce permanent quitte le jeu, la carte retirée revient en jeu.)\nLien de vie (À chaque fois que cette créature inflige des blessures, vous gagnez autant de points de vie.)", "type": "Créature : changeforme"}, {"language": "Italian", "multiverseId": 155700, "name": "Cangiante Eroe", "text": "Cangiante (Questa carta ha tutti i tipi di creatura in ogni momento.)\nBattersi per una creatura (Quando questa creatura entra in gioco, sacrificala a meno che tu non rimuova dal gioco un'altra creatura che controlli. Quando questa creatura lascia il gioco, quella carta viene rimessa in gioco.)\nLegame vitale (Ogniqualvolta questa creatura infligge danno, guadagni un pari ammontare di punti vita.)", "type": "Creatura — Polimorfo"}, {"language": "Japanese", "multiverseId": 156001, "name": "変わり身の勇士", "text": "多相 （このカードは常にすべてのクリーチャー・タイプである。）\n覇権（クリーチャー） （これが場に出たとき、あなたがコントロールする他のクリーチャー１体をゲームから取り除かないかぎり、これを生け贄に捧げる。 これが場を離れたとき、そのカードが場に戻る。）\n絆魂 （このクリーチャーがダメージを与えるたび、あなたはその点数に等しい点数のライフを得る。）", "type": "クリーチャー — 多相の戦士"}, {"language": "Portuguese (Brazil)", "multiverseId": 156904, "name": "Herói Morfolóide", "text": "Morfolóide (Este card é de todos os tipos de criatura sempre.)\nAcuda uma criatura (Quando esta permanente entrar em jogo, sacrifique-a, a menos que você remova outra criatura que você controla do jogo. Quando ela deixar o jogo, aquele card volta para o jogo.)\nVínculo com a vida (Toda vez que esta criatura causa dano, você ganha aquela quantidade em pontos de vida.)", "type": "Criatura — Metamorfo"}, {"language": "Russian", "multiverseId": 156302, "name": "Перевертыш-Герой", "text": "Перевертыш (Эта карта всегда обладает всеми типами существ.)\nЗаступитесь за существо (Когда этот перманент входит в игру, пожертвуйте его, если только вы не удалите из игры другое существо под вашим контролем. Когда этот перманент покидает игру, та карта возвращается в игру.)\nЦепь жизни (Каждый раз, когда это существо наносит повреждения, вы получаете столько же жизни.)", "type": "Существо — Имитатор"}, {"language": "Chinese Simplified", "multiverseId": 154787, "name": "化形勇士", "text": "化形 （此牌随时都是所有生物类别。）\n夺冠生物 （当它进场时，除非你将另一个由你操控的生物移出对战，否则牺牲之。 当它离场时，将该牌移回场上。）\n系命 （每当此生物造成伤害时，你获得等量的生命。）", "type": "生物～变形兽"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "123910", "cardKingdomId": "123512", "cardsphereId": "25198", "mcmId": "17750", "mcmMetaId": "9121", "mtgjsonV4Id": "29260540-fe52-5b97-9918-50cd12ccc37a", "mtgoFoilId": "28222", "mtgoId": "28221", "multiverseId": "145968", "scryfallId": "24f0c586-a1a5-4907-801a-7815c4dceb39", "scryfallIllustrationId": "dd4b90dc-a279-4f3a-b910-2d3eb23dba6c", "scryfallOracleId": "fc893d4a-debd-4df0-ae83-d3ebd2f0fefe", "tcgplayerProductId": "15446"}, "keywords": ["Champion", "Changeling", "Lifelink"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{W}", "manaValue": 5.0, "name": "Changeling Hero", "number": "9", "originalText": "Changeling (This card is every creature type at all times.)\nChampion a creature (When this comes into play, sacrifice it unless you remove another creature you control from the game. When this leaves play, that card returns to play.)\nLifelink (Whenever this creature deals damage, you gain that much life.)", "originalType": "Creature - Shapeshifter", "power": "4", "printings": ["FMB1", "LRW"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/68eaa638838462dc", "cardKingdomFoil": "https://mtgjson.com/links/86b4b5197147df6e", "cardmarket": "https://mtgjson.com/links/20e2a6d743fd699b", "tcgplayer": "https://mtgjson.com/links/e771b2d05c1b71e4"}, "rarity": "uncommon", "rulings": [], "setCode": "LRW", "subtypes": ["Shapeshifter"], "supertypes": [], "text": "Changeling (This card is every creature type.)\nChampion a creature (When this enters the battlefield, sacrifice it unless you exile another creature you control. When this leaves the battlefield, that card returns to the battlefield.)\nLifelink (Damage dealt by this creature also causes you to gain that much life.)", "toughness": "4", "type": "Creature — Shapeshifter", "types": ["Creature"], "uuid": "d4316b40-e194-5b2a-8073-4cf09958be59"}