{"artist": "Steve Prescott", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 7000, "finishes": ["foil"], "foreignData": [], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "193095", "cardsphereId": "39862", "mcmId": "263497", "mtgjsonV4Id": "94945001-b62d-59e5-9c6f-cdc8d3fae681", "scryfallId": "53ce8381-4cbb-4bf9-bdac-3b2375a46340", "scryfallIllustrationId": "72b0e884-3d35-4f71-a2aa-ddfef068f4b1", "scryfallOracleId": "68e12748-9a7b-4e99-a6de-be097a269342", "tcgplayerProductId": "70709"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "loyalty": "4", "manaCost": "{2}{R}{R}", "manaValue": 4.0, "name": "Chandra, Pyromaster", "number": "132★", "printings": ["AKR", "E01", "M14", "M15", "PRM", "PS14", "PSDC"], "promoTypes": ["convention"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/a1036797749f861a", "tcgplayer": "https://mtgjson.com/links/4161fc4834de09eb"}, "rarity": "mythic", "rulings": [{"date": "2014-07-18", "text": "To activate the first ability, you must target a player but you can choose to not target any creatures."}, {"date": "2014-07-18", "text": "If the first ability resolves but the damage is prevented or redirected, the target creature still won’t be able to block that turn."}, {"date": "2014-07-18", "text": "The card exiled by the second ability is exiled face up. Playing it follows the normal rules for playing that card. You must pay its costs, and you must follow all applicable timing rules. For example, if it’s a creature card, you can cast it only during your main phase while the stack is empty."}, {"date": "2014-07-18", "text": "If you exile a land card using the second ability, you may play that land only if you have any available land plays. Normally, this means you can play the land only if you haven’t played a land yet that turn."}, {"date": "2014-07-18", "text": "In the third ability, “exiled this way” means the cards you just exiled because of that ability resolving. Cards exiled with the second ability or with previous activations of the third ability don’t count."}, {"date": "2014-07-18", "text": "While resolving the third ability, you create the copies of the card in exile and cast them from exile. You can cast zero, one, two, or all three copies. The card itself isn’t cast. It remains exiled."}, {"date": "2014-07-18", "text": "While casting the copies created by the third ability, timing restrictions based on the card’s type (such as creature or sorcery) are ignored. Other restrictions, such as “Cast [this spell] only during combat,” are not."}, {"date": "2014-07-18", "text": "Because you’re casting the copies “without paying their mana costs,” you can’t pay any alternative costs for the copies. You can pay additional costs, such as kicker costs. If the copies have any mandatory additional costs, you must pay those."}, {"date": "2014-07-18", "text": "If the copied card has {X} in its mana cost, you must choose 0 as its value when casting the copies."}], "setCode": "PSDC", "subtypes": ["Chandra"], "supertypes": ["Legendary"], "text": "[+1]: Chandra, Pyromaster deals 1 damage to target player or planeswalker and 1 damage to up to one target creature that player or that planeswalker's controller controls. That creature can't block this turn.\n[0]: Exile the top card of your library. You may play it this turn.\n[−7]: Exile the top ten cards of your library. Choose an instant or sorcery card exiled this way and copy it three times. You may cast the copies without paying their mana costs.", "type": "Legendary Planeswalker — Chandra", "types": ["Planeswalker"], "uuid": "348f7c61-2ce9-5014-a2a4-97219a225ec2"}