{"artist": "Steve Argyle", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 6.0, "edhrecRank": 8770, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 204200, "name": "Chandra die Lodernde", "text": "+1: Wirf eine Karte aus deiner Hand ab. Falls auf diese Weise eine rote Karte abgeworfen wird, fügt Chandra die Lodernde einer Kreatur oder einem Spieler deiner Wahl 4 Schadenspunkte zu.\n-2: Jeder Spieler wirft alle Karten aus seiner Hand ab und zieht dann drei Karten.\n-7: Wirke eine beliebige Anzahl an roten Spontanzaubern und/oder Hexereien aus deinem Friedhof, ohne ihre Manakosten zu bezahlen.", "type": "Planeswalker — Chandra"}, {"language": "Spanish", "multiverseId": 202855, "name": "Chandra en llamas", "text": "+1: Descarta una carta. Si se descarta una carta roja de esta manera, Chandra en llamas hace 4 puntos de daño a la criatura o jugador objetivo.\n-2: Cada jugador descarta su mano, luego roba tres cartas.\n-7: Lanza cualquier cantidad de cartas de instantáneo o conjuro de tu cementerio sin pagar su coste de maná.", "type": "Planeswalker — Chandra"}, {"language": "French", "multiverseId": 204469, "name": "Chandra embrasée", "text": "+1 : Défaussez-vous d'une carte. Si une carte rouge est défaussée de cette manière, Chandra embrasée inflige 4 blessures à une cible, créature ou joueur.\n-2 : Chaque joueur se défausse de sa main et pioche ensuite trois cartes.\n-7 : Lancez n'importe quel nombre de cartes d'éphémère et/ou de rituel rouges depuis votre cimetière sans payer leurs coûts de mana.", "type": "Planeswalker : Chandra"}, {"language": "Italian", "multiverseId": 203124, "name": "Chandra in Fiamme", "text": "+1: Scarta una carta. Se una carta rossa è stata scartata in questo modo, Chandra in Fiamme infligge 4 danni a una creatura o a un giocatore bersaglio.\n-2: Ogni giocatore scarta la propria mano, poi pesca tre carte.\n-7: Lancia un qualsiasi numero di carte istantaneo e/o stregoneria rosse dal tuo cimitero senza pagare i loro costi di mana.", "type": "Planeswalker — Chandra"}, {"language": "Japanese", "multiverseId": 203931, "name": "燃え立つチャンドラ", "text": "+1:クリーチャー１体かプレイヤー１人を対象とする。カードを１枚捨てる。これにより赤のカードが捨てられた場合、燃え立つチャンドラはそのクリーチャーかプレイヤーに４点のダメージを与える。\n-2:各プレイヤーは自分の手札を捨て、その後カードを３枚引く。\n-7:あなたの墓地にある望む枚数の赤のインスタント・カードかソーサリー・カード（またはその組み合わせ）を、それらのマナ・コストを支払うことなく唱える。", "type": "プレインズウォーカー — チャンドラ"}, {"language": "Portuguese (Brazil)", "multiverseId": 203662, "name": "Chandra Incandescente", "text": "+1: Descarte um card. Se um card vermelho for descartado dessa maneira, Chandra Incandescente causará 4 pontos de dano à criatura ou ao jogador alvo.\n-2: Cada jogador descarta a própria mão e depois compra três cards.\n-7: Conjure um número qualquer de cards vermelhos de feitiço ou mágica instantânea de seu cemitério sem pagar seus custos de mana.", "type": "Planeswalker — Chandra"}, {"language": "Russian", "multiverseId": 203393, "name": "Пылающая Чандра", "text": "+1: сбросьте карту. Если таким образом сбрасывается красная карта, Пылающая Чандра наносит 4 повреждения целевому существу или игроку.\n-2: каждый игрок сбрасывает свою руку, затем берет три карты.\n-7: разыграйте любое количество карт красных мгновенных заклинаний и (или) заклинаний волшебства из вашего кладбища без уплаты их мана-стоимости.", "type": "Planeswalker — Чандра"}, {"language": "Chinese Simplified", "multiverseId": 204738, "name": "激昂茜卓", "text": "+1：弃一张牌。如果以此法弃掉一张红色牌，则激昂茜卓对目标生物或牌手造成4点伤害。\n-2：每位牌手弃掉其手牌，然后抓三张牌。\n-7：从你的坟墓场施放任意数量的红色瞬间和／或法术牌，且不需支付其法术力费用。", "type": "鹏洛客～茜卓"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "128090", "cardKingdomId": "127834", "cardsphereId": "47679", "mcmId": "21732", "mcmMetaId": "10729", "mtgjsonV4Id": "fc7683ba-8c3c-5a45-85b0-959bed2e007f", "mtgoFoilId": "34757", "mtgoId": "34756", "multiverseId": "195402", "scryfallId": "43da8995-77da-4ec4-94a5-5e7932a3c969", "scryfallIllustrationId": "938d9551-812f-4aaf-9c8a-a6625a174928", "scryfallOracleId": "3fae28e6-2ffc-460e-9dd3-e321e8a53ba9", "tcgplayerProductId": "33276"}, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "vintage": "Legal"}, "loyalty": "5", "manaCost": "{4}{R}{R}", "manaValue": 6.0, "name": "Chandra Ablaze", "number": "120", "originalText": "+1: Discard a card. If a red card is discarded this way, Chandra Ablaze deals 4 damage to target creature or player.\n-2: Each player discards his or her hand, then draws three cards.\n-7: Cast any number of red instant and/or sorcery cards from your graveyard without paying their mana costs.", "originalType": "Planeswalker — Chandra", "printings": ["ZEN"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1a3e8fb713a7ea37", "cardKingdomFoil": "https://mtgjson.com/links/6aaedb2e3dbc7758", "cardmarket": "https://mtgjson.com/links/45480fc42da3f81c", "tcgplayer": "https://mtgjson.com/links/476ff84d28b68e6c"}, "rarity": "mythic", "rulings": [{"date": "2009-10-01", "text": "If you activate Chandra Ablaze’s first ability, you don’t discard a card until the ability resolves. You may activate the ability even if your hand is empty. You choose a target as you activate the ability even if you have no red cards in hand at that time."}, {"date": "2009-10-01", "text": "As the first ability resolves, nothing happens if your hand is empty. But if you have any cards in hand, you must discard one. If you discard a nonred card, Chandra doesn’t deal any damage."}, {"date": "2009-10-01", "text": "If the creature targeted by the first ability is an illegal target by the time it resolves, the entire ability doesn’t resolve. You won’t discard a card."}, {"date": "2009-10-01", "text": "You may activate Chandra’s second ability even if your hand is empty. As it resolves, a player whose hand is empty simply draws three cards."}, {"date": "2009-10-01", "text": "You cast red instant cards and red sorcery cards from your graveyard as part of the resolution of Chandra Ablaze’s third ability. You don’t choose which ones to cast until you’re actually doing so as the ability resolves. You cast only the ones you want to, and you may cast them in any order. Timing restrictions based on the card’s type (if it’s a sorcery) are ignored. Other restrictions are not (such as “Cast [this card] only during combat”). Each card you cast this way is put on the stack, then the ability finishes resolving. Those spells will then resolve as normal, one at a time, in the opposite order that they were put on the stack. They’ll go back to the graveyard as they resolve."}, {"date": "2009-10-01", "text": "If you cast a card “without paying its mana cost,” you can’t pay any alternative costs. You can pay additional costs, such as kicker costs."}], "setCode": "ZEN", "subtypes": ["Chandra"], "supertypes": ["Legendary"], "text": "[+1]: Discard a card. If a red card is discarded this way, Chandra Ablaze deals 4 damage to any target.\n[−2]: Each player discards their hand, then draws three cards.\n[−7]: Cast any number of red instant and/or sorcery cards from your graveyard without paying their mana costs.", "type": "Legendary Planeswalker — Chandra", "types": ["Planeswalker"], "uuid": "10c0dcdc-3bce-5942-ab79-10e10e5a92a5"}