{"artist": "Grzegorz Rutkowski", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 3235, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 567846, "name": "Chaosdrache", "text": "Fliegend, Eile\nDer Chaosdrache greift in jedem Kampf an, falls möglich.\nZu Beginn des Kampfes in deinem Zug würfelt jeder Spieler einen W20. Falls ein oder mehrere Gegner das höchste Ergebnis erzielt haben, kann der Chaosdrache in diesem Kampf keinen jener Spieler oder Planeswalker, die sie kontrollieren, angreifen.", "type": "Kreatur — Drache"}, {"language": "Spanish", "multiverseId": 568091, "name": "Dragón del caos", "text": "Vuela, prisa.\nEl Dragón del caos ataca cada combate si puede.\nAl comienzo del combate en tu turno, cada jugador tira 1d20. Si uno o más oponentes sacaron el resultado más alto, el Dragón del caos no puede atacar este combate a esos jugadores o a planeswalkers que controlan.", "type": "Criatura — Dragón"}, {"language": "French", "multiverseId": 568336, "name": "Dragon du chaos", "text": "Vol, célérité\nLe Dragon du chaos attaque à chaque combat si possible.\nAu début du combat pendant votre tour, chaque joueur lance un d20. Si au moins un adversaire a eu le résultat le plus élevé, le Dragon du chaos ne peut pas attaquer ce joueur ou les planeswalkers qu'il contrôle pendant ce combat.", "type": "Créature : dragon"}, {"language": "Italian", "multiverseId": 568581, "name": "Drago del Caos", "text": "Volare, rapidità\nIl Drago del Caos attacca in ogni combattimento, se può farlo.\nAll'inizio del combattimento nel tuo turno, ogni giocatore tira un d20. Se uno o più avversari hanno ottenuto il risultato più alto, il Drago del Caos non può attaccare quei giocatori o i planeswalker che controllano in questo combattimento.", "type": "Creatura — Drago"}, {"language": "Japanese", "multiverseId": 568826, "name": "混沌のドラゴン", "text": "飛行、速攻\n各戦闘で、混沌のドラゴンは可能なら攻撃する。\nあなたのターンの戦闘の開始時に、各プレイヤーはそれぞれ１個のd20を振る。１人以上の対戦相手が最大の出目を出したなら、この戦闘で、混沌のドラゴンはそのプレイヤーやそのプレイヤーがコントロールしているプレインズウォーカーを攻撃できない。", "type": "クリーチャー — ドラゴン"}, {"language": "Portuguese (Brazil)", "multiverseId": 569071, "name": "Dragão do Caos", "text": "Voar, ímpeto\nDragão do Caos ataca a cada combate se estiver apto.\nNo início do combate no seu turno, cada jogador rola um d20. Se um ou mais oponentes tirarem o maior resultado, Dragão do Caos não poderá atacar aqueles jogadores ou os planeswalkers que eles controlem neste combate.", "type": "Criatura — Dragão"}, {"language": "Russian", "multiverseId": 569316, "name": "Дракон Хаоса", "text": "Полет, Ускорение\nДракон Хаоса атакует в каждом бою, если может.\nВ начале боя во время вашего хода каждый игрок бросает d20. Если у одного или нескольких оппонентов наивысший результат, то Дракон Хаоса не может атаковать тех игроков или planeswalker'ов под их контролем в этом бою.", "type": "Существо — Дракон"}, {"language": "Chinese Simplified", "multiverseId": 569561, "name": "混乱巨龙", "text": "飞行，敏捷\n混乱巨龙每次战斗若能攻击，则必须攻击。\n在你回合的战斗开始时，每位牌手各掷一颗d20。如果一位或多位对手的掷骰结果最大，则混乱巨龙本次战斗中不能攻击这些牌手或由其操控的鹏洛客。", "type": "生物 ～龙"}, {"language": "Chinese Traditional", "multiverseId": 569806, "name": "混亂巨龍", "text": "飛行，敏捷\n混亂巨龍每次戰鬥若能攻擊，則必須攻擊。\n在你回合的戰鬥開始時，每位玩家各擲一顆d20。如果一位或多位對手的擲骰結果最大，則混亂巨龍本次戰鬥中不能攻擊這些玩家或由其操控的鵬洛客。", "type": "生物 ～龍"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "261982", "cardsphereId": "89450", "mcmId": "661925", "mtgjsonV4Id": "ba296e96-e323-5630-87e8-11858d3924b1", "multiverseId": "567601", "scryfallId": "08219fbc-c155-4d1d-a08c-d2546c44bccc", "scryfallIllustrationId": "4d626956-c4c2-4998-8d0d-ff98bf2f6257", "scryfallOracleId": "a04f46b4-b0b0-4aef-907f-1df1a2e261de", "tcgplayerProductId": "273874"}, "isReprint": true, "keywords": ["Flying", "Haste"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}{R}", "manaValue": 3.0, "name": "Chaos Dragon", "number": "784", "originalText": "Flying, haste\nChaos Dragon attacks each combat if able.\nAt the beginning of combat on your turn, each player rolls a d20. If one or more opponents had the highest result, Chaos Dragon can't attack those players or planeswalkers they control this combat.", "originalType": "Creature — Dragon", "power": "4", "printings": ["AFC", "CLB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1274e375b33d8be2", "tcgplayer": "https://mtgjson.com/links/46fd42812666eae6"}, "rarity": "rare", "rulings": [{"date": "2021-07-23", "text": "You roll a d20 as well as your opponents. If you had a higher result than all of your opponents, Chaos Dragon won't have any restrictions on who it may attack."}, {"date": "2021-07-23", "text": "Dice are identified by the number of faces each one has. For example, a d20 is a twenty-sided die."}, {"date": "2021-07-23", "text": "Dice used must have equally likely outcomes and the roll must be fair. Although physical dice are recommended, digital substitutes are allowed, provided they have the same number of equally likely outcomes as specified in the original roll instruction."}, {"date": "2021-07-23", "text": "An ability that tells you to roll a die will also specify what to do with the result of that roll. Most often, this is in the form of a “results table” in the card text."}, {"date": "2021-07-23", "text": "The instruction to roll a die and the effect that occurs because of the result are all part of the same ability. Players do not get the chance to respond to the ability after knowing the result of the roll."}, {"date": "2021-07-23", "text": "An effect that says “choose a target, then roll a d20” or similar still uses the normal process of putting an ability on the stack and resolving it. Choosing targets is part of putting the ability on the stack and rolling the d20 happens later, as the ability resolves."}, {"date": "2021-07-23", "text": "Some effects may modify the result of a die roll. This may be part of the instruction to roll a die or it may come from other cards. Anything that references the “result” of a die roll is looking for the result after these modifications. Anything that is looking for the “natural result” is looking for the number shown on the face of the die before these modifications."}, {"date": "2021-07-23", "text": "Some abilities, like that of Pixie Guide and Barbarian Class, replace rolling a die with rolling extra dice and ignoring the lowest roll. The ignored rolls are not considered for the effect that instructed you to roll a die, and do not cause abilities to trigger. For all intents and purposes, once you determine which dice count, any extra dice were never rolled."}, {"date": "2021-07-23", "text": "Some effects instruct you to roll again. This uses the same number and type of dice as the original roll, and that roll will use the same set of possible outcomes."}, {"date": "2021-07-23", "text": "While playing Planechase, rolling the planar die will cause any ability that triggers whenever a player rolls one or more dice to trigger. However, any effect that refers to a numerical result will ignore the rolling of the planar die."}, {"date": "2021-07-23", "text": "Tournament events have more specific rules regarding dice and die-rolling. For more information, please see the most recent version of the Magic Tournament Rules at https://wpn.wizards.com/en/document/magic-gathering-tournament-rules."}], "securityStamp": "oval", "setCode": "CLB", "subtypes": ["Dragon"], "supertypes": [], "text": "Flying, haste\nChaos Dragon attacks each combat if able.\nAt the beginning of combat on your turn, each player rolls a d20. If one or more opponents had the highest result, Chaos Dragon can't attack those players or planeswalkers they control this combat.", "toughness": "4", "type": "Creature — Dragon", "types": ["Creature"], "uuid": "a7cd2c5f-b09f-502d-a3d8-ae381f8fd4fd"}