{"artist": "David Palumbo", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 5048, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 527683, "name": "Chaoskanalisierer", "text": "Woge der Wilden Magie — Immer wenn der Chaoskanalisierer angreift, würfle einen W20.\n1—9 | Schicke die oberste Karte deiner Bibliothek ins Exil. Du kannst sie in diesem Zug spielen.\n10—19 | Schicke die obersten zwei Karten deiner Bibliothek ins Exil. Du kannst sie in diesem Zug spielen.\n20 | Schicke die obersten drei Karten deiner Bibliothek ins Exil. Du kannst sie in diesem Zug spielen.", "type": "Kreatur — Mensch, Schamane"}, {"language": "Spanish", "multiverseId": 527944, "name": "Canalizador del caos", "text": "Sobrecarga de magia salvaje — Siempre que el Canalizador del caos ataque, tira 1d20.\n1—9 | Exilia la primera carta de tu biblioteca. Puedes jugar esa carta este turno.\n10—19 | Exilia las dos primeras cartas de tu biblioteca. Puedes jugarlas este turno.\n20 | Exilia las tres primeras cartas de tu biblioteca. Puedes jugarlas este turno.", "type": "Criatura — Chamán humano"}, {"language": "French", "multiverseId": 528205, "name": "Canaliseur de chaos", "text": "Déferlement de magie sauvage — À chaque fois que le Canaliseur de chaos attaque, lancez un d20.\n1—9 | Exilez la carte du dessus de votre bibliothèque. Vous pouvez la jouer ce tour-ci.\n10—19 | Exilez les deux cartes du dessus de votre bibliothèque. Vous pouvez les jouer ce tour-ci.\n20 | Exilez les trois cartes du dessus de votre bibliothèque. Vous pouvez les jouer ce tour-ci.", "type": "Créature : humain et shamane"}, {"language": "Italian", "multiverseId": 528466, "name": "Incanalatore del Caos", "text": "Impulso di Magia Selvaggia — Ogniqualvolta l'Incanalatore del Caos attacca, tira un d20.\n1—9 | Esilia la prima carta del tuo grimorio. Puoi giocarla in questo turno.\n10—19 | Esilia le prime due carte del tuo grimorio. Puoi giocarle in questo turno.\n20 | Esilia le prime tre carte del tuo grimorio. Puoi giocarle in questo turno.", "type": "Creatura — Sciamano Umano"}, {"language": "Japanese", "multiverseId": 528727, "name": "混沌の媒介者", "text": "ワイルドマジックサージ — 混沌の媒介者が攻撃するたび、１個のd20を振る。\n１—９| あなたのライブラリーの一番上にあるカード１枚を追放する。このターン、あなたはそれをプレイしてもよい。\n10—19 | あなたのライブラリーの一番上にあるカード２枚を追放する。このターン、あなたはそれらをプレイしてもよい。\n20 | あなたのライブラリーの一番上にあるカード３枚を追放する。このターン、あなたはそれらをプレイしてもよい。", "type": "クリーチャー — 人間・シャーマン"}, {"language": "Korean", "multiverseId": 528987, "name": "혼돈 전달자", "text": "야생 마법 급등 — 혼돈 전달자가 공격할 때마다, 20면체를 굴린다.\n1—9 | 당신의 서고 맨 위 카드를 추방한다. 당신은 이 턴에 그 카드를 플레이할 수 있다.\n10-19 | 당신의 서고 맨 위 카드 두 장을 추방한다. 당신은 이 턴에 그 카드들을 플레이할 수 있다.\n20 | 당신의 서고 맨 위 카드 세 장을 추방한다. 당신은 이 턴에 그 카드들을 플레이할 수 있다.", "type": "생물 — 인간 주술사"}, {"language": "Portuguese (Brazil)", "multiverseId": 529248, "name": "Canalizador do Caos", "text": "Surto de magia selvagem — Toda vez que Canalizador do Caos atacar, role um d20.\n1—9 | Exile o card do topo de seu grimório. Você pode jogá-lo neste turno.\n10—19 | Exile os dois cards do topo de seu grimório. Você pode jogá-los neste turno.\n20 | Exile os três cards do topo de seu grimório. Você pode jogá-los neste turno.", "type": "Criatura — Humano Xamã"}, {"language": "Russian", "multiverseId": 529509, "name": "Проводник Хаоса", "text": "Выброс дикой магии — Каждый раз, когда Проводник Хаоса атакует, бросьте d20.\n1—9 | Изгоните верхнюю карту вашей библиотеки. Вы можете разыграть ту карту в этом ходу.\n10—19 | Изгоните две верхние карты вашей библиотеки. Вы можете разыграть их в этом ходу.\n20 | Изгоните три верхние карты вашей библиотеки. Вы можете разыграть их в этом ходу.", "type": "Существо — Человек Шаман"}, {"language": "Chinese Simplified", "multiverseId": 529769, "name": "混沌通联师", "text": "狂野魔法浪涌～每当混沌通联师攻击时，掷一颗d20。\n1～9 | 放逐你的牌库顶牌。本回合中，你可以使用该牌。\n10～19 | 放逐你牌库顶的两张牌。本回合中，你可以使用这些牌。\n20 | 放逐你牌库顶的三张牌。本回合中，你可以使用这些牌。", "type": "生物 ～人类／祭师"}, {"language": "Chinese Traditional", "multiverseId": 530029, "name": "混沌通聯師", "text": "狂野魔法浪湧～每當混沌通聯師攻擊時，擲一顆d20。\n1～9 | 放逐你的牌庫頂牌。本回合中，你可以使用該牌。\n10～19 | 放逐你牌庫頂的兩張牌。本回合中，你可以使用這些牌。\n20 | 放逐你牌庫頂的三張牌。本回合中，你可以使用這些牌。", "type": "生物 ～人類／祭師"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "248408", "cardKingdomId": "248056", "cardsphereId": "78977", "mcmId": "571290", "mcmMetaId": "343722", "mtgArenaId": "77241", "mtgjsonV4Id": "c6b5f36e-e416-57a0-be86-a9ec14dd2c58", "mtgoId": "91774", "multiverseId": "527423", "scryfallId": "7b9bb587-f732-42c9-a2a7-152629889997", "scryfallIllustrationId": "f99e1760-e9f6-4eb0-b54e-e823b9f515f3", "scryfallOracleId": "ea9031de-6169-4b1c-9390-7fdaf876c7cd", "tcgplayerProductId": "243304"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}{R}", "manaValue": 4.0, "name": "Chaos Channeler", "number": "136", "originalText": "Wild Magic Surge — Whenever Chaos Channeler attacks, roll a d20.\n1–9 | Exile the top card of your library. You may play it this turn.\n10–19 | Exile the top two cards of your library. You may play them this turn.\n20 | Exile the top three cards of your library. You may play them this turn.", "originalType": "Creature — Human Shaman", "power": "4", "printings": ["AFR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d015730e60d176e4", "cardKingdomFoil": "https://mtgjson.com/links/1babf4671a5f916a", "cardmarket": "https://mtgjson.com/links/2ae2e09e463589e8", "tcgplayer": "https://mtgjson.com/links/9e38b7045ae74008"}, "rarity": "uncommon", "rulings": [{"date": "2021-07-23", "text": "The cards are exiled face up."}, {"date": "2021-07-23", "text": "If you do not play the exiled cards on the turn that they are exiled, they remain exiled indefinitely."}, {"date": "2021-07-23", "text": "Normal costs and timing permissions apply to cards played this way. Unless an effect says you can play additional lands during your turn, you cannot play a land exiled this way if you have already played one this turn."}, {"date": "2021-07-23", "text": "Dice are identified by the number of faces each one has. For example, a d20 is a twenty-sided die."}, {"date": "2021-07-23", "text": "Dice used must have equally likely outcomes and the roll must be fair. Although physical dice are recommended, digital substitutes are allowed, provided they have the same number of equally likely outcomes as specified in the original roll instruction."}, {"date": "2021-07-23", "text": "An ability that tells you to roll a die will also specify what to do with the result of that roll. Most often, this is in the form of a “results table” in the card text."}, {"date": "2021-07-23", "text": "The instruction to roll a die and the effect that occurs because of the result are all part of the same ability. Players do not get the chance to respond to the ability after knowing the result of the roll."}, {"date": "2021-07-23", "text": "An effect that says “choose a target, then roll a d20” or similar still uses the normal process of putting an ability on the stack and resolving it. Choosing targets is part of putting the ability on the stack and rolling the d20 happens later, as the ability resolves."}, {"date": "2021-07-23", "text": "Some effects may modify the result of a die roll. This may be part of the instruction to roll a die or it may come from other cards. Anything that references the “result” of a die roll is looking for the result after these modifications. Anything that is looking for the “natural result” is looking for the number shown on the face of the die before these modifications."}, {"date": "2021-07-23", "text": "Some abilities, like that of Pixie Guide and Barbarian Class, replace rolling a die with rolling extra dice and ignoring the lowest roll. The ignored rolls are not considered for the effect that instructed you to roll a die, and do not cause abilities to trigger. For all intents and purposes, once you determine which dice count, any extra dice were never rolled."}, {"date": "2021-07-23", "text": "Some effects instruct you to roll again. This uses the same number and type of dice as the original roll, and that roll will use the same set of possible outcomes."}, {"date": "2021-07-23", "text": "While playing Planechase, rolling the planar die will cause any ability that triggers whenever a player rolls one or more dice to trigger. However, any effect that refers to a numerical result will ignore the rolling of the planar die."}, {"date": "2021-07-23", "text": "Tournament events have more specific rules regarding dice and die-rolling. For more information, please see the most recent version of the Magic Tournament Rules at https://wpn.wizards.com/en/document/magic-gathering-tournament-rules."}], "setCode": "AFR", "subtypes": ["Human", "Shaman"], "supertypes": [], "text": "Wild Magic Surge — Whenever Chaos Channeler attacks, roll a d20.\n1—9 | Exile the top card of your library. You may play it this turn.\n10—19 | Exile the top two cards of your library. You may play them this turn.\n20 | Exile the top three cards of your library. You may play them this turn.", "toughness": "3", "type": "Creature — Human Shaman", "types": ["Creature"], "uuid": "0548f416-ba0f-5dc2-a1f1-67174b2799d4"}