{"artist": "Mark Tedin", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 2.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "1997", "hasFoil": false, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "955a8cfe-c705-5cd4-99b5-23bfcb3222a8", "scryfallId": "74319066-c386-4284-bf81-af2dcd70f493", "scryfallIllustrationId": "42f959e6-2b79-41a2-aaef-a28b25aa961f", "scryfallOracleId": "edb455f4-8dc9-4b7c-b25c-cb51b7dfbb41"}, "isOversized": true, "isReprint": true, "isReserved": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {}, "manaCost": "{2}", "manaValue": 2.0, "name": "Chaos Orb", "number": "1", "printings": ["2ED", "30A", "CED", "CEI", "LEA", "LEB", "O90P"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "You can arrange your cards any time before the Orb is put onto the battlefield, but not after. In general, you should not stack cards or put them in places where your opponent can’t read the names of all of them or count them. This is recommended good gaming practice."}, {"date": "2004-10-04", "text": "It must flip 360 degrees (that’s what “flip” means). And this flip must be in the air and not in your hand."}, {"date": "2004-10-04", "text": "Chaos Orb can only affect permanents. Cards that are in the game but not on the battlefield, such as those in the Library and Graveyard, can’t be affected."}, {"date": "2004-10-04", "text": "If you have sleeves on cards, they count as the cards."}, {"date": "2004-10-04", "text": "You can’t interfere in any physical way with activating this ability."}, {"date": "2004-10-04", "text": "This is a not a targeted ability."}, {"date": "2019-01-27", "text": "If you are playing Chaos Orb in the Old School format, the card's text is “{1}, {T}: Choose a nontoken permanent on the battlefield. If Chaos Orb is on the battlefield, flip Chaos Orb onto the battlefield from a height of at least one foot. If Chaos Orb turns over completely at least once during the flip, and lands resting on the chosen permanent, destroy that permanent. Then destroy Chaos Orb.”"}], "setCode": "O90P", "subtypes": [], "supertypes": [], "text": "{1}, {T}: If Chaos Orb is on the battlefield, flip Chaos Orb onto the battlefield from a height of at least one foot. If Chaos Orb turns over completely at least once during the flip, destroy all nontoken permanents it touches. Then destroy Chaos Orb.", "type": "Artifact", "types": ["Artifact"], "uuid": "658e7d13-0a1a-551a-9d54-cb010a8de457"}