{"artist": "Iain McCaig", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 3420, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "3602093f-e07d-50ad-9ab5-9a50b8ba95f2", "mtgoId": "91285", "scryfallId": "d80e1938-45ed-4abb-9c85-f6a6a4c11e9d", "scryfallIllustrationId": "e2f7e12e-e5f7-4083-b066-fb0e74161d47", "scryfallOracleId": "3d177c04-9aa3-44b8-bbe4-df5de23a4ce6"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}{R}", "manaValue": 3.0, "name": "Chef's Kiss", "number": "91285", "originalReleaseDate": "2021-06-19", "printings": ["MH2", "PMH2", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-06-18", "text": "Chef's Kiss can target any spell that targets a single permanent or player, including a spell you control."}, {"date": "2021-06-18", "text": "If there are any legal targets that are not you or permanents you control, you must reselect the targets at random."}, {"date": "2021-06-18", "text": "If there are no legal targets that could be selected, the targets remain unchanged. Note that this may not mean that those targets are illegal as the spell resolves. For example, if an opponent in a two-player game has hexproof and casts Lava Spike targeting you, Chef's Kiss will not be able to change the target. However, this doesn't make you an illegal target, and both the original spell and the copy will still target you and deal 3 damage to you."}, {"date": "2021-06-18", "text": "Note that Chef's Kiss may make some or all of the targets of a spell illegal. For example, any spell an opponent cast that targets a “creature you control” will be unable to find a new legal target, and its target will remain unchanged. In that case, that part of the spell will do nothing. If that was the spell's only target, that spell will be removed from the stack when it tries to resolve."}, {"date": "2021-06-18", "text": "If a spell has multiple instances of the word “target,” but all of them target the same permanent or player, it is a legal target for Chef's Kiss. In that case, a new target will be reselected at random for each instance of the word target in its rules text. The same is true for the copy."}, {"date": "2021-06-18", "text": "Neither copying a spell nor reselecting its targets counts as casting a spell."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Gain control of target spell that targets only a single permanent or player. Copy it, then reselect the targets at random for the spell and the copy. The new targets can't be you or a permanent you control.", "type": "Instant", "types": ["Instant"], "uuid": "28d0273f-1cc5-5358-ab63-0905a1b1f625"}