{"artist": "Heather Hudson", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 3.0, "edhrecRank": 381, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 111623, "name": "Akkord des Rufes", "text": "Einberufen (Jede Kreatur, die du tappst, während du diesen Zauberspruch spielst, reduziert dessen Kosten um {1} oder um ein Mana der Farbe jener Kreatur.)\nDurchsuche deine Bibliothek nach einer Kreaturenkarte mit umgewandelten Manakosten von X oder weniger und bringe sie ins Spiel. Mische danach deine Bibliothek.", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 113153, "name": "Acorde de llamada", "text": "Convocar (Cada criatura que gires al jugar este hechizo reduce su coste en {1} o en un maná del color de esa criatura.)\nBusca en tu biblioteca una carta de criatura con coste de maná convertido de X o menos y ponla en juego. Luego baraja tu biblioteca.", "type": "Instantáneo"}, {"language": "French", "multiverseId": 111929, "name": "Corde d'adjuration", "text": "Convocation (Chaque créature que vous engagez en jouant ce sort réduit son coût de {1} ou d'un mana de la couleur de cette créature.)\nCherchez dans votre bibliothèque une carte de créature avec un coût converti de mana de X ou moins et mettez-la en jeu. Mélangez ensuite votre bibliothèque.", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 112235, "name": "Corda della Convocazione", "text": "Convocazione (Ciascuna creatura che TAPpi mentre giochi questa magia riduce il suo costo di {1} o di un mana del colore di quella creatura.)\nPassa in rassegna il tuo grimorio, scegli una carta creatura con costo di mana convertito pari o inferiore a X e mettila in gioco. Poi rimescola il tuo grimorio.", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 112541, "name": "召喚の調べ", "text": "召集 （あなたがこの呪文をプレイする段階であなたがタップした各クリーチャーにつき、この呪文のコストはそのクリーチャーの色のマナ１点か{1}少なくなる。）\nあなたのライブラリーから、点数で見たマナ・コストがＸ以下のクリーチャー・カードを１枚探し、それを場に出す。 その後あなたのライブラリーを切り直す。", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 112847, "name": "Acorde do Chamado", "text": "Convocar (Cada criatura que você vira ao jogar esta mágica reduz seu custo em {1} ou em um mana da cor daquela criatura.)\nProcure em seu grimório um card de criatura com custo de mana convertido menor ou igual a X e coloque-o em jogo. Depois, embaralhe seu grimório.", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 114255, "name": "Призывный аккорд", "text": "Созыв (Когда вы разыгрываете это заклинание, каждое повернутое существо уменьшает стоимость заклинания на {1} или на один пункт маны цвета этого существа).\nНайдите в своей библиотеке карту существа с общей мановой стоимостью Х или меньше и введите его в игру. Затем перетасуйте библиотеку.", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 111317, "name": "和声召集", "text": "召集（使用此咒语时，你每为它横置一个生物，便可以少支付{1}，或一点所横置生物颜色的法术力。）\n从你的牌库中搜寻一张总法术力费用小于或等于X的生物牌，并将它放置进场。 然后将你的牌库洗牌。", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "118680", "cardKingdomId": "118389", "cardsphereId": "37921", "mcmId": "13327", "mcmMetaId": "7905", "mtgjsonV4Id": "4b53975f-d0c7-5d48-a2f2-e9eb78dc9903", "mtgoFoilId": "23455", "mtgoId": "23454", "multiverseId": "89064", "scryfallId": "e064174b-8f07-4fea-9eef-c3b5d0220b1a", "scryfallIllustrationId": "3d8f3d44-18f8-4060-aa9f-846a40d05805", "scryfallOracleId": "6789a170-f2c5-4fc0-8a45-2b2361e67410", "tcgplayerProductId": "13224"}, "keywords": ["Convoke"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{X}{G}{G}{G}", "manaValue": 3.0, "name": "Chord of Calling", "number": "156", "originalText": "Convoke (Each creature you tap while playing this spell reduces its cost by {1} or by one mana of that creature's color.)\nSearch your library for a creature card with converted mana cost X or less and put it into play. Then shuffle your library.", "originalType": "Instant", "printings": ["2XM", "M15", "P30A", "PRM", "RAV"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2810b573276b5731", "cardKingdomFoil": "https://mtgjson.com/links/b0f59a28b9d46573", "cardmarket": "https://mtgjson.com/links/a6cf6eb4ed303304", "tcgplayer": "https://mtgjson.com/links/90e4dc3c8c6dcdc9"}, "rarity": "rare", "rulings": [{"date": "2020-08-07", "text": "If a card in a player's library has {X} in its mana cost, X is considered to be 0."}, {"date": "2021-03-19", "text": "You can tap any untapped creature you control to convoke a spell, even one you haven't controlled continuously since the beginning of your most recent turn."}, {"date": "2021-03-19", "text": "When calculating a spell's total cost, include any alternative costs, additional costs, or anything else that increases or reduces the cost to cast the spell. Convoke applies after the total cost is calculated. Convoke doesn't change a spell's mana cost or mana value."}, {"date": "2021-03-19", "text": "If a creature you control has a mana ability with {T} in the cost, activating that ability while casting a spell with convoke will result in the creature being tapped before you pay the spell's costs. You won't be able to tap it again for convoke. Similarly, if you sacrifice a creature to activate a mana ability while casting a spell with convoke, that creature won't be on the battlefield when you pay the spell's costs, so you won't be able to tap it for convoke."}, {"date": "2021-03-19", "text": "When using convoke to cast a spell with {X} in its mana cost, first choose the value for X. That choice, plus any cost increases or decreases, will determine the spell's total cost. Then you can tap creatures you control to help pay that cost. For example, if you cast Chord of Calling (a spell with convoke and mana cost {X}{G}{G}{G}) and choose X to be 3, the total cost is {3}{G}{G}{G}. If you tap two green creatures and two red creatures, you'll have to pay {1}{G}."}], "setCode": "RAV", "subtypes": [], "supertypes": [], "text": "Convoke (Your creatures can help cast this spell. Each creature you tap while casting this spell pays for {1} or one mana of that creature's color.)\nSearch your library for a creature card with mana value X or less, put it onto the battlefield, then shuffle.", "type": "Instant", "types": ["Instant"], "uuid": "c8c7504a-28d0-54a2-9e14-f89c64ae3da4", "watermark": "selesnya"}