{"artist": "Una Fricker", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 1.0, "edhrecRank": 18791, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "name": "Kreisende Geier", "text": "Fliegend\nEntferne während Deiner Versorgungsphase die oberste Kreaturenkarte Deines Friedhofs ganz aus dem Spiel oder begrabe die Kreisenden Geier.\nWenn die Kreisenden Geier auf Deiner Hand sind, kannst Du sie abwerfen. Spiele diese Fähigkeit wie einen Spontanzauber.", "type": "Beschwörung von Vögeln"}, {"language": "Spanish", "name": "Buitres al acecho"}, {"language": "French", "name": "Vautours tournoyants"}, {"language": "Italian", "name": "Avvoltoi Volteggianti"}, {"language": "Japanese", "name": "待ち受ける禿鷹"}, {"language": "Portuguese (Brazil)", "name": "Abutres Circulantes"}], "frameVersion": "1997", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "33038", "cardsphereId": "47094", "mcmId": "8574", "mcmMetaId": "1001", "mtgjsonV4Id": "9b4793ad-8ee6-594c-abf3-0dd4dd04cdc2", "mtgoFoilId": "9384", "mtgoId": "9383", "multiverseId": "4452", "scryfallId": "8dae8e49-c2b6-4965-9249-49f93449d271", "scryfallIllustrationId": "94352f51-6e8d-40a8-80c5-1c75d52506a4", "scryfallOracleId": "7fd6fe21-8fb8-499b-9dd4-806d0d660265", "tcgplayerProductId": "6005"}, "keywords": ["Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "paupercommander": "Restricted", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{B}", "manaValue": 1.0, "name": "Circling Vultures", "number": "64", "originalText": "Flying\nDuring your upkeep, remove the top creature card in your graveyard from the game or bury Circling Vultures.\nIf Circling Vultures is in your hand, you may discard it. Play this ability as an instant.", "originalType": "Summon - Birds", "power": "3", "printings": ["WTH"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/40f20865939f0bf6", "cardmarket": "https://mtgjson.com/links/2e5e4386a3bb3303", "tcgplayer": "https://mtgjson.com/links/1ee09a95f78d5856"}, "rarity": "uncommon", "rulings": [{"date": "2008-04-01", "text": "The “top” card of your graveyard is the card that was put there most recently."}, {"date": "2008-04-01", "text": "Players may not rearrange the cards in their graveyards. This is a little-known rule because new cards that care about graveyard order haven’t been printed in years."}, {"date": "2008-04-01", "text": "If an effect or rule puts two or more cards into the same graveyard at the same time, the owner of those cards may arrange them in any order."}, {"date": "2008-04-01", "text": "The last thing that happens to a resolving instant or sorcery spell is that it’s put into its owner’s graveyard. —Example: You cast Wrath of God. All creatures on the battlefield are destroyed. You arrange all the cards put into your graveyard this way in any order you want. The other players in the game do the same to the cards that are put into their graveyards. Then you put Wrath of God into your graveyard, on top of the other cards."}, {"date": "2008-04-01", "text": "Say you’re the owner of both a permanent and an Aura that’s attached to it. If both the permanent and the Aura are destroyed at the same time (by Akroma’s Vengeance, for example), you decide the order they’re put into your graveyard. If just the enchanted permanent is destroyed, it’s put into your graveyard first. Then, after state-based actions are checked, the Aura (which is no longer attached to anything) is put into your graveyard on top of it."}, {"date": "2008-04-01", "text": "When the ability resolves, you choose whether to sacrifice the creature or perform the other action. If you can’t perform the other action, then you must sacrifice the creature."}, {"date": "2008-04-01", "text": "If the creature is no longer on the battlefield when the ability resolves, you may still perform the action if you want."}, {"date": "2008-04-01", "text": "Circling Vultures’s discard ability is a static ability, not an activated ability. Although it acts like an activated ability that says “Discard Circling Vultures: Nothing happens,” it is not one and cards like Pithing Needle or Abeyance won’t prevent you from being able to discard it."}], "setCode": "WTH", "subtypes": ["Bird"], "supertypes": [], "text": "Flying\nYou may discard Circling Vultures any time you could cast an instant.\nAt the beginning of your upkeep, sacrifice Circling Vultures unless you exile the top creature card of your graveyard.", "toughness": "2", "type": "Creature — Bird", "types": ["Creature"], "uuid": "b7d9ee60-5f59-5173-b3d5-61b32d0debaf"}