{"artist": "Leon Tukker", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 8.0, "edhrecRank": 7976, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "35ad91cb-c2d7-58b5-a63a-13cf77f48728", "mtgoId": "105858", "scryfallId": "98893175-3355-4979-9880-8fa326ff8ae2", "scryfallIllustrationId": "4a6f687b-05cd-4d86-861c-fbce8c7b0139", "scryfallOracleId": "d4d65797-2b92-4265-9169-133120c86c7f"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Trample", "Unearth"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{8}", "manaValue": 8.0, "name": "Cityscape Leveler", "number": "105858", "originalReleaseDate": "2022-11-18", "power": "8", "printings": ["BRO", "PBRO", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2022-10-14", "text": "Cityscape Leveler’s triggered ability won’t trigger when you activate its unearth ability from your graveyard. It will, however, trigger when you attack with Cityscape Leveler that turn."}, {"date": "2022-10-14", "text": "If you activate a card’s unearth ability but that card is removed from your graveyard before the ability resolves, that unearth ability will do nothing as it resolves."}, {"date": "2022-10-14", "text": "Activating a card’s unearth ability isn’t the same as casting that card. The unearth ability is put on the stack, but the card is not. Spells and abilities that interact with activated abilities (such as Defabricate’s second mode) will interact with unearth, but spells and abilities that interact with spells (such as Scatter Ray) will not."}, {"date": "2022-10-14", "text": "At the beginning of the next end step, a permanent returned to the battlefield with unearth is exiled. This is a delayed triggered ability, and it can be countered by effects such as Defabricate that counter triggered abilities. If the ability is countered, the permanent will stay on the battlefield and the delayed triggered ability won’t trigger again. However, the replacement effect will still exile the permanent if it eventually leaves the battlefield."}, {"date": "2022-10-14", "text": "Unearth grants haste to the permanent that’s returned to the battlefield (even if it’s not a creature card). However, neither of the “exile” abilities is granted to that permanent. If that permanent loses all its abilities, it will still be exiled at the beginning of the next end step, and if it would leave the battlefield, it is still exiled instead."}, {"date": "2022-10-14", "text": "If a permanent returned to the battlefield with unearth would leave the battlefield for any reason, it’s exiled instead—unless the spell or ability that’s causing the permanent to leave the battlefield is actually trying to exile it! In that case, it succeeds at exiling it. If that spell or ability later returns the card to the battlefield (as Static Net might, for example), the permanent card will return to the battlefield as a new object with no relation to its previous existence. The unearth effects will no longer apply to it."}, {"date": "2022-10-14", "text": "Powerstone tokens are a kind of predefined token. Each one has the artifact subtype “Powerstone” and the ability “{T}: Add {C}. This mana can’t be spent to cast a nonartifact spell.”"}, {"date": "2022-10-14", "text": "You can use the {C} added by a Powerstone token on anything that isn’t a nonartifact spell. This includes paying costs to activate abilities of both artifact and nonartifact permanents, paying ward costs, and so on."}, {"date": "2022-10-14", "text": "Although all the cards in The Brothers’ War that create Powerstone tokens create a tapped Powerstone token, entering the battlefield tapped isn’t part of the token’s definition. Notably, if you create a token that is a copy of a Powerstone token, the token copy won’t enter the battlefield tapped."}], "setCode": "PRM", "subtypes": ["Construct"], "supertypes": [], "text": "Trample\nWhen you cast this spell and whenever Cityscape Leveler attacks, destroy up to one target nonland permanent. Its controller creates a tapped Powerstone token.\nUnearth {8}", "toughness": "8", "type": "Artifact Creature — Construct", "types": ["Artifact", "Creature"], "uuid": "dc3bea4a-97af-5d1f-8962-747211b048b9"}