{"artist": "Michael Komarck", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G", "U", "W"], "colors": ["G", "U", "W"], "convertedManaCost": 7.0, "edhrecRank": 17089, "finishes": ["nonfoil", "foil"], "flavorText": "Be worthy of a single blessing, and many more will follow.", "foreignData": [{"flavorText": "Bist du erst einmal eines Segens würdig, werden bald viele weitere folgen.", "language": "German", "multiverseId": 187630, "name": "Deutliches Ultimatum", "text": "Bestimme fünf bleibende Karten, die du kontrollierst. Für jede dieser bleibenden Karten kannst du deine Bibliothek nach einer Karte mit dem gleichen Namen wie diese bleibende Karte durchsuchen. Bringe diese Karten getappt ins Spiel und mische dann deine Bibliothek.", "type": "Hexerei"}, {"flavorText": "Si eres merecedor de una bendición, otras la seguirán.", "language": "Spanish", "multiverseId": 187879, "name": "Ultimátum estentóreo", "text": "Elige cinco permanentes que controles. Por cada uno de esos permanentes, puedes buscar en tu biblioteca una carta con el mismo nombre que ese permanente. Pon en juego giradas esas cartas, luego baraja tu biblioteca.", "type": "Conjuro"}, {"flavorText": "Sois digne d'une bénédiction, et d'autres suivront.", "language": "French", "multiverseId": 188626, "name": "Ultimatum claironnant", "text": "Choisissez cinq permanents que vous contrôlez. Pour chacun de ces permanents, vous pouvez chercher dans votre bibliothèque une carte ayant le même nom que ce permanent. Mettez ces cartes en jeu engagées et mélangez ensuite votre bibliothèque.", "type": "Rituel"}, {"flavorText": "Dimostrati degno di una sola benedizione e molte altre ne seguiranno.", "language": "Italian", "multiverseId": 188377, "name": "Ultimatum Squillante", "text": "Scegli cinque permanenti che controlli. Per ognuno di quei permanenti, puoi passare in rassegna il tuo grimorio per una carta con lo stesso nome di quel permanente. Metti quelle carte in gioco TAPpate, poi rimescola il tuo grimorio.", "type": "Stregoneria"}, {"flavorText": "一つの祝福に値する者となるべし。されば多くがその後に続くであろう。", "language": "Japanese", "multiverseId": 187132, "name": "朗々たる根本原理", "text": "あなたがコントロールするパーマネントを５つ選ぶ。 それらのパーマネント１つにつき、あなたはあなたのライブラリーからそのパーマネントと同じ名前を持つカードを１枚探してもよい。 それらのカードをタップ状態で場に出し、その後あなたのライブラリーを切り直す。", "type": "ソーサリー"}, {"flavorText": "Seja digno de uma única bênção e muitas outras virão.", "language": "Portuguese (Brazil)", "multiverseId": 188128, "name": "Ultimato do Clarão", "text": "Escolha cinco permanentes que você controla. Para cada uma dessas permanentes, você pode procurar em seu grimório por um card com o mesmo nome daquela permanente. Coloque esses cards em jogo virados e depois embaralhe seu grimório.", "type": "Feitiço"}, {"flavorText": "Будь достоин одной медали, и ты заслужишь великое множество.", "language": "Russian", "multiverseId": 188875, "name": "Призывный Ультиматум", "text": "Выберите пять перманентов под вашим контролем. Для каждого из тех перманентов вы можете найти в вашей библиотеке карту с тем же именем, что и у того перманента. Положите те карты в игру повернутыми, затем перетасуйте вашу библиотеку.", "type": "Волшебство"}, {"flavorText": "若有资格领受祝福，就将能领受更多祝福。", "language": "Chinese Simplified", "multiverseId": 187381, "name": "号召通牒", "text": "选择五个由你操控的永久物。 对每一个这类永久物而言，你可以分别从你的牌库中搜寻一张与该永久物同名的牌。 将那些牌横置进场，然后将你的牌库洗牌。", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "126020", "cardKingdomId": "125782", "cardsphereId": "42297", "mcmId": "19916", "mcmMetaId": "10227", "mtgjsonV4Id": "3f365fb3-f0ad-51f8-b350-a823de1bf6c2", "mtgoFoilId": "31220", "mtgoId": "31219", "multiverseId": "175142", "scryfallId": "39e8bf21-0baf-4ee9-b224-b9eee50df280", "scryfallIllustrationId": "b2a2eb98-0080-43fb-9264-bcb03fb70642", "scryfallOracleId": "5fbd39e9-8736-4722-bb9b-6a7da8e47c84", "tcgplayerProductId": "27633"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{G}{G}{W}{W}{W}{U}{U}", "manaValue": 7.0, "name": "Clarion Ultimatum", "number": "163", "originalText": "Choose five permanents you control. For each of those permanents, you may search your library for a card with the same name as that permanent. Put those cards into play tapped, then shuffle your library.", "originalType": "Sorcery", "printings": ["ALA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1e975b6a4f5fbf9e", "cardKingdomFoil": "https://mtgjson.com/links/f1c98d0977579509", "cardmarket": "https://mtgjson.com/links/0a4fd8809ac9c1fd", "tcgplayer": "https://mtgjson.com/links/cf9c92bf1b0f57c7"}, "rarity": "rare", "rulings": [{"date": "2008-10-01", "text": "This spell has no targets. You don’t choose five permanents you control until Clarion Ultimatum resolves. If you control fewer than five permanents at that time, choose each permanent you do control."}, {"date": "2008-10-01", "text": "The five permanents you choose must all be different. However, some of them may have the same name as one another. For example, you may choose two Empyrial Archangels and three Plains. If you do, you search your library for up to two more Empyrial Archangels and up to three more Plains and put them onto the battlefield tapped."}, {"date": "2008-10-01", "text": "If you choose a permanent whose name has been changed by an effect (for example, a Clone that’s copying another creature), you’ll search for a card with the new name, not one with the original name. Note that changing a land’s subtype doesn’t change its name."}, {"date": "2008-10-01", "text": "If you choose a permanent with no name, such as a face-down creature, no card in your library can be found with that name."}, {"date": "2008-10-01", "text": "You make just one search. (This could matter for cards like Aven Mindcensor, for example.)"}, {"date": "2008-10-01", "text": "The cards all enter the battlefield at the same time. If one of the cards that’s entering the battlefield is an Aura, it must enter the battlefield attached to a permanent already on the battlefield. It can’t enter the battlefield attached to another permanent entering the battlefield via Clarion Ultimatum. If an Aura can’t enter the battlefield this way, it remains in your library."}, {"date": "2008-10-01", "text": "If you find a card that isn’t a permanent card while searching (for example, you chose an Illusion token and find the split card Illusion/Reality), that card remains in your library."}], "setCode": "ALA", "subtypes": [], "supertypes": [], "text": "Choose five permanents you control. For each of those permanents, you may search your library for a card with the same name as that permanent. Put those cards onto the battlefield tapped, then shuffle.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "88df3b21-3898-5baa-b560-30bcdf6d3cbe"}