{"artist": "Andrey Kuzinskiy", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 4.0, "edhrecRank": 7448, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 532013, "name": "Lehmgolem", "text": "{6}, würfle einen W8: Monstrum X, wobei X gleich dem Ergebnis ist. (Falls diese Kreatur nicht monströs ist, lege X +1/+1-Marken auf sie und sie wird monströs.)\nBerserker — Wenn der Lehmgolem monströs wird, zerstöre eine bleibende Karte deiner Wahl.", "type": "Artefaktkreatur — Golem"}, {"language": "Spanish", "multiverseId": 532067, "name": "Gólem de arcilla", "text": "{6}, tirar 1d8: Monstruosidad X, donde X es el resultado. (Si esta criatura no es monstruosa, pon X contadores +1/+1 sobre ella y se convierte en monstruosa.)\nBerserk — Cuando el Gólem de arcilla se convierta en monstruoso, destruye el permanente objetivo.", "type": "Criatura artefacto — Gólem"}, {"language": "French", "multiverseId": 532121, "name": "Golem d'argile", "text": "{6}, lancez un d8 : Monstruosité X, X étant le résultat. (Si cette créature n'est pas monstrueuse, mettez X marqueurs +1/+1 sur elle et elle devient monstrueuse.)\nBerserk — Quand le Golem d'argile devient monstrueux, détruisez un permanent ciblé.", "type": "Créature-artefact : golem"}, {"language": "Italian", "multiverseId": 532175, "name": "Golem di Argilla", "text": "{6}, Tira un d8: Mostruosità X, dove X è il risultato. (Se questa creatura non è mostruosa, metti X segnalini +1/+1 su di essa e diventa mostruosa.)\nBerserk — Quando il Golem di Argilla diventa mostruoso, distruggi un permanente bersaglio.", "type": "Creatura Artefatto — Golem"}, {"language": "Japanese", "multiverseId": 532229, "name": "クレイ・ゴーレム", "text": "{6}, １個のd8を振る：怪物化Ｘを行う。Ｘはその出目に等しい。（このクリーチャーが怪物的でないなら、これの上に＋１/＋１カウンターＸ個を置く。これは怪物的になる。）\nバーサーク ― クレイ・ゴーレムが怪物的になったとき、パーマネント１つを対象とする。それを破壊する。", "type": "アーティファクト・クリーチャー — ゴーレム"}, {"language": "Portuguese (Brazil)", "multiverseId": 532283, "name": "Golem de Argila", "text": "{6}, role um d8: Monstruosidade X, sendo X o resultado. (Se esta criatura não for monstruosa, coloque X marcadores +1/+1 nela e ela se tornará monstruosa.)\nBerserk — Quando Golem de Argila se tornar monstruoso, destrua a permanente alvo.", "type": "Criatura Artefato — Golem"}, {"language": "Russian", "multiverseId": 532337, "name": "Глиняный Голем", "text": "{6}, бросьте d8: Чудовищность X, где X — результат броска. (Если это существо не является чудовищным, положите на него X жетонов +1/+1, и оно становится чудовищным.)\nИсступление — Когда Глиняный Голем становится чудовищным, уничтожьте целевой перманент.", "type": "Артефакт Существо — Голем"}, {"language": "Chinese Simplified", "multiverseId": 532391, "name": "黏土魔像", "text": "{6}，掷一颗d8：蛮化X，X为掷骰结果。（如果此生物未蛮化，则在其上放置X个+1/+1指示物且它已蛮化。）\n狂暴态～当黏土魔像蛮化时，消灭目标永久物。", "type": "神器生物 ～魔像"}, {"language": "Chinese Traditional", "multiverseId": 532445, "name": "黏土魔像", "text": "{6}，擲一顆d8：蠻化X，X為擲骰結果。（如果此生物未蠻化，則在其上放置X個+1/+1指示物且它已蠻化。）\n狂暴態～當黏土魔像蠻化時，消滅目標永久物。", "type": "神器生物 ～魔像"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "249138", "cardsphereId": "79951", "mcmId": "572222", "mtgjsonV4Id": "ac60fdbd-58c8-5d3b-8bfe-4238fd348b21", "multiverseId": "531959", "scryfallId": "3a949c88-07bb-4526-9460-9324574cc466", "scryfallIllustrationId": "85e32503-a711-4811-9d8b-4ddf231dd4f9", "scryfallOracleId": "8773c2ea-ef41-4403-bb52-07f0d70d9bbe", "tcgplayerProductId": "243762"}, "isStarter": true, "keywords": ["Monstrosity"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "paupercommander": "Restricted", "vintage": "Legal"}, "manaCost": "{4}", "manaValue": 4.0, "name": "Clay Golem", "number": "58", "originalText": "{6}, Roll a d8: Monstrosity X, where X is the result. (If this creature isn't monstrous, put X +1/+1 counters on it and it becomes monstrous.)\nBerserk — When Clay Golem becomes monstrous, destroy target permanent.", "originalType": "Artifact Creature — Golem", "power": "4", "printings": ["AFC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/4b18c74ff93fbbe6", "tcgplayer": "https://mtgjson.com/links/2e715e83135676e8"}, "rarity": "uncommon", "rulings": [{"date": "2021-07-23", "text": "Once a creature becomes monstrous, it can't become monstrous again. If the creature is already monstrous when the monstrosity ability resolves, nothing happens. However, because rolling the d8 is part of the cost of activating the ability, if you don't like what you rolled and have another {6} handy, you can respond to the ability by activating the ability again. Good luck!"}, {"date": "2021-07-23", "text": "Monstrous isn't an ability that a creature has. It's just something true about that creature. If the creature stops being a creature or loses its abilities, it will continue to be monstrous."}, {"date": "2021-07-23", "text": "An ability that triggers when a creature becomes monstrous won't trigger if that creature isn't on the battlefield when its monstrosity ability resolves."}, {"date": "2021-07-23", "text": "You can activate Clay Golem's first ability even after it has become monstrous. It won't become monstrous again and you won't put any counters on it, but you will roll a die to activate the ability, which may cause abilities of other permanents to trigger."}, {"date": "2021-07-23", "text": "Dice are identified by the number of faces each one has. For example, a d20 is a twenty-sided die."}, {"date": "2021-07-23", "text": "Dice used must have equally likely outcomes and the roll must be fair. Although physical dice are recommended, digital substitutes are allowed, provided they have the same number of equally likely outcomes as specified in the original roll instruction."}, {"date": "2021-07-23", "text": "An ability that tells you to roll a die will also specify what to do with the result of that roll. Most often, this is in the form of a “results table” in the card text."}, {"date": "2021-07-23", "text": "The instruction to roll a die and the effect that occurs because of the result are all part of the same ability. Players do not get the chance to respond to the ability after knowing the result of the roll."}, {"date": "2021-07-23", "text": "An effect that says “choose a target, then roll a d20” or similar still uses the normal process of putting an ability on the stack and resolving it. Choosing targets is part of putting the ability on the stack and rolling the d20 happens later, as the ability resolves."}, {"date": "2021-07-23", "text": "Some effects may modify the result of a die roll. This may be part of the instruction to roll a die or it may come from other cards. Anything that references the “result” of a die roll is looking for the result after these modifications. Anything that is looking for the “natural result” is looking for the number shown on the face of the die before these modifications."}, {"date": "2021-07-23", "text": "Some abilities, like that of Pixie Guide and Barbarian Class, replace rolling a die with rolling extra dice and ignoring the lowest roll. The ignored rolls are not considered for the effect that instructed you to roll a die, and do not cause abilities to trigger. For all intents and purposes, once you determine which dice count, any extra dice were never rolled."}, {"date": "2021-07-23", "text": "Some effects instruct you to roll again. This uses the same number and type of dice as the original roll, and that roll will use the same set of possible outcomes."}, {"date": "2021-07-23", "text": "While playing Planechase, rolling the planar die will cause any ability that triggers whenever a player rolls one or more dice to trigger. However, any effect that refers to a numerical result will ignore the rolling of the planar die."}, {"date": "2021-07-23", "text": "Tournament events have more specific rules regarding dice and die-rolling. For more information, please see the most recent version of the Magic Tournament Rules at https://wpn.wizards.com/en/document/magic-gathering-tournament-rules."}], "setCode": "AFC", "subtypes": ["Golem"], "supertypes": [], "text": "{6}, Roll a d8: Monstrosity X, where X is the result. (If this creature isn't monstrous, put X +1/+1 counters on it and it becomes monstrous.)\nBerserk — When Clay Golem becomes monstrous, destroy target permanent.", "toughness": "4", "type": "Artifact Creature — Golem", "types": ["Artifact", "Creature"], "uuid": "7ea4c66c-a6c9-54f8-bbee-524ffcf2e673"}