{"artist": "Alayna Danner", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 1.0, "edhrecRank": 1414, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 527553, "name": "Klasse der Kleriker", "text": "(Erhöhe die Stufe wie eine Hexerei, um ihre Fähigkeit freizuschalten.)\nFalls du Lebenspunkte dazuerhalten würdest, erhältst du stattdessen so viele Lebenspunkte plus 1 dazu.\n{3}{W}: Stufe 2\n//Level_2//\nImmer wenn du Lebenspunkte dazuerhältst, lege eine +1/+1-Marke auf eine Kreatur deiner Wahl, die du kontrollierst.\n{4}{W}: Stufe 3\n//Level_3//\nWenn diese Klasse Stufe 3 erreicht, bringe eine Kreaturenkarte deiner Wahl aus deinem Friedhof ins Spiel zurück. Du erhältst Lebenspunkte in Höhe ihrer Widerstandskraft dazu.", "type": "Verzauberung — Klasse"}, {"language": "Spanish", "multiverseId": 527814, "name": "Clase: clérigo", "text": "(Gana un nivel como un conjuro para agregar su habilidad.)\nSi fueras a ganar vidas, en vez de eso, ganas esa cantidad de vidas más 1.\n{3}{W}: Nivel 2\n//Level_2//\nSiempre que ganes vidas, pon un contador +1/+1 sobre la criatura objetivo que controlas.\n{4}{W}: Nivel 3\n//Level_3//\nCuando esta Clase alcance el nivel 3, regresa la carta de criatura objetivo de tu cementerio al campo de batalla. Ganas una cantidad de vidas igual a su resistencia.", "type": "Encantamiento — Clase"}, {"language": "French", "multiverseId": 528075, "name": "Classe : clerc", "text": "(Acquérez le prochain niveau lorsque vous pourriez lancer un rituel pour ajouter sa capacité.)\nSi vous deviez gagner des points de vie, vous gagnez ce nombre de points de vie plus 1 à la place.\n{3}{W} : Niveau 2\n//Level_2//\nÀ chaque fois que vous gagnez des points de vie, mettez un marqueur +1/+1 sur une créature ciblée que vous contrôlez.\n{4}{W} : Niveau 3\n//Level_3//\nQuand cette classe devient niveau 3, renvoyez sur le champ de bataille une carte de créature ciblée depuis votre cimetière. Vous gagnez un nombre de points de vie égal à son endurance.", "type": "Enchantement : classe"}, {"language": "Italian", "multiverseId": 528336, "name": "Classe del Chierico", "text": "(Guadagni il livello successivo come una stregoneria per aggiungerne l'abilità.)\nSe stai per guadagnare punti vita, ne guadagni invece altrettanti più 1.\n{3}{W}: Livello 2\n//Level_2//\nOgniqualvolta guadagni punti vita, metti un segnalino +1/+1 su una creatura bersaglio che controlli.\n{4}{W}: Livello 3\n//Level_3//\nQuando questa Classe diventa di livello 3, rimetti sul campo di battaglia una carta creatura bersaglio dal tuo cimitero. Guadagni punti vita pari alla sua costituzione.", "type": "Incantesimo — Classe"}, {"language": "Japanese", "multiverseId": 528597, "name": "クレリック・クラス", "text": "（次のレベルになることはソーサリーとして行う。そのレベルの能力を得る。）\nあなたがライフを得るなら、代わりにあなたはその点数に１を足した点数のライフを得る。\n{3}{W}：レベル２\n//Level_2//\nあなたがライフを得るたび、あなたがコントロールしているクリーチャー１体を対象とする。それの上に＋１/＋１カウンター１個を置く。\n{4}{W}：レベル３\n//Level_3//\nこのクラスがレベル３になったとき、あなたの墓地にあるクリーチャー・カード１枚を対象とする。それを戦場に戻す。あなたはそれのタフネスに等しい点数のライフを得る。", "type": "エンチャント — クラス"}, {"language": "Korean", "multiverseId": 528857, "name": "성직자 직업", "text": "(집중마법 시기에만 다음 레벨을 얻어 자신의 능력에 추가한다.)\n당신이 생명점을 얻으려 한다면, 대신 그 수에 1을 더한 만큼 생명점을 얻는다.\n{3}{W}: 2레벨\n//Level_2//\n당신이 생명점을 얻을 때마다, 당신이 조종하는 생물을 목표로 정한다. 그 생물에 +1/+1 카운터 한 개를 올려놓는다.\n{4}{W}: 3레벨\n//Level_3//\n이 직업이 3레벨이 될 때, 당신의 무덤에 있는 생물 카드를 목표로 정한다. 그 카드를 전장으로 되돌린다. 당신은 그 생물의 방어력만큼 생명점을 얻는다.", "type": "부여마법 — 직업"}, {"language": "Portuguese (Brazil)", "multiverseId": 529118, "name": "Classe: Clérigo", "text": "(Ganhe o próximo nível como um feitiço para adicionar sua habilidade.)\nSe você ganharia pontos de vida, em vez disso, você ganha aquela quantidade de pontos de vida mais 1.\n{3}{W}: Nível 2\n//Level_2//\nToda vez que você ganhar pontos de vida, coloque um marcador +1/+1 na criatura alvo que você controla.\n{4}{W}: Nível 3\n//Level_3//\nQuando esta Classe chegar ao nível 3, devolva o card de criatura alvo de seu cemitério para o campo de batalha. Você ganha uma quantidade de pontos de vida igual à resistência dele.", "type": "Encantamento — Classe"}, {"language": "Russian", "multiverseId": 529379, "name": "Класс: Жрец", "text": "(Получите следующий уровень как волшебство, чтобы добавить его способность.)\nЕсли вы должны получить жизнь(-и), вы получаете такое же количество жизней плюс 1 вместо этого.\n{3}{W}: Уровень 2\n//Level_2//\nКаждый раз, когда вы получаете жизнь(-и), положите один жетон +1/+1 на целевое существо под вашим контролем.\n{4}{W}: Уровень 3\n//Level_3//\nКогда этот Класс становится уровня 3, верните целевую карту существа из вашего кладбища на поле битвы. Вы получаете количество жизней, равное его выносливости.", "type": "Чары — Класс"}, {"language": "Chinese Simplified", "multiverseId": 529639, "name": "职业：牧师", "text": "（获得下一等级便能新增相应异能；只能于法术时机如此作。）\n如果你将获得生命，则改为你获得原数量加1点生命。\n{3}{W}：等级2\n//Level_2//\n每当你获得生命时，在目标由你操控的生物上放置一个+1/+1指示物。\n{4}{W}：等级3\n//Level_3//\n当此职业成为等级3时，将目标生物牌从你的坟墓场移回战场。你获得等同于其防御力的生命。", "type": "结界 ～职业"}, {"language": "Chinese Traditional", "multiverseId": 529899, "name": "職業：牧師", "text": "（獲得下一等級便能新增相應異能；只能於巫術時機如此作。）\n如果你將獲得生命，則改為你獲得原數量加1點生命。\n{3}{W}：等級2\n//Level_2//\n每當你獲得生命時，在目標由你操控的生物上放置一個+1/+1指示物。\n{4}{W}：等級3\n//Level_3//\n當此職業成為等級3時，將目標生物牌從你的墳墓場移回戰場。你獲得等同於其防禦力的生命。", "type": "結界 ～職業"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "248486", "cardKingdomId": "248167", "cardsphereId": "79081", "mcmId": "571501", "mcmMetaId": "343846", "mtgArenaId": "77111", "mtgjsonV4Id": "609079be-87fe-5234-b6d5-d0e36a2fbbe4", "mtgoId": "91514", "multiverseId": "527293", "scryfallId": "47ce8b7e-d8e1-489a-a69e-99089eeb8739", "scryfallIllustrationId": "5101c556-4c32-4277-b25c-49f6cdfed308", "scryfallOracleId": "f0ead7f5-5c82-40fd-8e89-3e3c5d31fbad", "tcgplayerProductId": "243329"}, "language": "English", "layout": "class", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{W}", "manaValue": 1.0, "name": "Cleric Class", "number": "6", "originalText": "(Gain the next level as a sorcery to add its ability.)\nIf you would gain life, you gain that much life plus 1 instead.\n{3}{W}: Level 2\n//Level_2//\nWhenever you gain life, put a +1/+1 counter on target creature you control.\n{4}{W}: Level 3\n//Level_3//\nWhen this Class becomes level 3, return target creature card from your graveyard to the battlefield. You gain life equal to its toughness.", "originalType": "Enchantment — Class", "printings": ["AFR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/93fb655beaa0b074", "cardKingdomFoil": "https://mtgjson.com/links/bd37962ab2ec1796", "cardmarket": "https://mtgjson.com/links/c09ccc448de87b4f", "tcgplayer": "https://mtgjson.com/links/dbbed68562fcf45b"}, "rarity": "uncommon", "rulings": [{"date": "2021-07-23", "text": "You can multiclass or even control multiple Class enchantments of the same class. Each Class permanent tracks its own level separately."}, {"date": "2021-07-23", "text": "If you gain life at the same time a creature is dealt lethal damage, it dies before Cleric Class's level 2 ability can put a +1/+1 counter on it."}, {"date": "2021-07-23", "text": "An ability that triggers “whenever you gain life” triggers just once for each life gain event, no matter how much life you gain."}, {"date": "2021-07-23", "text": "Each creature with lifelink dealing combat damage causes a separate life gain event. For example, if two creatures you control with lifelink deal combat damage at the same time, you will gain 2 additional life from Cleric Class's first ability and its level 2 ability will trigger twice. However, if a single creature you control with lifelink deals combat damage to multiple creatures, players, and/or planeswalkers at the same time (perhaps because it has trample or was blocked by more than one creature), you will only gain 1 additional life and the ability will trigger only once."}, {"date": "2021-07-23", "text": "If you gain an amount of life “for each” of something, that life is gained as one event and the ability will trigger only once."}, {"date": "2021-07-23", "text": "When Cleric Class's level 3 ability resolves, you gain life equal to the creature's toughness as it exists on battlefield, which may be different than its toughness in the graveyard."}, {"date": "2021-07-23", "text": "Each Class has five abilities. The three in the major sections of its text box are class abilities. Class abilities can be static, activated, or triggered abilities. The other two are level abilities, one activated ability to advance the Class to level 2 and another to advance the Class to level 3."}, {"date": "2021-07-23", "text": "Each Class starts with only the first of three class abilities. As the first level ability resolves, the Class becomes level 2 and gains the second class ability. As the second level ability resolves, the Class becomes level 3 and gains the third class ability."}, {"date": "2021-07-23", "text": "Gaining a level won't remove abilities that a Class had at a previous level."}, {"date": "2021-07-23", "text": "Gaining a level is a normal activated ability. It uses the stack and can be responded to."}, {"date": "2021-07-23", "text": "You can't activate the first level ability of a Class unless that Class is level 1. Similarly, you can't activate the second level ability of a Class unless that Class is level 2."}, {"date": "2021-07-23", "text": "Some Class cards have an effect that increases when more are under your control. For example, if you have multiple Barbarian Class cards, you roll that many additional dice and ignore that many of the lowest rolls."}], "setCode": "AFR", "subtypes": ["Class"], "supertypes": [], "text": "(Gain the next level as a sorcery to add its ability.)\nIf you would gain life, you gain that much life plus 1 instead.\n{3}{W}: Level 2\nWhenever you gain life, put a +1/+1 counter on target creature you control.\n{4}{W}: Level 3\nWhen this Class becomes level 3, return target creature card from your graveyard to the battlefield. You gain life equal to that creature's toughness.", "type": "Enchantment — Class", "types": ["Enchantment"], "uuid": "f17eebae-bc94-5f8f-90a0-1959b8eb94e4"}