{"artist": "Slawomir Maniak", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 706, "finishes": ["nonfoil", "foil"], "flavorText": "\"Our own selves are the greatest obstacles to enlightenment.\"\n—Narset, khan of the Jeskai", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "231667", "cardKingdomId": "231630", "cardsphereId": "65830", "mcmId": "434774", "mtgjsonV4Id": "db8867ec-7f14-574a-a505-771eda238841", "scryfallId": "3889b4d6-2541-484d-88dd-d67800545327", "scryfallIllustrationId": "29c743ec-b9ec-4dbf-93ba-786b961fdb45", "scryfallOracleId": "d4ec0df9-a4a3-48cf-a0aa-b1aea5c49142", "tcgplayerProductId": "207689"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{U}", "manaValue": 4.0, "name": "Clever Impersonator", "number": "34p", "power": "0", "printings": ["C19", "EA2", "KTK", "PKTK"], "promoTypes": ["setpromo", "promopack", "stamped", "planeswalkerstamped"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/630d3c70c8ae738e", "cardKingdomFoil": "https://mtgjson.com/links/a86fae8db39d11dc", "tcgplayer": "https://mtgjson.com/links/84be3d3f6ac7208c"}, "rarity": "mythic", "rulings": [{"date": "2014-09-20", "text": "If the chosen permanent is a token, Clever Impersonator copies the original characteristics of that token as defined by the effect that put that token onto the battlefield. Clever Impersonator is not a token."}, {"date": "2014-09-20", "text": "You choose which nonland permanent Clever Impersonator will copy, if any, as it enters the battlefield. This doesn’t target that nonland permanent."}, {"date": "2014-09-20", "text": "Remember that if you control more than one legendary permanent with the same name, you’ll choose one to remain on the battlefield and put the rest into their owner’s graveyard."}, {"date": "2014-09-20", "text": "If Clever Impersonator enters the battlefield as a copy of a planeswalker, it will enter the battlefield with a number of loyalty counters on it equal to the loyalty printed in the lower right corner of the planeswalker card. It won’t copy the number of loyalty counters on the original planeswalker."}, {"date": "2014-09-20", "text": "Clever Impersonator copies exactly what is printed on the chosen permanent (unless that permanent is copying something else or is a token; see below). It doesn’t copy whether that permanent is tapped or untapped, whether that permanent has any counters on it or any Auras and/or Equipment attached to it, and it doesn’t copy any non-copy effects that have changed that permanent’s power, toughness, types, color, abilities, or so on."}, {"date": "2014-09-20", "text": "If the chosen permanent has {X} in its mana cost, X is considered to be 0."}, {"date": "2014-09-20", "text": "If the chosen permanent is a copy of something else (for example, if the chosen permanent is another Clever Impersonator), then your Clever Impersonator enters the battlefield as whatever the chosen permanent copied."}, {"date": "2014-09-20", "text": "Any enters-the-battlefield abilities of the chosen permanent will trigger when Clever Impersonator enters the battlefield. Any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities of the chosen permanent will also work."}, {"date": "2014-09-20", "text": "If Clever Impersonator enters the battlefield at the same time as another permanent, it can’t become a copy of that permanent. You may choose only a nonland permanent that’s already on the battlefield."}, {"date": "2014-09-20", "text": "You can choose not to copy anything. In that case, Clever Impersonator enters the battlefield as a 0/0 creature, and it’s put into the graveyard immediately (unless something is raising its toughness above 0)."}], "securityStamp": "oval", "setCode": "PKTK", "subtypes": ["Shapeshifter"], "supertypes": [], "text": "You may have Clever Impersonator enter the battlefield as a copy of any nonland permanent on the battlefield.", "toughness": "0", "type": "Creature — Shapeshifter", "types": ["Creature"], "uuid": "3c8067bf-09ef-5473-b9a4-79210ee03bb9"}