{"artist": "Matt Stewart", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210253", "mcmId": "294413", "mtgjsonV4Id": "1624334a-dcc3-5f67-96bc-e37f03139f1f", "multiverseId": "423599", "scryfallId": "ff65643b-e8bb-49d6-8887-13a146ee5174", "scryfallIllustrationId": "43c8ab85-a133-4f6f-a083-6cb7388d5c74", "scryfallOracleId": "b21a71d7-f236-43e2-b576-0b5c9280f0cc", "tcgplayerProductId": "125578"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Cliffside Market", "number": "18", "originalText": "When you planeswalk to Cliffside Market or at the beginning of your upkeep, you may exchange life totals with target player.\nWhenever you roll {Chaos}, exchange control of two target permanents that share a card type.", "originalType": "Plane — Mercadia", "printings": ["OHOP", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ad2cd0feaf94752b", "tcgplayer": "https://mtgjson.com/links/758b585f0b46d576"}, "rarity": "common", "rulings": [{"date": "2009-10-01", "text": "A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"}, {"date": "2009-10-01", "text": "A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."}, {"date": "2009-10-01", "text": "The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."}, {"date": "2009-10-01", "text": "If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}, {"date": "2009-10-01", "text": "For two players to exchange life totals, what actually happens is that each player gains or loses the amount of life necessary to equal the other player’s previous life total. For example, if Player A has 5 life and Player B has 3 life before the exchange, Player A will lose 2 life and Player B will gain 2 life. Other cards that interact with life gain or life loss will interact with this effect accordingly."}, {"date": "2009-10-01", "text": "Neither permanent you target with the chaos ability needs to be one you control."}, {"date": "2009-10-01", "text": "The control-change effect has no duration. For each permanent, it will last until the game ends or the permanent leaves the battlefield. It will override all previous control-change effects for those permanents, and may be overridden by a later control-change effect."}, {"date": "2009-10-01", "text": "Both permanents targeted by the chaos ability may be controlled by the same player. If they are, the effect nothing."}, {"date": "2009-10-01", "text": "If either permanent targeted by the chaos ability is an illegal target by the time the ability resolves, the exchange doesn’t happen. If both targets become illegal, the ability doesn’t resolve."}], "setCode": "OPCA", "subtypes": ["Mercadia"], "supertypes": [], "text": "When you planeswalk to Cliffside Market or at the beginning of your upkeep, you may exchange life totals with target player.\nWhenever you roll {CHAOS}, exchange control of two target permanents that share a card type.", "type": "Plane — Mercadia", "types": ["Plane"], "uuid": "daa9a24c-e4e9-5225-9cc3-97272ac129d5"}