{"artist": "Caio Monteiro", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 1.0, "edhrecRank": 5902, "finishes": ["nonfoil", "foil"], "flavorText": "In bleak Tizerus, all hope crumbles in your grasp.", "foreignData": [{"flavorText": "Im trostlosen Tizerus zerbröckelt alle Hoffnung in deinen Händen.", "language": "German", "multiverseId": 476592, "name": "An Staub klammern", "text": "Schicke eine Karte deiner Wahl aus einem Friedhof ins Exil. Falls es eine Kreaturenkarte war, erhältst du 3 Lebenspunkte dazu. Anderenfalls ziehst du eine Karte.\nBefreiung — {3}{B}, schicke fünf andere Karten aus deinem Friedhof ins Exil. (Du kannst diese Karte aus deinem Friedhof für ihre Befreiungskosten wirken.)", "type": "Spontanzauber"}, {"flavorText": "En el lúgubre Tizerus, todas las esperanzas a las que te aferrabas se desvanecen.", "language": "Spanish", "multiverseId": 476846, "name": "Aferrarse al polvo", "text": "Exilia la carta objetivo de un cementerio. Si era una carta de criatura, ganas 3 vidas. De lo contrario, robas una carta.\nEscapatoria—{3}{B}, exiliar otras cinco cartas de tu cementerio. (Puedes lanzar esta carta desde tu cementerio pagando su coste de escapatoria.)", "type": "Instantáneo"}, {"flavorText": "Dans la désolation du Tizère, tout espoir s'effrite dans le creux de votre main.", "language": "French", "multiverseId": 477100, "name": "S'agripper à la poussière", "text": "Exilez une carte ciblée depuis un cimetière. Si c'était une carte de créature, vous gagnez 3 points de vie. Sinon, vous piochez une carte.\nÉchappée — {3}{B}, exilez cinq autres cartes de votre cimetière. (Vous pouvez lancer cette carte depuis votre cimetière pour son coût d'échappée.)", "type": "Éphémère"}, {"flavorText": "Nella desolazione di Tizerus, ogni speranza si sgretola tra le dita.", "language": "Italian", "multiverseId": 477354, "name": "Aggrapparsi alla Polvere", "text": "Esilia una carta bersaglio da un cimitero. Se era una carta creatura, guadagni 3 punti vita. Altrimenti, pesca una carta.\nFuga—{3}{B}, Esilia altre cinque carte dal tuo cimitero. (Puoi lanciare questa carta dal tuo cimitero pagando il suo costo di fuga.)", "type": "Istantaneo"}, {"flavorText": "荒涼としたティゼルスでは、すべての希望は手にする前に崩れてしまう。", "language": "Japanese", "multiverseId": 477608, "name": "塵へのしがみつき", "text": "墓地からカード１枚を対象とし、それを追放する。それがクリーチャー・カードであるなら、あなたは３点のライフを得る。そうでないなら、あなたはカードを１枚引く。\n脱出―{3}{B}, あなたの墓地から他のカード５枚を追放する。（あなたはあなたの墓地から、このカードをこれの脱出コストで唱えてもよい。）", "type": "インスタント"}, {"flavorText": "황량한 티제루스에서는, 모든 희망이 손아귀 안에서 부스러져내린다.", "language": "Korean", "multiverseId": 477862, "name": "먼지를 붙잡다", "text": "무덤에 있는 카드를 목표로 정한다. 그 카드를 추방한다. 그 카드가 생물 카드였다면, 당신은 생명 3점을 얻는다. 그렇지 않으면, 당신은 카드 한 장을 뽑는다.\n탈출—{3}{B}, 당신의 무덤에서 다른 카드 다섯 장을 추방한다. (당신은 이 카드의 탈출 비용을 지불해 이 카드를 당신의 무덤에서 발동할 수 있다.)", "type": "순간마법"}, {"flavorText": "Na desolação do Tízero, toda esperança se esfacela por entre os dedos.", "language": "Portuguese (Brazil)", "multiverseId": 478116, "name": "Agarrar-se ao Pó", "text": "Exile o card alvo de um cemitério. Se for um card de criatura, você ganha 3 pontos de vida. Caso contrário, você compra um card.\nEscapatória — {3}{B}, exile cinco outros cards de seu cemitério. (Você pode conjurar este card de seu cemitério pagando seu custo de escapatória.)", "type": "Mágica Instantânea"}, {"flavorText": "В безрадостном Тизерии все надежды рассыпаются при одном прикосновении.", "language": "Russian", "multiverseId": 478370, "name": "Цепляться за Прах", "text": "Изгоните целевую карту из кладбища. Если это была карта существа, вы получаете 3 жизни. В противном случае вы берете карту.\nПобег — {3}{B}, изгоните пять других карт из вашего кладбища. (Вы можете разыграть эту карту из вашего кладбища за ее стоимость Побега.)", "type": "Мгновенное заклинание"}, {"flavorText": "在阴黯的提泽拉司境内，所有希望都会在你掌心化作尘埃。", "language": "Chinese Simplified", "multiverseId": 478624, "name": "执持化尘", "text": "将目标牌从坟墓场放逐。如果该牌是生物牌，则你获得3点生命。若否，你抓一张牌。\n逸脱～{3}{B}，从你的坟墓场放逐五张其他牌。（你可以从你的坟墓场施放此牌，并支付其逸脱费用。）", "type": "瞬间"}, {"flavorText": "在陰闇的提澤拉司境內，所有希望都會在你掌心化作塵埃。", "language": "Chinese Traditional", "multiverseId": 478878, "name": "執持化塵", "text": "將目標牌從墳墓場放逐。如果該牌是生物牌，則你獲得3點生命。若否，你抽一張牌。\n逸脫～{3}{B}，從你的墳墓場放逐五張其他牌。（你可以從你的墳墓場施放此牌，並支付其逸脫費用。）", "type": "瞬間"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "231078", "cardKingdomId": "230752", "cardsphereId": "65045", "mcmId": "430199", "mcmMetaId": "290874", "mtgArenaId": "70598", "mtgjsonV4Id": "cff603b8-d267-5052-a804-9fa61a9fa3c1", "mtgoId": "79298", "multiverseId": "476338", "scryfallId": "52c2de5f-e486-4cfe-9fb6-be0078ce5f93", "scryfallIllustrationId": "5a9997ad-8eb2-44cd-b6a6-aaf5f4204142", "scryfallOracleId": "9c44e556-4c7a-48bf-a108-c584f69c2cfa", "tcgplayerProductId": "206655"}, "keywords": ["Escape"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{B}", "manaValue": 1.0, "name": "Cling to Dust", "number": "87", "originalText": "Exile target card from a graveyard. If it was a creature card, you gain 3 life. Otherwise, you draw a card.\nEscape—{3}{B}, Exile five other cards from your graveyard. (You may cast this card from your graveyard for its escape cost.)", "originalType": "Instant", "printings": ["THB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1b6ed833c1f4e22d", "cardKingdomFoil": "https://mtgjson.com/links/811fb23f87545875", "cardmarket": "https://mtgjson.com/links/6b404a83e69b82e8", "tcgplayer": "https://mtgjson.com/links/bee305699ab6db40"}, "rarity": "uncommon", "rulings": [{"date": "2020-01-24", "text": "If the target card is an illegal target by the time Cling to Dust tries to resolve, the spell won’t resolve. You won’t gain 3 life or draw a card."}, {"date": "2020-01-24", "text": "If the exiled card is a creature card that’s also another card type (such as an enchantment creature), you gain 3 life. You don’t also draw a card."}, {"date": "2020-01-24", "text": "Cling to Dust can target one of the five cards you’ll exile to pay its escape cost. In this case, the spell won’t resolve."}, {"date": "2020-01-24", "text": "Escape’s permission doesn’t change when you may cast the spell from your graveyard."}, {"date": "2020-01-24", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost you’re paying (such as an escape cost), add any cost increases, then apply any cost reductions. The mana value of the spell remains unchanged, no matter what the total cost to cast it was and no matter whether an alternative cost was paid."}, {"date": "2020-01-24", "text": "After an escaped spell resolves, it returns to its owner’s graveyard if it’s not a permanent spell. If it is a permanent spell, it enters the battlefield and will return to its owner’s graveyard if it dies later. Perhaps it will escape again—good underworld security is so hard to come by these days."}, {"date": "2020-01-24", "text": "If a card has multiple abilities giving you permission to cast it, such as two escape abilities or an escape ability and a flashback ability, you choose which one to apply. The others have no effect."}, {"date": "2020-01-24", "text": "If you cast a spell with its escape permission, you can’t choose to apply any other alternative costs or to cast it without paying its mana cost. If it has any additional costs, you must pay those."}, {"date": "2020-01-24", "text": "If a card with escape is put into your graveyard during your turn, you’ll be able to cast it right away if it’s legal to do so, before an opponent can take any actions."}, {"date": "2020-01-24", "text": "Once you begin casting a spell with escape, it immediately moves to the stack. Players can’t take any other actions until you’re done casting the spell."}], "setCode": "THB", "subtypes": [], "supertypes": [], "text": "Exile target card from a graveyard. If it was a creature card, you gain 3 life. Otherwise, you draw a card.\nEscape—{3}{B}, Exile five other cards from your graveyard. (You may cast this card from your graveyard for its escape cost.)", "type": "Instant", "types": ["Instant"], "uuid": "32c98e4b-1776-51a8-bdbd-364a1c6e2cd3"}