{"artist": "Zoltan Boros & Gabor Szikszai", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 1.0, "edhrecRank": 3777, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 132890, "name": "Tickendes Uhrwerk", "text": "Rückkauf {3} (Du kannst zusätzlich {3} bezahlen, sowie du diesen Zauberspruch spielst. Falls du dies tust, nimm diese Karte auf deine Hand, sowie sie verrechnet wird.)\nBestimme eine Marke auf einer bleibenden oder ausgesetzten Karte deiner Wahl. Entferne diese Marke von dieser bleibenden Karte oder Karte oder lege eine weitere Marke derselben Art auf sie.", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 134395, "name": "Vueltas del reloj", "text": "Recuperar {3} (Puedes pagar {3} adicionales en cuanto juegues este hechizo. Si lo haces, pon esta carta en tu mano en cuanto se resuelve.)\nElige un contador sobre el permanente o carta suspendida objetivo. Remueve ese contador de esa carta o permanente o pon otro de esos contadores sobre él.", "type": "Instantáneo"}, {"language": "French", "multiverseId": 132589, "name": "Clepsydre", "text": "Rappel {3} (Vous pouvez payer {3} supplémentaires au moment où vous jouez ce sort. Si vous faites ainsi, mettez cette carte dans votre main au moment où elle se résout.)\nChoisissez un marqueur sur le permanent ciblé ou la carte en suspension ciblée. Retirez ce marqueur de ce permanent ou de cette carte ou mettez un autre de ces marqueurs sur lui.", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 133191, "name": "Accelerazione Oraria", "text": "Riscatto {3} (Puoi pagare {3} addizionale mentre giochi questa magia). Se lo fai, riprendi in mano questa carta quando si risolve.)\nScegli un segnalino su un permanente o una carta sospesa bersaglio. Rimuovi quel segnalino da quel permanente o da quella carta o metti su di esso o essa un altro di quei segnalini.", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 133492, "name": "時計回し", "text": "バイバック {3} （あなたはこの呪文をプレイするに際し、追加で{3}を支払ってもよい。 そうした場合、それの解決に際し、このカードをあなたの手札に加える。）\nパーマネント１つか待機状態のカード１枚を対象とする。その上のカウンターを１個選ぶ。 そのパーマネントかカードの上のそのカウンターを取り除くか、そのカウンターをもう１個置く。", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 133793, "name": "Ponteiro do Tempo", "text": "Recuperar {3} (Você pode pagar um custo adicional de {3} ao jogar esta mágica. Se fizer isso, coloque este card em sua mão quando for resolvido.)\nEscolha um marcador na permanente alvo ou card suspenso alvo. Remova aquele marcador daquela permanente ou card ou coloque outro desses marcadores sobre ele.", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 134094, "name": "Бег Часов", "text": "Выкуп {3} (Играя это заклинание, вы можете заплатить дополнительно {3}. Если вы делаете это, положите эту карту в вашу руку, когда она разрешится.)\nВыберите жетон на целевом перманенте или отсроченной карте. Удалите этот жетон с этого перманента или карты или положите другой такой же жетон на него или нее.", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 132288, "name": "扭转时钟", "text": "购回{3}（你使用此咒语时可以额外支付{3}。 若你如此做，则结算此咒语时将它放入你的手牌。）\n在目标永久物或已延缓的牌上选择一个指示物。 将该指示物从该永久物或牌上移去，或在其上放置一个同样的指示物。", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "121493", "cardKingdomId": "121203", "cardsphereId": "44166", "mcmId": "13793", "mcmMetaId": "8340", "mtgjsonV4Id": "f124c02f-e05a-582e-892e-a8007eae80ff", "mtgoFoilId": "25490", "mtgoId": "25489", "multiverseId": "109673", "scryfallId": "1323d548-e2fe-47c5-8df3-f181aed537c5", "scryfallIllustrationId": "39c6a11a-929f-4f73-9e79-0603ba57d44a", "scryfallOracleId": "3e1b32a9-27a4-4550-a644-ebe254e1f512", "tcgplayerProductId": "14186"}, "keywords": ["Buyback"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{U}", "manaValue": 1.0, "name": "Clockspinning", "number": "53", "originalText": "Buyback {3} (You may pay an additional {3} as you play this spell. If you do, put this card into your hand as it resolves.)\nChoose a counter on target permanent or suspended card. Remove that counter from that permanent or card or put another of those counters on it.", "originalType": "Instant", "printings": ["TSP"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/e34a1f783bb3d1c0", "cardKingdomFoil": "https://mtgjson.com/links/22e93d6dbae95437", "cardmarket": "https://mtgjson.com/links/8cad3ac0c9f516c2", "tcgplayer": "https://mtgjson.com/links/0c306288887856df"}, "rarity": "common", "rulings": [{"date": "2006-09-25", "text": "If the target is a permanent and it has no counter on it when Clockspinning resolves, nothing happens."}, {"date": "2006-09-25", "text": "Clockspinning can affect any kind of counter, not just a time counter. The type of counter isn’t chosen until resolution. Whether to add or remove a counter isn’t chosen until resolution."}, {"date": "2021-06-18", "text": "The mana value of a spell cast without paying its mana cost is determined by its mana cost, even though that cost wasn’t paid."}, {"date": "2021-06-18", "text": "You are never forced to activate mana abilities to pay costs, so if there is a mandatory additional mana cost (such as from Thalia, Guardian of Thraben), you can decline to activate mana abilities to pay for it and hence fail to cast the suspended card, leaving it in exile."}, {"date": "2021-06-18", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2021-06-18", "text": "Suspend is a keyword that represents three abilities. The first is a static ability that allows you to exile the card from your hand with the specified number of time counters (the number before the dash) on it by paying its suspend cost (listed after the dash). The second is a triggered ability that removes a time counter from the suspended card at the beginning of each of your upkeeps. The third is a triggered ability that causes you to cast the card when the last time counter is removed. If you cast a creature spell this way, it gains haste until you lose control of that creature (or, in rare cases, you lose control of the creature spell while it’s on the stack)."}, {"date": "2021-06-18", "text": "You can exile a card in your hand using suspend any time you could cast that card. Consider its card type, any effects that modify when you could cast it (such as flash) and any other effects that stop you from casting it (such as from Meddling Mage’s ability) to determine if and when you can do this. Whether you could actually complete all steps in casting the card is irrelevant. For example, you can exile a card with suspend that has no mana cost or that requires a target even if no legal targets are available at that time."}, {"date": "2021-06-18", "text": "Cards exiled with suspend are exiled face up."}, {"date": "2021-06-18", "text": "Exiling a card with suspend isn’t casting that card. This action doesn’t use the stack and can’t be responded to."}, {"date": "2021-06-18", "text": "If the spell requires any targets, those targets are chosen when the spell is finally cast, not when it’s exiled."}, {"date": "2021-06-18", "text": "If an effect refers to a “suspended card,” that means a card that (1) has suspend, (2) is in exile, and (3) has one or more time counters on it."}, {"date": "2021-06-18", "text": "If the first triggered ability of suspend (the one that removes time counters) is countered, no time counter is removed. The ability will trigger again at the beginning of the card’s owner’s next upkeep."}, {"date": "2021-06-18", "text": "When the last time counter is removed, the second triggered ability of suspend (the one that lets you cast the card) triggers. It doesn’t matter why the last time counter was removed or what effect removed it."}, {"date": "2021-06-18", "text": "If the second triggered ability is countered, the card can’t be cast. It remains exiled with no time counters on it, and it’s no longer suspended."}, {"date": "2021-06-18", "text": "As the second triggered ability resolves, you must cast the card if able. You must do so even if it requires targets and the only legal targets are ones that you really don’t want to target. Timing permissions based on the card’s type are ignored."}, {"date": "2021-06-18", "text": "If you can’t cast the card, perhaps because there are no legal targets available, it remains exiled with no time counters on it, and it’s no longer suspended."}, {"date": "2021-06-18", "text": "If you cast a card “without paying its mana cost,” such as with suspend, you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those if you want to cast the card."}], "setCode": "TSP", "subtypes": [], "supertypes": [], "text": "Buyback {3} (You may pay an additional {3} as you cast this spell. If you do, put this card into your hand as it resolves.)\nChoose a counter on target permanent or suspended card. Remove that counter from that permanent or card or put another of those counters on it.", "type": "Instant", "types": ["Instant"], "uuid": "6d11f4b3-b3f1-510b-9b8e-8a3287873275"}