{"artist": "Daniel Ljunggren", "availability": ["arena", "mtgo", "paper"], "borderColor": "black", "colorIdentity": ["B", "G", "R", "U", "W"], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 5983, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 517052, "name": "Codie, der polternde Codex", "text": "Du kannst keine Bleibende-Karte-Zaubersprüche wirken.\n{4}, {T}: Erzeuge {W}{U}{B}{R}{G}. Wenn du in diesem Zug deinen nächsten Zauberspruch wirkst, schicke so lange die oberste Karte deiner Bibliothek ins Exil, bis du eine Spontanzauber- oder Hexereikarte mit niedrigerem Manabetrag ins Exil schickst. Bis zum Ende des Zuges kannst du jene Karte wirken, ohne ihre Manakosten zu bezahlen. Lege den Rest in zufälliger Reihenfolge unter deine Bibliothek.", "type": "Legendäre Artefaktkreatur — Konstrukt"}, {"language": "Spanish", "multiverseId": 517147, "name": "Codi, códice vociferante", "text": "No puedes lanzar hechizos de permanente.\n{4}, {T}: Agrega {W}{U}{B}{R}{G}. Cuando lances tu siguiente hechizo este turno, exilia cartas de la parte superior de tu biblioteca hasta que exilies una carta de instantáneo o de conjuro con menor valor de maná. Hasta el final del turno, puedes lanzar esa carta sin pagar su coste de maná. Pon cada otra carta exiliada de esta manera en el fondo de tu biblioteca en un orden aleatorio.", "type": "Criatura artefacto legendaria — Constructo"}, {"language": "French", "multiverseId": 517242, "name": "Codie, codex vociférateur", "text": "Vous ne pouvez pas lancer de sorts de permanent.\n{4}, {T} : Ajoutez {W}{U}{B}{R}{G}. Quand vous lancez votre prochain sort ce tour-ci, exilez les cartes du dessus de votre bibliothèque jusqu'à ce que vous exiliez une carte d'éphémère ou de rituel avec une valeur de mana inférieure. Jusqu'à la fin du tour, vous pouvez lancer cette carte sans payer son coût de mana. Mettez chaque autre carte exilée de cette manière au-dessous de votre bibliothèque dans un ordre aléatoire.", "type": "Créature-artefact légendaire : construction"}, {"language": "Italian", "multiverseId": 517337, "name": "Cody, Codice Parlante", "text": "Non puoi lanciare magie permanente.\n{4}, {T}: Aggiungi {W}{U}{B}{R}{G}. Quando lanci la tua prossima magia in questo turno, esilia carte dalla cima del tuo grimorio finché non esili una carta istantaneo o stregoneria con valore di mana inferiore. Fino alla fine del turno, puoi lanciare quella carta senza pagare il suo costo di mana. Metti ogni altra carta esiliata in questo modo in fondo al tuo grimorio in ordine casuale.", "type": "Creatura Artefatto Leggendaria — Costrutto"}, {"language": "Japanese", "multiverseId": 517432, "name": "騒々しい写本、コーディ", "text": "あなたはパーマネント・呪文を唱えられない。\n{4}, {T}：{W}{U}{B}{R}{G}を加える。このターンにあなたが次に呪文を唱えたとき、マナ総量がそれより小さくインスタントやソーサリーであるカード１枚が追放されるまで、あなたのライブラリーの一番上から１枚ずつ追放していく。ターン終了時まで、あなたはそのカードをマナ・コストを支払うことなく唱えてもよい。これにより追放された、他のすべてのカードをあなたのライブラリーの一番下に無作為の順番で置く。", "type": "伝説のアーティファクト・クリーチャー — 構築物"}], "frameEffects": ["legendary", "extendedart"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "244912", "cardKingdomId": "244337", "cardsphereId": "76250", "mcmId": "557623", "mcmMetaId": "338781", "mtgjsonV4Id": "86e8f491-6769-59d8-9a9a-9d7c8b6cc64e", "multiverseId": "516957", "scryfallId": "e7d7e96e-5d35-41dc-9a8a-2049e2e56350", "scryfallIllustrationId": "a7caf74a-499d-4b79-bd04-205623627d32", "scryfallOracleId": "67a9357c-4713-4e01-a60d-532bf0dd80b6", "tcgplayerProductId": "235861"}, "isStarter": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Codie, Vociferous Codex", "number": "357", "originalText": "You can't cast permanent spells.\n{4}, {T}: Add {W}{U}{B}{R}{G}. When you cast your next spell this turn, exile cards from the top of your library until you exile an instant or sorcery card with lesser mana value. Until end of turn, you may cast that card without paying its mana cost. Put each other card exiled this way on the bottom of your library in a random order.", "originalType": "Legendary Artifact Creature — Construct", "power": "1", "printings": ["PRM", "PSTX", "STX"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2f2d7a42a68effbe", "cardKingdomFoil": "https://mtgjson.com/links/8da3a2924878cd14", "cardmarket": "https://mtgjson.com/links/645c5f5c0da97c7f", "tcgplayer": "https://mtgjson.com/links/1550ee4a98e5b596"}, "rarity": "rare", "rulings": [{"date": "2021-04-16", "text": "A permanent spell is an artifact, creature, enchantment, or planeswalker spell. You may still play lands and cast instant and sorcery spells. Other effects can still put permanents onto the battlefield."}, {"date": "2021-04-16", "text": "While you control Codie (as much as anyone can really “control” Codie), you may cast any face of a modal double-faced card that’s an instant or sorcery face, even if the other face is a permanent face."}, {"date": "2021-04-16", "text": "Codie’s activated ability is a mana ability. It can’t be countered or responded to, and you can activate it while casting a spell. If you do, that spell is “the next spell” you cast this turn."}, {"date": "2021-04-16", "text": "The delayed triggered ability created by Codie’s second ability will resolve before the spell that caused it to trigger. That ability will resolve even if the spell is countered or otherwise doesn’t resolve."}, {"date": "2021-04-16", "text": "You exile the cards face up. All players will be able to see them."}, {"date": "2021-04-16", "text": "The last card exiled is not cast immediately. You may cast it until the end of the current turn. If you do not cast it, that card will remain in exile."}, {"date": "2021-04-16", "text": "If you cast a spell “without paying its mana cost,” you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those to cast the spell."}, {"date": "2021-04-16", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2021-04-16", "text": "The mana value of the spell that caused the ability to trigger is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2021-04-16", "text": "The types and mana value of a double-faced card in exile are determined by the characteristics of its front face. The mana value of a split card is the total mana value of both halves of the split card added together."}, {"date": "2021-04-16", "text": "If you exile your entire library without exiling an instant or sorcery card with a lesser mana value, you will randomize the exiled cards and they again become your library, ending the effect. You will not continue to exile and shuffle your library forever."}], "securityStamp": "oval", "setCode": "STX", "subtypes": ["Construct"], "supertypes": ["Legendary"], "text": "You can't cast permanent spells.\n{4}, {T}: Add {W}{U}{B}{R}{G}. When you cast your next spell this turn, exile cards from the top of your library until you exile an instant or sorcery card with lesser mana value. Until end of turn, you may cast that card without paying its mana cost. Put each other card exiled this way on the bottom of your library in a random order.", "toughness": "4", "type": "Legendary Artifact Creature — Construct", "types": ["Artifact", "Creature"], "uuid": "a9ad89b5-df19-53ce-943a-b4c8f6ad4ccf", "variations": ["aaf3d518-71c7-55c2-ad6e-4d3dea880de7"]}