{"artist": "Jim Pavelec", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 8397, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 154492, "name": "Colfenors Urne", "text": "Immer wenn eine Kreatur mit Widerstandskraft 4 oder mehr aus dem Spiel auf deinen Friedhof gelegt wird, kannst du sie ganz aus dem Spiel entfernen.\nOpfere Colfenors Urne am Ende des Zuges, falls drei oder mehr Karten mit ihr ganz aus dem Spiel entfernt wurden. Falls du dies tust, bringe diese Karten unter der Kontrolle ihrer Besitzer ins Spiel zurück.", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 156609, "name": "Urna de Cólfenor", "text": "Siempre que una criatura con resistencia de 4 o más vaya a un cementerio desde el juego, puedes removerla del juego.\nAl final del turno, si fueron removidas del juego tres o más cartas con la Urna de Cólfenor, sacrifícala. Si lo haces, regresa esas cartas al juego bajo el control de sus propietarios.", "type": "Artefacto"}, {"language": "French", "multiverseId": 155405, "name": "Urne de Colfénor", "text": "À chaque fois qu'une créature d'endurance supérieure ou égale à 4 est mise dans votre cimetière depuis le jeu, vous pouvez la retirer de la partie.\nÀ la fin du tour, si au moins trois cartes ont été retirées de la partie par l'Urne de Colfénor, sacrifiez-la. Si vous faites ainsi, renvoyez ces cartes en jeu sous le contrôle de leur propriétaire.", "type": "Artefact"}, {"language": "Italian", "multiverseId": 155706, "name": "Urna di Colfenor", "text": "Ogniqualvolta una creatura con costituzione pari o superiore a 4 viene messa nel tuo cimitero dal gioco, puoi rimuoverla dal gioco.\nAlla fine del turno, se tre o più carte sono state rimosse dal gioco con l'Urna di Colfenor, sacrificala. Se lo fai, rimetti in gioco quelle carte sotto il controllo dei loro proprietari.", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 156007, "name": "コルフェノールの骨壷", "text": "いずれかのタフネスが４以上のクリーチャーが場からあなたの墓地に置かれるたび、あなたはそれをゲームから取り除いてもよい。\nターン終了時に、コルフェノールの骨壷により３枚以上のカードがゲームから取り除かれている場合、コルフェノールの骨壷を生け贄に捧げる。 そうした場合、それらのカードをオーナーのコントロール下で場に戻す。", "type": "アーティファクト"}, {"language": "Portuguese (Brazil)", "multiverseId": 156910, "name": "Urna de Colfenor", "text": "Toda vez que uma criatura com resistência maior ou igual a 4 é colocada no seu cemitério vinda do jogo, você pode removê-la do jogo.\nNo final do turno, se três ou mais cards tiverem sido removidos do jogo com Urna de Colfenor, sacrifique-o. Se fizer isso, devolva esses cards ao jogo sob o controle de seus donos.", "type": "Artefato"}, {"language": "Russian", "multiverseId": 156308, "name": "Погребальная Урна Колфенора", "text": "Каждый раз, когда существо с выносливостью 4 или более попадает из игры на ваше кладбище, вы можете удалить его из игры.\nВ конце хода, если три или более карт были удалены из игры через способность Погребальной Урны Колфенора, пожертвуйте ее. Если вы это делаете, верните те карты в игру под контролем их владельца.", "type": "Артефакт"}, {"language": "Chinese Simplified", "multiverseId": 154793, "name": "柯芬诺的瓮", "text": "每当一个力量大于或等于4的生物从场上置入你的坟墓场时，你可以将它移出对战。\n在回合结束时，如果三张或更多牌已经被柯芬诺的瓮移出对战，则牺牲之。 若你如此作，则将这些牌在其拥有者的操控下移回场上。", "type": "神器"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "123874", "cardKingdomId": "123751", "cardsphereId": "25210", "mcmId": "17995", "mcmMetaId": "9365", "mtgjsonV4Id": "8012973a-78a6-5c6a-a63d-eaa78d52ce9a", "mtgoFoilId": "28458", "mtgoId": "28457", "multiverseId": "140209", "scryfallId": "419fea28-3813-4e65-8b90-6d335fdf0a0b", "scryfallIllustrationId": "93722dc3-3426-4d99-b904-73f8017e92e1", "scryfallOracleId": "920c4df3-9517-44cd-8304-28b1ef69d60e", "tcgplayerProductId": "15452"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Colfenor's Urn", "number": "254", "originalText": "Whenever a creature with toughness 4 or greater is put into your graveyard from play, you may remove it from the game.\nAt end of turn, if three or more cards have been removed from the game with Colfenor's Urn, sacrifice it. If you do, return those cards to play under their owner's control.", "originalType": "Artifact", "printings": ["LRW"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7c1d4e1177e08747", "cardKingdomFoil": "https://mtgjson.com/links/5f4dbdc02768ff78", "cardmarket": "https://mtgjson.com/links/09c7e3d3f47e13f2", "tcgplayer": "https://mtgjson.com/links/e3fe97334bbb65a9"}, "rarity": "rare", "rulings": [{"date": "2007-10-01", "text": "The second ability checks how many creatures have been exiled with Colfenor’s Urn over the course of the entire game."}, {"date": "2007-10-01", "text": "The second ability forces you to sacrifice Colfenor’s Urn. If the ability triggers and the Urn isn’t sacrificed (because it left the battlefield or changed controllers, for example), the exiled cards won’t be returned to the battlefield."}, {"date": "2007-10-01", "text": "The first ability triggers when a token creature with toughness 4 or greater is put into your graveyard. However, that token will cease to exist before Colfenor’s Plans can exile it."}], "setCode": "LRW", "subtypes": [], "supertypes": [], "text": "Whenever a creature with toughness 4 or greater is put into your graveyard from the battlefield, you may exile it.\nAt the beginning of the end step, if three or more cards have been exiled with Colfenor's Urn, sacrifice it. If you do, return those cards to the battlefield under their owner's control.", "type": "Artifact", "types": ["Artifact"], "uuid": "6294454d-37ec-53b3-8463-3dc5707c92ac"}