{"artist": "Steve Argyle", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R", "U"], "colors": ["R", "U"], "convertedManaCost": 4.0, "edhrecRank": 14462, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 464399, "name": "Zaubersammlung", "text": "Schicke die obersten sechs Karten deiner Bibliothek ins Exil. Du kannst davon bis zu zwei Hexereikarten mit umgewandelten Manakosten von 3 oder weniger wirken, ohne ihre Manakosten zu bezahlen. Lege die auf diese Weise ins Exil geschickten Karten, die nicht gewirkt wurden, in zufälliger Reihenfolge unter deine Bibliothek.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 464653, "name": "Invocación reunida", "text": "Exilia las seis primeras cartas de tu biblioteca. Puedes lanzar hasta dos cartas de conjuro con coste de maná convertido de 3 o menos que se encuentren entre ellas sin pagar sus costes de maná. Pon las cartas exiliadas que no lanzaste de esta manera en el fondo de tu biblioteca en un orden aleatorio.", "type": "Conjuro"}, {"language": "French", "multiverseId": 464907, "name": "Conjuration rassemblée", "text": "Exilez les six cartes du dessus de votre bibliothèque. Vous pouvez lancer jusqu'à deux cartes de rituel avec un coût converti de mana inférieur ou égal à 3 parmi elles sans payer leur coût de mana. Mettez les cartes exilées non lancées de cette manière au-dessous de votre bibliothèque dans un ordre aléatoire.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 465161, "name": "Evocazione Raccolta", "text": "Esilia le prime sei carte del tuo grimorio. Puoi lanciare fino a due carte stregoneria con costo di mana convertito pari o inferiore a 3 scelte tra esse senza pagare il loro costo di mana. Metti le carte esiliate non lanciate in questo modo in fondo al tuo grimorio in ordine casuale.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 465415, "name": "集合妖術", "text": "あなたのライブラリーの一番上からカードを６枚追放する。あなたはその中から、点数で見たマナ・コストが３以下のソーサリー・カード最大２枚を、それらのマナ・コストを支払うことなく唱えてもよい。これにより追放されて唱えられなかったカードをあなたのライブラリーの一番下に無作為の順番で置く。", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 465669, "name": "선택된 마술", "text": "당신의 서고 맨 위 카드 여섯 장을 추방한다. 당신은 그중 전환마나비용이 3 이하인 집중마법 카드를 최대 두 개까지 마나 비용을 지불하지 않고 발동할 수 있다. 이런 식으로 발동되지 않은 추방된 카드들은 당신의 서고 맨 밑에 무작위로 넣는다.", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 465923, "name": "Conjuração Agrupada", "text": "Exile os seis cards do topo de seu grimório. Você pode conjurar até dois cards de feitiço com custo de mana convertido igual ou inferior a 3 dentre eles sem pagar seus custos de mana. Coloque os cards exilados não conjurados dessa forma no fundo de seu grimório em ordem aleatória.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 466177, "name": "Сборное Колдовство", "text": "Изгоните шесть верхних карт вашей библиотеки. Вы можете разыграть не более двух находящихся среди них карт волшебства с конвертированной мана-стоимостью не более 3 без уплаты их мана-стоимости. Положите изгнанные карты, не разыгранные таким образом, в низ вашей библиотеки в случайном порядке.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 466431, "name": "征召咒法", "text": "放逐你牌库顶的六张牌。你可以施放其中至多两张总法术力费用等于或小于3的法术牌，且不需支付其法术力费用。将以此法放逐且未施放的牌以随机顺序置于你的牌库底。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 466685, "name": "徵召咒法", "text": "放逐你牌庫頂的六張牌。你可以施放其中至多兩張總魔法力費用等於或小於3的巫術牌，且不需支付其魔法力費用。將以此法放逐且未施放的牌以隨機順序置於你的牌庫底。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "225209", "cardKingdomId": "224905", "cardsphereId": "59855", "mcmId": "374553", "mcmMetaId": "270912", "mtgjsonV4Id": "c78b8a76-1de4-5f09-8f9e-9f0bd26979c7", "mtgoId": "72764", "multiverseId": "464145", "scryfallId": "ba1d0ac1-e805-4213-a46e-cf124680d082", "scryfallIllustrationId": "aa1bda16-a635-4084-9520-c3c05703fa35", "scryfallOracleId": "a0a79e9e-38cb-45d8-a7ec-7cf10ef7e5fc", "tcgplayerProductId": "190838"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{R}", "manaValue": 4.0, "name": "Collected Conjuring", "number": "196", "originalText": "Exile the top six cards of your library. You may cast up to two sorcery cards with converted mana cost 3 or less from among them without paying their mana costs. Put the exiled cards not cast this way on the bottom of your library in a random order.", "originalType": "Sorcery", "printings": ["HA4", "MH1"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/a1d7eac8bb2f361b", "cardKingdomFoil": "https://mtgjson.com/links/cdb5908ddc3c41e2", "cardmarket": "https://mtgjson.com/links/fd37ad472a903d60", "tcgplayer": "https://mtgjson.com/links/e8564a142622dd54"}, "rarity": "rare", "rulings": [{"date": "2019-06-14", "text": "Each individual spell you cast this way must have mana value 3 or less. Their total mana value could be greater."}, {"date": "2019-06-14", "text": "You must cast any of the exiled cards you wish to cast while Collected Conjuring is resolving. You can’t cast them later in the turn."}, {"date": "2019-06-14", "text": "You may cast the two sorcery cards in either order. The second is cast before the first resolves."}, {"date": "2019-06-14", "text": "If a spell has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2019-06-14", "text": "If you cast a card “without paying its mana cost,” you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs (such as that of Tormenting Voice), you must pay those to cast the card."}], "securityStamp": "oval", "setCode": "MH1", "subtypes": [], "supertypes": [], "text": "Exile the top six cards of your library. You may cast up to two sorcery spells with mana value 3 or less from among them without paying their mana costs. Put the exiled cards not cast this way on the bottom of your library in a random order.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "46f38cd4-d64a-5177-a63e-67c4dce6d515"}