{"artist": "Erica Yang", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 7.0, "edhrecRank": 8946, "finishes": ["foil"], "foreignData": [], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": false, "identifiers": {"mtgjsonV4Id": "81bae9b3-a288-5b29-87c5-6c24fdcced7a", "mtgoId": "49834", "scryfallId": "9d0efe16-d789-4299-b381-080a6e5d9944", "scryfallIllustrationId": "becf3c3b-dfdd-495d-a31e-e34bbda280a4", "scryfallOracleId": "cd04b735-125f-47b5-a68e-ab2a008100b9"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Islandwalk", "Landwalk"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{5}{U}{U}", "manaValue": 7.0, "name": "Colossal Whale", "number": "49834", "originalReleaseDate": "2013-10-16", "power": "5", "printings": ["M14", "PM14", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2013-07-01", "text": "Colossal Whale’s triggered ability triggers and resolves during the declare attackers step, before blocking creatures are declared."}, {"date": "2013-07-01", "text": "Colossal Whale’s ability causes a zone change with a duration, a new style of ability that’s somewhat reminiscent of older cards like Oblivion Ring. However, unlike Oblivion Ring, cards like Colossal Whale have a single ability that creates two one-shot effects: one that exiles the creature when the ability resolves, and another that returns the exiled card to the battlefield immediately after Colossal Whale leaves the battlefield."}, {"date": "2013-07-01", "text": "If Colossal Whale leaves the battlefield before its triggered ability resolves, the target creature won’t be exiled."}, {"date": "2013-07-01", "text": "Auras attached to the exiled creature will be put into their owners’ graveyards. Equipment attached to the exiled creature will become unattached and remain on the battlefield. Any counters on the exiled creature will cease to exist."}, {"date": "2013-07-01", "text": "If a creature token is exiled, it ceases to exist. It won’t be returned to the battlefield."}, {"date": "2013-07-01", "text": "The exiled card returns to the battlefield immediately after Colossal Whale leaves the battlefield. Nothing happens between the two events, including state-based actions. The two creatures aren’t on the battlefield at the same time. For example, if the returning creature is a Clone, it can’t enter the battlefield as a copy of Colossal Whale."}, {"date": "2013-07-01", "text": "In a multiplayer game, if Colossal Whale’s owner leaves the game, the exiled card will return to the battlefield. Because the one-shot effect that returns the card isn’t an ability that goes on the stack, it won’t cease to exist along with the leaving player’s spells and abilities on the stack."}], "setCode": "PRM", "subtypes": ["Whale"], "supertypes": [], "text": "Islandwalk (This creature can't be blocked as long as defending player controls an Island.)\nWhenever Colossal Whale attacks, you may exile target creature defending player controls until Colossal Whale leaves the battlefield. (That creature returns under its owner's control.)", "toughness": "5", "type": "Creature — Whale", "types": ["Creature"], "uuid": "91c1cc8d-244a-5b28-97e0-860ccf0daeec"}