{"artist": "Chris Rallis", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 1491, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "212315", "cardsphereId": "49488", "mcmId": "297683", "mtgjsonV4Id": "8ade617d-df43-5877-97ab-8bddbe502c91", "scryfallId": "4bb4a85b-5afe-4e95-9aeb-23c45038cb15", "scryfallIllustrationId": "c91e4f21-3ae9-4fa0-8d78-fa8a5cd006d2", "scryfallOracleId": "5e15ff93-99a0-4000-918e-4bd2c257188d", "tcgplayerProductId": "130624"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Exert"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}", "manaValue": 3.0, "name": "Combat Celebrant", "number": "125s", "power": "4", "printings": ["AKH", "AKR", "PAKH"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/37a08073e8ba7bc6", "tcgplayer": "https://mtgjson.com/links/88c2b2d5b452dfa0"}, "rarity": "mythic", "rulings": [{"date": "2017-04-18", "text": "Combat Celebrant’s ability untaps all of your creatures, not just the ones that are attacking."}, {"date": "2017-04-18", "text": "Untapping an attacking creature doesn’t remove it from combat."}, {"date": "2017-04-18", "text": "There’s no main phase between your combat phases, so you’ll have no opportunity to cast spells or activate abilities that could only be cast any time you could cast a sorcery. For example, you won’t be able to cast another creature or equip Equipment between combats."}, {"date": "2017-04-18", "text": "If you exert Combat Celebrant, you get an additional combat phase even if Combat Celebrant doesn’t survive the first combat phase."}, {"date": "2017-04-18", "text": "If you exert multiple Combat Celebrants in one combat phase, you’ll have that many additional combat phases, but all of your creatures are untapped only during the current combat phase. You’ll need to exert the Combat Celebrants one at a time, in multiple combat phases, to untap your attacking creatures and attack with them in each combat step."}, {"date": "2017-04-18", "text": "You can’t exert a creature unless an effect allows you to do so. Similar effects that “tap and freeze” a creature (such as that of Decision Paralysis) don’t exert that creature."}, {"date": "2017-04-18", "text": "If an exerted creature is already untapped during your next untap step (most likely because it had vigilance or an effect untapped it), exert’s effect preventing it from untapping expires without having done anything."}, {"date": "2017-04-18", "text": "If you gain control of another player’s creature until end of turn and exert it, it will untap during that player’s untap step."}, {"date": "2017-04-18", "text": "All cards in the Amonkhet set that let you exert a creature let you do so as you declare it as an attacking creature, as do some of the cards in the Hour of Devastation set. You can’t do so later in combat, and creatures put onto the battlefield attacking can’t be exerted. Any abilities that trigger on exerting an attacking creature will resolve before blockers are declared."}], "securityStamp": "oval", "setCode": "PAKH", "subtypes": ["Human", "Warrior"], "supertypes": [], "text": "If Combat Celebrant hasn't been exerted this turn, you may exert it as it attacks. When you do, untap all other creatures you control and after this phase, there is an additional combat phase. (An exerted creature won't untap during your next untap step.)", "toughness": "1", "type": "Creature — Human Warrior", "types": ["Creature"], "uuid": "73e0e181-b89b-58f7-b530-6848ce1b461f"}