{"artist": "Marco Nelor", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 4171, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 390139, "name": "Gerechte Strafe", "text": "Verhindere allen Schaden, der dir oder Planeswalkern, die du kontrollierst, in diesem Zug von Quellen, die du nicht kontrollierst, zugefügt würde. Falls auf diese Weise Schaden aus einer Quelle, die eine Kreatur ist, verhindert wurde, fügt die Gerechte Strafe dieser Kreatur entsprechend viele Schadenspunkte zu. Falls auf diese Weise Schaden aus einer Quelle, die keine Kreatur ist, verhindert wurde, fügt die Gerechte Strafe dem Beherrscher der Quelle entsprechend viele Schadenspunkte zu.", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 391487, "name": "Castigo merecido", "text": "Prevén todo el daño que fueran a hacer fuentes que no controlas a ti y a los planeswalkers que controlas este turno. Si se previene daño de una fuente de criatura de esta manera, el Castigo merecido hace la misma cantidad de daño a esa criatura. Si se previene daño de una fuente que no sea criatura de esta manera, el Castigo merecido hace la misma cantidad de daño al controlador de la fuente.", "type": "Instantáneo"}, {"language": "French", "multiverseId": 390476, "name": "Sort bien mérité", "text": "Prévenez, ce tour-ci, toutes les blessures qui devraient être infligées à vous et aux planeswalkers que vous contrôlez par des sources que vous ne contrôlez pas. Si les blessures d'une source créature sont prévenues de cette manière, le Sort bien mérité inflige autant de blessures à cette créature. Si les blessures d'une source non-créature sont prévenues de cette manière, le Sort bien mérité inflige autant de blessures au contrôleur de cette source.", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 390813, "name": "Castigo Meritato", "text": "Previeni tutto il danno che verrebbe inflitto in questo turno a te e ai planeswalker che controlli da fonti che non controlli. Se viene prevenuto in questo modo il danno da una fonte creatura, il Castigo Meritato infligge altrettanti danni a quella creatura. Se viene prevenuto in questo modo il danno da una fonte non creatura, il Castigo Meritato infligge altrettanti danni al controllore di quella fonte.", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 391150, "name": "誅罰", "text": "あなたがコントロールしていない発生源があなたまたはあなたがコントロールするプレインズウォーカーに与えるすべてのダメージを軽減する。クリーチャーである発生源からのダメージがこれにより軽減されたなら、誅罰はそのクリーチャーにそのダメージと同じ点数のダメージを与える。クリーチャーでない発生源からのダメージがこれにより軽減されたなら、誅罰はその発生源のコントローラーにそのダメージと同じ点数のダメージを与える。", "type": "インスタント"}, {"language": "Chinese Simplified", "multiverseId": 389802, "name": "自业自得", "text": "于本回合中，防止不由你操控的来源将对你和由你操控的鹏洛客造成的所有伤害。如果以此法防止了某个来源为生物的伤害，则自业自得对该生物造成等量的伤害。如果以此法防止了某个来源为非生物的伤害，则自业自得对该来源的操控者造成等量的伤害。", "type": "瞬间"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "196754", "cardsphereId": "9914", "mcmId": "270518", "mcmMetaId": "210492", "mtgjsonV4Id": "5870328b-4081-5f1a-a317-b5dcd6d934c8", "mtgoFoilId": "55134", "mtgoId": "55133", "multiverseId": "389465", "scryfallId": "92d59c06-41f7-4009-9157-70ba90cc978b", "scryfallIllustrationId": "673090f1-9c4a-44b4-90ad-eedfa7609496", "scryfallOracleId": "01f29158-2dc9-4b9d-b726-add5d3fd5782", "tcgplayerProductId": "94212"}, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}", "manaValue": 4.0, "name": "Comeuppance", "number": "4", "originalText": "Prevent all damage that would be dealt to you and planeswalkers you control this turn by sources you don't control. If damage from a creature source is prevented this way, Comeuppance deals that much damage to that creature. If damage from a noncreature source is prevented this way, Comeuppance deals that much damage to the source's controller.", "originalType": "Instant", "printings": ["C14"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/9a817c2bafe484c2", "cardmarket": "https://mtgjson.com/links/033b342618356a3c", "tcgplayer": "https://mtgjson.com/links/efd21fbc58a1d0f0"}, "rarity": "rare", "rulings": [{"date": "2014-11-07", "text": "Comeuppance’s effect is not a redirection effect. If it prevents damage, Comeuppance (not the original source) deals damage to the permanent or player as part of that prevention effect. Comeuppance is the source of the new damage, so the characteristics of the original source (such as its color, or whether it had lifelink or deathtouch) don’t affect the new damage. The new damage is not combat damage, even if the prevented damage was."}], "securityStamp": "oval", "setCode": "C14", "subtypes": [], "supertypes": [], "text": "Prevent all damage that would be dealt to you and planeswalkers you control this turn by sources you don't control. If damage from a creature source is prevented this way, Comeuppance deals that much damage to that creature. If damage from a noncreature source is prevented this way, Comeuppance deals that much damage to the source's controller.", "type": "Instant", "types": ["Instant"], "uuid": "2d543de4-4db0-50de-93b4-6c1951b522ca"}