{"artist": "Daarken", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 6.0, "edhrecRank": 1852, "finishes": ["nonfoil", "foil"], "flavorText": "Liliana seized the reins of Bolas's vast army, gritting her teeth behind the Chain Veil.", "foreignData": [{"flavorText": "Liliana biss hinter dem Kettenschleier die Zähne zusammen und übernahm die Kontrolle über Bolas' riesige Armee.", "language": "German", "multiverseId": 461273, "name": "Befehligen der Schreckenshorde", "text": "Bestimme eine beliebige Anzahl an Kreaturen- und/oder Planeswalker-Karten deiner Wahl in Friedhöfen. Befehligen der Schreckenshorde fügt dir Schaden in Höhe der Summe der umgewandelten Manakosten jener Karten zu. Bringe sie unter deiner Kontrolle ins Spiel.", "type": "Hexerei"}, {"flavorText": "Liliana tomó las riendas del gigantesco ejército de Nicol Bolas, apretando la mandíbula detrás del Velo de Cadenas.", "language": "Spanish", "multiverseId": 461537, "name": "Comandar la Horda del Terror", "text": "Elige cualquier cantidad de cartas de criatura y/o planeswalker objetivo en los cementerios. Comandar la Horda del Terror te hace una cantidad de daño igual al coste de maná convertido total de esas cartas. Ponlas en el campo de batalla bajo tu control.", "type": "Conjuro"}, {"flavorText": "Liliana prit les rênes de l'immense armée de Bolas, les dents serrées derrière le Voile de Chaîne.", "language": "French", "multiverseId": 461801, "name": "Commander la Horde de l'effroi", "text": "Choisissez n'importe quel nombre de cartes de créature et/ou de planeswalker ciblées dans les cimetières. Commander la Horde de l'effroi vous inflige un nombre de blessures égal au coût converti de mana total de ces cartes. Mettez-les sur le champ de bataille sous votre contrôle.", "type": "Rituel"}, {"flavorText": "Liliana prese le redini del vasto esercito di Bolas, stringendo i denti sotto il Velo di Catena.", "language": "Italian", "multiverseId": 462065, "name": "Comandare l'Orda Atroce", "text": "Scegli un qualsiasi numero di carte creatura e/o planeswalker bersaglio nei cimiteri. Comandare l'Orda Atroce ti infligge danno pari al costo di mana convertito totale di quelle carte. Mettile sul campo di battaglia sotto il tuo controllo.", "type": "Stregoneria"}, {"flavorText": "リリアナはボーラスの大軍団を掌握したが、鎖のヴェールの裏側では歯を噛み締めていた。", "language": "Japanese", "multiverseId": 462329, "name": "戦慄衆の指揮", "text": "墓地からクリーチャーやプレインズウォーカーである望む数のカードを対象とする。戦慄衆の指揮はあなたに、それらのカードの点数で見たマナ・コストの合計に等しい点数のダメージを与える。それらをあなたのコントロール下で戦場に出す。", "type": "ソーサリー"}, {"flavorText": "릴리아나는 사슬 베일 너머에서 이를 악물며 볼라스의 광대한 군대의 고삐를 움켜쥐었다.", "language": "Korean", "multiverseId": 462593, "name": "공포군단 지휘", "text": "무덤들에 있는 생물 및/또는 플레인즈워커 카드들을 원하는 수만큼 목표로 정한다. 공포군단 지휘는 그렇게 선택된 카드들의 전환마나비용의 총합만큼 당신에게 피해를 입힌다. 그 카드들을 당신의 조종하에 전장에 놓는다.", "type": "집중마법"}, {"flavorText": "Liliana tomou as rédeas do vasto exército de Nicol Bolas, rangendo os dentes por trás do Véu Metálico.", "language": "Portuguese (Brazil)", "multiverseId": 462857, "name": "Comandar a Horda Medonha", "text": "Escolha qualquer número de cards de criatura e/ou planeswalker alvo nos cemitérios. Comandar a Horda Medonha causa a você uma quantidade de dano igual ao custo de mana convertido total daqueles cards. Coloque-os no campo de batalha sob o seu controle.", "type": "Feitiço"}, {"flavorText": "Стиснув зубы за Кольчужной Завесой, Лилиана взялась за удила неисчислимой армии Боласа.", "language": "Russian", "multiverseId": 463121, "name": "Повелевание Ордой Ужаса", "text": "Выберите любое количество целевых карт существ и (или) planeswalker-ов на кладбищах. Повелевание Ордой Ужаса наносит вам повреждения, равные суммарной конвертированной мана-стоимости тех карт. Положите их на поле битвы под вашим контролем.", "type": "Волшебство"}, {"flavorText": "虽然莉莲娜坐拥号令波拉斯大军的兵权，但在锁链面纱之下，却是一副咬牙切齿的表情。", "language": "Chinese Simplified", "multiverseId": 463385, "name": "统领震惧军", "text": "选择任意数量目标在坟墓场中的生物和／或鹏洛客牌。统领震惧军对你造成伤害，其数量等同于这些牌总法术力费用的总和。将它们在你的操控下放进战场。", "type": "法术"}, {"flavorText": "雖然莉蓮娜坐擁號令波拉斯大軍的兵權，但在鎖鏈面紗之下，卻是一副咬牙切齒的表情。", "language": "Chinese Traditional", "multiverseId": 463649, "name": "統領震懼軍", "text": "選擇任意數量目標在墳墓場中的生物和／或鵬洛客牌。統領震懼軍對你造成傷害，其數量等同於這些牌總魔法力費用的總和。將它們在你的操控下放進戰場。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "224566", "cardKingdomId": "224277", "cardsphereId": "59128", "mcmId": "372287", "mcmMetaId": "269612", "mtgArenaId": "69533", "mtgjsonV4Id": "4f803b06-0ffc-5500-85c9-82bd124042b2", "mtgoId": "71770", "multiverseId": "461009", "scryfallId": "de7ec307-45e0-4853-85fe-9ce859b188c2", "scryfallIllustrationId": "3da11367-d303-468c-9c4c-f7ffb60523e9", "scryfallOracleId": "198d31e4-1ae1-4bf9-a05a-7fa45c0aeddb", "tcgplayerProductId": "188715"}, "isStorySpotlight": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{B}{B}", "manaValue": 6.0, "name": "Command the Dreadhorde", "number": "82", "originalText": "Choose any number of target creature and/or planeswalker cards in graveyards. Command the Dreadhorde deals damage to you equal to the total converted mana cost of those cards. Put them onto the battlefield under your control.", "originalType": "Sorcery", "printings": ["PWAR", "WAR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/dd64f1d5cb8fa697", "cardKingdomFoil": "https://mtgjson.com/links/63c552e06955f240", "cardmarket": "https://mtgjson.com/links/409d79774f281e88", "tcgplayer": "https://mtgjson.com/links/6c9d23c1bd6f0658"}, "rarity": "rare", "rulings": [{"date": "2019-05-03", "text": "Command the Dreadhorde deals damage to you before the creature and planeswalker cards are put onto the battlefield, but if this brings your life total to 0 or less, those creatures and planeswalkers enter the battlefield before you lose the game. Any abilities they have that trigger when they enter the battlefield won’t resolve if you lose the game, but their static abilities (such as that of Platinum Angel) may help you survive with 0 or less life."}, {"date": "2019-05-03", "text": "If a card in a graveyard has {X} in its mana cost, X is considered to be 0."}, {"date": "2019-05-03", "text": "In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. If you leave the game, the creatures and planeswalkers you control from Command the Dreadhorde’s effect are exiled."}], "securityStamp": "oval", "setCode": "WAR", "subtypes": [], "supertypes": [], "text": "Choose any number of target creature and/or planeswalker cards in graveyards. Command the Dreadhorde deals damage to you equal to the total mana value of those cards. Put them onto the battlefield under your control.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "b132e71e-617c-5a0d-acef-c27efce402ce"}