{"artist": "John Matson", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 7.0, "edhrecRank": 5547, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 127243, "name": "Einziehen", "text": "Du kannst zwei blaue Karten aus deiner Hand ganz aus dem Spiel entfernen, anstatt die Manakosten von Einziehen zu bezahlen.\nÜbernimm die Kontrolle über einen Nichtkreaturenzauber deiner Wahl. Du kannst neue Ziele für ihn bestimmen. (Ist dieser Zauberspruch ein Artefakt oder eine Verzauberung, kommt die bleibende Karte unter deiner Kontrolle ins Spiel.)", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 128018, "name": "Requisar", "text": "Puedes remover del juego dos cartas azules de tu mano en lugar de pagar el coste de maná de Requisar.\nGana el control del hechizo objetivo que no sea de criatura. Puedes elegir nuevos objetivos para él. (Si ese hechizo es un artefacto o encantamiento, el permanente entra en juego bajo tu control.)", "type": "Instantáneo"}, {"language": "French", "multiverseId": 127088, "name": "Réquisition", "text": "Vous pouvez retirer de la partie deux cartes bleues de votre main à la place de payer le coût de mana de la Réquisition.\nAcquérez le contrôle du sort non-créature ciblé. Vous pouvez lui choisir de nouvelles cibles. (Si ce sort est un artefact ou un enchantement, le permanent arrive en jeu sous votre contrôle.)", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 127398, "name": "Requisire", "text": "Puoi rimuovere dal gioco due carte blu presenti nella tua mano invece di pagare il costo di mana di Requisire.\nPrendi il controllo di una magia non creatura bersaglio. Puoi scegliere nuovi bersagli per essa. (Se quella magia è un artefatto o un incantesimo, il permanente entra in gioco sotto il tuo controllo.)", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 127553, "name": "徴用", "text": "あなたは徴用のマナ・コストを支払うのではなく、あなたの手札にある青のカードを２枚ゲームから取り除いてもよい。\nクリーチャーでない呪文１つを対象とし、それのコントロールを得る。 あなたはそれの新たな対象を選んでもよい。 （その呪文がアーティファクトかエンチャントの場合、そのパーマネントはあなたのコントロール下で場に出る。）", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 127708, "name": "Requisitar", "text": "Você pode remover do jogo dois cards azuis na sua mão em vez de pagar o custo de mana de Requisitar.\nGanhe o controle da mágica alvo que não seja de criatura. Você pode escolher novos alvos para ela. (Se aquela mágica for um artefato ou encantamento, a permanente entra em jogo sob seu controle.)", "type": "Mágica Instantânea"}, {"language": "Chinese Simplified", "multiverseId": 126933, "name": "霸占", "text": "你可以将你手上两张蓝色牌移出对战，而不支付霸占的法术力费用。\n获得目标非生物咒语的操控权。 你可以为它选择新的目标。 （如果该咒语是神器或结界，则此永久物会在你的操控下进场。）", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "120888", "cardKingdomId": "120733", "cardsphereId": "8566", "mcmId": "13624", "mcmMetaId": "8177", "mtgjsonV4Id": "9d7a1cfb-8be2-50da-abf8-e2dafcb7c1b0", "mtgoFoilId": "24718", "mtgoId": "24717", "multiverseId": "121243", "scryfallId": "7e6e6204-c622-4efe-ac4f-8195528cec9c", "scryfallIllustrationId": "8372abd3-7f40-4d58-acfa-4a3c5fdc59d9", "scryfallOracleId": "ad7d854b-d303-40eb-acd6-03a8023e05e7", "tcgplayerProductId": "14017"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "vintage": "Legal"}, "manaCost": "{5}{U}{U}", "manaValue": 7.0, "name": "Commandeer", "number": "29", "originalText": "You may remove two blue cards in your hand from the game rather than pay Commandeer's mana cost.\nGain control of target noncreature spell. You may choose new targets for it. (If that spell is an artifact or enchantment, the permanent comes into play under your control.)", "originalType": "Instant", "printings": ["CSP"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/0332be249ef5a63f", "cardKingdomFoil": "https://mtgjson.com/links/75188a9d539ebe21", "cardmarket": "https://mtgjson.com/links/f23c64526f3ba1f5", "tcgplayer": "https://mtgjson.com/links/bb33f16eb3d207e1"}, "rarity": "rare", "rulings": [{"date": "2006-07-15", "text": "After Commandeer resolves, you control the targeted spell. Any instance of “you” in that spell’s text now refers to you, “an opponent” refers to one of your opponents, and so on. The change of control happens before new targets are chosen, so any targeting restrictions such as “target opponent” or “target creature you control” are now made in reference to you, not the spell’s original controller. You may either change those targets to be legal in reference to you, or, if those are the spell’s only targets, the spell doesn’t resolve for having illegal targets. When the spell resolves, any illegal targets are unaffected by it and you make all decisions the spell’s effect calls for."}, {"date": "2006-07-15", "text": "You may change any of the targeted spell’s targets. If you change a target, you must choose a legal target for the spell. If you can’t, you must leave the target the same (even if that target is now illegal)."}, {"date": "2006-07-15", "text": "If the targeted spell has a triggered ability that copies it (for example, replicate or storm), the copies will be controlled by the player who cast that spell."}, {"date": "2006-07-15", "text": "If you gain control of an instant or sorcery spell with Commandeer, it will still be put into its owner’s graveyard when it resolves."}, {"date": "2006-07-15", "text": "If you don’t have two cards of the right color in your hand, you can’t choose to cast the spell using the alternative cost."}, {"date": "2006-07-15", "text": "You can’t exile a card from your hand to pay for itself. At the time you would pay costs, that card is on the stack, not in your hand."}, {"date": "2006-07-15", "text": "You may pay the alternative cost rather than the card’s mana cost. Any additional costs are paid as normal."}, {"date": "2007-02-01", "text": "If you Commandeer a spell for which Buyback has been paid, the card returns to its owner’s hand."}], "setCode": "CSP", "subtypes": [], "supertypes": [], "text": "You may exile two blue cards from your hand rather than pay this spell's mana cost.\nGain control of target noncreature spell. You may choose new targets for it. (If that spell is an artifact, enchantment, or planeswalker, the permanent enters the battlefield under your control.)", "type": "Instant", "types": ["Instant"], "uuid": "9b78a70c-1331-5a17-8817-a9164c0af1ff"}