{"artist": "Seb McKinnon", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 6117, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "271690", "mcmId": "688909", "mcmMetaId": "265083", "mtgjsonV4Id": "4a5d7afe-f20c-5e73-880b-b1613496a126", "mtgoFoilId": "103607", "mtgoId": "103606", "scryfallId": "1dc26b58-1b10-41a3-8155-bbc8f189de15", "scryfallIllustrationId": "bc79c357-1d57-4063-a9ce-ef75d3550d05", "scryfallOracleId": "e938ee4c-d5df-4d93-bd61-9e518fb1dc30", "tcgplayerProductId": "456782"}, "isReprint": true, "isStarter": true, "keywords": ["Convoke"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}", "manaValue": 4.0, "name": "Conclave Tribunal", "number": "14", "printings": ["GRN", "PGRN", "SCD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2229b0928812dd43", "cardmarket": "https://mtgjson.com/links/752d7436c5a23463", "tcgplayer": "https://mtgjson.com/links/e3bdf5a3b024901d"}, "rarity": "uncommon", "rulings": [{"date": "2018-10-05", "text": "If Conclave Tribunal leaves the battlefield before its triggered ability resolves, the target permanent won’t be exiled."}, {"date": "2018-10-05", "text": "Auras attached to the exiled permanent will be put into their owners’ graveyards. Any Equipment will become unattached and remain on the battlefield. Any counters on the exiled permanent will cease to exist. When the card returns to the battlefield, it will be a new object with no connection to the card that was exiled."}, {"date": "2018-10-05", "text": "If a token is exiled this way, it will cease to exist and won’t return to the battlefield."}, {"date": "2018-10-05", "text": "You can tap an untapped creature you haven’t controlled continuously since the beginning of your most recent turn to convoke a spell."}, {"date": "2018-10-05", "text": "Convoke doesn’t change a spell’s mana cost or converted mana cost."}, {"date": "2018-10-05", "text": "When calculating a spell’s total cost, include any alternative costs, additional costs, or anything else that increases or reduces the cost to cast the spell. Convoke applies after the total cost is calculated."}, {"date": "2018-10-05", "text": "Because convoke isn’t an alternative cost, it can be used in conjunction with alternative costs."}, {"date": "2018-10-05", "text": "Tapping a multicolored creature using convoke will pay for {1} or one mana of your choice of any of that creature’s colors."}, {"date": "2018-10-05", "text": "When using convoke to cast a spell with {X} in its mana cost, first choose the value for X. That choice, plus any cost increases or decreases, will determine the spell’s total cost. Then you can tap creatures you control to help pay that cost. For example, if you cast Worldsoul Colossus (a spell with convoke and mana cost {X}{G}{W}) and choose X to be 3, the total cost is {3}{G}{W}. If you tap two green creatures and two white creatures, you’ll have to pay {1}."}, {"date": "2018-10-05", "text": "If a creature you control has a mana ability with {T} in the cost, activating that ability while casting a spell with convoke will result in the creature being tapped before you pay the spell’s costs. You won’t be able to tap it again for convoke. Similarly, if you sacrifice a creature to activate a mana ability while casting a spell with convoke, that creature won’t be on the battlefield when you pay the spell’s costs, so you won’t be able to tap it for convoke."}], "setCode": "SCD", "subtypes": [], "supertypes": [], "text": "Convoke (Your creatures can help cast this spell. Each creature you tap while casting this spell pays for {1} or one mana of that creature's color.)\nWhen Conclave Tribunal enters the battlefield, exile target nonland permanent an opponent controls until Conclave Tribunal leaves the battlefield.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "d02aa79e-9318-59a7-a71e-c5c2c8611a0f"}