{"artist": "Terese Nielsen", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 6.0, "edhrecRank": 23358, "finishes": ["nonfoil", "foil"], "flavorText": "Equenauts are the seeds of the Conclave, scattered on the four winds, searching for new places to take root.", "foreignData": [{"flavorText": "Equidonauten sind die in alle vier Himmelsrichtungen verstreuten Samen des Konklave, die neue Plätze suchen, an denen sie Wurzeln schlagen können.", "language": "German", "multiverseId": 111634, "name": "Konklavenequidonaut", "text": "Einberufen (Jede Kreatur, die du tappst, während du diesen Zauberspruch spielst, reduziert dessen Kosten um {1} oder um ein Mana der Farbe jener Kreatur.)\nFliegend", "type": "Kreatur — Mensch, Soldat"}, {"flavorText": "Los equinautas son las semillas del Cónclave, desperdigadas a los cuatro vientos, buscando nuevos lugares para echar raíces.", "language": "Spanish", "multiverseId": 113164, "name": "Equinautas del Cónclave", "text": "Convocar (Cada criatura que gires al jugar este hechizo reduce su coste en {1} o en un maná del color de esa criatura.)Vuela.", "type": "Criatura — Soldado humano"}, {"flavorText": "Les équénautes sont les semences du Conclave. Éparpillés aux quatre vents, ils cherchent de nouveaux lieux où prendre racine.", "language": "French", "multiverseId": 111940, "name": "Équénaute du Conclave", "text": "Convocation (Chaque créature que vous engagez en jouant ce sort réduit son coût de {1} ou d'un mana de la couleur de cette créature.)\nVol", "type": "Créature : humain et soldat"}, {"flavorText": "Gli equinauti sono i semi del Conclave, dispersi ai quattro venti, alla ricerca di nuovi luoghi in cui attecchire.", "language": "Italian", "multiverseId": 112246, "name": "Equinauta del Conclave", "text": "Convocazione (Ciascuna creatura che TAPpi mentre giochi questa magia riduce il suo costo di {1} o di un mana del colore di quella creatura.)\nVolare", "type": "Creatura — Soldato Umano"}, {"flavorText": "乗馬兵は議事会の種だ。四つの風に乗って散らばり、根を下ろす新たな場所を探している。", "language": "Japanese", "multiverseId": 112552, "name": "議事会の乗馬兵", "text": "召集 （あなたがこの呪文をプレイする段階であなたがタップした各クリーチャーにつき、この呪文のコストはそのクリーチャーの色のマナ１点か{1}少なくなる。）\n飛行", "type": "クリーチャー — 人間・兵士"}, {"flavorText": "Os Viajantes Eqüestres são as sementes do Conclave, disseminados aos quatro ventos, procurando novos lugares para germinar.", "language": "Portuguese (Brazil)", "multiverseId": 112858, "name": "Viajante Eqüestre do Conclave", "text": "Convocar (Cada criatura que você vira ao jogar esta mágica reduz seu custo em {1} ou em um mana da cor daquela criatura.)\nVoar", "type": "Criatura — Soldado Humano"}, {"flavorText": "Эквенавты — это семена Конклава, рассеянные по всему миру и ищущие, где бы пустить корни.", "language": "Russian", "multiverseId": 114266, "name": "Эквенавт Конклава", "text": "Созыв (Когда вы разыгрываете это заклинание, каждое повернутое существо уменьшает стоимость заклинания на {1} или на один пункт маны цвета этого существа).\nПолет", "type": "Существо — Человек Солдат"}, {"flavorText": "飞马骑士是盟会的种子，乘风飞向四方，寻找适合生根茁壮的新领域。", "language": "Chinese Simplified", "multiverseId": 111328, "name": "盟会飞马骑士", "text": "召集（使用此咒语时，你每为它横置一个生物，便可以少支付{1}，或一点所横置生物颜色的法术力。）\n飞行", "type": "生物～人类／士兵"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "118691", "cardKingdomId": "118400", "cardsphereId": "37944", "mcmId": "13338", "mcmMetaId": "7916", "mtgjsonV4Id": "fd47b2f7-9ce4-5efe-9a7e-a4f6c0e0048c", "mtgoFoilId": "23167", "mtgoId": "23166", "multiverseId": "87915", "scryfallId": "cd663560-915a-4762-a3a6-0b9f6d7a9c64", "scryfallIllustrationId": "bf66c81f-0316-436c-b49c-21faceffdca3", "scryfallOracleId": "4127794b-84d1-4efb-b0e9-543a02b07fa8", "tcgplayerProductId": "13235"}, "keywords": ["Convoke", "Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{W}{W}", "manaValue": 6.0, "name": "Conclave Equenaut", "number": "9", "originalText": "Convoke (Each creature you tap while playing this spell reduces its cost by {1} or by one mana of that creature's color.)\nFlying", "originalType": "Creature - Human Soldier", "power": "3", "printings": ["DDF", "RAV"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/b4a167733503e9f7", "cardKingdomFoil": "https://mtgjson.com/links/066cdae6eef04a66", "cardmarket": "https://mtgjson.com/links/197464bf5b5734b1", "tcgplayer": "https://mtgjson.com/links/4ee52566c16f8779"}, "rarity": "common", "rulings": [{"date": "2014-07-18", "text": "The rules for convoke have changed slightly since it last appeared in an expansion. Previously, convoke reduced the cost to cast a spell. Under current rules, you tap creatures at the same time you pay the spell’s costs. Tapping a creature this way is simply another way to pay."}, {"date": "2014-07-18", "text": "Convoke doesn’t change a spell’s mana cost or converted mana cost."}, {"date": "2014-07-18", "text": "When calculating a spell’s total cost, include any alternative costs, additional costs, or anything else that increases or reduces the cost to cast the spell. Convoke applies after the total cost is calculated."}, {"date": "2014-07-18", "text": "Because convoke isn’t an alternative cost, it can be used in conjunction with alternative costs."}, {"date": "2014-07-18", "text": "Tapping a multicolored creature using convoke will pay for {1} or one mana of your choice of any of that creature’s colors."}, {"date": "2014-07-18", "text": "When using convoke to cast a spell with {X} in its mana cost, first choose the value for X. That choice, plus any cost increases or decreases, will determine the spell’s total cost. Then you can tap creatures you control to help pay that cost. For example, if you cast Chord of Calling (a spell with convoke and mana cost {X}{G}{G}{G}) and choose X to be 3, the total cost is {3}{G}{G}{G}. If you tap two green creatures and two red creatures, you’ll have to pay {1}{G}."}, {"date": "2014-07-18", "text": "If a creature you control has a mana ability with {T} in the cost, activating that ability while casting a spell with convoke will result in the creature being tapped when you pay the spell’s costs. You won’t be able to tap it again for convoke. Similarly, if you sacrifice a creature to activate a mana ability while casting a spell with convoke, that creature won’t be on the battlefield when you pay the spell’s costs, so you won’t be able to tap it for convoke."}], "setCode": "RAV", "subtypes": ["Human", "Soldier"], "supertypes": [], "text": "Convoke (Your creatures can help cast this spell. Each creature you tap while casting this spell pays for {1} or one mana of that creature's color.)\nFlying", "toughness": "3", "type": "Creature — Human Soldier", "types": ["Creature"], "uuid": "f5a29620-e87e-5e61-a5b7-8ffd3ac95b04", "watermark": "selesnya"}