{"artist": "Joseph Meehan", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 11860, "finishes": ["foil"], "flavorText": "\"Citizens, do not resist. This is for your safety. Tezzeret bids you to surrender your inventions. Now.\"", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "209378", "cardsphereId": "37097", "mcmId": "292946", "mtgjsonV4Id": "f5d12233-582c-5f37-a16b-97e6f121b1cc", "scryfallId": "9f97953f-0cf9-4a78-b048-ae4d08c0e5de", "scryfallIllustrationId": "9204252a-20d3-4bea-b17a-a9113b4207e8", "scryfallOracleId": "c246cdb4-2fd8-487e-944e-3e52fbd1bbaa", "tcgplayerProductId": "123358"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}{U}", "manaValue": 5.0, "name": "Confiscation Coup", "number": "41s", "printings": ["KLD", "KLR", "PKLD"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/ec80f10bd40d7b2f", "tcgplayer": "https://mtgjson.com/links/9a90278b7b00728d"}, "rarity": "rare", "rulings": [{"date": "2016-09-20", "text": "If a permanent has {X} in its mana cost, X is considered to be 0."}, {"date": "2016-09-20", "text": "The mana value of a token that isn't a copy of another object is 0. A token that is a copy of another object has the same mana cost as that object."}, {"date": "2016-09-20", "text": "In a multiplayer game, if a permanent's owner leaves the game after you've gained control of it, the permanent leaves with that player. If you leave the game before that player, the control-change effect ends."}, {"date": "2016-09-20", "text": "If the target artifact or creature has a mana value of 0, you may choose to pay zero energy and gain control of it."}, {"date": "2016-09-20", "text": "You choose the target artifact or creature as you cast Confiscation Coup. You don't choose whether or not to pay an amount of {E} until Confiscation Coup resolves. If the target becomes an illegal target, Confiscation Coup won't resolve and you won't get {E}{E}{E}{E}."}, {"date": "2017-02-09", "text": "Energy counters are a kind of counter that a player may have. They're not associated with specific permanents. (Other kinds of counters that players may have include poison and experience.)"}, {"date": "2017-02-09", "text": "{E} is the energy symbol. It represents one energy counter."}, {"date": "2017-02-09", "text": "Keep careful track of how many energy counters each player has. You may do so by keeping a running count on paper, by using a die, or by any other clear and mutually agreeable method."}, {"date": "2017-02-09", "text": "If an effect says you get one or more {E}, you get that many energy counters. To pay one or more {E}, you lose that many energy counters. Any effects that interact with counters a player gets, has, or loses can interact with energy counters."}, {"date": "2017-02-09", "text": "Energy counters aren't mana. They don't go away as steps, phases, and turns end, and effects that add mana “of any type” to your mana pool can't give you energy counters."}, {"date": "2017-02-09", "text": "You can't pay more energy counters than you have."}, {"date": "2018-01-19", "text": "There are many important moments in the story, but the most crucial—called “story spotlights”—are shown on cards. These cards have the Planeswalker symbol in their text box; this symbol has no effect on gameplay. You can read more about these events in the official Magic fiction at http://www.mtgstory.com."}], "securityStamp": "oval", "setCode": "PKLD", "subtypes": [], "supertypes": [], "text": "Choose target artifact or creature. You get {E}{E}{E}{E} (four energy counters), then you may pay an amount of {E} equal to that permanent's mana value. If you do, gain control of it.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "ebe058ca-5092-5c97-9a07-bec3283f1034", "watermark": "planeswalker"}