{"artist": "Karl Kopinski", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 6.0, "edhrecRank": 5225, "finishes": ["nonfoil", "foil"], "flavorText": "Slivers are often seen toying with enemies they capture, not out of cruelty, but to fully learn their physical capabilities.", "foreignData": [{"flavorText": "Remasuris spielen häufig mit den Feinden, die sie fangen. Nicht aus Grausamkeit, sondern um alles über ihre körperlichen Fähigkeiten zu erfahren.", "language": "German", "multiverseId": 384067, "name": "Erstickender Remasuri", "text": "Remasuri-Kreaturen, die du kontrollierst, haben „Wenn diese Kreatur ins Spiel kommt, kannst du eine Kreatur deiner Wahl, die ein Gegner kontrolliert, ins Exil schicken, bis diese Kreatur das Spiel verlässt.\"", "type": "Kreatur — Remasuri"}, {"flavorText": "A menudo se ve a los fragmentados jugar con los enemigos que capturan; no lo hacen por crueldad, sino más bien para conocer a fondo sus capacidades físicas.", "language": "Spanish", "multiverseId": 386055, "name": "Fragmentado asfixiante", "text": "Las criaturas Fragmentado que controlas tienen \"Cuando esta criatura entre al campo de batalla, puedes exiliar la criatura objetivo que controla un oponente hasta que esta criatura deje el campo de batalla\".", "type": "Criatura — Fragmentado"}, {"flavorText": "Les slivoïdes jouent souvent avec les ennemis qu'ils capturent, pas par cruauté, mais dans le but de connaître leurs capacités physiques dans les moindres détails.", "language": "French", "multiverseId": 384351, "name": "Slivoïde constricteur", "text": "Les créatures Slivoïde que vous contrôlez ont « Quand cette créature arrive sur le champ de bataille, vous pouvez exiler une créature ciblée qu'un adversaire contrôle jusqu'à ce que cette créature quitte le champ de bataille. »", "type": "Créature : slivoïde"}, {"flavorText": "Numerosi avvistamenti raccontano di tramutanti che giocano con i nemici catturati, non per crudeltà, ma per comprendere pienamente le loro abilità fisiche.", "language": "Italian", "multiverseId": 384635, "name": "Tramutante Costrittore", "text": "Le creature Tramutante che controlli hanno \"Quando questa creatura entra nel campo di battaglia, puoi esiliare una creatura bersaglio controllata da un avversario finché questa creatura non lascia il campo di battaglia\".", "type": "Creatura — Tramutante"}, {"flavorText": "スリヴァーはしばしば捕えた敵を弄ぶことがある。これは残虐性からではなく、その身体的能力をより良く知るために行っているのである。", "language": "Japanese", "multiverseId": 384919, "name": "束縛スリヴァー", "text": "あなたがコントロールするスリヴァー・クリーチャーは「このクリーチャーが戦場に出たとき、対戦相手がコントロールするクリーチャー１体を対象とし、このクリーチャーが戦場を離れるまでそれを追放してもよい。」を持つ。", "type": "クリーチャー — スリヴァー"}, {"flavorText": "슬리버들은 종종 생포한 적을 가지고 노는데, 잔인함이라기보다는 적의 육체적인 능력을 완벽하게 연구하기 위해서이다.", "language": "Korean", "multiverseId": 385203, "name": "조여드는 슬리버", "text": "당신이 조종하는 슬리버 생물들은 \"이 생물이 전장에 들어올 때, 상대가 조종하는 생물을 목표로 정한다. 당신은 그 목표를 이 생물이 전장을 떠날 때까지 추방할 수 있다.\"를 가진다.", "type": "생물 — 슬리버"}, {"flavorText": "Os fractius comumente são vistos brincando com os inimigos capturados. Não por crueldade, mas para conhecer as capacidades físicas da presa.", "language": "Portuguese (Brazil)", "multiverseId": 385487, "name": "Fractius Constritor", "text": "As criaturas do tipo Fractius que você controla têm \"Quando esta criatura entra no campo de batalha, você pode exilar a criatura alvo que um oponente controla até esta criatura deixar o campo de batalha.\"", "type": "Criatura — Fractius"}, {"flavorText": "Нередко можно увидеть, как щепки играют с попавшими им в лапы врагами. Однако они делают это не из жестокости, а для того, чтобы лучше изучить их физические возможности.", "language": "Russian", "multiverseId": 385771, "name": "Удушающая Щепка", "text": "Существа-Щепки под вашим контролем имеют способность «Когда это существо выходит на поле битвы, вы можете изгнать целевое существо под контролем оппонента до тех пор, пока это существо не покинет поле битвы».", "type": "Существо — Щепка"}, {"flavorText": "时常有人看见裂片妖玩弄他们捕获的敌人，这并非出于残忍，而是为了充分了解自己的身体机能。", "language": "Chinese Simplified", "multiverseId": 383499, "name": "缠缚裂片妖", "text": "由你操控的裂片妖生物具有「当此生物进战场时，你可以放逐目标由对手操控的生物，直到此生物离开战场为止。」", "type": "生物～裂片妖"}, {"flavorText": "時常有人看見裂片妖玩弄他們捕獲的敵人，這並非出於殘忍，而是為了充分瞭解自己的身體機能。", "language": "Chinese Traditional", "multiverseId": 383783, "name": "纏縛裂片妖", "text": "由你操控的裂片妖生物具有「當此生物進戰場時，你可以放逐目標由對手操控的生物，直到該生物離開戰場為止。」", "type": "生物～裂片妖"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "195433", "cardKingdomId": "195131", "cardsphereId": "28352", "mcmId": "267694", "mcmMetaId": "209954", "mtgjsonV4Id": "3c3f85f8-4259-5721-a688-72dc73e62154", "mtgoFoilId": "53667", "mtgoId": "53666", "multiverseId": "383215", "scryfallId": "ae9b4111-ca9f-435b-81c4-0abf65d1384b", "scryfallIllustrationId": "b110766a-25b2-478d-a40b-945e7f5a0d73", "scryfallOracleId": "fd26f893-6f45-44df-aa4e-c919fc118aff", "tcgplayerProductId": "91103"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{5}{W}", "manaValue": 6.0, "name": "Constricting Sliver", "number": "7", "originalText": "Sliver creatures you control have \"When this creature enters the battlefield, you may exile target creature an opponent controls until this creature leaves the battlefield.\"", "originalType": "Creature — Sliver", "power": "3", "printings": ["M15"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/30aaa70c73ed54e6", "cardKingdomFoil": "https://mtgjson.com/links/82a2fba1986d51a4", "cardmarket": "https://mtgjson.com/links/1805fa47fa305c7a", "tcgplayer": "https://mtgjson.com/links/b7a3b38630fae484"}, "rarity": "uncommon", "rulings": [{"date": "2014-07-18", "text": "Constricting Sliver gives Slivers you control an ability that causes a zone change with a duration, a newer style of ability that’s somewhat reminiscent of older cards like Oblivion Ring. However, unlike Oblivion Ring’s abilities, this ability creates two one-shot effects: one that exiles the creature when the ability resolves, and another that returns the exiled card to the battlefield immediately after the Sliver leaves the battlefield."}, {"date": "2014-07-18", "text": "When Constricting Sliver enters the battlefield, the ability it gives itself will trigger."}, {"date": "2014-07-18", "text": "The Sliver that enters the battlefield is the source of the ability that exiles the creature. For example, if a blue Sliver enters the battlefield under your control, the ability can target and exile a creature with protection from white."}, {"date": "2014-07-18", "text": "Auras attached to the exiled creature will be put into their owners’ graveyards (unless they’re Theros block cards with the bestow ability). Equipment attached to the exiled creature will become unattached and remain on the battlefield. Any counters on the exiled creature will cease to exist."}, {"date": "2014-07-18", "text": "If a creature token is exiled, it ceases to exist. It won’t be returned to the battlefield."}, {"date": "2014-07-18", "text": "If a Sliver leaves the battlefield before its enters-the-battlefield ability resolves, the target creature won’t be exiled."}, {"date": "2014-07-18", "text": "If a Sliver you control leaves the battlefield, only the card that particular Sliver exiled will return to the battlefield. Each card exiled by another Sliver will remain exiled until that Sliver leaves the battlefield."}, {"date": "2014-07-18", "text": "The exiled card returns to the battlefield immediately after the Sliver leaves the battlefield. Nothing happens between the two events, including state-based actions. The two creatures aren’t on the battlefield at the same time. For example, if the returning creature is a Mercurial Pretender, it can’t enter the battlefield as a copy of the Sliver."}, {"date": "2014-07-18", "text": "The exiled card will return to the battlefield under its owner’s control."}, {"date": "2014-07-18", "text": "The exiled card will return even if the Sliver whose ability exiled it doesn’t have that ability at the time (perhaps because Constricting Sliver is no longer on the battlefield)."}, {"date": "2014-07-18", "text": "In a multiplayer game, if the Sliver’s owner leaves the game, the exiled card will return to the battlefield. Because the one-shot effect that returns the card isn’t an ability that goes on the stack, it won’t cease to exist along with the leaving player’s spells and abilities on the stack."}, {"date": "2014-07-18", "text": "Slivers in this set affect only Sliver creatures you control. They don’t grant bonuses to your opponents’ Slivers. This is the same way Slivers from the Magic 2014 core set worked, while Slivers in earlier sets granted bonuses to all Slivers."}, {"date": "2014-07-18", "text": "Abilities that Slivers grant, as well as power/toughness boosts, are cumulative. However, for some abilities, like indestructible and the ability granted by Belligerent Sliver, having more than one instance of the ability doesn’t provide any additional benefit."}, {"date": "2014-07-18", "text": "If you change the creature type of a Sliver you control so it’s no longer a Sliver, it will no longer be affected by its own ability. Its ability will continue to affect other Sliver creatures you control."}], "setCode": "M15", "subtypes": ["Sliver"], "supertypes": [], "text": "Sliver creatures you control have \"When this creature enters the battlefield, you may exile target creature an opponent controls until this creature leaves the battlefield.\"", "toughness": "3", "type": "Creature — Sliver", "types": ["Creature"], "uuid": "d17a8045-110b-5e1b-ba7f-2f39809d5efb"}