{"artist": "Zoltan Boros", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 2441, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "e63ed281-86b8-532e-ba7f-7e797a6dd79b", "mtgoId": "81968", "scryfallId": "4155cb6e-a676-45e0-86b6-267271571b1e", "scryfallIllustrationId": "b8d09b6e-185f-47b1-a510-cc5706f78f58", "scryfallOracleId": "f5d1bd3c-0e65-4999-a810-881b2389b40e"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{R}{R}", "manaValue": 2.0, "name": "Conspicuous Snoop", "number": "81968", "originalReleaseDate": "2020-07-31", "power": "2", "printings": ["M21", "PM21", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-06-23", "text": "If the top card of your library changes while you're casting a spell, playing a land, or activating an ability, you don't reveal the new top card until you finish doing so. This means that if you cast the top card of your library, you can't look at the next one until you're done paying for that spell. While the top card isn't revealed, Conspicuous Snoop doesn't have any abilities of that card."}, {"date": "2020-06-23", "text": "You must follow the normal timing permissions and restrictions of the Goblin spells you cast from your library."}, {"date": "2020-06-23", "text": "You still pay all costs for a Goblin spell you cast from your library, including additional costs. You may also pay alternative costs."}, {"date": "2020-06-23", "text": "Activated abilities contain a colon. They're generally written “[Cost]: [Effect].” Some keyword abilities are activated abilities and will have colons in their reminder text."}, {"date": "2020-06-23", "text": "If an activated ability of Goblin card on top of your library references the card it's printed on by name, treat Conspicuous Snoop's instance of that ability as though it referenced Conspicuous Snoop by name instead. For instance, if Conspicuous Snoop has Brash Taunter's ability, Conspicuous Snoop fights, not Brash Taunter."}, {"date": "2020-06-23", "text": "If Conspicuous Snoop gains a set of linked activated abilities (for example, one ability that exiles a card and another that refers to the card “exiled with” the object), that link only lasts as long as Conspicuous Snoop has those abilities. If it loses the abilities and then regains them, the link is lost."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Goblin", "Rogue"], "supertypes": [], "text": "Play with the top card of your library revealed.\nYou may cast Goblin spells from the top of your library.\nAs long as the top card of your library is a Goblin card, Conspicuous Snoop has all activated abilities of that card.", "toughness": "2", "type": "Creature — Goblin Rogue", "types": ["Creature"], "uuid": "71455e8a-d8c0-5fe2-8e74-5118215dcbb3"}