{"artist": "Andy Brase", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 2319, "faceName": "The Omenkeel", "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "7026d5b7-2ef3-589d-a42b-b59b7be28fa5", "mtgoId": "88258", "scryfallId": "d2045590-0fea-405e-8aa6-515c6d313594", "scryfallIllustrationId": "2b27b0c2-f574-4319-9a28-c411c48238dc", "scryfallOracleId": "648100cd-d44a-48f8-87e4-a1d5467f348c"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Crew"], "language": "English", "layout": "modal_dfc", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Cosima, God of the Voyage // The Omenkeel", "number": "88258", "originalReleaseDate": "2021-02-28", "otherFaceIds": ["04a4f015-bce6-516b-ae7f-573efb2543ea"], "power": "3", "printings": ["KHM", "PKHM", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "There is a single triangle icon in the top left corner of the front face. There is a double triangle icon in the top left corner of the back face."}, {"date": "2021-02-05", "text": "To determine whether it is legal to play a modal double-faced card, consider only the characteristics of the face you’re playing and ignore the other face’s characteristics."}, {"date": "2021-02-05", "text": "If an effect allows you to play a specific modal double-faced card, you may cast it as a spell or play it as a land, as determined by which face you choose to play. If an effect allows you to cast (rather than “play”) a specific modal double-faced card, you can’t play it as a land."}, {"date": "2021-02-05", "text": "If an effect allows you to play a land or cast a spell from among a group of cards, you may play or cast a modal double-faced card with any face that fits the criteria of that effect."}, {"date": "2021-02-05", "text": "The converted mana cost of a modal double-faced card is based on the characteristics of the face that’s being considered. On the stack and battlefield, consider whichever face is up. In all other zones, consider only the front face. This is different than how the converted mana cost of a transforming double-faced card is determined."}, {"date": "2021-02-05", "text": "A modal double-faced card can’t be transformed or be put onto the battlefield transformed. Ignore any instruction to transform a modal double-faced card or to put one onto the battlefield transformed."}, {"date": "2021-02-05", "text": "If an effect puts a double-faced card onto the battlefield, it enters with its front face up. If that front face can’t be put onto the battlefield, it doesn’t enter the battlefield."}, {"date": "2021-02-05", "text": "If an effect instructs a player to choose a card name, the name of either face may be chosen. If that effect or a linked ability refers to a spell with the chosen name being cast and/or a land with the chosen name being played, it considers only the chosen name, not the other face’s name."}, {"date": "2021-02-05", "text": "In the Commander variant, a double-faced card’s color identity is determined by the mana costs and mana symbols in the rules text of both faces combined. If either face has a color indicator or basic land type, those are also considered."}, {"date": "2021-02-05", "text": "Cosima’s ability triggers only if Cosima is on the battlefield at the beginning of your upkeep, and you may exile Cosima only if it is still on the battlefield as the ability resolves."}, {"date": "2021-02-05", "text": "While the triggered ability Cosima gains is resolving, if you don’t put a voyage counter on Cosima, you’ll immediately return it to the battlefield and draw cards equal to the number of voyage counters Cosima had on it in exile. Players can’t respond to this choice, and no player may take actions during this process."}, {"date": "2021-02-05", "text": "You may choose to return Cosima to the battlefield even if it doesn’t have any voyage counters on it. If you do, it won’t enter with any +1/+1 counters on it and you won’t draw any cards."}, {"date": "2021-02-05", "text": "If a land enters the battlefield under your control while Cosima is exiled and has the added triggered ability, that ability will trigger. As the ability tries to resolve, it will check to see if Cosima is still in exile. If Cosima has left exile before the ability tries to resolve, it won’t resolve and none of its effects will happen. This is true even if Cosima returns to exile before that ability tries to resolve."}, {"date": "2021-02-05", "text": "The Omenkeel doesn’t allow you to play additional lands during your turn, nor does it allow you to play lands at times you normally can’t. In most cases, you’ll be able to play only one land from among cards exiled with The Omenkeel during each of your turns."}, {"date": "2021-02-05", "text": "You can play lands from among cards exiled with The Omenkeel for as long as they remain exiled, even if The Omenkeel leaves the battlefield or another player gains control of it."}], "securityStamp": "oval", "setCode": "PRM", "side": "b", "subtypes": ["Vehicle"], "supertypes": ["Legendary"], "text": "Whenever a Vehicle you control deals combat damage to a player, that player exiles that many cards from the top of their library. You may play lands from among those cards for as long as they remain exiled.\nCrew 1", "toughness": "3", "type": "Legendary Artifact — Vehicle", "types": ["Artifact"], "uuid": "7a4c800f-1500-575b-a7d4-11feb589d89b"}