{"artist": "Alexander Mokhov", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 1773, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 508165, "name": "Kosmisches Eingreifen", "text": "Falls eine bleibende Karte, die du kontrollierst, in diesem Zug aus dem Spiel auf einen Friedhof gelegt würde, schicke sie stattdessen ins Exil. Bringe ihn zu Beginn des nächsten Endsegments unter der Kontrolle seines Besitzers ins Spiel zurück.\nVorherbestimmung {1}{W} (Während deines Zuges kannst du {2} bezahlen und diese Karte aus deiner Hand verdeckt ins Exil schicken. Wirke sie in einem späteren Zug für ihre Vorherbestimmungskosten.)", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 508181, "name": "Intervención cósmica", "text": "Si un permanente que controlas fuera a ir a un cementerio desde el campo de batalla este turno, en vez de eso, exílialo. Regrésalo al campo de batalla bajo el control de su propietario al comienzo del próximo paso final.\nProfetizar {1}{W}. (Durante tu turno, puedes pagar {2} y exiliar esta carta de tu mano boca abajo. Puedes lanzarla en un turno posterior pagando su coste de profetizar.)", "type": "Instantáneo"}, {"language": "French", "multiverseId": 508197, "name": "Intervention cosmique", "text": "Si un permanent que vous contrôlez devait être mis dans un cimetière depuis le champ de bataille ce tour-ci, exilez-le à la place. Renvoyez-le sur le champ de bataille sous le contrôle de son propriétaire au début de la prochaine étape de fin.\nPrédiction {1}{W} (Pendant votre tour, vous pouvez payer {2} et exiler cette carte de votre main face cachée. Lancez-la pendant un autre tour pour son coût de prédiction.)", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 508213, "name": "Intervento Cosmico", "text": "Se un permanente che controlli sta per essere messo in un cimitero dal campo di battaglia in questo turno, invece esilialo. Rimettilo sul campo di battaglia sotto il controllo del suo proprietario all'inizio della prossima sottofase finale.\nPredire {1}{W} (Durante il tuo turno, puoi pagare {2} ed esiliare questa carta dalla tua mano a faccia in giù. Lanciala in un turno successivo per il suo costo di predire.)", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 508229, "name": "星界の介入", "text": "このターン、あなたがコントロールしているパーマネントが戦場から墓地に置かれるなら、代わりにそれを追放する。次の終了ステップの開始時に、これをオーナーのコントロール下で戦場に戻す。\n予顕{1}{W}（あなたのターンの間、あなたは{2}を支払って、あなたの手札からこのカードを裏向きに追放してもよい。後のターンに、これの予顕コストでこれを唱えてもよい。）", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 508245, "name": "Intervenção Cósmica", "text": "Se uma permanente que você controla seria colocada em um cemitério do campo de batalha neste turno, em vez disso, exile-a. Devolva-a ao campo de batalha sob o controle de seu dono no início da próxima etapa final.\nProfetizar {1}{W} (Durante o seu turno, você pode pagar {2} e exilar este card de sua mão voltado para baixo. Conjure-o em um turno posterior pagando seu custo de profetizar.)", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 508261, "name": "Вселенское Вмешательство", "text": "Если перманент под вашим контролем должен быть положен на кладбище с поля битвы в этом ходу, изгоните его вместо этого. Верните его на поле битвы под контролем его владельца в начале следующего заключительного шага.\nПророчество {1}{W} (Во время вашего хода вы можете заплатить {2} и изгнать эту карту из вашей руки рубашкой вверх. Разыграйте ее во время одного из последующих ходов за ее стоимость Пророчества.)", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 508277, "name": "寰宇干预", "text": "本回合中，如果某个由你操控的永久物将从战场进入坟墓场，则改为将它放逐。在下一个结束步骤开始时，将它在其拥有者的操控下移回战场。\n预示{1}{W}（在你的回合中，你可以支付{2}并从你手上牌面朝下地放逐此牌。过了该回合后，便可利用其预示费用来施放之。）", "type": "瞬间"}, {"language": "Chinese Traditional", "multiverseId": 508293, "name": "寰宇干預", "text": "本回合中，如果某個由你操控的永久物將從戰場進入墳墓場，則改為將它放逐。在下一個結束步驟開始時，將它在其擁有者的操控下返回戰場。\n預示{1}{W}（在你的回合中，你可以支付{2}並從你手上牌面朝下地放逐此牌。過了該回合後，便可利用其預示費用來施放之。）", "type": "瞬間"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "240736", "cardsphereId": "73993", "mcmId": "533107", "mtgjsonV4Id": "9bc1a778-391e-5fba-9148-9cc6792f7965", "mtgoId": "88149", "multiverseId": "508149", "scryfallId": "933c4a54-5c3a-496b-aa35-edf791155d8d", "scryfallIllustrationId": "948dd23a-3a2d-4a58-b7f2-747f970b5973", "scryfallOracleId": "cddccc2a-a76e-48b3-b4dd-dfeab89e1619", "tcgplayerProductId": "230954"}, "isStarter": true, "keywords": ["Foretell"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}", "manaValue": 4.0, "name": "Cosmic Intervention", "number": "3", "originalText": "If a permanent you control would be put into a graveyard from the battlefield this turn, exile it instead. Return it to the battlefield under its owner's control at the beginning of the next end step.\nForetell {1}{W} (During your turn, you may pay {2} and exile this card from your hand face down. Cast it on a later turn for its foretell cost.)", "originalType": "Instant", "printings": ["KHC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/728a37bd9b101631", "tcgplayer": "https://mtgjson.com/links/4f1d560c05e4f408"}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "If a token permanent would be put into a graveyard, it’s exiled and then ceases to exist. It won’t return to the battlefield."}, {"date": "2021-02-05", "text": "Each permanent that is exiled instead of being put into a graveyard from the battlefield creates its own triggered ability to return itself. Those abilities all trigger at the beginning of the next end step, and you can choose the order in which those abilities will go on the stack. The cards will be returned to the battlefield one at a time as those abilities resolve."}, {"date": "2021-02-05", "text": "Once Cosmic Intervention resolves, any “When [this creature] dies” abilities of permanents you control won’t trigger for the rest of the turn because those permanents won’t be put into the graveyard."}, {"date": "2021-02-05", "text": "If you return an Aura this way, you choose what the Aura will enchant just before it enters the battlefield. An Aura returning to the battlefield this way doesn’t target the player or permanent it will enchant, so permanents or players with hexproof may be chosen; however, the chosen recipient must be able to legally be enchanted by the Aura, so a player or permanent with protection from one of the Aura’s qualities can’t be chosen this way. If there’s nothing legal for the Aura to enchant, it stays in exile."}, {"date": "2021-02-05", "text": "Because exiling a card with foretell from your hand is a special action, you can do so any time you have priority during your turn, including in response to spells and abilities. Once you announce you’re taking the action, no other player can respond by trying to remove the card from your hand."}, {"date": "2021-02-05", "text": "Casting a foretold card from exile follows the timing rules for that card. If you foretell an instant card, you can cast it as soon as the next player’s turn. In most cases, if you foretell a card that isn’t an instant (or doesn’t have flash), you’ll have to wait until your next turn to cast it."}, {"date": "2021-02-05", "text": "If you’re casting a foretold card from exile for its foretell cost, you can’t choose to cast it for any other alternative costs. You can, however, pay additional costs, such as kicker costs. If the card has any mandatory additional costs, those must be paid to cast the spell."}], "securityStamp": "oval", "setCode": "KHC", "subtypes": [], "supertypes": [], "text": "If a permanent you control would be put into a graveyard from the battlefield this turn, exile it instead. Return it to the battlefield under its owner's control at the beginning of the next end step.\nForetell {1}{W} (During your turn, you may pay {2} and exile this card from your hand face down. Cast it on a later turn for its foretell cost.)", "type": "Instant", "types": ["Instant"], "uuid": "9af35fba-bb57-5475-9e58-b67f5a747818", "watermark": "foretell"}