{"artist": "Wayne England", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 21607, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 174510, "name": "Loch im Kopf", "text": "Neutralisiere einen Zauberspruch deiner Wahl. Durchsuche den Friedhof, die Hand und die Bibliothek seines Besitzers nach allen Karten mit dem gleichen Namen wie jener Zauberspruch und entferne sie ganz aus dem Spiel. Dieser Spieler mischt dann seine Bibliothek.", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 172704, "name": "Contrataladro", "text": "Contrarresta el hechizo objetivo. Busca en el cementerio, mano y biblioteca de su controlador todas las cartas con el mismo nombre que ese hechizo y remuévelas del juego. Luego ese jugador baraja su biblioteca.", "type": "Instantáneo"}, {"language": "French", "multiverseId": 173306, "name": "Contreforet", "text": "Contrecarrez le sort ciblé. Cherchez dans le cimetière, la main et la bibliothèque de son contrôleur toutes les cartes ayant le même nom que ce sort et retirez-les de la partie. Ce joueur mélange ensuite sa bibliothèque.", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 173607, "name": "Foro Neutralizzatore", "text": "Neutralizza una magia bersaglio. Passa in rassegna il cimitero, la mano e il grimorio del suo controllore per tutte le carte con lo stesso nome di quella magia e rimuovile dal gioco. Poi quel giocatore rimescola il suo grimorio.", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 173908, "name": "呪文穿ち", "text": "呪文１つを対象とし、それを打ち消す。 それのコントローラーの墓地と手札とライブラリーから、その呪文と同じ名前を持つカードをすべて探し、それらをゲームから取り除く。 その後、そのプレイヤーは自分のライブラリーを切り直す。", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 172102, "name": "Nuliperfurador", "text": "Anule a mágica alvo. Procure no cemitério, na mão e no grimório de seu controlador por todos os cards com o mesmo nome daquela mágica e remova-os de jogo. Depois, aquele jogador embaralha seu próprio grimório.", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 172403, "name": "Высверливание", "text": "Отмените целевое заклинание. Найдите на кладбище, в руке и в библиотеке контролирующего его игрока все карты с тем же именем, что и то заклинание, и удалите их из игры. Затем тот игрок тасует свою библиотеку.", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 173005, "name": "反击锥孔", "text": "反击目标咒语。 自其操控者的坟墓场、手牌、以及牌库中搜寻与该咒语同名的牌，并将这些牌移出对战。 然后该牌手将他的牌库洗牌。", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "124825", "cardKingdomId": "124539", "cardsphereId": "41076", "mcmId": "19047", "mcmMetaId": "9599", "mtgjsonV4Id": "1723d06a-2bd9-51a7-be89-739fdd4afcf6", "mtgoFoilId": "29650", "mtgoId": "29649", "multiverseId": "153966", "scryfallId": "f4228b80-d87d-4ebe-ae92-04e4a7d0dc43", "scryfallIllustrationId": "038bfb87-4356-4c14-95f7-a6cab6ddd4db", "scryfallOracleId": "1198ec53-9050-417d-812f-692e1378d346", "tcgplayerProductId": "18595"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}{U}", "manaValue": 5.0, "name": "Counterbore", "number": "33", "originalText": "Counter target spell. Search its controller's graveyard, hand, and library for all cards with the same name as that spell and remove them from the game. Then that player shuffles his or her library.", "originalType": "Instant", "printings": ["DPA", "PS11", "SHM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/68ea390edce2833e", "cardKingdomFoil": "https://mtgjson.com/links/d8329b870aadad79", "cardmarket": "https://mtgjson.com/links/b101d90e8cde7a7d", "tcgplayer": "https://mtgjson.com/links/e7539476406bd96c"}, "rarity": "rare", "rulings": [{"date": "2008-05-01", "text": "Counterbore has no effect on cards on the battlefield that have the same name as the targeted spell."}, {"date": "2008-05-01", "text": "The cards you’re searching for must be found if they’re in the graveyard, because that’s a zone everyone can see. Finding those cards in the hand and library is optional, though."}, {"date": "2008-05-01", "text": "In most cases, Counterbore will exile the targeted spell. Its first sentence counters the spell, which puts it into its owner’s graveyard. Its second sentence then removes it from the graveyard. However, there are some exceptions to this, as listed below."}, {"date": "2008-05-01", "text": "If the spell’s controller isn’t the same as its owner (due to Commandeer, for example), it won’t be exiled. The spell is countered and put into its owner’s graveyard. Then the spell’s controller’s graveyard, hand, and library are searched."}, {"date": "2008-05-01", "text": "If the targeted spell can’t be countered (it’s Vexing Shusher, for example), that spell will remain on the stack. Counterbore will continue to resolve. You still get to search for and exile all other cards with that name."}], "setCode": "SHM", "subtypes": [], "supertypes": [], "text": "Counter target spell. Search its controller's graveyard, hand, and library for all cards with the same name as that spell and exile them. Then that player shuffles.", "type": "Instant", "types": ["Instant"], "uuid": "18225efd-713d-589f-bc8e-1eb8551ccca1"}