{"artist": "Ravenna Tran", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 1110, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "d9cf2b37-198c-5ef4-85c8-d7334a543a9f", "mtgoId": "85978", "scryfallId": "6216f806-6164-40e4-aed8-bf756320322b", "scryfallIllustrationId": "b7d2fea0-e6ab-422f-80f7-b31cab23f7a1", "scryfallOracleId": "652e71a9-e46f-41b3-8695-76b3606b1955"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}{B}", "manaValue": 4.0, "name": "Court of Ambition", "number": "85978", "originalReleaseDate": "2020-12-15", "printings": ["CMR", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-11-10", "text": "As Court of Ambition’s second ability resolves, first the next opponent in turn order chooses whether they are discarding or not. If they are, they choose a card without revealing it (or two cards without revealing them, if you’re the monarch), then each other opponent in turn order does the same. Then each chosen card is discarded simultaneously, and finally each player who couldn’t or didn’t discard loses the appropriate amount of life."}, {"date": "2020-11-10", "text": "The game starts with no monarch. Once an effect makes one player the monarch, the game will have exactly one monarch from that point forward. As a player becomes the monarch, the current monarch (if any) ceases being the monarch."}, {"date": "2020-11-10", "text": "There are two inherent triggered abilities associated with being the monarch. These triggered abilities have no source and are controlled by the player who was the monarch at the time the abilities triggered. The full texts of these abilities are “At the beginning of the monarch’s end step, that player draws a card” and “Whenever a creature deals combat damage to the monarch, its controller becomes the monarch.”"}, {"date": "2020-11-10", "text": "If the triggered ability that causes the monarch to draw a card goes on the stack and a different player becomes the monarch before that ability resolves, the first player will still draw the card."}, {"date": "2020-11-10", "text": "If the monarch leaves the game during another player’s turn, that player becomes the monarch. If the monarch leaves the game during their turn, the next player in turn order becomes the monarch."}, {"date": "2020-11-10", "text": "If combat damage dealt to the monarch causes that player to lose the game, the triggered ability that causes the controller of the attacking creature to become the monarch doesn’t resolve. In most cases, the controller of the attacking creature will still become the monarch as it is likely their turn."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "When Court of Ambition enters the battlefield, you become the monarch.\nAt the beginning of your upkeep, each opponent loses 3 life unless they discard a card. If you're the monarch, instead each opponent loses 6 life unless they discard two cards.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "97daf9a1-10fd-5023-86fd-a4550591f1d4"}