{"artist": "Lie Setiawan", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 5.0, "edhrecRank": 4074, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 495696, "name": "Ersehnte Beute", "text": "Dieser Zauberspruch kostet beim Wirken für jede Kreatur in deiner Abenteurergruppe {1} weniger.\nDurchsuche deine Bibliothek nach einer Karte, nimm sie auf deine Hand und mische dann deine Bibliothek. Falls du eine vollständige Abenteurergruppe hast, kannst du einen Zauberspruch mit umgewandelten Manakosten von 4 oder weniger aus deiner Hand wirken, ohne seine Manakosten zu bezahlen.", "type": "Hexerei"}, {"language": "French", "multiverseId": 495771, "name": "Prix convoité", "text": "Ce sort coûte {1} de moins à lancer pour chaque créature dans votre groupe.\nCherchez une carte dans votre bibliothèque, mettez-la dans votre main, et mélangez ensuite votre bibliothèque. Si vous avez un groupe complet, vous pouvez lancer un sort avec un coût converti de mana inférieur ou égal à 4 depuis votre main sans payer son coût de mana.", "type": "Rituel"}, {"language": "Japanese", "multiverseId": 495846, "name": "切望の報奨", "text": "この呪文を唱えるためのコストは、あなたのパーティーを構成しているクリーチャー１体につき{1}少なくなる。\nあなたのライブラリーからカード１枚を探し、あなたの手札に加える。その後、あなたのライブラリーを切り直す。あなたのパーティーが全員そろっているなら、あなたはあなたの手札から点数で見たマナ・コストが４以下の呪文１つを、そのマナ・コストを支払うことなく唱えてもよい。", "type": "ソーサリー"}], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "237499", "cardKingdomId": "237030", "cardsphereId": "71206", "mcmId": "495264", "mcmMetaId": "316029", "mtgjsonV4Id": "05addc35-ec2b-5e86-a0d8-d0635b677485", "multiverseId": "495621", "scryfallId": "95c86ad5-5384-4a62-971c-05abc995da91", "scryfallIllustrationId": "0403fa4a-ffe2-4e00-9a32-2a3d30dddcbc", "scryfallOracleId": "56204530-7ab5-4610-9570-fba2673725ad", "tcgplayerProductId": "221878"}, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{B}", "manaValue": 5.0, "name": "Coveted Prize", "number": "337", "originalText": "This spell costs {1} less to cast for each creature in your party.\nSearch your library for a card, put it into your hand, then shuffle your library. If you have a full party, you may cast a spell with converted mana cost 4 or less from your hand without paying its mana cost.", "originalType": "Sorcery", "printings": ["PRM", "PZNR", "ZNR"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/017d5455aaa4042c", "cardKingdomFoil": "https://mtgjson.com/links/b5a069cc72aeea98", "cardmarket": "https://mtgjson.com/links/bba2987575d1508d", "tcgplayer": "https://mtgjson.com/links/a91806522a031aed"}, "rarity": "rare", "rulings": [{"date": "2020-09-25", "text": "If you have a full party and wish to cast a spell with Coveted Prize’s effect, you do so as part of the resolution of Coveted Prize after searching for a card. You can’t wait to cast it later in the turn. Timing permissions based on a card’s type are ignored."}, {"date": "2020-09-25", "text": "The card you search for may be the one you cast."}, {"date": "2020-09-25", "text": "If you cast a card “without paying its mana cost,” you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those to cast the card."}, {"date": "2020-09-25", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2020-09-25", "text": "To determine “the number of creatures in your party,” check whether you control a Cleric, whether you control a Rogue, whether you control a Warrior, and whether you control a Wizard. The number is the total number of those checks to which you answered yes. Each creature you control can be counted for only one of those checks."}, {"date": "2020-09-25", "text": "If a creature has more than one party creature type, and there are multiple ways to count that creature that could result in a different number of creatures in your party, the highest such number is used. For example, if you control a Cleric and a Cleric Wizard, the number of creatures in your party is two. You can’t choose to have it be just one by counting the Cleric Wizard first as a Cleric."}, {"date": "2020-09-25", "text": "An ability referring to the number of creatures in your party gets a number from zero to four. Such abilities never ask which creatures are in your party, and you never have to designate specific creatures as being in your party. You can’t choose to exclude creatures from this count to lower the number."}, {"date": "2020-09-25", "text": "Some cards refer to you having a “full party.” This is true if the number of creatures in your party is four."}, {"date": "2020-09-25", "text": "Several cards have a cost reduction based on the number of creatures in your party. To determine the total cost of a spell, start with the mana cost or alternative cost you’re paying, add any cost increases, then apply any cost reductions. The converted mana cost of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2020-09-25", "text": "If a spell has a cost reduction based on the number of creatures in your party, no player may attempt to change that number after you begin to cast the spell but before you pay the cost."}], "securityStamp": "oval", "setCode": "ZNR", "subtypes": [], "supertypes": [], "text": "This spell costs {1} less to cast for each creature in your party. (Your party consists of up to one each of Cleric, Rogue, Warrior, and Wizard.)\nSearch your library for a card, put it into your hand, then shuffle. If you have a full party, you may cast a spell with mana value 4 or less from your hand without paying its mana cost.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "5971056b-bc98-5b6c-ab80-3dd260bbc37c", "variations": ["5c56c095-1c7c-5fd4-bb7f-4308e3479dd6"]}