{"artist": "Grzegorz Rutkowski", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 4458, "finishes": ["nonfoil", "foil"], "flavorText": "Possession is eleven-tenths of the pirate code.", "foreignData": [{"flavorText": "Besitztümer anzuhäufen, ist das oberste Gebot unter den Piraten.", "language": "German", "multiverseId": 439893, "name": "Geschickte Taschendiebin", "text": "Aufblitzen\nWenn die Geschickte Taschendiebin ins Spiel kommt, wird jeder Spielstein, der in diesem Zug unter der Kontrolle eines Gegners erzeugt würde, stattdessen unter deiner Kontrolle erzeugt.", "type": "Kreatur — Mensch, Pirat"}, {"flavorText": "La posesión es un 110 % del código pirata.", "language": "Spanish", "multiverseId": 440096, "name": "Ladronzuela habilidosa", "text": "Destello.\nCuando la Ladronzuela habilidosa entre al campo de batalla, cada ficha que fuera a ser creada bajo el control de un oponente este turno, en vez de eso, se crea bajo tu control.", "type": "Criatura — Pirata humano"}, {"flavorText": "Le larcin est la première et unique règle du code des pirates.", "language": "French", "multiverseId": 440299, "name": "Coupe-bourse astucieuse", "text": "Flash\nQuand la Coupe-bourse astucieuse arrive sur le champ de bataille, chaque jeton qui devrait être créé sous le contrôle d'un adversaire ce tour-ci est créé sous votre contrôle à la place.", "type": "Créature : humain et pirate"}, {"flavorText": "\"Arraffa\" è la prima e unica regola del codice dei pirati.", "language": "Italian", "multiverseId": 440502, "name": "Tagliaborse Astuta", "text": "Lampo\nQuando la Tagliaborse Astuta entra nel campo di battaglia, ogni pedina che sta per essere creata sotto il controllo di un avversario in questo turno viene invece creata sotto il tuo controllo.", "type": "Creatura — Pirata Umano"}, {"flavorText": "占有こそ海賊の心得そのものだ。", "language": "Japanese", "multiverseId": 440705, "name": "狡猾な巾着切り", "text": "瞬速\n狡猾な巾着切りが戦場に出たとき、このターン、対戦相手のコントロール下で生成される各トークンは、代わりに、あなたのコントロール下で生成される。", "type": "クリーチャー — 人間・海賊"}, {"flavorText": "소유는 해적 강령 열 가지 중 열한 번째 항목이다.", "language": "Korean", "multiverseId": 440908, "name": "교활한 소매치기", "text": "섬광\n교활한 소매치기가 전장에 들어올 때, 이번 턴에 상대의 조종하에 만들어지려는 토큰은 대신 당신의 조종하에 만들어진다.", "type": "생물 — 인간 해적"}, {"flavorText": "A posse é 110% do código da pirataria.", "language": "Portuguese (Brazil)", "multiverseId": 441111, "name": "Ladra Astuta", "text": "Lampejo\nQuando Ladra Astuta entra no campo de batalha, cada ficha que seria criada sob o controle de um oponente neste turno é, em vez disso, criada sob o seu controle.", "type": "Criatura — Humano Pirata"}, {"flavorText": "Завладение имуществом — это одиннадцать десятых пиратского кодекса.", "language": "Russian", "multiverseId": 441314, "name": "Находчивая Карманница", "text": "Миг\nКогда Находчивая Карманница выходит на поле битвы, каждая фишка, которая должна быть создана под контролем оппонента в этом ходу, создается под вашим контролем вместо этого.", "type": "Существо — Человек Пират"}, {"flavorText": "海盗铁则：现实占有，尽归我手。", "language": "Chinese Simplified", "multiverseId": 441517, "name": "狡智扒手", "text": "闪现\n当狡智扒手进战场时，所有将于本回合中在对手操控下派出的衍生物，改为在你的操控下派出之。", "type": "生物 ～人类／海盗"}, {"flavorText": "海盜鐵則：現實佔有，盡歸我手。", "language": "Chinese Traditional", "multiverseId": 441720, "name": "狡智扒手", "text": "閃現\n當狡智扒手進戰場時，所有將於本回合中在對手操控下派出的衍生物，改為在你的操控下派出之。", "type": "生物 ～人類／海盜"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "216378", "cardKingdomId": "216116", "cardsphereId": "53004", "mcmId": "315344", "mcmMetaId": "236148", "mtgArenaId": "66683", "mtgjsonV4Id": "a781c1ce-e6ba-53c6-831b-a6d5f549f21d", "mtgoId": "66519", "multiverseId": "439690", "scryfallId": "ac6afc4c-3c41-44e8-ad8c-186c277267a1", "scryfallIllustrationId": "eba42647-e73c-42f3-af95-6915998857ce", "scryfallOracleId": "2ef53e18-0baf-4eee-b671-4c19b464cbfb", "tcgplayerProductId": "155790"}, "keywords": ["Flash"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Crafty Cutpurse", "number": "33", "originalText": "Flash\nWhen Crafty Cutpurse enters the battlefield, each token that would be created under an opponent's control this turn is created under your control instead.", "originalType": "Creature — Human Pirate", "power": "2", "printings": ["C21", "PRIX", "RIX"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6c3667d688ac3662", "cardKingdomFoil": "https://mtgjson.com/links/a58d878aafe644c6", "cardmarket": "https://mtgjson.com/links/86f227866ffe7ea5", "tcgplayer": "https://mtgjson.com/links/91e8dfbf91bd9a61"}, "rarity": "rare", "rulings": [{"date": "2018-01-19", "text": "Crafty Cutpurse’s replacement effect is applied before any other replacement effects that would also modify how the token enters the battlefield. For example, if an opponent controls Anointed Procession, your Crafty Cutpurse’s effect applies before that of Anointed Procession and you won’t get twice as many tokens."}, {"date": "2018-01-19", "text": "Crafty Cutpurse won’t retroactively change the control of tokens that have already entered the battlefield."}, {"date": "2018-01-19", "text": "If a token would be created tapped and attacking, but the token’s controller isn’t an attacking player, that token is created tapped but not attacking. If a token would be created blocking a creature, but the token’s controller isn’t a defending player, that token is created but isn’t blocking."}, {"date": "2018-01-19", "text": "If the effect that creates the token also creates a delayed triggered ability, Crafty Cutpurse doesn’t change who controls that ability. For example, if your opponent activates the ability of Kiki-Jiki, Mirror Breaker, that opponent controls the delayed triggered ability. When the ability triggers, that player can’t sacrifice the token, so it remains on the battlefield."}, {"date": "2018-01-19", "text": "On the other hand, if the effect that creates the token grants a triggered ability to the token, the player who controls the token at the time the ability triggers will be the player who controls that ability. For example, if your opponent activates the second ability of Jace, Cunning Castaway, the token has the ability. If the ability triggers, you’ll control it, so you’ll have to sacrifice the token."}, {"date": "2018-01-19", "text": "If two or more players each have resolved Crafty Cutpurse’s triggered ability and a token would be created, the token’s would-be controller chooses one of the applicable Crafty Cutpurse effects to apply. Then the new would-be controller of the token repeats this process among the remaining Crafty Cutpurse effects, and so on, until there are no more possible such effects to apply. Each effect can be applied to the token only once this way."}, {"date": "2018-01-19", "text": "The above procedure means that if each player in a two-player game has resolved Crafty Cutpurse’s triggered ability and one would create a token, it really will enter the battlefield under that player’s control. The token would enter the battlefield under player A’s control, so player B’s effect affects it. Now that token would enter the battlefield under player B’s control, so player A’s effect affects it. Each replacement effect has now been used, so the token will enter the battlefield under player A’s control."}], "securityStamp": "oval", "setCode": "RIX", "subtypes": ["Human", "Pirate"], "supertypes": [], "text": "Flash\nWhen Crafty Cutpurse enters the battlefield, each token that would be created under an opponent's control this turn is created under your control instead.", "toughness": "2", "type": "Creature — Human Pirate", "types": ["Creature"], "uuid": "a33e369b-77da-5539-a7c0-fc5904b0a19e"}