{"artist": "Howard Lyon", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 2.0, "edhrecRank": 7604, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 163623, "name": "Das Beste vom Besten", "text": "Immer wenn eine Kreatur unter deiner Kontrolle ins Spiel kommt, kannst du dir die obersten X Karten deiner Bibliothek anschauen, wobei X gleich der Stärke der Kreatur ist. Falls du dies tust, lege eine dieser Karten oben auf deine Bibliothek und den Rest in beliebiger Reihenfolge unter deine Bibliothek.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 163473, "name": "Lo mejor de la cosecha", "text": "Siempre que una criatura entre en juego bajo tu control, puedes mirar las primeras X cartas de tu biblioteca, donde X es la fuerza de esa criatura. Si lo haces, pon una de esas cartas en la parte superior y el resto en el fondo de tu biblioteca en cualquier orden.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 164373, "name": "Le meilleur de la cueillette", "text": "À chaque fois qu'une créature arrive en jeu sous votre contrôle, vous pouvez regarder les X cartes du dessus de votre bibliothèque, X étant la force de cette créature. Si vous faites ainsi, mettez une de ces cartes au-dessus de votre bibliothèque et le reste, au-dessous de votre bibliothèque dans l'ordre de votre choix.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 163773, "name": "Scrematura del Raccolto", "text": "Ogniqualvolta una creatura entra in gioco sotto il tuo controllo, puoi guardare le prime X carte del tuo grimorio, dove X è la forza di quella creatura. Se lo fai, metti una di queste carte in cima al tuo grimorio e il resto in fondo al tuo grimorio in qualsiasi ordine.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 164073, "name": "粒選りの収穫", "text": "いずれかのクリーチャーがあなたのコントロール下で場に出るたび、あなたはあなたのライブラリーの一番上からＸ枚のカードを見てもよい。Ｘはそのクリーチャーのパワーに等しい。 そうした場合、それらのカードのうち１枚をあなたのライブラリーの一番上に置き、残りをあなたのライブラリーの一番下に望む順番で置く。", "type": "エンチャント"}, {"language": "Portuguese (Brazil)", "multiverseId": 163923, "name": "Fina Nata", "text": "Toda vez que uma criatura entra em jogo sob seu controle, você pode olhar X cards do topo de seu grimório, sendo X igual ao poder daquela criatura. Se fizer isso, coloque um desses cards no topo de seu grimório e o restante no fundo deste em qualquer ordem.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 164523, "name": "Лучшее из Лучшего", "text": "Каждый раз, когда существо входит в игру под вашим контролем, вы можете посмотреть X верхних карт вашей библиотеки, где X значение силы того существа. Если вы это делаете, положите одну из тех карт на верх вашей библиотеки, а остальные в низ вашей библиотеки в любом порядке.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 164223, "name": "最顶尖", "text": "每当一个生物在你的操控下进场时，你可以检视你牌库顶的X张牌，X为该生物的力量。 如果你如此作，则将其中一张牌置于你牌库顶，其余的则以任意顺序置于你的牌库底。", "type": "结界"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "124333", "cardKingdomId": "124183", "cardsphereId": "32449", "mcmId": "18946", "mcmMetaId": "9533", "mtgjsonV4Id": "469608df-ca30-5ccd-8950-27b0f0f891d4", "mtgoFoilId": "29231", "mtgoId": "29230", "multiverseId": "157423", "scryfallId": "030b0a9d-d0cf-4f3a-97b3-3e1d59226ee6", "scryfallIllustrationId": "c3eff218-4ea6-4fc8-aba8-86b9446534d3", "scryfallOracleId": "b61a87e3-dc98-4db9-abed-b47b677d81ab", "tcgplayerProductId": "17966"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}", "manaValue": 2.0, "name": "Cream of the Crop", "number": "117", "originalText": "Whenever a creature comes into play under your control, you may look at the top X cards of your library, where X is that creature's power. If you do, put one of those cards on top of your library and the rest on the bottom of your library in any order.", "originalType": "Enchantment", "printings": ["MOR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/5daade3f3d29b622", "cardKingdomFoil": "https://mtgjson.com/links/e7f2c0498188f384", "cardmarket": "https://mtgjson.com/links/c26aa4d104ed79ee", "tcgplayer": "https://mtgjson.com/links/2d8c7b82dc94c7be"}, "rarity": "rare", "rulings": [{"date": "2008-04-01", "text": "The creature’s power is checked as this ability resolves. If the creature has left the battlefield, use its last known information."}, {"date": "2008-04-01", "text": "If the creature has 0 power, this ability has no effect."}, {"date": "2008-04-01", "text": "If the creature has 1 power, this ability lets you look at the top card of your library, then you’ll have to leave it there."}], "setCode": "MOR", "subtypes": [], "supertypes": [], "text": "Whenever a creature enters the battlefield under your control, you may look at the top X cards of your library, where X is that creature's power. If you do, put one of those cards on top of your library and the rest on the bottom of your library in any order.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "edc6e1eb-550f-51d2-9465-4c6442e80469"}