{"artist": "Yeong-Hao Han", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G", "U"], "colors": ["G", "U"], "convertedManaCost": 3.0, "edhrecRank": 3419, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "739602db-989e-57da-b16d-68bdc084f2c0", "mtgoId": "94082", "scryfallId": "3b928c48-e00c-4444-8978-f9e4c1691b02", "scryfallIllustrationId": "e13305f4-ae2f-450b-ae58-329eff26fdde", "scryfallOracleId": "142b2f24-49f6-4ef8-9731-9ae2e513f796"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Flashback"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}{U}", "manaValue": 3.0, "name": "Croaking Counterpart", "number": "94082", "originalReleaseDate": "2022-01-28", "printings": ["DBL", "MID", "PMID", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-09-24", "text": "Except for power, toughness, creature type, and color, the token copies exactly what was printed on the original creature and nothing else (unless that permanent is copying something else or it is a token; see below). It doesn't copy whether that creature is tapped or untapped, whether it has any counters on it or Auras and Equipment attached to it, and so on."}, {"date": "2021-09-24", "text": "If the copied creature has {X} in its mana cost, X is considered to be 0."}, {"date": "2021-09-24", "text": "If the copied creature is a token, the new token that's created copies the original characteristics of that token as stated by the effect that created that token, with the exceptions noted above."}, {"date": "2021-09-24", "text": "If the copied creature is copying something else, then the token enters the battlefield as whatever that creature copied, with the exceptions noted above."}, {"date": "2021-09-24", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when the token enters the battlefield. Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities of the chosen creature will also work."}, {"date": "2021-09-24", "text": "“Flashback [cost]” means “You may cast this card from your graveyard by paying [cost] rather than paying its mana cost” and “If the flashback cost was paid, exile this card instead of putting it anywhere else any time it would leave the stack.”"}, {"date": "2021-09-24", "text": "You must still follow any timing restrictions and permissions, including those based on the card's type. For instance, you can cast a sorcery using flashback only when you could normally cast a sorcery."}, {"date": "2021-09-24", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a flashback cost) you're paying, add any cost increases, then apply any cost reductions. The mana value of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2021-09-24", "text": "A spell cast using flashback will always be exiled afterward, whether it resolves, is countered, or leaves the stack in some other way."}, {"date": "2021-09-24", "text": "You can cast a spell using flashback even if it was somehow put into your graveyard without having been cast."}, {"date": "2021-09-24", "text": "If a card with flashback is put into your graveyard during your turn, you can cast it if it's legal to do so before any other player can take any actions."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Create a token that's a copy of target non-Frog creature, except it's a 1/1 green Frog.\nFlashback {3}{G}{U} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "a20536bd-7f0c-527d-be88-c2154af82149"}