{"artist": "David Palumbo", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 7.0, "edhrecRank": 8348, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 421330, "name": "Grausames Schauspiel", "text": "Bestimme einen Spieler deiner Wahl und einen anderen Spieler deiner Wahl. Der erste Spieler kontrolliert den zweiten Spieler während des nächsten Zuges des zweiten Spielers, und der zweite Spieler kontrolliert den ersten Spieler während des nächsten Zuges des ersten Spielers.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 423085, "name": "Diversión cruel", "text": "Elige a un jugador objetivo y a otro jugador objetivo. El primer jugador controla al segundo jugador durante el próximo turno del segundo jugador, y el segundo jugador controla al primer jugador durante el próximo turno del primer jugador.", "type": "Conjuro"}, {"language": "French", "multiverseId": 421681, "name": "Divertissement cruel", "text": "Choisissez un joueur ciblé et un autre joueur ciblé. Le premier joueur contrôle le deuxième pendant le prochain tour du deuxième joueur, et le deuxième joueur contrôle le premier pendant le prochain tour du premier joueur.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 422032, "name": "Spettacolo Crudele", "text": "Scegli un giocatore bersaglio e un altro giocatore bersaglio. Il primo giocatore controlla il secondo giocatore durante il prossimo turno del secondo giocatore e il secondo giocatore controlla il primo giocatore durante il prossimo turno del primo giocatore.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 422383, "name": "残酷な見世物", "text": "プレイヤー１人と他のプレイヤー１人を対象とする。後者のプレイヤーの次のターン中、前者のプレイヤーは後者のプレイヤーをコントロールし、前者のプレイヤーの次のターン中、後者のプレイヤーは前者のプレイヤーをコントロールする。", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 422734, "name": "Entretenimento Cruel", "text": "Escolha um jogador alvo e outro jogador alvo. O primeiro jogador controla o segundo jogador durante o próximo turno do segundo jogador, e o segundo jogador controla o primeiro jogador durante o próximo turno do primeiro jogador.", "type": "Feitiço"}, {"language": "Chinese Simplified", "multiverseId": 420979, "name": "苦笑言欢", "text": "选择目标牌手和另一位目标牌手。后者牌手在其下个回合由前者牌手操控，且前者牌手在其下个回合由后者牌手操控。", "type": "法术"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "209533", "cardsphereId": "10670", "mcmId": "293508", "mcmMetaId": "224063", "mtgjsonV4Id": "7505b56c-890e-58ff-94d6-f0a92f26592c", "multiverseId": "420628", "scryfallId": "3e304424-4a50-43bb-aee0-e9f960583aac", "scryfallIllustrationId": "96f79ac7-b97b-4f52-8deb-86949a30eed0", "scryfallOracleId": "7747804f-ca49-4a68-b508-b94b27c52b0f", "tcgplayerProductId": "124130"}, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{6}{B}", "manaValue": 7.0, "name": "Cruel Entertainment", "number": "11", "originalText": "Choose target player and another target player. The first player controls the second player during the second player's next turn, and the second player controls the first player during the first player's next turn.", "originalType": "Sorcery", "printings": ["C16"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ffa4bdcd1a3221ea", "cardmarket": "https://mtgjson.com/links/1ef88ea9cbc78cb8", "tcgplayer": "https://mtgjson.com/links/7d0eb1c974245b19"}, "rarity": "rare", "rulings": [{"date": "2016-11-08", "text": "The controlling player only controls the player. The controlling player doesn’t control any of that player’s permanents, spells, or abilities."}, {"date": "2016-11-08", "text": "Cruel Entertainment’s controller may be one of its targets, even if it’s less entertaining this way."}, {"date": "2016-11-08", "text": "If one player loses the game before controlling the other player, the other player takes their turn normally."}, {"date": "2016-11-08", "text": "The controlling player can’t make the player being controlled concede. A player may choose to concede at any time, even while under another player’s control."}, {"date": "2016-11-08", "text": "The player being controlled is still the active player during their turn."}, {"date": "2016-11-08", "text": "While controlling another player, the controlling player also continues to make their own choices and decisions."}, {"date": "2016-11-08", "text": "While controlling another player, the controlling player can see all cards in the game that the player being controlled can see. This includes cards in that player’s hand, face-down cards that player controls, and any cards in that player’s library that they may look at."}, {"date": "2016-11-08", "text": "While controlling another player, the controlling player makes all choices and decisions that the player being controlled is allowed to make or is told to make during that turn. This includes choices about what spells to cast or what abilities to activate, as well as any decisions called for by a triggered ability or anything else."}, {"date": "2016-11-08", "text": "The controlling player can’t make any illegal decisions or illegal choices—that player can’t do anything that the player being controlled couldn’t do. The controlling player can’t make choices or decisions for that player that aren’t called for by the game rules or by any cards, permanents, spells, abilities, and so on. If an effect causes another player to make decisions that the player being controlled would normally make (as Master Warcraft does), that effect takes precedence. In other words, if the player being controlled wouldn’t make a decision, the controlling player can’t make that decision on their behalf."}, {"date": "2016-11-08", "text": "The controlling player also can’t make any choices or decisions for the player being controlled that would be called for by the tournament rules (such as whether to take an intentional draw or whether to call a judge)."}, {"date": "2016-11-08", "text": "The controlling player can use only the resources of the player being controlled (cards, mana, and so on) to pay costs for that player; the controlling player can’t use their own resources to pay costs for the player being controlled. Similarly, the controlling player can’t spend the resources of the player being controlled on any of the controlling player’s own costs."}, {"date": "2016-11-08", "text": "If a player who would be controlled skips their next turn, the other player will control the next turn the affected player actually takes."}, {"date": "2016-11-08", "text": "Multiple player-controlling effects that affect the same player overwrite each other. The last one to be created is the one that works."}, {"date": "2016-11-08", "text": "Controlling a player doesn’t allow the controlling player to look at the controlled player’s sideboard. If an effect instructs that player to choose a card from outside the game, the controlling player can’t have that player choose a card."}], "securityStamp": "oval", "setCode": "C16", "subtypes": [], "supertypes": [], "text": "Choose target player and another target player. The first player controls the second player during the second player's next turn, and the second player controls the first player during the first player's next turn.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "9a856bef-5d1d-5f9c-b0ff-036b43297337"}