{"artist": "Joe Slucher", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 7593, "finishes": ["nonfoil"], "flavorText": "\"As a boulder diverts a stream, the crystals bend life around them.\"\n—Rielle, the Everwise", "foreignData": [{"flavorText": "„So wie ein Felsen das Wasser in einem Fluss teilt, beugen Kristalle das Leben um sie herum.\"\n—Rielle die Allwissende", "language": "German", "multiverseId": 484929, "name": "Kristalline Resonanz", "text": "Immer wenn du eine Karte umwandelst, kannst du die Kristalline Resonanz bis zu deinem nächsten Zug zu einer Kopie einer anderen bleibenden Karte deiner Wahl werden lassen, außer dass sie diese Fähigkeit hat.", "type": "Verzauberung"}, {"flavorText": "\"Al igual que una roca desvía un arroyo, los cristales cambian la vida que hay a su alrededor\".\n—Rielle, la Versada", "language": "Spanish", "multiverseId": 484980, "name": "Resonancia cristalina", "text": "Siempre que actives una habilidad de ciclo de una carta, puedes hacer que la Resonancia cristalina se convierta en una copia de otro permanente objetivo hasta tu próximo turno, excepto que tiene esta habilidad.", "type": "Encantamiento"}, {"flavorText": "« Comme les rochers dévient les ruisseaux, les cristaux détournent la vie autour d'eux. »\n—Rielle, l'éternisciente", "language": "French", "multiverseId": 485031, "name": "Résonance cristalline", "text": "À chaque fois que vous recyclez une carte, vous pouvez faire que la Résonance cristalline devienne une copie d'un autre permanent ciblé jusqu'à votre prochain tour, excepté qu'elle a cette capacité.", "type": "Enchantement"}, {"flavorText": "\"Come un masso devia il corso di un ruscello, così i cristalli piegano la vita intorno alle proprie sfaccettature.\"\n—Rielle, l'Onnisapiente", "language": "Italian", "multiverseId": 485082, "name": "Risonanza Cristallina", "text": "Ogniqualvolta cicli una carta, puoi far diventare la Risonanza Cristallina una copia di un altro permanente bersaglio fino al tuo prossimo turno, tranne che ha questa abilità.", "type": "Incantesimo"}, {"flavorText": "「大きな岩が川の流れを変えるように、水晶は周囲の生命を曲げる。」\n――常智のリエール", "language": "Japanese", "multiverseId": 485133, "name": "水晶の共鳴", "text": "あなたがカードをサイクリングするたび、他のパーマネント１つを対象とする。あなたは「あなたの次のターンまで、水晶の共鳴は、この能力を持つことを除き、それのコピーになる。」を選んでもよい。", "type": "エンチャント"}, {"flavorText": "\"Assim como a rocha desvia o curso d'água, os cristais defletem a vida ao seu redor.\"\n— Rielle, a Onissapiente", "language": "Portuguese (Brazil)", "multiverseId": 485184, "name": "Ressonância Cristalina", "text": "Toda vez que você recicla um card, você pode fazer com que Ressonância Cristalina se torne uma cópia de outra permanente alvo até seu próximo turno, com a exceção de ter esta habilidade.", "type": "Encantamento"}, {"flavorText": "«Как валун разделяет поток, кристаллы меняют жизнь вокруг себя».\n— Риэлль, Вечномудрая", "language": "Russian", "multiverseId": 485235, "name": "Кристальный Резонанс", "text": "Каждый раз, когда вы совершаете Цикл карты, вы можете заставить Кристальный Резонанс стать копией другого целевого перманента до вашего следующего хода, но при этом у него есть эта способность.", "type": "Чары"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "232347", "cardsphereId": "66374", "mcmId": "452353", "mtgjsonV4Id": "48c7046b-162c-5d1f-b0f3-787568d2e135", "mtgoId": "80643", "multiverseId": "484878", "scryfallId": "93f20664-c3d0-4dbd-93dc-4f69a0cbff46", "scryfallIllustrationId": "198649bc-b7d4-4111-9e31-0c270cd57e36", "scryfallOracleId": "93255c68-2ed1-499b-82c6-672823451ce9", "tcgplayerProductId": "212207"}, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}", "manaValue": 3.0, "name": "Crystalline Resonance", "number": "31", "originalText": "Whenever you cycle a card, you may have Crystalline Resonance become a copy of another target permanent until your next turn, except it has this ability.", "originalType": "Enchantment", "printings": ["C20"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/46f1544ce42e1203", "tcgplayer": "https://mtgjson.com/links/d9fde6220125c7dd"}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "Crystalline Resonance copies the printed values of the target permanent, plus any copy effects that have been applied to it. It won’t copy counters on that permanent or effects that have changed its power, toughness, types, color, or so on. Notably, it won’t copy effects that made the target permanent become a creature."}, {"date": "2020-04-17", "text": "If Crystalline Resonance copies a permanent that’s copying something else, it will become whatever the target is copying."}, {"date": "2020-04-17", "text": "If another permanent becomes a copy of Crystalline Resonance, it will become whatever Crystalline Resonance is copying and it will also have its ability."}, {"date": "2020-04-17", "text": "If Crystalline Resonance’s ability triggers multiple times in a turn, then each time one of those abilities resolves, it will overwrite whatever Crystalline Resonance is copying. Crystalline Resonance will wind up as a copy of the permanent targeted by the last ability to resolve. As your next turn begins, all instances of the ability will wear off at the same time."}, {"date": "2020-04-17", "text": "If an effect begins to apply to Crystalline Resonance before it becomes a copy of another permanent, that effect will continue to apply."}, {"date": "2020-04-17", "text": "If Crystalline Resonance becomes a creature the same turn it enters the battlefield, you can’t attack with it or use any of its {T} abilities (if it gains any) unless it has haste."}, {"date": "2020-04-17", "text": "If Crystalline Resonance becomes a copy of a legendary permanent you control, you’ll put one of them into its owner’s graveyard."}, {"date": "2020-04-17", "text": "If Crystalline Resonance becomes a copy of an Aura, it’s put into its owner’s graveyard unless it’s somehow attached to an appropriate object or player already. If it becomes a copy of an Equipment and is attached to a creature, it’ll become unattached when it becomes an enchantment again."}, {"date": "2020-04-17", "text": "If Crystalline Resonance becomes a copy of a planeswalker, it won’t receive loyalty counters for that planeswalker’s starting loyalty. Unless it already has loyalty counters on it somehow, it will be put into its owner’s graveyard."}, {"date": "2020-04-17", "text": "Crystalline Resonance’s copy effect wears off immediately before your next turn begins."}, {"date": "2020-04-17", "text": "If Crystalline Resonance becomes a copy of an object with a set of linked abilities (for example, one ability that exiles a card and another that refers to the card “exiled with” the object), that link only lasts as long as Crystalline Resonance is copying that object. If it stops being a copy of that object and then becomes a copy again later, the link is lost."}, {"date": "2020-04-17", "text": "Some cards with cycling have an ability that triggers when you cycle them, and some cards have an ability that triggers whenever you cycle any card. These triggered abilities resolve before you draw from the cycling ability."}, {"date": "2020-04-17", "text": "Triggered abilities from cycling a card and the cycling ability itself aren’t spells. Effects that interact with spells (such as that of Cancel) won’t affect them."}, {"date": "2020-04-17", "text": "You can cycle a card even if it has a triggered ability from cycling that won’t have a legal target. This is because the cycling ability and the triggered ability are separate. This also means that if either ability is countered (with Disallow, for example), the other ability will still resolve."}], "securityStamp": "oval", "setCode": "C20", "subtypes": [], "supertypes": [], "text": "Whenever you cycle a card, you may have Crystalline Resonance become a copy of another target permanent until your next turn, except it has this ability.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "b4ed18d7-01a7-52fb-baec-fef747052913"}