{"artist": "Daren Bader", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 17931, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 73291, "name": "Waage des Aussortierens", "text": "Zerstöre zu Beginn deines Versorgungssegments eine bleibende Karte deiner Wahl, die kein Land ist und unter den bleibenden Karten im Spiel, die keine Länder sind, die niedrigsten umgewandelten Manakosten hat. (Haben zwei oder mehr bleibende Karten gleich niedrige Kosten, bestimme eine von ihnen als Ziel.)", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 162040, "name": "Balanza selectiva", "text": "Al comienzo de tu mantenimiento, destruye el permanente objetivo que no sea tierra con el menor coste de maná convertido entre los permanentes en juego que no sean tierra. (Si dos o más permanentes empatan por el menor coste, elige el objetivo entre ellos.)", "type": "Artefacto"}, {"language": "French", "multiverseId": 161662, "name": "Balance du sacrifice", "text": "Au début de votre entretien, détruisez le permanent non-terrain ciblé ayant le coût converti de mana le plus faible parmi les permanents non-terrain en jeu. (Si au moins deux permanents partagent le coût converti de mana le plus faible, ciblez n'importe lequel d'entre eux.)", "type": "Artefact"}, {"language": "Italian", "multiverseId": 160131, "name": "Bilancia della Selezione", "text": "All'inizio del tuo mantenimento, distruggi un permanente non terra bersaglio con il più basso costo di mana convertito tra i permanenti non terra in gioco. (Se due o più permanenti hanno il costo più basso, scegli come bersaglio uno qualsiasi di essi.)", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 73644, "name": "選別の秤", "text": "あなたのアップキープの開始時に、場に出ているすべての土地でないパーマネントの中で、点数でみたマナ・コストが最も小さい土地でないパーマネント１つを対象とし、それを破壊する。 （コストが最も小さいパーマネントが複数ある場合、どれか１つを選ぶ。）", "type": "アーティファクト"}, {"language": "Portuguese (Brazil)", "multiverseId": 162356, "name": "Balanças Seletoras", "text": "No início de sua manutenção, destrói a permanente alvo que não seja um terreno com o menor custo de mana convertido dentre as permanentes em jogo que não forem terrenos. (Se houver duas ou mais permanentes empatadas com o menor custo de mana convertido, escolha qualquer uma delas como alvo.)", "type": "Artefato"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "73159", "cardKingdomId": "72159", "cardsphereId": "30550", "mcmId": "160", "mcmMetaId": "1243", "mtgjsonV4Id": "1b4bfd48-6ecf-58b8-874e-3e2cbee4ab22", "mtgoFoilId": "20078", "mtgoId": "20077", "multiverseId": "47445", "scryfallId": "db9a57d6-bba6-463d-ad12-6f93c035d16b", "scryfallIllustrationId": "737e0a3b-ad41-4ee1-9338-f7be1d053c3f", "scryfallOracleId": "ec4f2266-3e8e-4194-8f06-d95ebc543661", "tcgplayerProductId": "11475"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Culling Scales", "number": "160", "originalText": "At the beginning of your upkeep, destroy target nonland permanent with the lowest converted mana cost among nonland permanents in play. (If two or more permanents are tied for lowest cost, target any one of them.)", "originalType": "Artifact", "printings": ["MRD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/55fdfb7c496d683a", "cardKingdomFoil": "https://mtgjson.com/links/dc1b10461447bc35", "cardmarket": "https://mtgjson.com/links/24df87167156fd57", "tcgplayer": "https://mtgjson.com/links/f09a1905fb149076"}, "rarity": "rare", "rulings": [{"date": "2004-12-01", "text": "You choose the target. If there’s more than one nonland permanent tied for lowest converted mana cost, you choose which one to target."}, {"date": "2004-12-01", "text": "If the targeted permanent doesn’t have the lowest converted mana cost when the ability resolves, the ability doesn’t resolve and the permanent isn’t destroyed."}, {"date": "2004-12-01", "text": "Most tokens have a converted mana cost of 0. A token that’s a copy of another permanent or card has a converted mana cost equal to that permanent or card’s converted mana cost."}, {"date": "2004-12-01", "text": "If the lowest converted mana cost is 3, Culling Scales can destroy itself."}], "setCode": "MRD", "subtypes": [], "supertypes": [], "text": "At the beginning of your upkeep, destroy target nonland permanent with the lowest mana value. (If two or more permanents are tied for lowest, target any one of them.)", "type": "Artifact", "types": ["Artifact"], "uuid": "18625edd-db2b-5feb-adb2-1f74586d8671"}