{"artist": "David Gaillet", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 946, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "9ae5bbe3-976a-5b49-9ae2-e7f38ed44c53", "mtgoId": "90120", "scryfallId": "f59ce15e-370e-47f7-ab1f-179cae155536", "scryfallIllustrationId": "7cfe7642-e094-4fe7-8acd-bee74eb0b737", "scryfallOracleId": "4d67e2a7-4aa7-44cc-853b-500d7aac046d"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}", "manaValue": 3.0, "name": "Cursed Mirror", "number": "90120", "originalReleaseDate": "2021-05-01", "printings": ["BRC", "C21", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-04-16", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when Cursed Mirror enters the battlefield. Any “As [this creature] enters the battlefield” or “[This creature] enters the battlefield with” abilities of the copied creature will also work."}, {"date": "2021-04-16", "text": "While it is copying a creature, Cursed Mirror does not have “{T}: Add {R}” (unless the creature it's copying also has that ability)."}, {"date": "2021-04-16", "text": "If something else becomes a copy of Cursed Mirror while Cursed Mirror is a copy of a creature, the duration of the effect is not copied. The new copy will still be a creature (with haste) after Cursed Mirror stops being a copy at the end of the turn."}, {"date": "2021-04-16", "text": "Cursed Mirror copies exactly what was printed on the original creature (unless that creature is copying something else or is a token; see below). It doesn't copy whether that creature is tapped or untapped, whether it has any counters on it or any Auras or Equipment attached to it, or any non-copy effects that have changed its types, color, power and toughness, and so on."}, {"date": "2021-04-16", "text": "If the copied creature has {X} in its mana cost, X is considered to be 0."}, {"date": "2021-04-16", "text": "If the copied creature is copying something else, then Cursed Mirror enters the battlefield as a copy of whatever that creature is copying."}, {"date": "2021-04-16", "text": "If the copied creature is a token, Cursed Mirror copies the original characteristics of that token as stated by the effect that created the token. Copying a token doesn't make Cursed Mirror a token. Similarly, if Cursed Mirror itself is a token, copying a nontoken permanent doesn't make it stop being a token."}, {"date": "2021-04-16", "text": "If Cursed Mirror somehow enters the battlefield at the same time as a creature, it can't become a copy of that creature. You may choose only a creature that's already on the battlefield."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "{T}: Add {R}.\nAs Cursed Mirror enters the battlefield, you may have it become a copy of any creature on the battlefield until end of turn, except it has haste.", "type": "Artifact", "types": ["Artifact"], "uuid": "acce708a-1f55-53ea-9734-fd8aca69d7da"}