{"artist": "Uriah Voth", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B"], "colorIndicator": ["B"], "colors": ["B"], "convertedManaCost": 3.0, "edhrecRank": 7121, "faceConvertedManaCost": 0.0, "faceManaValue": 0.0, "faceName": "Leeching Lurker", "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "04c70b98-443f-5830-809d-1a79da1ece08", "mtgoId": "93988", "scryfallId": "9b455a54-fbb1-499c-860b-2709b4b3806a", "scryfallIllustrationId": "156d8287-fd30-4bfc-92be-2ed2af9f3486", "scryfallOracleId": "44eb0caa-ba16-49e4-915c-bd5e1ce770e6"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Lifelink", "Nightbound"], "language": "English", "layout": "transform", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaValue": 3.0, "name": "Curse of Leeches // Leeching Lurker", "number": "93988", "originalReleaseDate": "2022-01-28", "otherFaceIds": ["602d22c9-d21d-5ac7-8059-6439620ebc6b"], "power": "4", "printings": ["DBL", "MID", "PMID", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-09-24", "text": "Attaching Curse of Leeches as it transforms doesn't target a player, so it can be attached to a player with hexproof this way."}, {"date": "2021-09-24", "text": "After Curse of Leeches transforms into Leeching Lurker, it will become unattached from the player it's attached to as a state-based action."}, {"date": "2021-09-24", "text": "If you cast Curse of Leeches while it is night, you must still choose a target player, and that player must be a legal target as Curse of Leeches resolves. It enters the battlefield transformed and is not attached to that player."}, {"date": "2021-09-24", "text": "Day and night are designations that the game itself can have. The game starts as neither. Once the game becomes day (or less commonly, night), the game will be exactly one of them—day or night—going back and forth for the rest of the game."}, {"date": "2021-09-24", "text": "Before a player untaps their permanents during the untap step, the game checks to see if the day/night designation should change."}, {"date": "2021-09-24", "text": "If it is day, and the active player of the previous turn cast no spells during their turn, it becomes night."}, {"date": "2021-09-24", "text": "If it is night, and the active player of the previous turn cast two or more spells during their turn, it becomes day."}, {"date": "2021-09-24", "text": "For more information about Day and Night and the Daybound and Nightbound abilities, please see the Innistrad: Midnight Hunt Mechanics atricle (https://magic.wizards.com/en/articles/archive/feature/innistrad-midnight-hunt-mechanics-2021-09-02)."}, {"date": "2021-09-24", "text": "Double-faced permanents with daybound transform to their nightbound faces as it becomes night. Similarly, double-faced permanents with nightbound transform to their daybound faces as it becomes day. This happens immediately and is not a state-based action. It happens any time it becomes day or night, not just during the untap step."}, {"date": "2021-09-24", "text": "If you cast a spell with daybound during night, that spell will be front face up (that is, daybound face up) on the stack. However, it will enter the battlefield with its back face up (that is, with its nightbound face up). It won't enter with its daybound face up and then transform."}, {"date": "2021-09-24", "text": "If it is night, permanents with daybound that enter the battlefield without being cast will enter with their nightbound faces up."}, {"date": "2021-09-24", "text": "Permanents with daybound and nightbound can't transform via any means other than their daybound and nightbound abilities. Notably, older cards such as Moonmist that instruct a player to transform permanents don't affect permanents with daybound or nightbound."}, {"date": "2021-09-24", "text": "If it's neither day nor night, and a creature with daybound and a creature with nightbound somehow appear on the battlefield at the same time, it becomes day. The creature with nightbound will transform."}, {"date": "2021-09-24", "text": "If Leeching Lurker is on the battlefield during night, and the active player casts two or more spells during the turn, it will become day as the next turn begins. This will cause Leeching Lurker to transform into Curse of Leeches and become attached to a player. This all happens before that turn's upkeep, so the triggered ability of Curse of Leeches will trigger at the beginning of that turn's upkeep."}], "securityStamp": "oval", "setCode": "PRM", "side": "b", "subtypes": ["Leech", "Horror"], "supertypes": [], "text": "Lifelink\nNightbound (If a player casts at least two spells during their own turn, it becomes day next turn.)", "toughness": "4", "type": "Creature — Leech Horror", "types": ["Creature"], "uuid": "f3f0771b-4816-5bf6-aa3d-46e85f700337"}