{"artist": "Matt Cavotta", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 5.0, "edhrecRank": 17641, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 143907, "name": "Zyklische Entwicklung", "text": "Eine Kreatur deiner Wahl erhält +3/+3 bis zum Ende des Zuges. Entferne Zyklische Entwicklung mit drei Zeitmarken ganz aus dem Spiel.\n Aussetzen 3 {2}{G} (Statt diese Karte aus deiner Hand zu spielen, kannst du {2}{G} bezahlen, sie ganz aus dem Spiel entfernen und drei Zeitmarken auf sie legen. Entferne zu Beginn deines Versorgungssegments eine Zeitmarke von ihr. Wenn die letzte Zeitmarke entfernt wird, spiele die Karte, ohne ihre Manakosten zu bezahlen.)", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 144311, "name": "Evolución cíclica", "text": "La criatura objetivo obtiene +3/+3 hasta el final del turno. Remueve del juego la Evolución cíclica con tres contadores de tiempo sobre ella.\u2028Suspender 3—{2}{G} (En lugar de jugar esta carta de tu mano, puedes pagar {2}{G} y removerla del juego con tres contadores de tiempo sobre ella. Al comienzo de tu mantenimiento, remueve un contador de tiempo. Cuando se remueva el último, juégala sin pagar su coste de maná.)", "type": "Conjuro"}, {"language": "French", "multiverseId": 145616, "name": "Évolution cyclique", "text": "La créature ciblée gagne +3/+3 jusqu'à la fin du tour. Retirez l'Évolution cyclique de la partie avec trois marqueurs « temps » sur elle.\nSuspension 3 — {2}{G} (Plutôt que jouer cette carte depuis votre main, vous pouvez payer {2}{G} et la retirer de la partie avec trois marqueurs « temps » sur elle. Au début de votre entretien, retirez un marqueur « temps ». Quand le dernier marqueur est retiré, jouez cette carte sans payer son coût de mana.)", "type": "Rituel"}, {"language": "Italian", "multiverseId": 145517, "name": "Evoluzione Ciclica", "text": "Una creatura bersaglio prende +3/+3 fino alla fine del turno. Rimuovi dal gioco l'Evoluzione Ciclica con tre segnalini tempo su di essa.\nSospendere 3—{2}{G} (Invece di giocare questa carta dalla tua mano, puoi pagare {2}{G} e rimuoverla dal gioco con tre segnalini tempo su di essa. All'inizio del tuo mantenimento, rimuovi un segnalino tempo. Quando l'ultimo viene rimosso, gioca la carta senza pagare il suo costo di mana.)", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 145715, "name": "循環進化", "text": "クリーチャー１体を対象とする。それはターン終了時まで＋３/＋３の修整を受ける。 循環進化を、それの上に時間カウンターを３つ置かれた状態でゲームから取り除く。\n 待機 ３―{2}{G} （これをあなたの手札からプレイするのではなく、{2}{G}を支払ってゲームから取り除き、その上に時間カウンターを３個置いてもよい。 あなたのアップキープの開始時に、時間カウンターを１個取り除く。 最後の１個を取り除いたとき、あなたはそれをマナ・コストを支払わずにプレイする。）", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 144111, "name": "Evolução Cíclica", "text": "A criatura alvo recebe +3/+3 até o final do turno. Remova Evolução Cíclica do jogo com três marcadores temporais sobre ele.\n Suspender 3 {2}{G} (Em vez de jogar este card da sua mão, você pode pagar {2}{G} e removê-lo do jogo com três marcadores temporais sobre ele. No início de sua manutenção, remova um marcador temporal. Quando o último for removido, jogue-o sem pagar seu custo de mana.)", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 144410, "name": "Круги Эволюции", "text": "Целевое существо получает +3/+3 до конца хода. Удалите Круги Эволюции из игры с тремя временными жетонами на них.\nОтсрочка 3—{2}{G} (Вместо того чтобы разыграть эту карту из вашей руки, вы можете заплатить {2}{G} и удалить ее из игры с тремя временными жетонами на ней. В начале вашего шага поддержки удалите один временной жетон. Когда последний жетон будет удален, разыграйте эту карту без уплаты ее мана-стоимости.)", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 144012, "name": "周期演化", "text": "目标生物得+3/+3直到回合结束。 将周期演化移出对战，且上面有三个计时指示物。\n延缓3～{2}{G}（除了从你手上使用此牌，你可以支付{2}{G}并将此牌移出对战，且上面有三个计时指示物。 在你的维持开始时，从其上移去一个计时指示物。 当移去最后一个时，则使用它且不需支付其法术力费用。）", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "122642", "cardKingdomId": "122462", "cardsphereId": "18599", "mcmId": "15117", "mcmMetaId": "9046", "mtgjsonV4Id": "7316e007-c785-5f48-9b74-88dd6e611664", "mtgoFoilId": "26637", "mtgoId": "26636", "multiverseId": "126169", "scryfallId": "f2b2fa14-b08b-4cb9-bd77-c9da1dfa91d4", "scryfallIllustrationId": "355fb81e-1e92-4662-9005-8056e75e7597", "scryfallOracleId": "bc8213f9-bef7-4077-a919-4347ec373de7", "tcgplayerProductId": "14870"}, "keywords": ["Suspend"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{G}{G}", "manaValue": 5.0, "name": "Cyclical Evolution", "number": "125", "originalText": "Target creature gets +3/+3 until end of turn. Remove Cyclical Evolution from the game with three time counters on it.\nSuspend 3—{2}{G} (Rather than play this card from your hand, you may pay {2}{G} and remove it from the game with three time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, play it without paying its mana cost.)", "originalType": "Sorcery", "printings": ["FUT"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ca4ee7a8bd9059a3", "cardKingdomFoil": "https://mtgjson.com/links/166f6382fd1b0ca7", "cardmarket": "https://mtgjson.com/links/d3f71aaa82f510ba", "tcgplayer": "https://mtgjson.com/links/fd4d1d9fc5de836c"}, "rarity": "uncommon", "rulings": [{"date": "2021-06-18", "text": "Suspend is a keyword that represents three abilities. The first is a static ability that allows you to exile the card from your hand with the specified number of time counters (the number before the dash) on it by paying its suspend cost (listed after the dash). The second is a triggered ability that removes a time counter from the suspended card at the beginning of each of your upkeeps. The third is a triggered ability that causes you to cast the card when the last time counter is removed. If you cast a creature spell this way, it gains haste until you lose control of that creature (or, in rare cases, you lose control of the creature spell while it’s on the stack)."}, {"date": "2021-06-18", "text": "You can exile a card in your hand using suspend any time you could cast that card. Consider its card type, any effects that modify when you could cast it (such as flash) and any other effects that stop you from casting it (such as from Meddling Mage’s ability) to determine if and when you can do this. Whether you could actually complete all steps in casting the card is irrelevant. For example, you can exile a card with suspend that has no mana cost or that requires a target even if no legal targets are available at that time."}, {"date": "2021-06-18", "text": "Cards exiled with suspend are exiled face up."}, {"date": "2021-06-18", "text": "Exiling a card with suspend isn’t casting that card. This action doesn’t use the stack and can’t be responded to."}, {"date": "2021-06-18", "text": "If the spell requires any targets, those targets are chosen when the spell is finally cast, not when it’s exiled."}, {"date": "2021-06-18", "text": "If an effect refers to a “suspended card,” that means a card that (1) has suspend, (2) is in exile, and (3) has one or more time counters on it."}, {"date": "2021-06-18", "text": "If the first triggered ability of suspend (the one that removes time counters) is countered, no time counter is removed. The ability will trigger again at the beginning of the card’s owner’s next upkeep."}, {"date": "2021-06-18", "text": "When the last time counter is removed, the second triggered ability of suspend (the one that lets you cast the card) triggers. It doesn’t matter why the last time counter was removed or what effect removed it."}, {"date": "2021-06-18", "text": "If the second triggered ability is countered, the card can’t be cast. It remains exiled with no time counters on it, and it’s no longer suspended."}, {"date": "2021-06-18", "text": "As the second triggered ability resolves, you must cast the card if able. You must do so even if it requires targets and the only legal targets are ones that you really don’t want to target. Timing permissions based on the card’s type are ignored."}, {"date": "2021-06-18", "text": "If you can’t cast the card, perhaps because there are no legal targets available, it remains exiled with no time counters on it, and it’s no longer suspended."}, {"date": "2021-06-18", "text": "If you cast a card “without paying its mana cost,” such as with suspend, you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those if you want to cast the card."}, {"date": "2021-06-18", "text": "You are never forced to activate mana abilities to pay costs, so if there is a mandatory additional mana cost (such as from Thalia, Guardian of Thraben), you can decline to activate mana abilities to pay for it and hence fail to cast the suspended card, leaving it in exile."}, {"date": "2021-06-18", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2021-06-18", "text": "The mana value of a spell cast without paying its mana cost is determined by its mana cost, even though that cost wasn’t paid."}], "setCode": "FUT", "subtypes": [], "supertypes": [], "text": "Target creature gets +3/+3 until end of turn. Exile Cyclical Evolution with three time counters on it.\nSuspend 3—{2}{G} (Rather than cast this card from your hand, you may pay {2}{G} and exile it with three time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "9f70d049-11ef-5358-93ae-5de038cc0975"}