{"artist": "Alan Pollack", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G", "U"], "colors": ["G", "U"], "convertedManaCost": 3.0, "edhrecRank": 17225, "finishes": ["nonfoil", "foil"], "flavorText": "\"Though highly effective at reshaping flesh, these specially bred cytoplasts leave the subject reeking of omnibian mucus.\"\n—Simic research notes", "foreignData": [{"flavorText": "„Diese neu gezüchteten Zytoplasten übertreffen die Erwartungen, was das Umformen des Fleisches betrifft. Allerdings stinken sie gewaltig nach Krötenschleim.\" —Notizen von Simic-Forschern", "language": "German", "multiverseId": 122984, "name": "Zytoform", "text": "Bestimme eine nichtlegendäre Kreatur im Spiel. Ein Kreatur deiner Wahl wird bis zum Ende des Zuges zu einer Kopie der bestimmten Kreatur.", "type": "Spontanzauber"}, {"flavorText": "\"Aunque son extremadamente efectivos al remodelar la carne, estos citoplastos criados especialmente dejan al sujeto apestando a moco de omnibio.\" —Notas de investigación simic", "language": "Spanish", "multiverseId": 123884, "name": "Citomoldear", "text": "Elige una criatura en juego que no sea legendaria. La criatura objetivo se convierte en una copia de esa criatura hasta el final del turno.", "type": "Instantáneo"}, {"flavorText": "« Bien que très efficaces pour modeler la chair, ces cytoplastes spécialement élevés transmettent au sujet une puanteur de mucus d'omnibien. » —Notes de recherche des Simic", "language": "French", "multiverseId": 122804, "name": "Cytoforme", "text": "Choisissez une créature non-légendaire en jeu. La créature ciblée devient une copie de cette créature jusqu'à la fin du tour.", "type": "Éphémère"}, {"flavorText": "\"Pur essendo molto efficaci nel rimodellare la carne, questi citoplasti provenienti da allevamenti speciali causano fuoriuscite di muco omnibio nei soggetti.\" —Note di ricerca dei Simic", "language": "Italian", "multiverseId": 123164, "name": "Citoforma", "text": "Scegli una creatura non leggendaria in gioco. La creatura bersaglio diventa una copia di quella creatura fino alla fine del turno.", "type": "Istantaneo"}, {"flavorText": "この特別に繁殖した細胞質体は、肉体の再形成には極めて効果的であるが、被験体に悪臭を放つオムニビアンの粘液を残す。 ――シミックの研究メモ", "language": "Japanese", "multiverseId": 123344, "name": "細胞形成", "text": "クリーチャー１体を対象とする。 それはターン終了時まで、あなたが選んだ場に出ている伝説でないクリーチャーのコピーになる。", "type": "インスタント"}, {"flavorText": "\"Embora sejam muito eficazes no remodelamento da carne, essa linhagem especial de citoplastos deixa um terrível fedor de muco omníbio.\" — notas de pesquisa Simic", "language": "Portuguese (Brazil)", "multiverseId": 123524, "name": "Citoforma", "text": "Escolha uma criatura não lendária em jogo. A criatura alvo torna-se uma cópia daquela criatura até o final do turno.", "type": "Mágica Instantânea"}, {"flavorText": "\"Эти специально выведенные цитопласты чрезвычайно действенны для переформирования плоти, однако они слишком сильно воняют слизью омнибий\". —Исследовательские записки Симиков", "language": "Russian", "multiverseId": 123704, "name": "Цитоформа", "text": "Выберите нелегендарное существо в игре. Целевое существо становится копией этого существа до конца хода.", "type": "Мгновенное заклинание"}, {"flavorText": "「虽然重塑肉体的效率很高，但此特化种的胞塑体会让样本带有全能蛙的黏液。」 ～析米克研究纪录", "language": "Chinese Simplified", "multiverseId": 122624, "name": "细胞塑型", "text": "选择场上的一个非传奇生物。 目标生物成为该生物的复制品直到回合结束。", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "120335", "cardKingdomId": "120155", "cardsphereId": "12946", "mcmId": "12984", "mcmMetaId": "7568", "mtgjsonV4Id": "e65acef6-1c03-5a1a-b53b-f0460632114a", "mtgoFoilId": "24172", "mtgoId": "24171", "multiverseId": "107346", "scryfallId": "758023cb-548a-4a98-a355-f5c6e9eab5ff", "scryfallIllustrationId": "0393fd34-1e7e-4b90-bb19-4e5f91af4d18", "scryfallOracleId": "14221c18-7801-49c9-a2c8-53b8c5181d63", "tcgplayerProductId": "13848"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}{U}", "manaValue": 3.0, "name": "Cytoshape", "number": "108", "originalText": "Choose a nonlegendary creature in play. Target creature becomes a copy of that creature until end of turn.", "originalType": "Instant", "printings": ["DIS"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/82c1714f5b5f3de8", "cardKingdomFoil": "https://mtgjson.com/links/8cc8066ec40f8ded", "cardmarket": "https://mtgjson.com/links/c922d2b427b39867", "tcgplayer": "https://mtgjson.com/links/0009f4fabaadaffc"}, "rarity": "rare", "rulings": [{"date": "2006-05-01", "text": "Only the creature that’s becoming a copy is targeted. The creature that it will copy isn’t chosen until Cytoshape resolves."}, {"date": "2006-05-01", "text": "The creature copies the printed values of the chosen creature, plus any copy effects that have been applied to it. It won’t copy counters on that creature. It won’t copy effects that have changed the creature’s power, toughness, types, color, or so on."}, {"date": "2006-05-01", "text": "If the creature copies a creature that’s copying a creature, it will become whatever the chosen creature is copying."}, {"date": "2006-05-01", "text": "If the creature becomes a copy of a face-down creature, it will become a 2/2 creature with no name, creature type, abilities, mana cost, or color. It will not become face-down and thus can’t be turned face up."}, {"date": "2006-05-01", "text": "This effect can cause the target to stop being a creature. For example, if it becomes a copy of an animated Blinkmoth Nexus, the printed wording will be copied and it will become an unanimated Blinkmoth Nexus."}, {"date": "2006-05-01", "text": "Effects that have already applied to the target creature will continue to apply to it. For example, if Giant Growth had given it +3/+3 earlier in the turn, then Cytoshape makes it a copy of Grizzly Bears, it will be a 5/5 Grizzly Bears."}, {"date": "2006-05-01", "text": "A creature may become a copy of itself this way. This generally won’t have any visible effect."}, {"date": "2006-05-01", "text": "At the end of the turn, the creature reverts to what it was before. If two Cytoshapes affect the same creature on the same turn, they’ll both wear off at the same time."}], "setCode": "DIS", "subtypes": [], "supertypes": [], "text": "Choose a nonlegendary creature on the battlefield. Target creature becomes a copy of that creature until end of turn.", "type": "Instant", "types": ["Instant"], "uuid": "180bad9b-1a4b-5cc4-acc3-bc18609b3c0f", "watermark": "simic"}