{"artist": "Karl Kopinski", "availability": ["mtgo"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R", "U"], "colors": ["R", "U"], "convertedManaCost": 4.0, "edhrecRank": 4692, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "c632b62f-2ef2-5c5e-9ad6-a09ec54c29aa", "mtgoFoilId": "53200", "mtgoId": "53199", "multiverseId": "382904", "scryfallId": "bc8e9859-10b3-460c-99d5-4ace259c2d48", "scryfallIllustrationId": "154cfb00-88d7-4c66-bb3e-8f0a315ec96f", "scryfallOracleId": "724767ca-bd84-4137-9133-4ad2e96b8428"}, "isOnlineOnly": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{R}", "manaValue": 4.0, "name": "Dack's Duplicate", "number": "248", "originalText": "You may have Dack's Duplicate enter the battlefield as a copy of any creature on the battlefield except it gains haste and dethrone. (Whenever it attacks the player with the most life or tied for most life, put a +1/+1 counter on it.)", "originalType": "Creature — Shapeshifter", "power": "0", "printings": ["2X2", "CNS", "VMA"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2014-05-29", "text": "Haste and dethrone are part of the copiable values of Dack’s Duplicate. If another creature enters the battlefield as or becomes a copy of Dack’s Duplicate, it will copy whatever Dack’s Duplicate is copying and have haste and dethrone."}, {"date": "2014-05-29", "text": "The ability of Dack’s Duplicate doesn’t target the creature."}, {"date": "2014-05-29", "text": "Dack’s Duplicate copies exactly what was printed on the original creature and nothing more (unless that creature is copying something else or is a token; see below), except it will have haste and dethrone. It doesn’t copy whether that creature is tapped or untapped, whether it has any counters on it or Auras attached to it, or any non-copy effects that have changed its power, toughness, types, color, and so on."}, {"date": "2014-05-29", "text": "If the copied creature has {X} in its mana cost (such as Grenzo, Dungeon Warden), X is considered to be 0."}, {"date": "2014-05-29", "text": "If the chosen creature is copying something else (for example, if the chosen creature is another Dack’s Duplicate), then Dack’s Duplicate enters the battlefield as whatever the chosen creature is copying. It will have haste and dethrone."}, {"date": "2014-05-29", "text": "If the chosen creature is a token, Dack’s Duplicate copies the original characteristics of that token as stated by the effect that put the token onto the battlefield. Dack’s Duplicate is not a token, even when copying one."}, {"date": "2014-05-29", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when Dack’s Duplicate enters the battlefield. Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities of the chosen creature will also work."}, {"date": "2014-05-29", "text": "If Dack’s Duplicate somehow enters the battlefield at the same time as another creature, Dack’s Duplicate can’t become a copy of that creature. You may choose only a creature that’s already on the battlefield."}, {"date": "2014-05-29", "text": "You can choose to not copy anything. In that case, Dack’s Duplicate enters the battlefield as a 0/0 Shapeshifter creature, and will probably die almost immediately, when state-based actions are next performed."}, {"date": "2014-05-29", "text": "Dethrone doesn’t trigger if the creature attacks a planeswalker, even if its controller has the most life."}, {"date": "2014-05-29", "text": "Once dethrone triggers, it doesn’t matter what happens to the players’ life totals before the ability resolves. You’ll put a +1/+1 counter on the creature even if the defending player doesn’t have the most life as the ability resolves."}, {"date": "2014-05-29", "text": "The +1/+1 counter is put on the creature before blockers are declared."}, {"date": "2014-05-29", "text": "In a Two-Headed Giant game, dethrone will trigger if the creature attacks either player on the team with the most life or tied for the most life."}], "securityStamp": "oval", "setCode": "VMA", "subtypes": ["Shapeshifter"], "supertypes": [], "text": "You may have Dack's Duplicate enter the battlefield as a copy of any creature on the battlefield, except it has haste and dethrone. (Whenever it attacks the player with the most life or tied for most life, put a +1/+1 counter on it.)", "toughness": "0", "type": "Creature — Shapeshifter", "types": ["Creature"], "uuid": "4460e8cc-110b-51aa-8ac1-dc26f3b6da93"}