{"artist": "Randy Gallegos", "availability": ["paper"], "borderColor": "gold", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 2.0, "edhrecRank": 1316, "finishes": ["nonfoil", "signed"], "foreignData": [], "frameVersion": "1993", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "243561", "mcmId": "22737", "mtgjsonV4Id": "26816a80-f76d-53fa-8629-e23bea43d31d", "scryfallId": "5b5bc1a2-6903-439b-9ec6-6fdaf48d923a", "scryfallIllustrationId": "f656af0a-f54a-430a-b39f-319ae7ee5ced", "scryfallOracleId": "15d5b198-edbe-40f3-87e2-d72f7f0c58ab", "tcgplayerProductId": "158648"}, "isReprint": true, "isStarter": true, "keywords": ["Enchant"], "language": "English", "layout": "normal", "legalities": {}, "manaCost": "{1}{B}", "manaValue": 2.0, "name": "Dance of the Dead", "number": "ll118", "printings": ["ICE", "ME2", "PTC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/c0924acac1ac6582", "tcgplayer": "https://mtgjson.com/links/ad46b37d12f0497c"}, "rarity": "uncommon", "rulings": [{"date": "2004-10-04", "text": "If more than one Dance of the Dead ends up on a creature, each contributes a +1/+1. But you only have to pay the untap cost once. You may pay for each one, however, and untap the card more than once during upkeep."}, {"date": "2008-04-01", "text": "This is a new wording. Dance of the Dead is now an Aura. You target a creature card in a graveyard when you cast it. It enters the battlefield attached to that card. Then it returns that card to the battlefield, and attaches itself to that card again (since the card is treated as a new object on the battlefield)."}, {"date": "2008-04-01", "text": "Once the creature is returned to the battlefield, Dance of the Dead can’t be attached to anything other than it (unless Dance of the Dead somehow manages to put a different creature onto the battlefield). Attempting to move Dance of the Dead to another creature won’t work."}, {"date": "2008-04-01", "text": "If the creature card put onto the battlefield has protection from black (or anything that prevents this from legally being attached), this won’t be able to attach to it. Then this will go to the graveyard as a state-based action, causing the creature to be sacrificed."}], "setCode": "PTC", "signature": "Leon Lindback", "subtypes": ["Aura"], "supertypes": [], "text": "Enchant creature card in a graveyard\nWhen Dance of the Dead enters the battlefield, if it's on the battlefield, it loses \"enchant creature card in a graveyard\" and gains \"enchant creature put onto the battlefield with Dance of the Dead.\" Put enchanted creature card onto the battlefield tapped under your control and attach Dance of the Dead to it. When Dance of the Dead leaves the battlefield, that creature's controller sacrifices it.\nEnchanted creature gets +1/+1 and doesn't untap during its controller's untap step.\nAt the beginning of the upkeep of enchanted creature's controller, that player may pay {1}{B}. If the player does, untap that creature.", "type": "Enchantment — Aura", "types": ["Enchantment"], "uuid": "43bc78c8-1712-56ca-8689-1fc62f4ebb64"}