{"artist": "Titus Lunter", "availability": ["arena"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 8674, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"mtgArenaId": "75809", "mtgjsonV4Id": "0506f126-22f7-561b-ad29-69a5ea9d4b23", "scryfallId": "6a178595-f051-4ad6-86c4-597ab738be85", "scryfallIllustrationId": "325dc36d-1989-417f-83bb-915cdd99f7d1", "scryfallOracleId": "6aa96a6e-9a88-4662-aa26-b4c16c0ef650"}, "isOnlineOnly": true, "isReprint": true, "keywords": ["Crew"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Daredevil Dragster", "number": "231", "power": "4", "printings": ["AER", "KLR"], "purchaseUrls": {}, "rarity": "uncommon", "rulings": [{"date": "2017-02-09", "text": "If a second velocity counter is put on Daredevil Dragster by something other than the resolution of its triggered ability, you won’t sacrifice it yet."}, {"date": "2017-02-09", "text": "If Daredevil Dragster has one velocity counter on it and leaves the battlefield while its triggered ability is on the stack, it won’t get a second velocity counter and you won’t draw cards."}, {"date": "2017-02-09", "text": "If Daredevil Dragster somehow has two velocity counters on it and leaves the battlefield while its triggered ability is on the stack, you’ll draw two cards even though you can’t sacrifice it."}, {"date": "2017-02-09", "text": "If Daredevil Dragster doesn’t survive the combat damage step, its ability won’t trigger."}, {"date": "2017-09-29", "text": "If a permanent becomes a copy of a Vehicle, the copy won’t be a creature, even if the Vehicle it’s copying has become an artifact creature."}, {"date": "2017-09-29", "text": "Once a Vehicle becomes a creature, it behaves exactly like any other artifact creature. It can’t attack unless you’ve controlled it continuously since your turn began, it can block if it’s untapped, it can be tapped to pay a Vehicle’s crew cost, and so on."}, {"date": "2017-09-29", "text": "You may activate a crew ability of a Vehicle even if it’s already an artifact creature. Doing so has no effect on the Vehicle. It doesn’t change its power and toughness."}, {"date": "2017-09-29", "text": "For a Vehicle to be able to attack, it must be a creature as the declare attackers step begins, so the latest you can activate its crew ability to attack with it is during the beginning of combat step. For a Vehicle to be able to block, it must be a creature as the declare blockers step begins, so the latest you can activate its crew ability to block with it is during the declare attackers step. In either case, players may take actions after the crew ability resolves but before the Vehicle has been declared as an attacking or blocking creature."}, {"date": "2017-09-29", "text": "When a Vehicle becomes a creature, that doesn’t count as having a creature enter the battlefield. The permanent was already on the battlefield; it only changed its types. Abilities that trigger whenever a creature enters the battlefield won’t trigger."}, {"date": "2017-09-29", "text": "Each Vehicle is printed with a power and toughness, but it’s not a creature. If it becomes a creature (most likely through its crew ability), it will have that power and toughness."}, {"date": "2017-09-29", "text": "If an effect causes a Vehicle to become an artifact creature with a specified power and toughness, that effect overwrites the Vehicle’s printed power and toughness."}, {"date": "2017-09-29", "text": "Vehicle is an artifact type, not a creature type. A Vehicle that’s crewed won’t normally have any creature type."}, {"date": "2017-09-29", "text": "Once a player announces that they are activating a crew ability, no player may take other actions until the ability has been paid for. Notably, players can’t try to stop the ability by changing a creature’s power or by removing or tapping a creature."}, {"date": "2017-09-29", "text": "Any untapped creature you control can be tapped to pay a crew cost, even one that just came under your control."}, {"date": "2017-09-29", "text": "You may tap more creatures than necessary to activate a crew ability."}, {"date": "2017-09-29", "text": "Creatures that crew a Vehicle aren’t attached to it or related in any other way. Effects that affect the Vehicle, such as by destroying it or giving it a +1/+1 counter, don’t affect the creatures that crewed it."}], "setCode": "KLR", "subtypes": ["Vehicle"], "supertypes": [], "text": "At end of combat, if Daredevil Dragster attacked or blocked this combat, put a velocity counter on it. Then if it has two or more velocity counters on it, sacrifice it and draw two cards.\nCrew 2 (Tap any number of creatures you control with total power 2 or more: This Vehicle becomes an artifact creature until end of turn.)", "toughness": "4", "type": "Artifact — Vehicle", "types": ["Artifact"], "uuid": "419e03ee-5f18-5eba-a7ad-10703f609c37"}