{"artist": "Johann Bodin", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 7638, "finishes": ["nonfoil", "foil"], "flavorText": "Honesty is the first casualty of war.", "foreignData": [{"flavorText": "Das erste Opfer des Krieges ist die Ehrlichkeit.", "language": "German", "multiverseId": 380888, "name": "Dreiste Diebin", "text": "Inspiriert — Immer wenn die Dreiste Diebin enttappt wird, kannst du die Kontrolle über eine bleibende Karte deiner Wahl, die kein Land ist und die du kontrollierst, und eine bleibende Karte deiner Wahl, die ein Gegner kontrolliert und die mit dieser bleibenden Karte einen Kartentyp gemeinsam hat, tauschen.", "type": "Kreatur — Mensch, Räuber"}, {"flavorText": "La honestidad es la primera baja de una guerra.", "language": "Spanish", "multiverseId": 382043, "name": "Ladrona temeraria", "text": "Inspiración — Siempre que la Ladrona temeraria se enderece, puedes intercambiar el control del permanente objetivo que no sea tierra que controlas y el permanente objetivo que controla un oponente que comparte un tipo de carta con él.", "type": "Criatura — Bribón humano"}, {"flavorText": "L'honnêteté est la première victime de la guerre.", "language": "French", "multiverseId": 381053, "name": "Voleuse audacieuse", "text": "Inspiration — À chaque fois que la Voleuse audacieuse devient dégagée, vous pouvez échanger le contrôle d'un permanent non-terrain ciblé que vous contrôlez contre celui d'un permanent ciblé qu'un adversaire contrôle qui partage un type de carte avec lui.", "type": "Créature : humain et gredin"}, {"flavorText": "L'onestà è la prima vittima della guerra.", "language": "Italian", "multiverseId": 381218, "name": "Ladra Audace", "text": "Ispirazione — Ogniqualvolta la Ladra Audace viene STAPpata, puoi scambiare il controllo di un permanente non terra bersaglio che controlli e un permanente bersaglio controllato da un avversario che condivide con esso un tipo di carta.", "type": "Creatura — Farabutto Umano"}, {"flavorText": "戦争での最初の犠牲者は、誠実さである。", "language": "Japanese", "multiverseId": 381383, "name": "果敢な泥棒", "text": "神啓 ― 果敢な泥棒がアンタップ状態になるたび、あなたがコントロールする土地でないパーマネント１つと、それと共通のカード・タイプを持つ、対戦相手がコントロールするパーマネント１つを対象とする。あなたはそれらのコントロールを交換してもよい。", "type": "クリーチャー — 人間・ならず者"}, {"flavorText": "전쟁에서 가장 먼저 죽는 것은 정직함이다.", "language": "Korean", "multiverseId": 381548, "name": "대담한 도둑", "text": "영감 — 대담한 도둑이 언탭될 때마다, 당신이 조종하는 대지가 아닌 지속물, 그리고 그 카드와 카드 유형을 공유하는 상대가 조종하는 지속물을 각각 목표로 정한다. 당신은 두 지속물의 조종권을 교환할 수 있다.", "type": "생물 — 인간 도적"}, {"flavorText": "A honestidade é a primeira baixa de guerra.", "language": "Portuguese (Brazil)", "multiverseId": 381713, "name": "Ladrão Ousado", "text": "Inspirado — Toda vez que Ladrão Ousado é desvirado, você pode permutar o controle de uma permanente alvo que não seja terreno sob seu controle por uma permanente alvo sob o controle de um oponente que tenha o mesmo tipo de card.", "type": "Criatura — Humano Ladino"}, {"flavorText": "Честность — первая жертва войны.", "language": "Russian", "multiverseId": 381878, "name": "Дерзкая Воровка", "text": "Одухотворение — Каждый раз, когда Дерзкая Воровка становится развернутой, вы можете поменяться контролем над целевым не являющимся землей перманентом под вашим контролем и целевым перманентом под контролем оппонента, у которого есть такой же тип карты.", "type": "Существо — Человек Бродяга"}, {"flavorText": "诚信是战争的首个牺牲品。", "language": "Chinese Simplified", "multiverseId": 380558, "name": "大胆的窃贼", "text": "启悟～每当大胆的窃贼成为未横置时，选择目标由你操控之非地永久物，以及目标由对手操控、且与前者有共通牌类别之永久物。你可以交换两者的操控权。", "type": "生物～人类／浪客"}, {"flavorText": "誠信是戰爭的首個犧牲品。", "language": "Chinese Traditional", "multiverseId": 380723, "name": "大膽的竊賊", "text": "啟悟～每當大膽的竊賊成為未橫置時，選擇目標由你操控之非地永久物，以及目標由對手操控、且與前者有共通牌類別之永久物。你可以交換兩者的操控權。", "type": "生物～人類／浪客"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "194228", "cardKingdomId": "193969", "cardsphereId": "22036", "mcmId": "266636", "mcmMetaId": "209531", "mtgjsonV4Id": "9e588e10-ccda-57a8-8520-854083a8d03b", "mtgoFoilId": "52229", "mtgoId": "52228", "multiverseId": "380393", "scryfallId": "c9d9378d-e553-48b5-8a23-59a35329eda2", "scryfallIllustrationId": "cce865f9-4382-4d8f-a10d-f2cd137e886c", "scryfallOracleId": "e01289ea-634b-4be5-8b8e-5e1179761a9b", "tcgplayerProductId": "82241"}, "keywords": ["Inspired"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}", "manaValue": 3.0, "name": "Daring Thief", "number": "36", "originalText": "Inspired — Whenever Daring Thief becomes untapped, you may exchange control of target nonland permanent you control and target permanent an opponent controls that shares a card type with it.", "originalType": "Creature — Human Rogue", "power": "2", "printings": ["JOU"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/5e423a48dcdaf05e", "cardKingdomFoil": "https://mtgjson.com/links/7d359f8251f6c823", "cardmarket": "https://mtgjson.com/links/180cc044787a5909", "tcgplayer": "https://mtgjson.com/links/7e5971603351563e"}, "rarity": "rare", "rulings": [{"date": "2014-04-26", "text": "The exchange of control lasts indefinitely. It doesn't expire when Daring Thief leaves the battlefield."}, {"date": "2014-04-26", "text": "Gaining control of an Aura or Equipment doesn't cause it to move, though gaining control of an Equipment will allow you to activate its equip ability to attach it to a creature you control later."}, {"date": "2014-04-26", "text": "The relevant card types (that is, the ones a permanent can have) are artifact, creature, enchantment, planeswalker, and tribal."}, {"date": "2014-04-26", "text": "If the full exchange can't happen, perhaps because one of the targets is illegal as the inspired ability tries to resolve, then nothing happens. No permanents change controllers."}, {"date": "2014-04-26", "text": "If another spell or ability allows you to change the targets of the ability (or perhaps copy it and choose new targets for the copy), you can change the targets only such that the final set of targets is still legal. For example, if the ability targets a creature you control and a creature an opponent controls, you couldn't change just the second target to a noncreature permanent controlled by that player. You could, however, change just the second target to a creature controlled by a different opponent. The two new targets can share a different card type than the two original targets did."}, {"date": "2014-04-26", "text": "Although the permanent you control can't be a land, the other target can, provided it shares a card type with the first target. For example, you could target an artifact you control and an artifact land controlled by an opponent."}, {"date": "2014-04-26", "text": "Inspired abilities trigger no matter how the creature becomes untapped: by the turn-based action at the beginning of the untap step or by a spell or ability."}, {"date": "2014-04-26", "text": "If an inspired ability triggers during your untap step, the ability will be put on the stack at the beginning of your upkeep. If the ability creates one or more token creatures, those creatures won't be able to attack that turn (unless they gain haste)."}, {"date": "2014-04-26", "text": "Inspired abilities don't trigger when the creature enters the battlefield."}, {"date": "2014-04-26", "text": "If the inspired ability includes an optional cost, you decide whether to pay that cost as the ability resolves. You can do this even if the creature leaves the battlefield in response to the ability."}], "setCode": "JOU", "subtypes": ["Human", "Rogue"], "supertypes": [], "text": "Inspired — Whenever Daring Thief becomes untapped, you may exchange control of target nonland permanent you control and target permanent an opponent controls that shares a card type with it.", "toughness": "3", "type": "Creature — Human Rogue", "types": ["Creature"], "uuid": "da6a7da7-620d-509e-8726-fe111295e831"}