{"artist": "Chase Stone", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B", "R", "U"], "colors": ["B", "R", "U"], "convertedManaCost": 5.0, "edhrecRank": 8099, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "210925", "cardsphereId": "48219", "mcmId": "295052", "mtgjsonV4Id": "91ad7816-10f0-557d-baab-31dce0c28100", "scryfallId": "8338f5d2-38e8-460e-ade3-c7f96025362b", "scryfallIllustrationId": "c27fb91e-7531-4cc9-9d61-d0cdf31f8f0e", "scryfallOracleId": "228cb63f-0b93-4be5-94e5-4eaae9112eeb", "tcgplayerProductId": "126829"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{B}{R}", "manaValue": 5.0, "name": "Dark Intimations", "number": "128s", "printings": ["AER", "KLR", "PAER"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/b7040b408f07cfc8", "tcgplayer": "https://mtgjson.com/links/87a7f9fc45deb287"}, "rarity": "rare", "rulings": [{"date": "2017-02-09", "text": "Each opponent chooses a permanent to sacrifice from among the creatures and planeswalkers that player controls. You don’t choose which type of permanent the player has to sacrifice."}, {"date": "2017-02-09", "text": "If an opponent can’t sacrifice a creature or planeswalker, that player still discards a card if able. You still return a creature or planeswalker card to your hand if able, even if no opponent sacrifices a permanent and/or discards a card. You still draw a card even if you can’t return a card to your hand."}, {"date": "2017-02-09", "text": "When Dark Intimations resolves, first the player whose turn it is (if that player is an opponent) chooses which creature or planeswalker they will sacrifice, then each other opponent in turn order does the same, then all chosen permanents are sacrificed at the same time. Then each opponent in the same order chooses a card in their hand without revealing it, then all chosen cards are discarded at the same time."}, {"date": "2017-02-09", "text": "If two or more Dark Intimations are in your graveyard when you cast a Bolas planeswalker spell, you’ll exile each of them and that planeswalker will enter the battlefield with that many additional loyalty counters."}, {"date": "2017-02-09", "text": "The draconic Planeswalker Nicol Bolas is not featured in the Aether Revolt set. He must be up to something nefarious elsewhere."}, {"date": "2017-02-09", "text": "You choose the creature or planeswalker card to return to your hand while Dark Intimations is resolving. No player may take actions between the time you choose one and the time you put it into your hand."}, {"date": "2018-01-19", "text": "There are many important moments in the story, but the most crucial—called “story spotlights”—are shown on cards. These cards have the Planeswalker symbol in their text box; this symbol has no effect on gameplay. You can read more about these events in the official Magic fiction at http://www.mtgstory.com."}], "securityStamp": "oval", "setCode": "PAER", "subtypes": [], "supertypes": [], "text": "Each opponent sacrifices a creature or planeswalker, then discards a card. You return a creature or planeswalker card from your graveyard to your hand, then draw a card.\nWhen you cast a Bolas planeswalker spell, exile Dark Intimations from your graveyard. That planeswalker enters the battlefield with an additional loyalty counter on it.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "6bf314ad-bf84-5bda-b790-022be5b01cce", "watermark": "planeswalker"}