{"artist": "Karla Ortiz", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U", "W"], "colors": ["U", "W"], "convertedManaCost": 3.0, "edhrecRank": 4977, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 374411, "name": "Daxos von Meletis", "text": "Daxos von Meletis kann von Kreaturen mit Stärke 3 oder größer nicht geblockt werden.\nImmer wenn Daxos von Meletis einem Spieler Kampfschaden zufügt, schicke die oberste Karte der Bibliothek dieses Spielers ins Exil. Du erhältst so viele Lebenspunkte dazu, wie die umgewandelten Manakosten dieser Karte betragen. Bis zum Ende des Zuges kannst du diese Karte wirken, und um sie zu wirken kannst du Mana ausgeben, als wäre es Mana beliebiger Farbe.", "type": "Legendäre Kreatur — Mensch, Soldat"}, {"language": "Spanish", "multiverseId": 376154, "name": "Daxos de Meletis", "text": "Daxos de Meletis no puede ser bloqueado por criaturas con fuerza de 3 o más.\nSiempre que Daxos de Meletis haga daño de combate a un jugador, exilia la primera carta de la biblioteca de ese jugador. Ganas vidas igual al coste de maná convertido de esa carta. Hasta el final del turno, puedes lanzar esa carta y puedes gastar maná como si fuera maná de cualquier color para lanzarla.", "type": "Criatura legendaria — Soldado humano"}, {"language": "French", "multiverseId": 374660, "name": "Daxos de Mélétis", "text": "Daxos de Mélétis ne peut pas être bloqué par les créatures de force supérieure ou égale à 3.\nÀ chaque fois que Daxos de Mélétis inflige des blessures de combat à un joueur, exilez la carte du dessus de la bibliothèque de ce joueur. Vous gagnez autant de points de vie que le coût converti de mana de cette carte. Jusqu'à la fin du tour, vous pouvez lancer cette carte et vous pouvez dépenser du mana comme s'il s'agissait de mana de n'importe quelle couleur pour la lancer.", "type": "Créature légendaire : humain et soldat"}, {"language": "Italian", "multiverseId": 374909, "name": "Daxos di Meletis", "text": "Daxos di Meletis non può essere bloccato da creature con forza pari o superiore a 3.\nOgniqualvolta Daxos di Meletis infligge danno da combattimento a un giocatore, esilia la prima carta del grimorio di quel giocatore. Guadagni punti vita pari al costo di mana convertito di quella carta. Fino alla fine del turno, puoi lanciare quella carta e puoi spendere mana come se fosse mana di qualsiasi colore per lanciarla.", "type": "Creatura Leggendaria — Soldato Umano"}, {"language": "Japanese", "multiverseId": 375158, "name": "メレティスのダクソス", "text": "メレティスのダクソスは、パワーが３以上のクリーチャーによってはブロックされない。\nメレティスのダクソスがプレイヤー１人に戦闘ダメージを与えるたび、そのプレイヤーのライブラリーの一番上のカードを追放する。あなたはそのカードの点数で見たマナ・コストに等しい点数のライフを得る。ターン終了時まで、あなたは任意のマナをいずれかの色のマナであるかのように支払ってそのカードを唱えてもよい。", "type": "伝説のクリーチャー — 人間・兵士"}, {"language": "Korean", "multiverseId": 375407, "name": "멜레티스의 닥소스", "text": "멜레티스의 닥소스는 공격력이 3 이상인 생물에게 방어당할 수 없다.\n멜레티스의 닥소스가 플레이어에게 전투피해를 입힐 때마다, 그 플레이어의 서고 맨 위의 카드 한 장을 추방한다. 당신은 그 카드의 전환마나비용만큼의 생명점을 얻는다. 턴종료까지, 당신은 그 카드를 발동할 수 있으며, 당신이 그 카드를 발동하기 위한 마나는 당신이 원하는 색의 마나로 사용할 수 있다.", "type": "전설적 생물 — 인간 병사"}, {"language": "Portuguese (Brazil)", "multiverseId": 375656, "name": "Daxos de Meletis", "text": "Daxos de Meletis não pode ser bloqueado por criaturas de poder maior ou igual a 3.\nToda vez que Daxos de Meletis causar dano de combate a um jogador, exile o card do topo do grimório daquele jogador. Você ganha uma quantidade de pontos de vida igual ao custo de mana convertido daquele card. Até o final do turno, você pode conjurar aquele card e pode gastar mana como se fosse de qualquer cor para fazê-lo.", "type": "Criatura Lendária — Humano Soldado"}, {"language": "Russian", "multiverseId": 375905, "name": "Дакс из Мелетиды", "text": "Дакс из Мелетиды не может быть заблокирован существами с силой 3 или больше.\nКаждый раз, когда Дакс из Мелетиды наносит боевые повреждения игроку, изгоните верхнюю карту библиотеки того игрока. Вы получаете количество жизней, равное конвертированной мана-стоимости той карты. До конца хода вы можете разыграть ту карту, если она не является картой земли, и вы можете тратить ману на разыгрывание той карты, как если бы это была мана любого цвета.", "type": "Легендарное Существо — Человек Солдат"}, {"language": "Chinese Simplified", "multiverseId": 373913, "name": "迈勒提斯的达克索斯", "text": "迈勒提斯的达克索斯不能被力量大于或等于3的生物阻挡。\n每当迈勒提斯的达克索斯对任一牌手造成战斗伤害时，放逐该牌手的牌库顶牌。你获得等同于该牌之总法术力费用的生命。直到回合结束，你可以施放该牌，且你可以将法术力视同任意颜色的法术力来支付施放该牌的费用。", "type": "传奇生物～人类／士兵"}, {"language": "Chinese Traditional", "multiverseId": 374162, "name": "邁勒提斯的達克索斯", "text": "邁勒提斯的達克索斯不能被力量大於或等於3的生物阻擋。\n每當邁勒提斯的達克索斯對任一玩家造成戰鬥傷害時，放逐該玩家的牌庫頂牌。你獲得等同於該牌之總魔法力費用的生命。直到回合結束，你可以施放該牌，且你可以將魔法力視同任意顏色的魔法力來支付施放該牌的費用。", "type": "傳奇生物～人類／士兵"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "191520", "cardKingdomId": "191181", "cardsphereId": "43660", "mcmId": "264060", "mcmMetaId": "208659", "mtgjsonV4Id": "898d2cb6-99f8-53b5-887c-82119319cd91", "mtgoFoilId": "50533", "mtgoId": "50532", "multiverseId": "373664", "scryfallId": "6bb68644-e99d-4ecb-a804-8d4ad1c3325d", "scryfallIllustrationId": "6245d81c-1cf5-4a28-bb48-08fb3dfc48c2", "scryfallOracleId": "4cf10cb6-b082-4c0d-89e9-43cd39716201", "tcgplayerProductId": "71035"}, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}{U}", "manaValue": 3.0, "name": "Daxos of Meletis", "number": "191", "originalText": "Daxos of Meletis can't be blocked by creatures with power 3 or greater.\nWhenever Daxos of Meletis deals combat damage to a player, exile the top card of that player's library. You gain life equal to that card's converted mana cost. Until end of turn, you may cast that card and you may spend mana as though it were mana of any color to cast it.", "originalType": "Legendary Creature — Human Soldier", "power": "2", "printings": ["C18", "NCC", "THS"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/a1a37d221c2239a5", "cardKingdomFoil": "https://mtgjson.com/links/7b24dc58a0bd0963", "cardmarket": "https://mtgjson.com/links/d1b1f7ac6a1a9634", "tcgplayer": "https://mtgjson.com/links/7bdbf3e49702da27"}, "rarity": "rare", "rulings": [{"date": "2013-09-15", "text": "If Daxos is blocked by a creature, raising that creature's power to 3 or greater won't change or undo the block."}, {"date": "2013-09-15", "text": "If the exiled card is a land card, you won't gain any life and you won't be able to play the land."}, {"date": "2013-09-15", "text": "You must pay all costs to cast the exiled card. You may pay alternative or additional costs. If the card has any mandatory additional costs, you must pay those."}, {"date": "2013-09-15", "text": "Daxos doesn't change when you can cast the exiled card. For example, if you exile a creature card without flash, you can cast it only during your main phase when the stack is empty."}], "setCode": "THS", "subtypes": ["Human", "Soldier"], "supertypes": ["Legendary"], "text": "Daxos of Meletis can't be blocked by creatures with power 3 or greater.\nWhenever Daxos of Meletis deals combat damage to a player, exile the top card of that player's library. You gain life equal to that card's mana value. Until end of turn, you may cast that card and you may spend mana as though it were mana of any color to cast that spell.", "toughness": "2", "type": "Legendary Creature — Human Soldier", "types": ["Creature"], "uuid": "a45ba28d-7fa5-571a-9f05-8bc7297983c8"}