{"artist": "Matthew D. Wilson", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 7.0, "edhrecRank": 8944, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 165988, "name": "Tag der Drachen", "text": "Entferne alle Kreaturen, die du kontrollierst, ganz aus dem Spiel, wenn der Tag der Drachen ins Spiel kommt. Bringe dann ebenso viele 5/5 rote Drachen-Spielsteine mit Flugfähigkeit ins Spiel.\nWenn der Tag der Drachen das Spiel verlässt, opfere alle Drachen, die du kontrollierst. Bringe dann die so ganz aus dem Spiel entfernten Karten unter deiner Kontrolle wieder ins Spiel zurück.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 166561, "name": "Día de los dragones", "text": "Cuando el Día de los dragones entre en juego, remueve del juego todas las criaturas que controles. Luego pon en juego ese número de fichas de criatura Dragón roja 5/5 con la habilidad de volar.\nCuando el Día de los dragones salga del juego, sacrifica todos los Dragones que controles. Luego regresa al juego las cartas removidas bajo tu control.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 166131, "name": "Jour des dragons", "text": "Quand le Jour des dragons arrive en jeu, retirez de la partie toutes les créatures que vous contrôlez. Mettez ensuite en jeu autant de jetons de créature 5/5 rouge Dragon avec le vol.\nQuand le Jour des dragons quitte le jeu, sacrifiez tous les dragons que vous contrôlez. Renvoyez ensuite les cartes retirées en jeu, sous votre contrôle.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 166274, "name": "Il Giorno dei Draghi", "text": "Quando Il Giorno dei Draghi entra in gioco, rimuovi dal gioco tutte le creature che controlli. Poi metti in gioco altrettante pedine creatura Drago 5/5 rosse con volare.\nQuando il Giorno dei Draghi lascia il gioco, sacrifica tutti i Draghi che controlli. Poi rimetti in gioco sotto il tuo controllo le carte rimosse.", "type": "Incantesimo"}, {"language": "Japanese", "name": "ドラゴンの日"}, {"language": "Portuguese (Brazil)", "multiverseId": 166417, "name": "Dia dos Dragões", "text": "Quando Dia dos Dragões entrar em jogo, remova de jogo todas as criaturas que você controla. Depois, coloque em jogo aquela quantidade de fichas de criatura vermelha 5/5, com a habilidade de voar, do tipo Dragão.\nQuando Dia dos Dragões sair de jogo, sacrifique todos os Dragões que você controla. Depois, devolva todos os cards removidos para o jogo sob seu controle.", "type": "Encantamento"}], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "67030", "cardKingdomId": "66030", "cardsphereId": "40777", "mcmId": "1024", "mcmMetaId": "1344", "mtgjsonV4Id": "6efb18d4-cd02-5a95-8113-bbeb2b8bc63f", "mtgoFoilId": "18721", "mtgoId": "18720", "multiverseId": "43602", "scryfallId": "366a934c-eb01-48c6-8393-c2fe0708ff91", "scryfallIllustrationId": "c08a52d5-eca0-494e-967a-39ac68200cc9", "scryfallOracleId": "c4df259a-cdd4-420a-8e3d-7b69da5c9f6f", "tcgplayerProductId": "10858"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "penny": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U}{U}{U}", "manaValue": 7.0, "name": "Day of the Dragons", "number": "31", "originalText": "When Day of the Dragons comes into play, remove all creatures you control from the game. Then put that many 5/5 red Dragon creature tokens with flying into play.\nWhen Day of the Dragons leaves play, sacrifice all Dragons you control. Then return the removed cards to play under your control.", "originalType": "Enchantment", "printings": ["C15", "IMA", "KHC", "SCG"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2fbb067b844b6e22", "cardKingdomFoil": "https://mtgjson.com/links/109a29add5bf75bf", "cardmarket": "https://mtgjson.com/links/fd0bb42ed1f1d22e", "tcgplayer": "https://mtgjson.com/links/cf4f918b720891c5"}, "rarity": "rare", "rulings": [{"date": "2017-11-17", "text": "Auras attached to the exiled creatures will be put into their owners’ graveyards. Equipment attached to the exiled creatures will become unattached and remain on the battlefield. Any counters on the exiled creatures will cease to exist."}, {"date": "2017-11-17", "text": "Token creatures will count to determine how many Dragon tokens you create, but they won’t be returned to the battlefield when Day of the Dragons leaves the battlefield."}, {"date": "2017-11-17", "text": "If Day of the Dragons leaves the battlefield before its first ability has resolved, its second ability will trigger and you’ll sacrifice any Dragons you already control. Then its first ability will resolve and exile your creatures forever, leaving you with that many Dragon tokens."}, {"date": "2017-11-17", "text": "All of the nontoken creatures you exiled return to the battlefield when Day of the Dragons leaves the battlefield, even if some or all of the Dragon tokens had already left the battlefield."}], "setCode": "SCG", "subtypes": [], "supertypes": [], "text": "When Day of the Dragons enters the battlefield, exile all creatures you control. Then create that many 5/5 red Dragon creature tokens with flying.\nWhen Day of the Dragons leaves the battlefield, sacrifice all Dragons you control. Then return the exiled cards to the battlefield under your control.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "eb192481-dcb7-5a3c-b9d6-d2ab01a280d2"}