{"artist": "Jonas De Ro", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 5211, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "252757", "cardsphereId": "83244", "mcmId": "583929", "mcmMetaId": "220221", "mtgjsonV4Id": "507a79fe-7907-55fa-afb7-0393afff1350", "scryfallId": "e2f625b2-7816-4a8d-95a8-0174c2fc145e", "scryfallIllustrationId": "6f280db9-1f36-40ea-9aff-3243fd63fb83", "scryfallOracleId": "810a6cf5-e9f4-48e1-8e06-3e0af85633ce", "tcgplayerProductId": "254564"}, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}", "manaValue": 3.0, "name": "Day's Undoing", "number": "590", "originalReleaseDate": "2021-11-19", "printings": ["ORI", "PLIST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/8b7db76b2fb10729", "cardmarket": "https://mtgjson.com/links/540481e8b87b4dc0", "tcgplayer": "https://mtgjson.com/links/5e04402006c91706"}, "rarity": "mythic", "rulings": [{"date": "2015-06-22", "text": "Ending the turn this way means the following things happen in order: 1) All spells and abilities on the stack are exiled. This includes spells and abilities that can’t be countered. 2) If there are any attacking and blocking creatures, they’re removed from combat. 3) State-based actions are checked. No player gets priority, and no triggered abilities are put onto the stack. 4) The current phase and/or step ends. The game skips straight to the cleanup step. 5) The cleanup step happens in its entirety."}, {"date": "2015-06-22", "text": "If any triggered abilities do trigger during the process of ending the turn, they’re put onto the stack during the cleanup step. If this happens, players will have a chance to cast spells and activate abilities, then there will be another cleanup step before the turn ends."}, {"date": "2015-06-22", "text": "Though other spells and abilities that are exiled won’t get a chance to resolve, they don’t count as being countered."}, {"date": "2015-06-22", "text": "Any “at the beginning of the next end step” triggered abilities won’t get the chance to trigger that turn because the end step is skipped. Those abilities will trigger at the beginning of the end step of the next turn. The same is true of abilities that trigger at the beginning of other phases or steps."}, {"date": "2015-06-22", "text": "If both your hand and graveyard are empty as Day’s Undoing starts resolving, you’ll still shuffle your library before drawing seven cards."}, {"date": "2017-04-18", "text": "If any abilities trigger while players are shuffling cards into their library or drawing seven cards, those abilities cease to exist when the turn ends. They won’t be put on the stack."}], "securityStamp": "oval", "setCode": "PLIST", "subtypes": [], "supertypes": [], "text": "Each player shuffles their hand and graveyard into their library, then draws seven cards. If it's your turn, end the turn. (Exile all spells and abilities from the stack, including this card. Discard down to your maximum hand size. Damage wears off, and \"this turn\" and \"until end of turn\" effects end.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "51fdebee-2053-5046-9e72-b56dd3c9cc4a"}