{"artist": "Jason Rainville", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 13116, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "209381", "cardsphereId": "37115", "mcmId": "292949", "mtgjsonV4Id": "6605efea-2288-5dc6-978a-33b6f7e230e8", "scryfallId": "245610ce-0733-4acd-904b-2912dc480b81", "scryfallIllustrationId": "4b47543f-1b97-4648-9e17-27e094d695ff", "scryfallOracleId": "726c911d-6543-4400-a8fa-b8a5c9f0c15d", "tcgplayerProductId": "123361"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Deadlock Trap", "number": "204s", "printings": ["KLD", "PKLD"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/8d15b986e8a8ed18", "tcgplayer": "https://mtgjson.com/links/1532ecb81ab1725f"}, "rarity": "rare", "rulings": [{"date": "2016-09-20", "text": "Once a player has announced an ability, Deadlock Trap can't be used to undo it. The last ability must be activated before that player activates that ability."}, {"date": "2016-09-20", "text": "Players may respond to Deadlock Trap's last ability by activating an ability of the target permanent if that ability's timing permissions allow it."}, {"date": "2016-09-20", "text": "After a planeswalker enters the battlefield, the active player receives priority and may activate an ability of that planeswalker before any player can activate Deadlock Trap's last ability."}, {"date": "2016-09-20", "text": "A tapped planeswalker can be attacked or dealt damage as normal."}, {"date": "2016-09-20", "text": "If the tapped creature somehow becomes untapped, it can attack and block as normal, but its abilities still can't be activated this turn."}, {"date": "2016-09-20", "text": "Activated abilities contain a colon. They're generally written “[Cost]: [Effect].” Some keywords are activated abilities and will have colons in their reminder text."}, {"date": "2017-02-09", "text": "{E} is the energy symbol. It represents one energy counter."}, {"date": "2017-02-09", "text": "Energy counters are a kind of counter that a player may have. They're not associated with specific permanents. (Other kinds of counters that players may have include poison and experience.)"}, {"date": "2017-02-09", "text": "Keep careful track of how many energy counters each player has. You may do so by keeping a running count on paper, by using a die, or by any other clear and mutually agreeable method."}, {"date": "2017-02-09", "text": "If an effect says you get one or more {E}, you get that many energy counters. To pay one or more {E}, you lose that many energy counters. Any effects that interact with counters a player gets, has, or loses can interact with energy counters."}, {"date": "2017-02-09", "text": "Energy counters aren't mana. They don't go away as steps, phases, and turns end, and effects that add mana “of any type” to your mana pool can't give you energy counters."}, {"date": "2017-02-09", "text": "You can't pay more energy counters than you have."}, {"date": "2018-01-19", "text": "There are many important moments in the story, but the most crucial—called “story spotlights”—are shown on cards. These cards have the Planeswalker symbol in their text box; this symbol has no effect on gameplay. You can read more about these events in the official Magic fiction at http://www.mtgstory.com."}], "securityStamp": "oval", "setCode": "PKLD", "subtypes": [], "supertypes": [], "text": "Deadlock Trap enters the battlefield tapped.\nWhen Deadlock Trap enters the battlefield, you get {E}{E} (two energy counters).\n{T}, Pay {E}: Tap target creature or planeswalker. Its activated abilities can't be activated this turn.", "type": "Artifact", "types": ["Artifact"], "uuid": "3469248a-0ebe-5ca9-bec7-240c47ae38ea", "watermark": "planeswalker"}