{"artist": "Jason A. Engle", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 2.0, "edhrecRank": 3708, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 439926, "name": "Truhe des Toten", "text": "Verzaubert eine Kreatur, die ein Gegner kontrolliert\nWenn die verzauberte Kreatur stirbt, schicke eine Anzahl Karten in Höhe ihrer Stärke oben von der Bibliothek ihres Besitzers ins Exil. Du kannst davon Karten, die keine Länder sind, wirken, solange sie im Exil sind, und um sie zu wirken, kannst du Mana ausgeben, als wäre es Mana eines beliebigen Typs.", "type": "Verzauberung — Aura"}, {"language": "Spanish", "multiverseId": 440129, "name": "Cofre del muerto", "text": "Encantar criatura que controla un oponente.\nCuando la criatura encantada muera, exilia una cantidad de cartas igual a su fuerza de la parte superior de la biblioteca de su propietario. Puedes lanzar cartas que no sean tierra de entre ellas mientras permanezcan exiliadas, y puedes gastar maná como si fuera maná de cualquier tipo para lanzar esos hechizos.", "type": "Encantamiento — Aura"}, {"language": "French", "multiverseId": 440332, "name": "Coffre du moribond", "text": "Enchanter : une créature qu'un adversaire contrôle\nQuand la créature enchantée meurt, exilez un nombre de cartes égal à sa force depuis le dessus de la bibliothèque de son propriétaire. Vous pouvez lancer des cartes non-terrain parmi elles tant qu'elles restent exilées, et vous pouvez dépenser du mana comme s'il s'agissait de mana de n'importe quel type pour lancer ces sorts.", "type": "Enchantement : aura"}, {"language": "Italian", "multiverseId": 440535, "name": "Cassa del Morto", "text": "Incanta creatura controllata da un avversario\nQuando la creatura incantata muore, esilia carte pari alla sua forza dalla cima del grimorio del suo proprietario. Puoi lanciare carte non terra scelte tra esse fintanto che rimangono esiliate e puoi spendere mana come se fosse mana di qualsiasi tipo per lanciare quelle magie.", "type": "Incantesimo — Aura"}, {"language": "Japanese", "multiverseId": 440738, "name": "死者の宝箱", "text": "エンチャント（対戦相手がコントロールしているクリーチャー）\nエンチャントされているクリーチャーが死亡したとき、それのオーナーのライブラリーの一番上から、それのパワーに等しい枚数のカードを追放する。それらのカードが追放され続けているかぎり、あなたはそれらの中から土地でないカードを唱えてもよい。あなたは、それらの呪文を唱えるために、任意のマナを望むタイプのマナであるかのように支払ってもよい。", "type": "エンチャント — オーラ"}, {"language": "Korean", "multiverseId": 440941, "name": "죽은 자의 궤짝", "text": "상대가 조종하는 생물에게 부여\n부여된 생물이 죽을 때, 그 생물의 공격력만큼 소유자의 서고 맨 위 카드를 추방한다. 그 카드들이 추방된 상태로 남아 있는 한 당신은 그 카드들 중 대지가 아닌 카드들을 발동할 수 있으며, 그 주문들을 발동하기 위한 마나는 당신이 원하는 유형의 마나인 것처럼 사용할 수 있다.", "type": "부여마법 — 마법진"}, {"language": "Portuguese (Brazil)", "multiverseId": 441144, "name": "Baú do Morto", "text": "Encantar criatura que um oponente controla\nQuando a criatura encantada morrer, exile do topo do grimório de seu dono uma quantidade de cards igual a seu poder. Você pode conjurar cards que não sejam terrenos dentre eles enquanto eles permanecerem exilados, e você pode gastar mana como se fosse de qualquer tipo para conjurar aquelas mágicas.", "type": "Encantamento — Aura"}, {"language": "Russian", "multiverseId": 441347, "name": "Сундук Мертвеца", "text": "Зачаровать существо под контролем оппонента\nКогда зачарованное существо умирает, изгоните равное значению его силы количество карт с верха библиотеки его владельца. Вы можете разыгрывать находящиеся среди них не являющиеся землями карты, пока они остаются в изгнании, и вы можете тратить ману на разыгрывание тех заклинаний, как если бы это была мана любого типа.", "type": "Чары — Аура"}, {"language": "Chinese Simplified", "multiverseId": 441550, "name": "死魂棺", "text": "结附于由对手操控的生物\n当所结附的生物死去时，放逐其拥有者牌库顶的若干牌，其数量等同于该生物的力量。于这些牌持续被放逐期间，你可以施放其中的非地牌，且你可以将法术力视同任意种类的法术力来支付施放这些咒语的费用。", "type": "结界 ～灵气"}, {"language": "Chinese Traditional", "multiverseId": 441753, "name": "死魂棺", "text": "結附於由對手操控的生物\n當所結附的生物死去時，放逐其擁有者牌庫頂的若干牌，其數量等同於該生物的力量。於這些牌持續被放逐期間，你可以施放其中的非地牌，且你可以將魔法力視同任意種類的魔法力來支付施放這些咒語的費用。", "type": "結界 ～靈氣"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "216341", "cardKingdomId": "216060", "cardsphereId": "53020", "mcmId": "315313", "mcmMetaId": "236118", "mtgArenaId": "66749", "mtgjsonV4Id": "552e0d80-4dd2-5f93-8638-7958e6700c3f", "mtgoId": "66585", "multiverseId": "439723", "scryfallId": "a76ac1d9-b0df-4dec-b133-057cc5902071", "scryfallIllustrationId": "62928d3d-e78e-4ca9-a7d8-61592aaafae4", "scryfallOracleId": "e5fdd6fd-6492-47ec-8b74-9ff22ff9849a", "tcgplayerProductId": "155631"}, "keywords": ["Enchant"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{B}", "manaValue": 2.0, "name": "Dead Man's Chest", "number": "66", "originalText": "Enchant creature an opponent controls\nWhen enchanted creature dies, exile cards equal to its power from the top of its owner's library. You may cast nonland cards from among them for as long as they remain exiled, and you may spend mana as though it were mana of any type to cast those spells.", "originalType": "Enchantment — Aura", "printings": ["AFC", "PRIX", "RIX"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/dce56cc4453065ce", "cardKingdomFoil": "https://mtgjson.com/links/5cd6c25e0ae0579c", "cardmarket": "https://mtgjson.com/links/a29172022d2e42a8", "tcgplayer": "https://mtgjson.com/links/1707ccb85135bf7b"}, "rarity": "rare", "rulings": [{"date": "2018-01-19", "text": "If you gain control of the enchanted creature, Dead Man's Chest will be put into your graveyard."}, {"date": "2018-01-19", "text": "If Dead Man's Chest and the enchanted creature are both put into graveyards at the same time, the last ability of Dead Man's Chest still triggers."}, {"date": "2018-01-19", "text": "To determine how many cards to exile, use the enchanted creature's power as it last existed on the battlefield."}, {"date": "2018-01-19", "text": "You are a creature's owner if the card representing it began the game in your deck, or if it's a token that entered the battlefield under your control. If Dead Man's Chest enchants a creature that you own but an opponent controls, you'll exile cards from your library."}, {"date": "2018-01-19", "text": "The effect of Dead Man's Chest doesn't change when you can cast the exiled cards. For example, if you exile a creature card without flash, you can cast it only during your main phase when the stack is empty."}, {"date": "2018-01-19", "text": "Casting an exiled card causes it to leave exile. You can't cast it multiple times."}, {"date": "2018-01-19", "text": "In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. If you leave the game, any spells or permanents you control from Dead Man's Chest's ability are exiled."}], "securityStamp": "oval", "setCode": "RIX", "subtypes": ["Aura"], "supertypes": [], "text": "Enchant creature an opponent controls\nWhen enchanted creature dies, exile cards equal to its power from the top of its owner's library. You may cast spells from among those cards for as long as they remain exiled, and you may spend mana as though it were mana of any type to cast those spells.", "type": "Enchantment — Aura", "types": ["Enchantment"], "uuid": "8d69d6c6-47ac-5123-bb00-eb4f1a948ee8"}