{"artist": "Svetlin Velinov", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 3.0, "edhrecRank": 16997, "finishes": ["nonfoil", "foil"], "flavorText": "Many venture out to hunt for treasures. Others lie in wait to hunt the hunters.", "foreignData": [{"flavorText": "Viele wagen sich auf Schatzsuche. Andere warten in ihrem Versteck, um die Schatzsucher zu suchen.", "language": "German", "multiverseId": 210615, "name": "Abrechnung der Toten", "text": "Du kannst eine Kreaturenkarte deiner Wahl aus deinem Friedhof oben auf deine Bibliothek legen. Falls du dies tust, fügt die Abrechnung der Toten einer Kreatur deiner Wahl Schadenspunkte in Höhe der Stärke der Kreaturenkarte zu.", "type": "Hexerei"}, {"flavorText": "Muchos se aventuran para cazar tesoros. Otros esperan para cazar a los cazadores.", "language": "Spanish", "multiverseId": 211630, "name": "Cálculo mortal", "text": "Puedes poner la carta de criatura objetivo de tu cementerio en la parte superior de tu biblioteca. Si lo haces, el Cálculo mortal hace una cantidad de daño igual a la fuerza de esa carta a la criatura objetivo.", "type": "Conjuro"}, {"flavorText": "Nombreux sont ceux qui chassent les trésors. Bien d'autres attendent patiemment de chasser les chasseurs.", "language": "French", "multiverseId": 211340, "name": "Estime", "text": "Vous pouvez mettre une carte de créature ciblée de votre cimetière au-dessus de votre bibliothèque. Si vous faites ainsi, l'Estime inflige à la créature ciblée un nombre de blessures égal à la force de cette carte.", "type": "Rituel"}, {"flavorText": "Molti si avventurano a caccia di tesori. Altri aspettano semplicemente di cacciare i cacciatori.", "language": "Italian", "multiverseId": 211195, "name": "Vendetta dei Morti", "text": "Puoi mettere una carta creatura bersaglio dal tuo cimitero in cima al tuo grimorio. Se lo fai, la Vendetta dei Morti infligge danni pari alla forza di quella carta a una creatura bersaglio.", "type": "Stregoneria"}, {"flavorText": "宝を求めて外に出る者は大勢いる。 その一方、冒険者を求めて待ち伏せをする者もいる。", "language": "Japanese", "multiverseId": 210760, "name": "死の報い", "text": "あなたの墓地にあるクリーチャー・カード１枚とクリーチャー１体を対象とする。あなたはその前者を、あなたのライブラリーの一番上に置いてもよい。 そうした場合、死の報いはその後者に、その前者のパワーに等しい点数のダメージを与える。", "type": "ソーサリー"}, {"flavorText": "Muitos se aventuram para caçar tesouros. Outros aguardam para caçar os caçadores.", "language": "Portuguese (Brazil)", "multiverseId": 210905, "name": "Contagem dos Mortos", "text": "Você pode colocar o card de criatura alvo de seu cemitério no topo de seu grimório. Se fizer isso, Contagem dos Mortos causa dano igual ao poder daquele card à criatura alvo.", "type": "Feitiço"}, {"flavorText": "Многие отваживаются на поиски сокровищ. А некоторые, наоборот, сидят в засаде, подкарауливая таких вот смельчаков.", "language": "Russian", "multiverseId": 211485, "name": "Расчет Мертвецов", "text": "Вы можете положить целевую карту существа с вашего кладбища на верх вашей библиотеки. Если вы это делаете, Расчет Мертвецов наносит целевому существу повреждения, равные силе той карты.", "type": "Волшебство"}, {"flavorText": "许多人为寻宝而出发冒险。 其他的则躺着要猎杀猎人。", "language": "Chinese Simplified", "multiverseId": 211050, "name": "亡者报复", "text": "你可以将目标生物牌从你坟墓场置于你的牌库顶。 如果你如此作，则亡者报复对目标生物造成伤害，其数量等同于该牌的力量。", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "130270", "cardKingdomId": "130123", "cardsphereId": "47389", "mcmId": "22224", "mcmMetaId": "11060", "mtgjsonV4Id": "ea353cf3-0aa7-5a16-acf9-1d0b12e47098", "mtgoFoilId": "35720", "mtgoId": "35719", "multiverseId": "194679", "scryfallId": "ad16a3b8-e99e-47ed-92ce-ef42310f9f46", "scryfallIllustrationId": "e77cfb19-3b91-4939-8599-6ce0688293fb", "scryfallOracleId": "2a4b77f0-81ac-48a6-961b-bd63e99f74cf", "tcgplayerProductId": "34356"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{B}{B}", "manaValue": 3.0, "name": "Dead Reckoning", "number": "56", "originalText": "You may put target creature card from your graveyard on top of your library. If you do, Dead Reckoning deals damage equal to that card's power to target creature.", "originalType": "Sorcery", "printings": ["WWK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/bdb7be342c3f8602", "cardKingdomFoil": "https://mtgjson.com/links/fa2dd5ef032dd48d", "cardmarket": "https://mtgjson.com/links/4f40a1211f199018", "tcgplayer": "https://mtgjson.com/links/f361359221c4aeb1"}, "rarity": "common", "rulings": [{"date": "2010-03-01", "text": "You must choose two targets as you cast Dead Reckoning: a creature card in your graveyard and a creature on the battlefield. If you can’t, then you can’t cast the spell."}, {"date": "2010-03-01", "text": "If the targeted creature card is an illegal target as Dead Reckoning resolves (because it’s no longer in your graveyard, perhaps), you can’t choose to put it on top of your library. No damage will be dealt."}, {"date": "2010-03-01", "text": "If the targeted creature is an illegal target as Dead Reckoning resolves (because it’s no longer on the battlefield, perhaps), you may still put the targeted creature card from your graveyard on top of your library. No damage will be dealt."}, {"date": "2010-03-01", "text": "Dead Reckoning deals damage equal to the power the creature card had while it was in your graveyard. This could matter if that card is something like Lord of Extinction or Tarmogoyf whose power is determined by a characteristic-defining ability that checks the contents of your graveyard."}], "setCode": "WWK", "subtypes": [], "supertypes": [], "text": "You may put target creature card from your graveyard on top of your library. If you do, Dead Reckoning deals damage equal to that card's power to target creature.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "3c8755d7-9029-5e21-9de7-f72603fac77c"}