{"artist": "Don Hazeltine", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 3.0, "edhrecRank": 16005, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 175835, "name": "Verwesende Erde", "text": "Entferne zu Beginn deines Versorgungssegments eine Karte aus deinem Friedhof ganz aus dem Spiel.\nGrenzwert Immer wenn eine Nicht-Spielsteinkreatur aus dem Spiel auf deinen Friedhof gelegt wird, kannst du {1} bezahlen. Falls du dies tust, bringe jene Karte auf deine Hand zurück. (Du hast den Grenzwert erreicht, solange sieben oder mehr Karten in deinem Friedhof sind.)", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 177247, "name": "Tierra pútrida", "text": "Al comienzo de tu mantenimiento, remueve del juego una carta de tu cementerio.\nUmbral Siempre que una criatura que no sea ficha vaya a tu cementerio desde el juego, puedes pagar {1}. Si lo haces, regresa esa carta a tu mano. (Tienes umbral mientras haya siete o más cartas en tu cementerio.)", "type": "Encantamiento"}, {"language": "French", "multiverseId": 176187, "name": "Sol en décomposition", "text": "Au début de votre entretien, retirez de la partie une carte de votre cimetière.\nSeuil — À chaque fois qu'une créature non-jeton est mise dans votre cimetière depuis le jeu, vous pouvez payer {1}. Si vous faites ainsi, renvoyez cette carte dans votre main. (Vous avez le seuil tant qu'il y a sept cartes ou plus dans votre cimetière.)", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 176696, "name": "Terreno Putrescente", "text": "All'inizio del tuo mantenimento, rimuovi dal gioco una carta presente nel tuo cimitero.\nSoglia Ogniqualvolta una creatura non pedina viene messa nel tuo cimitero dal gioco, puoi spendere {1}. Se lo fai, riprendi in mano quella carta. (hai soglia fintanto che ci sono almeno sette carte nel tuo cimitero).", "type": "Incantesimo"}, {"language": "Japanese", "name": "衰微する土"}, {"language": "Portuguese (Brazil)", "multiverseId": 178690, "name": "Solo Decadente", "text": "No início de sua manutenção, remova de jogo um card de seu cemitério.\nLimiar — Toda vez que uma criatura que não seja uma ficha for colocada em seu cemitério vinda de jogo, você pode pagar {1}. Se o fizer, devolva aquele card para sua mão. (Você atinge o limiar desde que haja sete ou mais cards em seu cemitério.)", "type": "Encantamento"}], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "55126", "cardKingdomId": "54126", "cardsphereId": "33894", "mcmId": "2539", "mcmMetaId": "1378", "mtgjsonV4Id": "8052df5d-f194-5444-8248-14d5182f4a80", "mtgoFoilId": "16748", "mtgoId": "16747", "multiverseId": "29955", "scryfallId": "f2bea0ec-52e0-4f45-a445-8805dc6ed596", "scryfallIllustrationId": "5f145b5f-2f5d-4633-a54e-4ebf905f11ce", "scryfallOracleId": "3a58d68c-7683-4543-a929-8ef12641a564", "tcgplayerProductId": "9402"}, "keywords": ["Threshold"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "penny": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{1}{B}{B}", "manaValue": 3.0, "name": "Decaying Soil", "number": "127", "originalText": "At the beginning of your upkeep, remove a card in your graveyard from the game.\nThreshold Whenever a nontoken creature is put into your graveyard from play, you may pay o1. If you do, return that card to your hand. (You have threshold as long as seven or more cards are in your graveyard.)", "originalType": "Enchantment", "printings": ["ODY"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/eeeea93f1a9d814e", "cardKingdomFoil": "https://mtgjson.com/links/0b487904b7042b82", "cardmarket": "https://mtgjson.com/links/4975687855b373f9", "tcgplayer": "https://mtgjson.com/links/6eeca5e8c9d00dde"}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "Multiple creatures going to the graveyard at the same time all end up there at once, so either all of them or none of them will cause the trigger to go off, depending on whether or not Threshold was met prior to the creatures going to the graveyard."}, {"date": "2004-10-04", "text": "The ability in Threshold will trigger only if Threshold was met before the creature goes to the graveyard. So the one that causes Threshold to be met will not trigger the ability."}], "setCode": "ODY", "subtypes": [], "supertypes": [], "text": "At the beginning of your upkeep, exile a card from your graveyard.\nThreshold — As long as seven or more cards are in your graveyard, Decaying Soil has \"Whenever a nontoken creature is put into your graveyard from the battlefield, you may pay {1}. If you do, return that card to your hand.\"", "type": "Enchantment", "types": ["Enchantment"], "uuid": "4dd19d9f-cc17-546b-bb1b-289678106664"}