{"artist": "Tyler Jacobson", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 2.0, "edhrecRank": 8440, "finishes": ["nonfoil", "foil"], "flavorText": "The message was clear to Sorin—Nahiri had paid Markov Manor a visit.", "foreignData": [{"flavorText": "Für Sorin war die Botschaft eindeutig: Nahiri hatte dem Anwesen der Markovs einen Besuch abgestattet.", "language": "German", "multiverseId": 410740, "name": "Verkündung in Stein", "text": "Schicke eine Kreatur deiner Wahl und alle anderen Kreaturen, die ihr Beherrscher kontrolliert und die den gleichen Namen haben wie diese, ins Exil. Dieser Spieler stellt für jede auf diese Weise ins Exil geschickte Nichtspielsteinkreatur Nachforschungen an.", "type": "Hexerei"}, {"flavorText": "El mensaje estaba claro para Sorin: Nahiri había visitado la mansión Markov.", "language": "Spanish", "multiverseId": 413050, "name": "Declaración en piedra", "text": "Exilia la criatura objetivo y todas las otras criaturas con el mismo nombre que controle su controlador. Ese jugador investiga por cada criatura que no sea ficha exiliada de esta manera.", "type": "Conjuro"}, {"flavorText": "Pour Sorin, le message était clair : Nahiri avait rendu une petite visite au Manoir Markov.", "language": "French", "multiverseId": 411070, "name": "Déclaration dans la pierre", "text": "Exilez la créature ciblée et toutes les autres créatures que son contrôleur contrôle ayant le même nom que cette créature. Ce joueur enquête pour chaque créature non-jeton exilée de cette manière.", "type": "Rituel"}, {"flavorText": "Per Sorin, il messaggio era chiaro: Nahiri aveva fatto visita al Maniero Markov.", "language": "Italian", "multiverseId": 411400, "name": "Dichiarazione nella Pietra", "text": "Esilia una creatura bersaglio e tutte le altre creature controllate dal suo controllore che hanno lo stesso nome di quella creatura. Quel giocatore indaga per ogni creatura non pedina esiliata in questo modo.", "type": "Stregoneria"}, {"flavorText": "これがどういうことなのかソリンには明白だった。ナヒリがマルコフ荘園に来たのだ。", "language": "Japanese", "multiverseId": 411730, "name": "石の宣告", "text": "クリーチャー１体を対象とする。それと、それのコントローラーがコントロールするそれと同じ名前を持つ他のクリーチャーをすべて追放する。そのプレイヤーは、これにより追放されたトークンでないクリーチャー１体につき１回調査を行う。", "type": "ソーサリー"}, {"flavorText": "소린은 나히리가 마르코프 저택을 다녀갔다는 것을 분명히 알 수 있었다.", "language": "Korean", "multiverseId": 412060, "name": "암석 포고문", "text": "생물을 목표로 정한다. 그 생물을 추방하고 그 생물의 조종자가 조종하는 생물 중 그 생물과 이름이 같은 다른 생물을 모두 추방한다. 그 플레이어는 이런 식으로 토큰이 아닌 생물이 추방될 때마다 조사한다.", "type": "집중마법"}, {"flavorText": "A mensagem estava clara para Sorin — Nahiri fizera uma visita à Mansão Markov.", "language": "Portuguese (Brazil)", "multiverseId": 412390, "name": "Declaração em Pedra", "text": "Exile a criatura alvo e todas as outras criaturas que seu controlador controla com o mesmo nome daquela criatura. Aquele jogador investiga para cada criatura exilada desta forma que não seja uma ficha.", "type": "Feitiço"}, {"flavorText": "Сорин сразу понял смысл этого послания: Нахири нанесла визит в поместье Марковых.", "language": "Russian", "multiverseId": 412720, "name": "Заявление в Камне", "text": "Изгоните целевое существо и все другие существа с тем же именем, что у него, под контролем контролирующего его игрока. Тот игрок использует Дознание за каждое не являющееся фишкой существо, изгнанное таким образом.", "type": "Волшебство"}, {"flavorText": "索霖得到的讯息很清楚～娜希丽拜访过马可夫庄园。", "language": "Chinese Simplified", "multiverseId": 410080, "name": "铸石以告", "text": "选择目标生物。放逐该生物和所有由它的操控者操控且与之同名的其他生物。每以此法放逐一个非衍生物的生物，该牌手便探查一次。", "type": "法术"}, {"flavorText": "索霖得到的訊息很清楚～娜希麗拜訪過馬可夫莊園。", "language": "Chinese Traditional", "multiverseId": 410410, "name": "鑄石以告", "text": "選擇目標生物。放逐該生物和所有由它的操控者操控且與之同名的其他生物。每以此法放逐一個非衍生物的生物，該玩家便探查一次。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "206043", "cardKingdomId": "205555", "cardsphereId": "41726", "mcmId": "288644", "mcmMetaId": "222096", "mtgjsonV4Id": "01931cfc-8347-5050-86c6-a990a287a010", "mtgoFoilId": "59879", "mtgoId": "59878", "multiverseId": "409750", "scryfallId": "f685445d-e2af-455f-b3b2-97cf15362f3c", "scryfallIllustrationId": "73f500d2-4e90-4f73-b997-73ef0757ecc7", "scryfallOracleId": "49554441-bb48-4829-b8d6-55e687a6c2e2", "tcgplayerProductId": "114852"}, "keywords": ["Investigate"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}", "manaValue": 2.0, "name": "Declaration in Stone", "number": "12", "originalText": "Exile target creature and all other creatures its controller controls with the same name as that creature. That player investigates for each nontoken creature exiled this way.", "originalType": "Sorcery", "printings": ["HA4", "NCC", "PSOI", "SOI"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/8084d05e4e282c6e", "cardKingdomFoil": "https://mtgjson.com/links/81942d8434ded30b", "cardmarket": "https://mtgjson.com/links/62366fd5427562ac", "tcgplayer": "https://mtgjson.com/links/72d738426fcd9b7d"}, "rarity": "rare", "rulings": [{"date": "2016-04-08", "text": "The token is named Clue Token and has the artifact subtype Clue. Clue isn't a creature type."}, {"date": "2016-04-08", "text": "The tokens are normal artifacts. For example, they can be sacrificed to cast Angelic Purge or targeted by Root Out."}, {"date": "2016-04-08", "text": "If you sacrifice a Clue for another card's cost or effect, such as that of Angelic Purge or Tamiyo's Journal, you can't also pay {2} and sacrifice it to draw a card."}, {"date": "2016-04-08", "text": "A face-down creature, such as one cast with a megamorph ability from the Dragons of Tarkir set, has no name and can't share a name with any other creatures."}, {"date": "2016-04-08", "text": "If the target creature is an illegal target when Declaration in Stone tries to resolve, it won't resolve and none of its effects will happen. No creatures will be exiled, including those with the same name as the target."}, {"date": "2016-04-08", "text": "It's possible to have a creature and a noncreature permanent with the same name, such as two copies of the same land, one of which has become a land creature. Only creatures with that name are exiled by Declaration in Stone."}, {"date": "2016-04-08", "text": "Declaration in Stone has only one target. The other creatures with that name aren't targeted. For example, a creature with hexproof will be exiled if it has the same name as the target creature."}, {"date": "2022-06-10", "text": "Unless a token is a copy of another permanent or was explicitly given a name by the effect that created it, its name is the subtypes it was given when it was created plus the word \"Token.\" For example, if an effect creates a 1/1 Soldier creature token, that token is named \"Soldier Token.\""}], "securityStamp": "oval", "setCode": "SOI", "subtypes": [], "supertypes": [], "text": "Exile target creature and all other creatures its controller controls with the same name as that creature. That player investigates for each nontoken creature exiled this way.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "fb2bfd69-920b-56fa-9b32-fb80d99509c8"}