{"artist": "Adam Rex", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 8.0, "edhrecRank": 5831, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 165989, "name": "Dekret des Schweigens", "text": "Immer wenn ein Gegner einen Zauberspruch spielt, neutralisiere ihn und lege eine Entleerungsmarke auf das Dekret des Schweigens. Falls drei oder mehr Entleerungsmarken auf dem Dekret des Schweigens liegen, opfere sie.\nUmwandlung {4}{U}{U}\nWenn du das Dekret des Schweigens umwandelst, kannst du einen Zauberspruch deiner Wahl neutralisieren.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 166562, "name": "Decreto de silencio", "text": "Siempre que un oponente juegue un hechizo, contrarresta ese hechizo y pon un contador de agotamiento sobre el Decreto de silencio. Si hay tres o más contadores de agotamiento sobre el Decreto de silencio, sacrifícalo.\nCiclo {4}{U}{U}.\nCuando uses la habilidad de ciclo del Decreto de silencio, puedes contrarrestar el hechizo objetivo.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 166132, "name": "Décret de silence", "text": "À chaque fois qu'un adversaire joue un sort, contrez ce sort et placez un marqueur « sec » sur le Décret de silence. Quand il y a au moins trois marqueurs « sec » sur le Décret de silence, sacrifiez-le.\nRecyclage {4}{U}{U}\nQuand vous recyclez le Décret de silence, vous pouvez contrer le sort ciblé.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 166275, "name": "Decreto del Silenzio", "text": "Ogniqualvolta un avversario gioca una magia, neutralizza quella magia e metti un segnalino svuotamento sul Decreto del Silenzio. Se ci sono almeno tre segnalini svuotamento sul Decreto del Silenzio, sacrificalo.\nCiclo {4}{U}{U}\nQuando usi l'abilità ciclo del Decreto del Silenzio, puoi neutralizzare una magia bersaglio.", "type": "Incantesimo"}, {"language": "Japanese", "name": "静寂の命令"}, {"language": "Portuguese (Brazil)", "multiverseId": 166418, "name": "Decreto de Silêncio", "text": "Toda vez que um oponente jogar uma mágica, anule aquela mágica e coloque um marcador de depleção em Decreto de Silêncio. Se houver três ou mais marcadores de depleção em Decreto de Silêncio, sacrifique-o.\nReciclar {4}{U}{U}\nQuando reciclar Decreto do Silêncio, você pode anular a mágica alvo.", "type": "Encantamento"}], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "67031", "cardKingdomId": "66031", "cardsphereId": "40789", "mcmId": "1025", "mcmMetaId": "1388", "mtgjsonV4Id": "33fc528e-5179-5eef-99fa-5bb8183bb77d", "mtgoFoilId": "18897", "mtgoId": "18896", "multiverseId": "46430", "scryfallId": "f2fc46e2-5e19-4999-a4cd-1e84697066c1", "scryfallIllustrationId": "064fcd41-176d-460d-8e63-8437cfa9b4b1", "scryfallOracleId": "920684d0-aef3-4408-a66b-a0c9394c58f4", "tcgplayerProductId": "10829"}, "keywords": ["Cycling"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{6}{U}{U}", "manaValue": 8.0, "name": "Decree of Silence", "number": "32", "originalText": "Whenever an opponent plays a spell, counter that spell and put a depletion counter on Decree of Silence. If there are three or more depletion counters on Decree of Silence, sacrifice it.\nCycling {4}{U}{U}\nWhen you cycle Decree of Silence, you may counter target spell.", "originalType": "Enchantment", "printings": ["SCG"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/b19d312ea08489f6", "cardKingdomFoil": "https://mtgjson.com/links/48bff22daddd1d6b", "cardmarket": "https://mtgjson.com/links/1a42e669f88ff9e3", "tcgplayer": "https://mtgjson.com/links/9e74c1bebef17224"}, "rarity": "rare", "rulings": [{"date": "2008-10-01", "text": "Cycling is an activated ability. Effects that interact with activated abilities (such as Stifle or Rings of Brighthearth) will interact with cycling. Effects that interact with spells (such as Remove Soul or Faerie Tauntings) will not."}, {"date": "2008-10-01", "text": "When you cycle this card, first the cycling ability goes on the stack, then the triggered ability goes on the stack on top of it. The triggered ability will resolve before you draw a card from the cycling ability."}, {"date": "2008-10-01", "text": "The cycling ability and the triggered ability are separate. If the triggered ability doesn’t resolve (due to being countered with Stifle, for example, or if all its targets have become illegal), the cycling ability will still resolve and you’ll draw a card."}, {"date": "2008-10-01", "text": "You can cycle this card even if there are no targets for the triggered ability. That’s because the cycling ability itself has no targets."}], "setCode": "SCG", "subtypes": [], "supertypes": [], "text": "Whenever an opponent casts a spell, counter that spell and put a depletion counter on Decree of Silence. If there are three or more depletion counters on Decree of Silence, sacrifice it.\nCycling {4}{U}{U} ({4}{U}{U}, Discard this card: Draw a card.)\nWhen you cycle Decree of Silence, you may counter target spell.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "253cfe94-24d3-592b-84f2-a625a59046c1"}