{"artist": "Christopher Moeller", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 10.0, "edhrecRank": 3345, "finishes": ["nonfoil", "foil"], "flavorText": "The rift remained open for days, sluicing ancient seawater. It closed only after the last great tentacle squirmed its way through.", "foreignData": [{"flavorText": "Die Spalte blieb tagelang offen und ließ uraltes Meerwasser einströmen. Sie schloss sich erst, als sich auch der letzte Riesententakel hindurchgequetscht hatte.", "language": "German", "multiverseId": 132903, "name": "Tiefseekrake", "text": "Der Tiefseekrake ist unblockbar.\nAussetzen 9 {2}{U}\nImmer wenn ein Gegner einen Zauberspruch spielt, entferne eine Zeitmarke vom Tiefseekraken, falls er ausgesetzt ist.", "type": "Kreatur — Krake"}, {"flavorText": "La grieta permaneció abierta por días, vertiendo agua marina antigua. Se cerró sólo después de que el último gran tentáculo se deslizó a través de ella.", "language": "Spanish", "multiverseId": 134408, "name": "Kraken del mar profundo", "text": "El Kraken del mar profundo es imbloqueable.\nSuspender 9—{2}{U}.\nSiempre que un oponente juegue un hechizo, si el Kraken del mar profundo está suspendido, remueve un contador de tiempo de él.", "type": "Criatura — Kraken"}, {"flavorText": "La faille demeura ouverte pendant des jours, déversant son flot d'eau de mer ancestrale. Elle ne se referma qu'une fois que le dernier grand tentacule s'y fut faufilé.", "language": "French", "multiverseId": 132602, "name": "Kraken des abîmes", "text": "Le Kraken des abîmes est imblocable.\nSuspension 9 — {2}{U}\nÀ chaque fois qu'un adversaire joue un sort, si le Kraken des abîmes est en suspension, retirez-lui un marqueur « temps ».", "type": "Créature : kraken"}, {"flavorText": "Lo squarcio rimase aperto per giorni, inondando tutto di antica acqua salmastra. Si chiuse solo dopo che l'ultimo grande tentacolo si era fatto largo contorcendosi.", "language": "Italian", "multiverseId": 133204, "name": "Kraken delle Profondità", "text": "La Kraken delle Profondità non può essere bloccata.\nSospendere 9—{2}{U}\nOgniqualvolta un avversario gioca una magia, se la Kraken delle Profondità è sospesa, rimuovi un segnalino tempo da essa.", "type": "Creatura — Kraken"}, {"flavorText": "裂け目は何日もの間、そこから古代の海水を放出し続けていた。 それが閉じたのは、最後の触手がうねり出た後のことだった。", "language": "Japanese", "multiverseId": 133505, "name": "深海のクラーケン", "text": "深海のクラーケンはブロックされない。\n待機 ９―{2}{U}\nいずれかの対戦相手が呪文をプレイするたび、深海のクラーケンが待機状態である場合、それの上から時間カウンターを１個取り除く。", "type": "クリーチャー — クラーケン"}, {"flavorText": "A fenda permaneceu aberta por dias, jorrando as águas de um mar primitivo. Ela só se fechou depois que o último grande tentáculo passou.", "language": "Portuguese (Brazil)", "multiverseId": 133806, "name": "Kraken do Mar Profundo", "text": "Kraken do Mar Profundo não pode ser bloqueado.\nSuspender 9—{2}{U}\nToda vez que um oponente jogar uma mágica, se Kraken do Mar Profundo estiver suspenso, remova um marcador temporal dele.", "type": "Criatura — Kraken"}, {"flavorText": "Разлом оставался открытым многие дни, пропуская древние морские воды. Но все же он закрылся, когда последнее из громадных щупалец проскользнуло через него.", "language": "Russian", "multiverseId": 134107, "name": "Глубоководный Кракен", "text": "Глубоководный Кракен не блокируется.\nОтсрочка 9—{2}{U}\nКогда оппонент играет заклинание, если Глубоководный Кракен отсрочен, удалите с него один временной жетон.", "type": "Существо — Кракен"}, {"flavorText": "时缝连着打开了几天，泄出远古海水。 直到最后一个巨大触手从其间挤出来，才得以关闭。", "language": "Chinese Simplified", "multiverseId": 132301, "name": "深海巨怪", "text": "深海巨怪不能被阻挡。\n延缓9～{2}{U}\n每当任一对手使用咒语时，若深海巨怪已延缓，则从其上移去一个计时指示物。", "type": "生物～巨海兽"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "121506", "cardKingdomId": "121216", "cardsphereId": "44208", "mcmId": "13806", "mcmMetaId": "8353", "mtgjsonV4Id": "0e447c0b-7b5d-5e9e-a305-42b071974a27", "mtgoFoilId": "25612", "mtgoId": "25611", "multiverseId": "113506", "scryfallId": "8e050532-e245-4eea-90a5-03e3e410dcbe", "scryfallIllustrationId": "0f753685-6a01-4c89-9bbd-cb86241093e0", "scryfallOracleId": "54de4a7f-86f4-4029-80f7-bc25d6509cc8", "tcgplayerProductId": "14199"}, "keywords": ["Suspend"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{7}{U}{U}{U}", "manaValue": 10.0, "name": "Deep-Sea Kraken", "number": "56", "originalText": "Deep-Sea Kraken is unblockable.\nSuspend 9—{2}{U}\nWhenever an opponent plays a spell, if Deep-Sea Kraken is suspended, remove a time counter from it.", "originalType": "Creature - Kraken", "power": "6", "printings": ["C14", "DDS", "TSP"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/23f73bcd3e10109d", "cardKingdomFoil": "https://mtgjson.com/links/78566afa41b82f94", "cardmarket": "https://mtgjson.com/links/6eb48dabdb37ca55", "tcgplayer": "https://mtgjson.com/links/56ddb98c0784ed6c"}, "rarity": "rare", "rulings": [{"date": "2021-06-18", "text": "Suspend is a keyword that represents three abilities. The first is a static ability that allows you to exile the card from your hand with the specified number of time counters (the number before the dash) on it by paying its suspend cost (listed after the dash). The second is a triggered ability that removes a time counter from the suspended card at the beginning of each of your upkeeps. The third is a triggered ability that causes you to cast the card when the last time counter is removed. If you cast a creature spell this way, it gains haste until you lose control of that creature (or, in rare cases, you lose control of the creature spell while it’s on the stack)."}, {"date": "2021-06-18", "text": "You can exile a card in your hand using suspend any time you could cast that card. Consider its card type, any effects that modify when you could cast it (such as flash) and any other effects that stop you from casting it (such as from Meddling Mage’s ability) to determine if and when you can do this. Whether you could actually complete all steps in casting the card is irrelevant. For example, you can exile a card with suspend that has no mana cost or that requires a target even if no legal targets are available at that time."}, {"date": "2021-06-18", "text": "Cards exiled with suspend are exiled face up."}, {"date": "2021-06-18", "text": "Exiling a card with suspend isn’t casting that card. This action doesn’t use the stack and can’t be responded to."}, {"date": "2021-06-18", "text": "If the spell requires any targets, those targets are chosen when the spell is finally cast, not when it’s exiled."}, {"date": "2021-06-18", "text": "If an effect refers to a “suspended card,” that means a card that (1) has suspend, (2) is in exile, and (3) has one or more time counters on it."}, {"date": "2021-06-18", "text": "If the first triggered ability of suspend (the one that removes time counters) is countered, no time counter is removed. The ability will trigger again at the beginning of the card’s owner’s next upkeep."}, {"date": "2021-06-18", "text": "When the last time counter is removed, the second triggered ability of suspend (the one that lets you cast the card) triggers. It doesn’t matter why the last time counter was removed or what effect removed it."}, {"date": "2021-06-18", "text": "If the second triggered ability is countered, the card can’t be cast. It remains exiled with no time counters on it, and it’s no longer suspended."}, {"date": "2021-06-18", "text": "As the second triggered ability resolves, you must cast the card if able. You must do so even if it requires targets and the only legal targets are ones that you really don’t want to target. Timing permissions based on the card’s type are ignored."}, {"date": "2021-06-18", "text": "If you can’t cast the card, perhaps because there are no legal targets available, it remains exiled with no time counters on it, and it’s no longer suspended."}, {"date": "2021-06-18", "text": "If you cast a card “without paying its mana cost,” such as with suspend, you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those if you want to cast the card."}, {"date": "2021-06-18", "text": "You are never forced to activate mana abilities to pay costs, so if there is a mandatory additional mana cost (such as from Thalia, Guardian of Thraben), you can decline to activate mana abilities to pay for it and hence fail to cast the suspended card, leaving it in exile."}, {"date": "2021-06-18", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2021-06-18", "text": "The mana value of a spell cast without paying its mana cost is determined by its mana cost, even though that cost wasn’t paid."}, {"date": "2021-06-18", "text": "A creature cast using suspend will enter the battlefield with haste. It will have haste until another player gains control of it. (In some rare cases, another player may gain control of the creature spell itself. If this happens, the creature won’t enter the battlefield with haste.)"}], "setCode": "TSP", "subtypes": ["Kraken"], "supertypes": [], "text": "Deep-Sea Kraken can't be blocked.\nSuspend 9—{2}{U} (Rather than cast this card from your hand, you may pay {2}{U} and exile it with nine time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost. It has haste.)\nWhenever an opponent casts a spell, if Deep-Sea Kraken is suspended, remove a time counter from it.", "toughness": "6", "type": "Creature — Kraken", "types": ["Creature"], "uuid": "0e4b4d39-e2d1-52fc-bbc0-2932a1f1a442"}