{"artist": "Svetlin Velinov", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 690, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 509715, "name": "Verzögern", "text": "Neutralisiere einen Zauberspruch deiner Wahl. Falls der Zauberspruch auf diese Weise neutralisiert wird, schicke ihn mit drei Zeitmarken ins Exil, anstatt ihn auf den Friedhof seines Besitzers zu legen. Falls er nicht Aussetzen hat, erhält er Aussetzen. (Entferne zu Beginn des Versorgungssegments ihres Besitzers eine Zeitmarke von der Karte. Wenn die letzte Zeitmarke entfernt wird, spielt der Spieler sie, ohne ihre Manakosten zu bezahlen. Falls sie eine Kreatur ist, hat sie Eile.)", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 510004, "name": "Retrasar", "text": "Contrarresta el hechizo objetivo. Si el hechizo es contrarrestado de esta manera, exílialo con tres contadores de tiempo sobre él en vez de ponerlo en el cementerio de su propietario. Si no tiene la habilidad de suspender, gana la habilidad de suspender. (Al comienzo del mantenimiento de su propietario, remueve un contador de tiempo de esa carta. Cuando sea removido el último, el jugador la lanza sin pagar su coste de maná. Si es una criatura, tiene la habilidad de prisa.)", "type": "Instantáneo"}, {"language": "French", "multiverseId": 510293, "name": "Retard", "text": "Contrecarrez un sort ciblé. Si ce sort est contrecarré de cette manière, exilez-le avec trois marqueurs « temps » sur lui à la place de le mettre dans le cimetière de son propriétaire. S'il n'a pas la suspension, il acquiert la suspension. (Au début de l'entretien de son propriétaire, retirez un marqueur « temps » de cette carte. Quand le dernier marqueur est retiré, le joueur joue cette carte sans payer son coût de mana. Si c'est une créature, elle a la célérité.)", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 510582, "name": "Ritardo", "text": "Neutralizza una magia bersaglio. Se la magia è neutralizzata in questo modo, esiliala con tre segnalini tempo su di essa invece di metterla nel cimitero del suo proprietario. Se non ha sospendere, guadagna sospendere. (All'inizio del mantenimento del suo proprietario, rimuovi un segnalino tempo da quella carta. Quando l'ultimo viene rimosso, il giocatore lancia la carta senza pagare il suo costo di mana. Se è una creatura, ha rapidità.)", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 510871, "name": "遅延", "text": "呪文１つを対象とする。それを打ち消す。これによりそれが打ち消されたなら、それをオーナーの墓地に置く代わりに、それを時間カウンター３個が置かれた状態で追放する。それが待機を持っていないなら、それは待機を得る。（それのオーナーのアップキープの開始時に、そのカードの上から時間カウンター１個を取り除く。最後の１個が取り除かれたとき、そのプレイヤーはそれをマナ・コストを支払わずにプレイする。それがクリーチャーなら、それは速攻を持つ。）", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 511160, "name": "Atrasar", "text": "Anule a mágica alvo. Se a mágica for anulada dessa maneira, exile-a com três marcadores temporais, em vez de colocá-la no cemitério de seu dono. Se ela não tem suspender, ela ganha suspender. (No início da manutenção de seu dono, remova um marcador temporal daquele card. Quando o último for removido, o jogador poderá jogá-lo sem pagar seu custo de mana. Se é uma criatura, ela tem ímpeto.)", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 511449, "name": "Промедление", "text": "Отмените целевое заклинание. Если то заклинание отменяется таким способом, изгоните его с тремя временными жетонами на нем, вместо того чтобы положить его на кладбище его владельца. Если у него нет Отсрочки, оно получает Отсрочку. (В начале шага поддержки ее владельца удалите один временной жетон с той карты. Когда удален последний жетон, тот игрок разыгрывает ту карту без уплаты ее мана-стоимости. Если это существо, оно получает Ускорение.)", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 511738, "name": "拖延", "text": "反击目标咒语。如果以此法反击该咒语，则改为将它放逐且上面有三个计时指示物，而非置入其拥有者的坟墓场。如果它原本不具有延缓，则它获得延缓异能。（在其拥有者的维持开始时，从该牌上移去一个指示物。当移去最后一个时，该牌手施放它且不需支付其法术力费用。若它是生物，则它具有敏捷。）", "type": "瞬间"}, {"language": "Chinese Traditional", "multiverseId": 512027, "name": "拖延", "text": "反擊目標咒語。如果以此法反擊該咒語，則改為將它放逐且上面有三個計時指示物，而非置入其擁有者的墳墓場。若它原本不具有延緩異能，則它獲得延緩異能（在其擁有者的維持開始時，從該牌上移去一個計時指示物。當移去最後一個時，則該玩家施放它且不需支付其魔法力費用。若它是生物，則它具有敏捷異能。）", "type": "瞬間"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "243018", "cardKingdomId": "242513", "cardsphereId": "74646", "mcmId": "542851", "mcmMetaId": "8956", "mtgjsonV4Id": "430a5d80-b27d-5fc8-8100-4044d708360e", "mtgoId": "86485", "multiverseId": "509426", "scryfallId": "3906d538-f1ca-4799-b91c-2e0d2934f241", "scryfallIllustrationId": "9a2afc82-9988-48bc-8ea3-a389a96cedbe", "scryfallOracleId": "983caa3f-7089-4e66-825d-4086a5adb9bb", "tcgplayerProductId": "233519"}, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Delay", "number": "61", "originalText": "Counter target spell. If the spell is countered this way, exile it with three time counters on it instead of putting it into its owner's graveyard. If it doesn't have suspend, it gains suspend. (At the beginning of its owner's upkeep, remove a time counter from that card. When the last is removed, the player plays it without paying its mana cost. If it's a creature, it has haste.)", "originalType": "Instant", "printings": ["FMB1", "FUT", "TSR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1391cf6a4a927185", "cardKingdomFoil": "https://mtgjson.com/links/25c9cd78c200be62", "cardmarket": "https://mtgjson.com/links/26d0f13a086f6af8", "tcgplayer": "https://mtgjson.com/links/4d9bf7eb69856fa3"}, "rarity": "uncommon", "rulings": [{"date": "2021-03-19", "text": "When the last time counter is removed from the exiled card, it’s cast as a completely new spell. Modes and targets are chosen again. If the spell has any mandatory additional costs, they must be paid again. If they can’t be, the spell can’t be cast and stays exiled."}, {"date": "2021-03-19", "text": "If the target spell was cast with flashback, Delay’s effect will exile it, not the flashback effect. The card will get time counters and gain suspend (if it didn’t already have suspend)."}, {"date": "2021-03-19", "text": "If the target spell is face down, it’ll be exiled face up. It can’t be cast face down when casting it without paying its mana cost."}, {"date": "2021-06-18", "text": "The mana value of a spell cast without paying its mana cost is determined by its mana cost, even though that cost wasn’t paid."}, {"date": "2021-06-18", "text": "You are never forced to activate mana abilities to pay costs, so if there is a mandatory additional mana cost (such as from Thalia, Guardian of Thraben), you can decline to activate mana abilities to pay for it and hence fail to cast the suspended card, leaving it in exile."}, {"date": "2021-06-18", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2021-06-18", "text": "If the spell requires any targets, those targets are chosen when the spell is finally cast, not when it’s exiled."}, {"date": "2021-06-18", "text": "Suspend is a keyword that represents three abilities. The first is a static ability that allows you to exile the card from your hand with the specified number of time counters (the number before the dash) on it by paying its suspend cost (listed after the dash). The second is a triggered ability that removes a time counter from the suspended card at the beginning of each of your upkeeps. The third is a triggered ability that causes you to cast the card when the last time counter is removed. If you cast a creature spell this way, it gains haste until you lose control of that creature (or, in rare cases, you lose control of the creature spell while it’s on the stack)."}, {"date": "2021-06-18", "text": "You can exile a card in your hand using suspend any time you could cast that card. Consider its card type, any effects that modify when you could cast it (such as flash) and any other effects that stop you from casting it (such as from Meddling Mage’s ability) to determine if and when you can do this. Whether you could actually complete all steps in casting the card is irrelevant. For example, you can exile a card with suspend that has no mana cost or that requires a target even if no legal targets are available at that time."}, {"date": "2021-06-18", "text": "Cards exiled with suspend are exiled face up."}, {"date": "2021-06-18", "text": "Exiling a card with suspend isn’t casting that card. This action doesn’t use the stack and can’t be responded to."}, {"date": "2021-06-18", "text": "If an effect refers to a “suspended card,” that means a card that (1) has suspend, (2) is in exile, and (3) has one or more time counters on it."}, {"date": "2021-06-18", "text": "If the first triggered ability of suspend (the one that removes time counters) is countered, no time counter is removed. The ability will trigger again at the beginning of the card’s owner’s next upkeep."}, {"date": "2021-06-18", "text": "When the last time counter is removed, the second triggered ability of suspend (the one that lets you cast the card) triggers. It doesn’t matter why the last time counter was removed or what effect removed it."}, {"date": "2021-06-18", "text": "If the second triggered ability is countered, the card can’t be cast. It remains exiled with no time counters on it, and it’s no longer suspended."}, {"date": "2021-06-18", "text": "As the second triggered ability resolves, you must cast the card if able. You must do so even if it requires targets and the only legal targets are ones that you really don’t want to target. Timing permissions based on the card’s type are ignored."}, {"date": "2021-06-18", "text": "If you can’t cast the card, perhaps because there are no legal targets available, it remains exiled with no time counters on it, and it’s no longer suspended."}, {"date": "2021-06-18", "text": "If you cast a card “without paying its mana cost,” such as with suspend, you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those if you want to cast the card."}], "setCode": "TSR", "subtypes": [], "supertypes": [], "text": "Counter target spell. If the spell is countered this way, exile it with three time counters on it instead of putting it into its owner's graveyard. If it doesn't have suspend, it gains suspend. (At the beginning of its owner's upkeep, remove a time counter from that card. When the last is removed, the player plays it without paying its mana cost. If it's a creature, it has haste.)", "type": "Instant", "types": ["Instant"], "uuid": "7613c3d3-6972-579a-a332-d8e4874dd229"}