{"artist": "Andreas Zafiratos", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 2719, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 567269, "name": "Spätzündender Feuerball", "text": "Der Spätzündende Feuerball fügt jedem Gegner und jeder Kreatur, die er kontrolliert, 2 Schadenspunkte zu. Falls dieser Zauberspruch aus dem Exil gewirkt wurde, fügt er jedem Gegner und jeder Kreatur, die er kontrolliert, stattdessen 5 Schadenspunkte zu.\nVorherbestimmung {4}{R}{R} (Während deines Zuges kannst du {2} bezahlen und diese Karte aus deiner Hand verdeckt ins Exil schicken. Wirke sie in einem späteren Zug für ihre Vorherbestimmungskosten.)", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 567297, "name": "Bola de fuego de explosión retardada", "text": "La Bola de fuego de explosión retardada hace 2 puntos de daño a cada oponente y a cada criatura que controlan tus oponentes. Si este hechizo fue lanzado desde el exilio, en vez de eso, hace 5 puntos de daño a cada oponente y a cada criatura que controlan tus oponentes.\nProfetizar {4}{R}{R}. (Durante tu turno, puedes pagar {2} y exiliar esta carta de tu mano boca abajo. Puedes lanzarla en un turno posterior pagando su coste de profetizar.)", "type": "Instantáneo"}, {"language": "French", "multiverseId": 567325, "name": "Boule de feu à retardement", "text": "La Boule de feu à retardement inflige 2 blessures à chaque adversaire et à chaque créature qu'il contrôle. Si ce sort a été lancé depuis l'exil, il inflige 5 blessures à chaque adversaire et à chaque créature qu'il contrôle à la place.\nPrédiction {4}{R}{R} (Pendant votre tour, vous pouvez payer {2} et exiler cette carte depuis votre main face cachée. Lancez-la pendant un autre tour pour son coût de prédiction.)", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 567353, "name": "Palla di Fuoco Ritardata", "text": "La Palla di Fuoco Ritardata infligge 2 danni a ogni avversario e a ogni creatura che controlla. Se questa magia è stata lanciata dall'esilio, infligge invece 5 danni a ogni avversario e a ogni creatura che controlla.\nPredire {4}{R}{R} (Durante il tuo turno, puoi pagare {2} ed esiliare questa carta dalla tua mano a faccia in giù. Lanciala in un turno successivo per il suo costo di predire.)", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 567381, "name": "ディレイド・ブラスト・ファイアーボール", "text": "ディレイド・ブラスト・ファイアーボールは各対戦相手とそのプレイヤーがコントロールしている各クリーチャーにそれぞれ２点のダメージを与える。この呪文が追放領域から唱えられたなら、代わりにこれは各対戦相手とそのプレイヤーがコントロールしている各クリーチャーにそれぞれ５点のダメージを与える。\n予顕{4}{R}{R}（あなたのターンの間、あなたは{2}を支払って、あなたの手札にあるこのカードを裏向きに追放してもよい。後のターンに、予顕コストでこれを唱えてもよい。）", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 567409, "name": "Bola de Fogo Adiável", "text": "Bola de Fogo Adiável causa 2 pontos de dano a cada oponente e a cada criatura que esse controla. Se esta mágica tiver sido conjurada do exílio, em vez disso, ela causa 5 pontos de dano a cada oponente e a cada criatura que esse controla.\nProfetizar {4}{R}{R} (Durante o seu turno, você pode pagar {2} e exilar este card de sua mão voltado para baixo. Conjure-o em um turno posterior pagando seu custo de profetizar.)", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 567437, "name": "Замедленный Огненный Шар", "text": "Замедленный Огненный Шар наносит по 2 повреждения каждому оппоненту и каждому существу под их контролем. Если это заклинание было разыграно из изгнания, то вместо этого оно наносит по 5 повреждений каждому оппоненту и каждому существу под их контролем.\nПророчество {4}{R}{R} (Во время вашего хода вы можете заплатить {2} и изгнать эту карту из вашей руки рубашкой вверх. Разыграйте ее во время одного из последующих ходов за ее стоимость Пророчества.)", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 567465, "name": "延迟爆裂火球", "text": "延迟爆裂火球向每位对手和每个由对手操控的生物各造成2点伤害。如果此咒语是从放逐区施放，则改为它向每位对手和每个由对手操控的生物各造成5点伤害。\n预示{4}{R}{R}（在你的回合中，你可以支付{2}并从你手上牌面朝下地放逐此牌。过了该回合后，便可利用其预示费用来施放之。）", "type": "瞬间"}, {"language": "Chinese Traditional", "multiverseId": 567493, "name": "延遲爆裂火球", "text": "延遲爆裂火球向每位對手和每個由對手操控的生物各造成2點傷害。如果此咒語是從放逐區施放，則改為它向每位對手和每個由對手操控的生物各造成5點傷害。\n預示{4}{R}{R}（在你的回合中，你可以支付{2}並從你手上牌面朝下地放逐此牌。過了該回合後，便可利用其預示費用來施放之。）", "type": "瞬間"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "262029", "mcmId": "661378", "mtgjsonV4Id": "c9cfb4c1-d759-5c14-9232-98909781e785", "mtgoId": "101448", "multiverseId": "567241", "scryfallId": "e59903e3-a344-4218-9d41-8b19a9bc8311", "scryfallIllustrationId": "cd1d9353-e6e1-4b37-96c4-997225948ead", "scryfallOracleId": "99915b5a-5092-4900-8824-6de2aab1b2c1", "tcgplayerProductId": "273623"}, "keywords": ["Foretell"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}{R}", "manaValue": 3.0, "name": "Delayed Blast Fireball", "number": "676", "originalText": "Delayed Blast Fireball deals 2 damage to each opponent and each creature they control. If this spell was cast from exile, it deals 5 damage to each opponent and each creature they control instead.\nForetell {4}{R}{R} (During your turn, you may pay {2} and exile this card from your hand face down. Cast it on a later turn for its foretell cost.)", "originalType": "Instant", "printings": ["CLB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/25931f9628feca80", "tcgplayer": "https://mtgjson.com/links/e2dc7b5a358d3aff"}, "rarity": "rare", "rulings": [{"date": "2022-06-10", "text": "Delayed Blast Fireball deals 5 damage if it was cast from exile for any reason; it doesn't have to be from its foretell ability."}, {"date": "2022-06-10", "text": "Because exiling a card with foretell from your hand is a special action, you can do so any time you have priority during your turn, including in response to spells and abilities. Once you announce you're taking the action, no other player can respond by trying to remove the card from your hand."}, {"date": "2022-06-10", "text": "Casting a foretold card from exile follows the timing rules for that card. If you foretell an instant card, you can cast it as soon as the next player's turn. In most cases, if you foretell a card that isn't an instant (or doesn't have flash), you'll have to wait until your next turn to cast it."}, {"date": "2022-06-10", "text": "If you're casting a foretold card from exile for its foretell cost, you can't choose to cast it for any other alternative costs. You can, however, pay additional costs, such as kicker costs. If the card has any mandatory additional costs, those must be paid to cast the spell."}], "securityStamp": "oval", "setCode": "CLB", "subtypes": [], "supertypes": [], "text": "Delayed Blast Fireball deals 2 damage to each opponent and each creature they control. If this spell was cast from exile, it deals 5 damage to each opponent and each creature they control instead.\nForetell {4}{R}{R} (During your turn, you may pay {2} and exile this card from your hand face down. Cast it on a later turn for its foretell cost.)", "type": "Instant", "types": ["Instant"], "uuid": "91f07837-84a7-5cc9-bc54-8b858fb8ed6c", "variations": ["24c82576-7a3b-5e20-b77f-ba48b4140a26"], "watermark": "foretell"}