{"artist": "Chris Rallis", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U", "W"], "colorIndicator": ["U", "W"], "colors": ["U", "W"], "convertedManaCost": 2.0, "edhrecRank": 8189, "faceConvertedManaCost": 0.0, "faceManaValue": 0.0, "faceName": "Dennick, Pious Apparition", "finishes": ["foil"], "foreignData": [], "frameEffects": ["legendary", "sunmoondfc"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardsphereId": "81861", "mcmId": "575716", "mtgjsonV4Id": "329afec4-8105-521e-9bff-6ff81b24925b", "scryfallId": "261add35-d42d-4ec3-92f7-46136c20a639", "scryfallIllustrationId": "9b152992-8678-446a-a27d-046a83838a76", "scryfallOracleId": "45802eb2-6848-416c-95e0-c1c1ea0620d0", "tcgplayerProductId": "249520"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Flying", "Investigate"], "language": "English", "layout": "transform", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaValue": 2.0, "name": "Dennick, Pious Apprentice // Dennick, Pious Apparition", "number": "217s", "otherFaceIds": ["b0436ed5-7bf4-5b8e-83ab-798b09ce7ac5"], "power": "3", "printings": ["DBL", "MID", "PMID"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {"tcgplayer": "https://mtgjson.com/links/1acb7b6aec432b5d"}, "rarity": "rare", "rulings": [{"date": "2021-09-24", "text": "The second ability of Dennick, Pious Apprentice affects only spells and abilities that actually target cards in graveyards. Spells and abilities that affect cards in graveyards without targeting them may still affect them, move them to other zones, and so on."}, {"date": "2021-09-24", "text": "Disturb is found only on the front faces of some double-faced cards."}, {"date": "2021-09-24", "text": "“Disturb [cost]” means “You may cast this card transformed from your graveyard by paying [cost] rather than its mana cost.”"}, {"date": "2021-09-24", "text": "When you cast a spell using a card's disturb ability, the card is put onto the stack with its back face up. The resulting spell has all the characteristics of that face."}, {"date": "2021-09-24", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a disturb cost) you're paying, add any cost increases, then apply any cost reductions. The mana value of a spell cast using disturb is determined by the mana cost on the front face of the card, no matter what the total cost to cast the spell was. (This is a special rule that applies only to transforming double faced-cards, including ones with disturb.)"}, {"date": "2021-09-24", "text": "A spell cast this way enters the battlefield with its back face up."}, {"date": "2021-09-24", "text": "If you copy a permanent spell cast this way (perhaps with a card like Double Major), the copy becomes a token that's a copy of the card's back face, even though it isn't itself a double-faced card."}, {"date": "2021-09-24", "text": "The back face of each card with disturb has an ability that instructs its controller to exile if it would be put into a graveyard from anywhere. This includes going to the graveyard from the stack, so if the spell is countered after you cast it using the disturb ability, it will be put into exile."}, {"date": "2021-09-24", "text": "The triggered ability of Dennick, Pious Apparition looks at what type the cards are after they move to the graveyard to determine whether the ability should trigger, regardless of any types they may have had before they were in the graveyard. For example, a creature card that has become a noncreature permanent, perhaps because it was enchanted by Minimus Containment, will cause the ability to trigger when it's put into a graveyard. By contrast, a noncreature card that has become a creature on the battlefield will not cause the ability to trigger when it's put into a graveyard."}, {"date": "2021-09-24", "text": "A token dying will never cause the triggered ability to trigger because a token is not a card."}], "securityStamp": "oval", "setCode": "PMID", "side": "b", "subtypes": ["Spirit", "Soldier"], "supertypes": ["Legendary"], "text": "Flying\nWhenever one or more creature cards are put into graveyards from anywhere, investigate. This ability triggers only once each turn. (Create a Clue token. It's an artifact with \"{2}, Sacrifice this artifact: Draw a card.\")\nIf Dennick, Pious Apparition would be put into a graveyard from anywhere, exile it instead.", "toughness": "2", "type": "Legendary Creature — Spirit Soldier", "types": ["Creature"], "uuid": "37dded0e-ad90-5fce-92da-7c6d7ce29b72"}