{"artist": "Kev Walker", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U", "W"], "colors": ["U", "W"], "convertedManaCost": 3.0, "edhrecRank": 3544, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 355891, "name": "Arrestkugel", "text": "Wenn die Arrestkugel ins Spiel kommt, kannst du eine bleibende Karte deiner Wahl, die kein Land ist und nicht Arrestkugel heißt, sowie alle anderen bleibenden Karten mit dem gleichen Namen wie diese bleibende Karte ins Exil schicken.\nWenn die Arrestkugel das Spiel verlässt, bringe die ins Exil geschickten Karten unter der Kontrolle ihres Besitzers ins Spiel zurück.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 365613, "name": "Esfera de detención", "text": "Cuando la Esfera de detención entre al campo de batalla, puedes exiliar el permanente objetivo que no sea tierra que no se llame Esfera de detención y todos los otros permanentes con el mismo nombre que ese permanente.\nCuando la Esfera de detención deje el campo de batalla, regresa las cartas exiliadas al campo de batalla bajo el control de su propietario.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 356165, "name": "Sphère de détention", "text": "Quand la Sphère de détention arrive sur le champ de bataille, vous pouvez exiler un permanent non-terrain ciblé qui n'est pas nommé Sphère de détention et tous les autres permanents ayant le même nom que ce permanent.\nQuand la Sphère de détention quitte le champ de bataille, renvoyez, sous le contrôle de leur propriétaire, les cartes exilées sur le champ de bataille.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 356439, "name": "Sfera di Detenzione", "text": "Quando la Sfera di Detenzione entra nel campo di battaglia, puoi esiliare un permanente non terra bersaglio che non si chiama Sfera di Detenzione e tutti gli altri permanenti con lo stesso nome di quel permanente.\nQuando la Sfera di Detenzione lascia il campo di battaglia, rimetti le carte esiliate sul campo di battaglia sotto il controllo del loro proprietario.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 356713, "name": "拘留の宝球", "text": "拘留の宝球が戦場に出たとき、拘留の宝球という名前でなく土地でないパーマネント１つを対象とする。あなたはそのパーマネントと、そのパーマネントと同じ名前を持つ他のすべてのパーマネントを追放してもよい。\n拘留の宝球が戦場を離れたとき、その追放されたカードをオーナーのコントロール下で戦場に戻す。", "type": "エンチャント"}, {"language": "Korean", "multiverseId": 357535, "name": "억류의 구체", "text": "억류의 구체가 전장에 들어올 때, 대지가 아니고 이름이 억류의 구체가 아닌 지속물 한 개를 목표로 정한다. 당신은 그 지속물 및 그 지속물과 이름이 같은 모든 지속물을 추방할 수 있다.\n억류의 구체가 전장을 떠날 때, 추방된 카드들을 소유자의 조종 하에 전장으로 되돌린다.", "type": "부여마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 356987, "name": "Esfera de Detenção", "text": "Quando Esfera de Detenção entra no campo de batalha, você pode exilar a permanente alvo que não seja um terreno e não tenha o nome Esfera de Detenção e todas as permanentes com o mesmo nome daquela permanente.\nQuando Esfera de Detenção deixar o campo de batalha, devolva os cards exilados ao campo de batalha sob o controle de seus donos.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 355343, "name": "Сфера Задержания", "text": "Когда Сфера Задержания выходит на поле битвы, вы можете изгнать целевой не являющийся землей перманент, имя которого не Сфера Задержания, и все другие перманенты с тем же именем, что и у того перманента.\nКогда Сфера Задержания покидает поле битвы, верните те изгнанные карты на поле битвы под контролем их владельца.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 357261, "name": "扣留法球", "text": "当扣留法球进战场时，你可以放逐目标非地、且名称不是扣留法球的永久物，以及与该永久物同名的所有其他永久物。\n当扣留法球离开战场时，将所放逐的牌在其拥有者的操控下移回战场。", "type": "结界"}, {"language": "Chinese Traditional", "multiverseId": 355617, "name": "扣留法球", "text": "當扣留法球進戰場時，你可以放逐目標非地、且名稱不是扣留法球的永久物，以及與該永久物同名的所有其他永久物。\n當扣留法球離開戰場時，將所放逐的牌在其擁有者的操控下移回戰場。", "type": "結界"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "188513", "cardKingdomId": "188214", "cardsphereId": "38617", "mcmId": "258372", "mcmMetaId": "206504", "mtgjsonV4Id": "9c91bbe7-2d1e-5d08-bec3-a54ec7b0c872", "mtgoFoilId": "46424", "mtgoId": "46423", "multiverseId": "270356", "scryfallId": "afee5464-83b7-4d7a-b407-9ee7de21535b", "scryfallIllustrationId": "0897c85c-2acf-404b-a5c2-d6eefc288323", "scryfallOracleId": "0a0b376d-7824-4ba5-8bc9-bc0be12800c5", "tcgplayerProductId": "66495"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}{U}", "manaValue": 3.0, "name": "Detention Sphere", "number": "155", "originalText": "When Detention Sphere enters the battlefield, you may exile target nonland permanent not named Detention Sphere and all other permanents with the same name as that permanent.\nWhen Detention Sphere leaves the battlefield, return the exiled cards to the battlefield under their owner's control.", "originalType": "Enchantment", "printings": ["GK2", "RTR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/c5e8fc7d151d75e8", "cardKingdomFoil": "https://mtgjson.com/links/9f24e35aa1da59f9", "cardmarket": "https://mtgjson.com/links/461567bb73992ab6", "tcgplayer": "https://mtgjson.com/links/fc5c01647398b6b7"}, "rarity": "rare", "rulings": [{"date": "2012-10-01", "text": "Although the target of the enters-the-battlefield ability must not be a land, lands with the same name as that permanent will be exiled."}, {"date": "2012-10-01", "text": "The enters-the-battlefield ability has only one target. The other permanents with that name aren’t targeted. For example, a permanent with protection from white will be exiled if it has the same name as the target nonland permanent."}, {"date": "2012-10-01", "text": "If the target nonland permanent is an illegal target when the enters-the-battlefield ability tries to resolve, it won’t resolve and none of its effects will happen. No permanents will be exiled, including those with the same name as the target."}, {"date": "2012-10-01", "text": "If Detention Sphere leaves the battlefield before its enters-the-battlefield ability has resolved, its leaves-the-battlefield ability will trigger and do nothing. Then the enters-the-battlefield ability will resolve and exile the targeted nonland permanent and other permanents with that name indefinitely."}], "setCode": "RTR", "subtypes": [], "supertypes": [], "text": "When Detention Sphere enters the battlefield, you may exile target nonland permanent not named Detention Sphere and all other permanents with the same name as that permanent.\nWhen Detention Sphere leaves the battlefield, return the exiled cards to the battlefield under their owner's control.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "fbe1c72e-a3dd-5561-87f5-f5cb786cdbb8", "watermark": "azorius"}