{"artist": "Zoltan Boros", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 15259, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 426981, "name": "Aufopferungsvoller Saatgefährte", "text": "Du kannst den Aufopferungsvollen Saatgefährten erschöpfen, sowie er angreift. Wenn du dies tust, bringe eine Kreaturenkarte deiner Wahl mit umgewandelten Manakosten von 2 oder weniger aus deinem Friedhof ins Spiel zurück. (Eine erschöpfte Kreatur enttappt nicht während deines nächsten Enttappsegments.)", "type": "Kreatur — Mensch, Krieger"}, {"language": "Spanish", "multiverseId": 427250, "name": "Camarada de simiente entregado", "text": "Puedes espolear al Camarada de simiente entregado en cuanto ataque. Cuando lo hagas, regresa la carta de criatura objetivo con coste de maná convertido de 2 o menos de tu cementerio al campo de batalla. (Una criatura espoleada no se enderezará durante tu próximo paso de enderezar.)", "type": "Criatura — Guerrero humano"}, {"language": "French", "multiverseId": 427519, "name": "Compagnon de moisson dévoué", "text": "Vous pouvez surmener le Compagnon de moisson dévoué au moment où il attaque. Quand vous faites ainsi, renvoyez sur le champ de bataille depuis votre cimetière une carte de créature ciblée avec un coût converti de mana inférieur ou égal à 2. (Une créature surmenée ne se dégage pas pendant votre prochaine étape de dégagement.)", "type": "Créature : humain et guerrier"}, {"language": "Italian", "multiverseId": 427788, "name": "Comessiano Devoto", "text": "Puoi stremare il Comessiano Devoto mentre attacca. Quando lo fai, rimetti sul campo di battaglia una carta creatura bersaglio con costo di mana convertito pari o inferiore a 2 dal tuo cimitero. (Una creatura stremata non STAPpa durante il tuo prossimo STAP.)", "type": "Creatura — Guerriero Umano"}, {"language": "Japanese", "multiverseId": 428057, "name": "献身的な門友", "text": "献身的な門友が攻撃するに際し、あなたはこれを督励してもよい。そうしたとき、あなたの墓地から点数で見たマナ・コストが２以下のクリーチャー・カード１枚を対象とし、それを戦場に戻す。（督励されたクリーチャーは、あなたの次のアンタップ・ステップにアンタップしない。）", "type": "クリーチャー — 人間・戦士"}, {"language": "Korean", "multiverseId": 428326, "name": "헌신적 입문자 동료", "text": "당신은 헌신적 입문자 동료로 공격을 선언하면서 헌신적 입문자 동료를 분전시킬 수 있다. 그렇게 할 때, 당신의 무덤에 있는 전환마나비용이 2 이하인 생물 카드를 목표로 정한다. 그 카드를 전장으로 되돌린다. (분전한 생물은 당신의 다음 언탭단에 언탭되지 않는다.)", "type": "생물 — 인간 전사"}, {"language": "Portuguese (Brazil)", "multiverseId": 428595, "name": "Colega de Safra Devotado", "text": "Você pode exaurir Colega de Safra Devotado conforme ele ataca. Quando fizer isso, devolva o card de criatura alvo com custo de mana convertido igual ou inferior a 2 de seu cemitério para o campo de batalha. (Uma criatura exaurida não será desvirada durante sua próxima etapa de desvirar.)", "type": "Criatura — Humano Guerreiro"}, {"language": "Russian", "multiverseId": 428864, "name": "Преданный Брат по Снопу", "text": "Вы можете подстегнуть Преданного Брата по Снопу в момент его атаки. Когда вы это делаете, верните целевую карту существа с конвертированной мана-стоимостью не более 2 из вашего кладбища на поле битвы. (Подстегнутое существо не разворачивается во время вашего следующего шага разворота.)", "type": "Существо — Человек Воин"}, {"language": "Chinese Simplified", "multiverseId": 429133, "name": "虔诚群伴", "text": "你可以于虔诚群伴攻击时耗竭之。当你如此作时，将目标总法术力费用等于或小于2的生物牌从你的坟墓场移回战场。（已耗竭的生物于你的下一个重置步骤中不能重置。）", "type": "生物～人类／战士"}, {"language": "Chinese Traditional", "multiverseId": 429402, "name": "虔誠群伴", "text": "你可以於虔誠群伴攻擊時耗竭之。當你如此作時，將目標總魔法力費用等於或小於2的生物牌從你的墳墓場移回戰場。（已耗竭的生物於你的下一個重置步驟中不能重置。）", "type": "生物～人類／戰士"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "212120", "cardKingdomId": "211853", "cardsphereId": "49178", "mcmId": "297134", "mcmMetaId": "225555", "mtgjsonV4Id": "396df3b4-e4b0-553c-a20f-e0b1c97b6e72", "mtgoFoilId": "63623", "mtgoId": "63622", "multiverseId": "426712", "scryfallId": "d3677f10-b530-4606-b7c8-a72dd2131160", "scryfallIllustrationId": "76607d6f-070d-47b2-8ea4-c1fb1342ca39", "scryfallOracleId": "fcde4643-a212-4a9e-94c3-0a0a95841bc6", "tcgplayerProductId": "130207"}, "keywords": ["Exert"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}", "manaValue": 3.0, "name": "Devoted Crop-Mate", "number": "10", "originalText": "You may exert Devoted Crop-Mate as it attacks. When you do, return target creature card with converted mana cost 2 or less from your graveyard to the battlefield. (An exerted creature won't untap during your next untap step.)", "originalType": "Creature - Human Warrior", "power": "3", "printings": ["AKH"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7cb71c9f641f7d24", "cardKingdomFoil": "https://mtgjson.com/links/c6fab6385814f7fb", "cardmarket": "https://mtgjson.com/links/25b33f280930db51", "tcgplayer": "https://mtgjson.com/links/bd4a6ca38a67121d"}, "rarity": "uncommon", "rulings": [{"date": "2017-04-18", "text": "The converted mana cost of a card in your graveyard is determined solely by the mana symbols printed in its upper right corner. The converted mana cost is the total amount of mana in that cost, regardless of color. For example, a card with mana cost {1}{U}{U} has converted mana cost 3."}, {"date": "2017-04-18", "text": "If the mana cost of a card in your graveyard includes X, X is considered to be 0."}, {"date": "2017-04-18", "text": "All attackers are chosen at once. You can’t attack with Devoted Crop-Mate, return a creature card to the battlefield, and then attack with that creature."}, {"date": "2017-04-18", "text": "If the creature returned to the battlefield has any abilities that trigger when creatures attack or when you exert creatures, those abilities won’t trigger."}, {"date": "2017-04-18", "text": "You can’t exert a creature unless an effect allows you to do so. Similar effects that “tap and freeze” a creature (such as that of Decision Paralysis) don’t exert that creature."}, {"date": "2017-04-18", "text": "If an exerted creature is already untapped during your next untap step (most likely because it had vigilance or an effect untapped it), exert’s effect preventing it from untapping expires without having done anything."}, {"date": "2017-04-18", "text": "If you gain control of another player’s creature until end of turn and exert it, it will untap during that player’s untap step."}, {"date": "2017-04-18", "text": "If a creature has a targeted triggered ability that triggers when you exert it, you can exert it even if there isn’t a legal target for that triggered ability."}, {"date": "2017-04-18", "text": "All cards in the Amonkhet set that let you exert a creature let you do so as you declare it as an attacking creature, as do some of the cards in the Hour of Devastation set. You can’t do so later in combat, and creatures put onto the battlefield attacking can’t be exerted. Any abilities that trigger on exerting an attacking creature will resolve before blockers are declared."}], "setCode": "AKH", "subtypes": ["Human", "Warrior"], "supertypes": [], "text": "You may exert Devoted Crop-Mate as it attacks. When you do, return target creature card with mana value 2 or less from your graveyard to the battlefield. (An exerted creature won't untap during your next untap step.)", "toughness": "2", "type": "Creature — Human Warrior", "types": ["Creature"], "uuid": "76963fc6-e573-51ef-9ca7-9e9c130c74d6"}