{"artist": "Steven Belledin", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 9.0, "edhrecRank": 21979, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 140496, "name": "Dichotomagie", "text": "Für jede getappte bleibende Karte außer Ländern, die ein Gegner deiner Wahl kontrolliert, durchsuche die Bibliothek dieses Spielers nach einer Karte mit demselben Namen wie diese bleibende Karte und bringe sie unter deiner Kontrolle ins Spiel. Dieser Spieler mischt dann seine Bibliothek.\nAussetzen 3 {1}{U}{U}", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 141216, "name": "Dicotomancia", "text": "Por cada permanente girado que no sea tierra que controla el oponente objetivo, busca en la biblioteca de ese jugador una carta con el mismo nombre que ese permanente y ponlo en juego bajo tu control. Luego ese jugador baraja su biblioteca.\nSuspender 3—{1}{U}{U}", "type": "Conjuro"}, {"language": "French", "multiverseId": 140376, "name": "Dichotomancie", "text": "Pour chaque permanent non-terrain engagé que contrôle l'adversaire ciblé, cherchez dans la bibliothèque de ce joueur une carte du même nom que ce permanent et mettez-la en jeu sous votre contrôle. Ce joueur mélange ensuite sa bibliothèque.\nSuspension 3 — {1}{U}{U}", "type": "Rituel"}, {"language": "Italian", "multiverseId": 140616, "name": "Dicotomanzia", "text": "Per ogni permanente non terra TAPpato controllato da un avversario bersaglio, passa in rassegna il grimorio di quel giocatore per una carta con lo stesso nome di quel permanente e mettila in gioco sotto il tuo controllo. Poi quel giocatore rimescola il proprio grimorio.\nSospendere 3—{1}{U}{U}", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 140856, "name": "裂断術", "text": "対戦相手１人を対象とする。そのプレイヤーがコントロールするタップ状態の土地でない各パーマネントにつき、そのプレイヤーのライブラリーからそのパーマネントと同じ名前のカードを１枚探し、それをあなたのコントロール下で場に出す。 その後、そのプレイヤーは自分のライブラリーを切り直す。\n待機 ３―{1}{U}{U}", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 140976, "name": "Dicotomancia", "text": "Para cada permanente virada que não seja um terreno controlada pelo oponente alvo, procure no grimório daquele jogador por um card com o mesmo nome daquela permanente e coloque-o em jogo sob o seu controle. Depois, aquele jogador embaralha seu próprio grimório.\nSuspender 3 {1}{U}{U}", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 141096, "name": "Дихотомия", "text": "За каждый повернутый неземельный перманент под контролем целевого оппонента поищите в библиотеке этого игрока карту с тем же именем, что и этот перманент, и положите его в игру под вашим контролем. Затем этот игрок тасует свою библиотеку.\nОтсрочка 3—{1}{U}{U}", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 141336, "name": "二分奇术", "text": "目标对手每操控一个已横置的非地永久物，你便从该牌手的牌库中搜寻一张与该永久物同名的牌，并在你的操控下放置进场。 然后该牌手将他的牌库洗牌。\n延缓3～{1}{U}{U}", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "122128", "cardKingdomId": "121954", "cardsphereId": "35212", "mcmId": "14217", "mcmMetaId": "8624", "mtgjsonV4Id": "a804409a-fad9-5ff1-b735-151b651086e3", "mtgoFoilId": "26300", "mtgoId": "26299", "multiverseId": "122455", "scryfallId": "61583ead-bccc-44d9-bd1d-2a13511990b5", "scryfallIllustrationId": "fba55fed-062a-4d9d-9213-d2f54601e4e8", "scryfallOracleId": "6d23f074-d84c-429b-9322-adc731f54a5b", "tcgplayerProductId": "14711"}, "keywords": ["Suspend"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{7}{U}{U}", "manaValue": 9.0, "name": "Dichotomancy", "number": "38", "originalText": "For each tapped nonland permanent target opponent controls, search that player's library for a card with the same name as that permanent and put it into play under your control. Then that player shuffles his or her library.\nSuspend 3—{1}{U}{U}", "originalType": "Sorcery", "printings": ["PLC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/c06b14cf2b97d5ba", "cardKingdomFoil": "https://mtgjson.com/links/91f37112ff520056", "cardmarket": "https://mtgjson.com/links/90393904858ff9b8", "tcgplayer": "https://mtgjson.com/links/223e219b59d47950"}, "rarity": "rare", "rulings": [{"date": "2007-02-01", "text": "The cards all enter the battlefield simultaneously. If one of the cards that’s entering the battlefield is an Aura, it must enter the battlefield attached to a permanent already on the battlefield. It can’t enter the battlefield attached to another permanent entering the battlefield via Dichotomancy. If an Aura can’t enter the battlefield this way, it remains in the opponent’s library."}, {"date": "2021-06-18", "text": "The mana value of a spell cast without paying its mana cost is determined by its mana cost, even though that cost wasn’t paid."}, {"date": "2021-06-18", "text": "Suspend is a keyword that represents three abilities. The first is a static ability that allows you to exile the card from your hand with the specified number of time counters (the number before the dash) on it by paying its suspend cost (listed after the dash). The second is a triggered ability that removes a time counter from the suspended card at the beginning of each of your upkeeps. The third is a triggered ability that causes you to cast the card when the last time counter is removed. If you cast a creature spell this way, it gains haste until you lose control of that creature (or, in rare cases, you lose control of the creature spell while it’s on the stack)."}, {"date": "2021-06-18", "text": "You can exile a card in your hand using suspend any time you could cast that card. Consider its card type, any effects that modify when you could cast it (such as flash) and any other effects that stop you from casting it (such as from Meddling Mage’s ability) to determine if and when you can do this. Whether you could actually complete all steps in casting the card is irrelevant. For example, you can exile a card with suspend that has no mana cost or that requires a target even if no legal targets are available at that time."}, {"date": "2021-06-18", "text": "Cards exiled with suspend are exiled face up."}, {"date": "2021-06-18", "text": "Exiling a card with suspend isn’t casting that card. This action doesn’t use the stack and can’t be responded to."}, {"date": "2021-06-18", "text": "If the spell requires any targets, those targets are chosen when the spell is finally cast, not when it’s exiled."}, {"date": "2021-06-18", "text": "If an effect refers to a “suspended card,” that means a card that (1) has suspend, (2) is in exile, and (3) has one or more time counters on it."}, {"date": "2021-06-18", "text": "If the first triggered ability of suspend (the one that removes time counters) is countered, no time counter is removed. The ability will trigger again at the beginning of the card’s owner’s next upkeep."}, {"date": "2021-06-18", "text": "When the last time counter is removed, the second triggered ability of suspend (the one that lets you cast the card) triggers. It doesn’t matter why the last time counter was removed or what effect removed it."}, {"date": "2021-06-18", "text": "If the second triggered ability is countered, the card can’t be cast. It remains exiled with no time counters on it, and it’s no longer suspended."}, {"date": "2021-06-18", "text": "As the second triggered ability resolves, you must cast the card if able. You must do so even if it requires targets and the only legal targets are ones that you really don’t want to target. Timing permissions based on the card’s type are ignored."}, {"date": "2021-06-18", "text": "If you can’t cast the card, perhaps because there are no legal targets available, it remains exiled with no time counters on it, and it’s no longer suspended."}, {"date": "2021-06-18", "text": "If you cast a card “without paying its mana cost,” such as with suspend, you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those if you want to cast the card."}, {"date": "2021-06-18", "text": "You are never forced to activate mana abilities to pay costs, so if there is a mandatory additional mana cost (such as from Thalia, Guardian of Thraben), you can decline to activate mana abilities to pay for it and hence fail to cast the suspended card, leaving it in exile."}, {"date": "2021-06-18", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}], "setCode": "PLC", "subtypes": [], "supertypes": [], "text": "For each tapped nonland permanent target opponent controls, search that player's library for a card with the same name as that permanent. Put those cards onto the battlefield under your control, then that player shuffles.\nSuspend 3—{1}{U}{U} (Rather than cast this card from your hand, you may pay {1}{U}{U} and exile it with three time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "558d00a3-c02d-5bbd-a24f-e1d5fb984c4b"}