{"artist": "Mark Behm", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 11120, "finishes": ["nonfoil", "foil"], "flavorText": "Archaeologists don't just dig in the dirt. They excavate time, scraping off the years grain by grain.", "foreignData": [{"flavorText": "Archäologen wühlen nicht einfach nur im Dreck. Sie bergen die Zeit und legen die Jahre Sandkorn für Sandkorn frei.", "language": "German", "multiverseId": 443208, "name": "Gewissenhafte Ausgräberin", "text": "Immer wenn du einen historischen Zauberspruch wirkst, legt ein Spieler deiner Wahl die obersten zwei Karten seiner Bibliothek auf seinen Friedhof. (Legenden, Artefakte und Sagen sind historisch.)", "type": "Kreatur — Mensch, Handwerker"}, {"flavorText": "Los arqueólogos no se limitan a excavar la tierra; excavan el propio tiempo y eliminan años con cada grano de arena que retiran.", "language": "Spanish", "multiverseId": 443477, "name": "Excavadora diligente", "text": "Siempre que lances un hechizo histórico, el jugador objetivo pone las dos primeras cartas de su biblioteca en su cementerio. (Los artefactos, las Sagas y las cartas legendarias son cartas históricas.)", "type": "Criatura — Artífice humano"}, {"flavorText": "Les archéologues ne se contentent pas de fouiller la terre. Ils creusent le temps, raclant les années petits morceaux par petits morceaux.", "language": "French", "multiverseId": 443746, "name": "Excavatrice appliquée", "text": "À chaque fois que vous lancez un sort historique, le joueur ciblé met les deux cartes du dessus de sa bibliothèque dans son cimetière. (Les artefacts, les légendaires et les sagas sont historiques.)", "type": "Créature : humain et artificier"}, {"flavorText": "Gli archeologi non scavano semplicemente nella terra. Scavano nel tempo, raschiando via gli anni granello per granello.", "language": "Italian", "multiverseId": 444015, "name": "Dissotterratrice Diligente", "text": "Ogniqualvolta lanci una magia storica, un giocatore bersaglio mette nel suo cimitero le prime due carte del suo grimorio. (Artefatti, carte leggendarie e Saghe sono carte storiche.)", "type": "Creatura — Artefice Umano"}, {"flavorText": "考古学者はただ地面に穴を掘っているわけではない。時間を掘り返し、年月を一粒ずつ削ぎ落としているのだ。", "language": "Japanese", "multiverseId": 444284, "name": "精励する発掘者", "text": "あなたが歴史的な呪文を唱えるたび、プレイヤー１人を対象とする。そのプレイヤーは自分のライブラリーの一番上からカードを２枚自分の墓地に置く。（歴史的とは、アーティファクトと伝説と英雄譚のことである。）", "type": "クリーチャー — 人間・工匠"}, {"flavorText": "고고학자는 그저 땅만 파는 자들이 아니다. 그들은 세월을 조금씩 벗겨내며 시간을 발굴하는 것이다.", "language": "Korean", "multiverseId": 444553, "name": "성실한 발굴자", "text": "당신이 역사적 주문을 발동할 때마다, 플레이어를 목표로 정한다. 그 플레이어는 자신의 서고 맨 위 카드 두 장을 자신의 무덤에 넣는다. (마법물체와 전설적, 서사시가 역사적이다.)", "type": "생물 — 인간 기능공"}, {"flavorText": "O que os arqueólogos fazem não é só procurar em meio ao pó. Eles escavam o tempo, removendo os anos grão a grão.", "language": "Portuguese (Brazil)", "multiverseId": 444822, "name": "Escavadora Diligente", "text": "Toda vez que você conjura uma mágica histórica, o jogador alvo coloca os dois cards do topo do próprio grimório no próprio cemitério. (Os artefatos, os cards lendários e as Sagas são cards históricos.)", "type": "Criatura — Humano Artesão"}, {"flavorText": "Археологи не просто роются в земле. Они раскапывают само время, по песчинке снимая с него года.", "language": "Russian", "multiverseId": 445091, "name": "Усердная Раскопщица", "text": "Каждый раз, когда вы разыгрываете историческое заклинание, целевой игрок кладет две верхние карты своей библиотеки на свое кладбище. (Артефакты, легендарные карты и Саги являются историческими.)", "type": "Существо — Человек Механик"}, {"flavorText": "考古学家并非只是破土挖掘。他们开掘时间，如抽丝剥茧般探究每一年。", "language": "Chinese Simplified", "multiverseId": 445360, "name": "勤勉开挖人", "text": "每当你施放史迹咒语时，目标对手将其牌库顶的两张牌置入其坟墓场。（神器、传奇和传纪是史迹。）", "type": "生物 ～人类／神器师"}, {"flavorText": "考古學家並非只是破土挖掘。他們開掘時間，如抽絲剝繭般探究每一年。", "language": "Chinese Traditional", "multiverseId": 445629, "name": "勤勉開挖人", "text": "每當你施放史跡咒語時，目標玩家將其牌庫頂的兩張牌置入其墳墓場。（神器、傳奇和傳紀是史跡。）", "type": "生物 ～人類／神器師"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "218257", "cardKingdomId": "217984", "cardsphereId": "54279", "mcmId": "355406", "mcmMetaId": "261115", "mtgArenaId": "67206", "mtgjsonV4Id": "01f09003-cb49-5242-ab29-320fe9e3710a", "mtgoId": "67567", "multiverseId": "442939", "scryfallId": "65212970-770e-4110-aa86-c89128688867", "scryfallIllustrationId": "11f1650e-c6b6-42a8-800f-c87b891756a2", "scryfallOracleId": "a3866181-c127-45d6-8553-97e9f64a3ca5", "tcgplayerProductId": "164693"}, "keywords": ["Mill"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Diligent Excavator", "number": "51", "originalText": "Whenever you cast a historic spell, target player puts the top two cards of their library into their graveyard. (Artifacts, legendaries, and Sagas are historic.)", "originalType": "Creature — Human Artificer", "power": "1", "printings": ["DOM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/3ee007c97769c26a", "cardKingdomFoil": "https://mtgjson.com/links/cfd60dba126316f6", "cardmarket": "https://mtgjson.com/links/1eec5fd738bd0a16", "tcgplayer": "https://mtgjson.com/links/2e763be34a1c6094"}, "rarity": "uncommon", "rulings": [{"date": "2018-04-27", "text": "A card, spell, or permanent is historic if it has the legendary supertype, the artifact card type, or the Saga subtype. Having two of those qualities doesn’t make an object more historic than another or provide an additional bonus—an object either is historic or it isn’t."}, {"date": "2018-04-27", "text": "Some abilities trigger “whenever you cast a historic spell.” Such an ability resolves before the spell that caused it to trigger. It resolves even if that spell is countered."}, {"date": "2018-04-27", "text": "An ability that triggers “whenever you cast a historic spell” doesn’t trigger if a historic card is put onto the battlefield without being cast."}, {"date": "2018-04-27", "text": "Lands are never cast, so abilities that trigger “whenever you cast a historic spell” won’t trigger if you play a legendary land. They also won’t trigger if a card on the battlefield transforms into a legendary land, as the Ixalan and Rivals of Ixalan double-faced cards do."}], "setCode": "DOM", "subtypes": ["Human", "Artificer"], "supertypes": [], "text": "Whenever you cast a historic spell, target player mills two cards. (Artifacts, legendaries, and Sagas are historic.)", "toughness": "3", "type": "Creature — Human Artificer", "types": ["Creature"], "uuid": "6f793e92-2619-58f7-aac6-2913f079c461"}