{"artist": "Zoltan Boros", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 1208, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 439959, "name": "Schreckensflotten-Draufgängerin", "text": "Erstschlag\nWenn die Schreckensflotten-Draufgängerin ins Spiel kommt, schicke eine Spontanzauber- oder Hexereikarte deiner Wahl aus dem Friedhof eines Gegners ins Exil. Du kannst die Karte in diesem Zug wirken und um sie zu wirken, kannst du Mana ausgeben, als wäre es Mana eines beliebigen Typs. Falls jene Karte in diesem Zug auf einen Friedhof gelegt würde, schicke sie stattdessen ins Exil.", "type": "Kreatur — Mensch, Pirat"}, {"language": "Spanish", "multiverseId": 440162, "name": "Temeraria de la Flota Arrasadora", "text": "Daña primero.\nCuando la Temeraria de la Flota Arrasadora entre al campo de batalla, exilia la carta de instantáneo o de conjuro objetivo del cementerio de un oponente. Puedes lanzar esa carta este turno, y puedes gastar maná como si fuera maná de cualquier tipo para lanzar ese hechizo. Si esa carta fuera a ser puesta en un cementerio este turno, en vez de eso, exíliala.", "type": "Criatura — Pirata humano"}, {"language": "French", "multiverseId": 440365, "name": "Casse-cou de la Flotte implacable", "text": "Initiative\nQuand la Casse-cou de la Flotte implacable arrive sur le champ de bataille, exilez une carte d'éphémère ou de rituel ciblée depuis le cimetière d'un adversaire. Vous pouvez lancer cette carte ce tour-ci, et vous pouvez dépenser du mana comme s'il s'agissait de mana de n'importe quel type pour lancer ce sort. Si cette carte devait être mise dans un cimetière ce tour-ci, exilez-la à la place.", "type": "Créature : humain et pirate"}, {"language": "Italian", "multiverseId": 440568, "name": "Spericolata della Flotta Funesta", "text": "Attacco improvviso\nQuando la Spericolata della Flotta Funesta entra nel campo di battaglia, esilia una carta istantaneo o stregoneria bersaglio dal cimitero di un avversario. Puoi lanciare quella carta in questo turno e puoi spendere mana come se fosse mana di qualsiasi tipo per lanciarla. Se quella carta sta per essere messa in un cimitero in questo turno, invece esiliala.", "type": "Creatura — Pirata Umano"}, {"language": "Japanese", "multiverseId": 440771, "name": "凶兆艦隊の向こう見ず", "text": "先制攻撃\n凶兆艦隊の向こう見ずが戦場に出たとき、対戦相手の墓地からインスタントかソーサリーであるカード１枚を対象とし、それを追放する。このターン、あなたはそのカードを唱えてもよい。あなたは、その呪文を唱えるために、任意のマナを望むタイプのマナであるかのように支払ってもよい。このターン、そのカードが墓地に置かれるなら、代わりにそれを追放する。", "type": "クリーチャー — 人間・海賊"}, {"language": "Korean", "multiverseId": 440974, "name": "무모한 다이어 선단 선원", "text": "선제공격\n무모한 다이어 선단 선원이 전장에 들어올 때, 상대의 무덤에 있는 순간마법이나 집중마법 카드를 목표로 정한다. 그 카드를 추방한다. 당신은 이번 턴에 그 카드를 발동할 수 있으며, 그 주문을 발동하기 위한 마나는 당신이 원하는 유형의 마나인 것처럼 사용할 수 있다. 그 카드가 이 턴에 무덤에 들어가려고 하면, 대신에 그 카드를 추방한다.", "type": "생물 — 인간 해적"}, {"language": "Portuguese (Brazil)", "multiverseId": 441177, "name": "Destemida da Frota Macabra", "text": "Iniciativa\nQuando Destemida da Frota Macabra entrar no campo de batalha, exile a mágica instantânea ou o feitiço alvo do cemitério de um oponente. Você pode conjurar aquele card neste turno e gastar mana como se fosse de qualquer tipo para conjurar aquela mágica. Se aquele card seria colocado num cemitério neste turno, em vez disso, exile-o.", "type": "Criatura — Humano Pirata"}, {"language": "Russian", "multiverseId": 441380, "name": "Сорвиголова Лютой Флотилии", "text": "Первый удар\nКогда Сорвиголова Лютой Флотилии выходит на поле битвы, изгоните целевую карту мгновенного заклинания или волшебства из кладбища оппонента. Вы можете разыграть ту карту в этом ходу, и вы можете тратить ману на разыгрывание того заклинания, как если бы это была мана любого типа. Если та карта должна быть положена на кладбище в этом ходу, изгоните ее вместо этого.", "type": "Существо — Человек Пират"}, {"language": "Chinese Simplified", "multiverseId": 441583, "name": "焦炬舰队冒险客", "text": "先攻\n当焦炬舰队冒险客进战场时，将目标瞬间或法术牌从对手的坟墓场放逐。本回合中，你可以施放该牌，且你可以将法术力视同任意种类的法术力来支付施放该咒语的费用。若该牌于本回合中将被置入坟墓场，则改为将它放逐。", "type": "生物 ～人类／海盗"}, {"language": "Chinese Traditional", "multiverseId": 441786, "name": "焦炬艦隊冒險客", "text": "先攻\n當焦炬艦隊冒險客進戰場時，將目標瞬間或巫術牌從對手的墳墓場放逐。本回合中，你可以施放該牌，且你可以將魔法力視同任意種類的魔法力來支付施放該咒語的費用。若該牌於本回合中將被置入墳墓場，則改為將它放逐。", "type": "生物 ～人類／海盜"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "216490", "cardKingdomId": "216279", "cardsphereId": "53025", "mcmId": "315421", "mcmMetaId": "236219", "mtgArenaId": "66815", "mtgjsonV4Id": "b4ab51f4-131d-5485-92ac-7e5b99bb7277", "mtgoId": "66651", "multiverseId": "439756", "scryfallId": "13e3c0c5-7451-4da9-acc0-d6e4e1f2655e", "scryfallIllustrationId": "9a6ad915-c858-4e2c-b0e4-32714e226100", "scryfallOracleId": "7a3e50a5-c163-4c41-b62d-d52c233c55b7", "tcgplayerProductId": "155706"}, "keywords": ["First strike"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}", "manaValue": 2.0, "name": "Dire Fleet Daredevil", "number": "99", "originalText": "First strike\nWhen Dire Fleet Daredevil enters the battlefield, exile target instant or sorcery card from an opponent's graveyard. You may cast that card this turn, and you may spend mana as though it were mana of any type to cast that spell. If that card would be put into a graveyard this turn, exile it instead.", "originalType": "Creature — Human Pirate", "power": "2", "printings": ["AFC", "CLB", "PRIX", "RIX"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ad76a88832fe9993", "cardKingdomFoil": "https://mtgjson.com/links/f7a4f24df5abf834", "cardmarket": "https://mtgjson.com/links/96d247ab39b54776", "tcgplayer": "https://mtgjson.com/links/13e4fc887834836a"}, "rarity": "rare", "rulings": [{"date": "2018-01-19", "text": "The effect of Dire Fleet Daredevil doesn't change when you can cast the exiled card. For example, if you exile a sorcery card, you can cast it only during your main phase when the stack is empty."}, {"date": "2018-01-19", "text": "Casting an exiled card causes it to leave exile. You can't cast it multiple times."}], "securityStamp": "oval", "setCode": "RIX", "subtypes": ["Human", "Pirate"], "supertypes": [], "text": "First strike\nWhen Dire Fleet Daredevil enters the battlefield, exile target instant or sorcery card from an opponent's graveyard. You may cast it this turn, and you may spend mana as though it were mana of any type to cast that spell. If that spell would be put into a graveyard this turn, exile it instead.", "toughness": "1", "type": "Creature — Human Pirate", "types": ["Creature"], "uuid": "30a726f0-ee3c-514b-9213-f4d11c084e1f"}