{"artist": "Darek Zabrocki", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G", "R"], "colors": ["G", "R"], "convertedManaCost": 3.0, "edhrecRank": 4713, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "c240cf8f-6afc-53f8-b470-e20451f3d66f", "mtgoId": "94070", "scryfallId": "1cabcd97-b248-4227-a25c-3f0bd97ca83f", "scryfallIllustrationId": "43de3a18-89a3-4bf1-a5b0-642fee57eea4", "scryfallOracleId": "55281479-9d30-4f3e-afd0-66b0df5de68c"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Flashback"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}{G}", "manaValue": 3.0, "name": "Dire-Strain Rampage", "number": "94070", "originalReleaseDate": "2022-01-28", "printings": ["DBL", "MID", "PMID", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-09-24", "text": "If the target permanent became an illegal target by the time Dire-Strain Rampage tried to resolve, the spell won't resolve and none of its effects will happen. No player will search their library for any cards. However, if the target is still legal but wasn't destroyed, perhaps because it was indestructible, its controller may still search their library for a basic land card (even if the target was a land)."}, {"date": "2021-09-24", "text": "“Flashback [cost]” means “You may cast this card from your graveyard by paying [cost] rather than paying its mana cost” and “If the flashback cost was paid, exile this card instead of putting it anywhere else any time it would leave the stack.”"}, {"date": "2021-09-24", "text": "You must still follow any timing restrictions and permissions, including those based on the card's type. For instance, you can cast a sorcery using flashback only when you could normally cast a sorcery."}, {"date": "2021-09-24", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a flashback cost) you're paying, add any cost increases, then apply any cost reductions. The mana value of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2021-09-24", "text": "A spell cast using flashback will always be exiled afterward, whether it resolves, is countered, or leaves the stack in some other way."}, {"date": "2021-09-24", "text": "You can cast a spell using flashback even if it was somehow put into your graveyard without having been cast."}, {"date": "2021-09-24", "text": "If a card with flashback is put into your graveyard during your turn, you can cast it if it's legal to do so before any other player can take any actions."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Destroy target artifact, enchantment, or land. If a land was destroyed this way, its controller may search their library for up to two basic land cards, put them onto the battlefield tapped, then shuffle. Otherwise, its controller may search their library for a basic land card, put it onto the battlefield tapped, then shuffle.\nFlashback {3}{R}{G}", "type": "Sorcery", "types": ["Sorcery"], "uuid": "b558f059-4db5-5835-b3a8-ce56bb176da0"}