{"artist": "Steve Argyle", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 5.0, "edhrecRank": 18421, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "bd0f3291-fde8-54d3-afea-afe6efba97bc", "mtgoId": "105630", "scryfallId": "be587bc3-7dba-4312-ba3a-c7940d2aad58", "scryfallIllustrationId": "0e39894b-a0b8-474e-b2cf-16bce8a94ab1", "scryfallOracleId": "2e5440ef-6887-4c79-98f5-49db82406d71"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{W}", "manaValue": 5.0, "name": "Disciple of Caelus Nin", "number": "105630", "originalReleaseDate": "2022-11-19", "power": "3", "printings": ["BRC", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2022-10-14", "text": "The last ability means that no permanents phase in under any player’s control as long as Disciple of Caelus Nin is on the battlefield. This includes permanents that phase out in ways other than the first ability, and even permanents that are phased out already when it enters the battlefield. Once it leaves the battlefield, each phased out permanent will phase in normally during its controller’s untap step, with one exception (see below)."}, {"date": "2022-10-14", "text": "If an effect causes a permanent to phase out “until” some event occurs, and that event occurs while Disciple of Caelus Nin is still on the battlefield, the phased out permanent stays phased out forever."}, {"date": "2022-10-14", "text": "If Disciple of Caelus Nin itself phases out, other phased out permanents can phase back in normally while it is phased out. During its controller’s untap step, Caelus Nin and all other phased out permanents that player controls phase in at the same time."}, {"date": "2022-10-14", "text": "While a permanent is phased out, it’s treated as though it doesn’t exist. It can’t be the target of spells or abilities, its static abilities have no effect on the game, its triggered abilities can’t trigger, it can’t attack or block, and so on."}, {"date": "2022-10-14", "text": "Phasing out doesn’t cause any “leaves the battlefield” abilities to trigger. Similarly, phasing in won’t cause any “enters the battlefield” abilities to trigger."}, {"date": "2022-10-14", "text": "Any one-shot effects that are waiting “until [this] leaves the battlefield,” such as that of Banisher Priest, won’t happen when a permanent phases out."}, {"date": "2022-10-14", "text": "Any continuous effects with a “for as long as” duration, such as that of Vodalian Mindsinger, ignore phased-out objects. Any such effects will expire if their conditions are no longer met after ignoring the phased-out objects."}, {"date": "2022-10-14", "text": "Each Aura and Equipment attached to a permanent that’s phasing out also phases out. They will phase in with that permanent and still be attached to it. Similarly, permanents that phase out with counters phase in with those counters."}, {"date": "2022-10-14", "text": "Choices made for permanents as they entered the battlefield are remembered when they phase in."}], "setCode": "PRM", "subtypes": ["Human", "Wizard"], "supertypes": [], "text": "When Disciple of Caelus Nin enters the battlefield, starting with you, each player chooses up to five permanents they control. All permanents other than Disciple of Caelus Nin that weren't chosen this way phase out.\nPermanents can't phase in.", "toughness": "4", "type": "Creature — Human Wizard", "types": ["Creature"], "uuid": "b154f187-7d94-548c-ba05-461349dd1581"}