{"artist": "Volkan Baǵa", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 6.0, "edhrecRank": 5076, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "b7901904-f83f-5274-a8e6-6ca1f4b0350a", "mtgoId": "81952", "scryfallId": "bf3bbd98-dc21-4e34-99ac-1477c5d0830f", "scryfallIllustrationId": "3101be18-7f77-4040-a2de-79c5cb889f17", "scryfallOracleId": "5cfd73ab-8509-4e4b-9704-68d8dad3b301"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}{U}{U}", "manaValue": 6.0, "name": "Discontinuity", "number": "81952", "originalReleaseDate": "2020-07-31", "printings": ["M21", "PM21", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2020-06-23", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost you're paying, add any cost increases, then apply any cost reductions (such as that of Discontinuity). The mana value of the spell remains unchanged, no matter what the total cost to cast it was."}, {"date": "2020-06-23", "text": "Ending the turn this way means the following things happen in order: 1) All spells and abilities on the stack are exiled. This includes spells and abilities that can't be countered. 2) If there are any attacking and blocking creatures, they're removed from combat. 3) State-based actions are checked. No player gets priority, and no triggered abilities are put onto the stack. 4) The current phase and/or step ends. The game skips straight to the cleanup step. 5) The cleanup step happens in its entirety."}, {"date": "2020-06-23", "text": "If any triggered abilities do trigger during this process, they're put onto the stack during the cleanup step. If this happens, players will have a chance to cast spells and activate abilities, then there will be another cleanup step before the turn is over."}, {"date": "2020-06-23", "text": "Though other spells and abilities that are exiled won't get a chance to resolve, they don't count as being countered."}, {"date": "2020-06-23", "text": "Any “at the beginning of the next end step” triggered abilities won't get the chance to trigger that turn because the end step is skipped. Those abilities will trigger at the beginning of the end step of the next turn."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "As long as it's your turn, this spell costs {2}{U}{U} less to cast.\nEnd the turn. (Exile all spells and abilities from the stack, including this card. The player whose turn it is discards down to their maximum hand size. Damage wears off, and \"this turn\" and \"until end of turn\" effects end.)", "type": "Instant", "types": ["Instant"], "uuid": "2f440c1c-076a-57bb-9a26-36273fc23816"}