{"artist": "Sidharth Chaturvedi", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 1023, "finishes": ["nonfoil", "foil"], "flavorText": "Dinner and politics don't mix.", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "03c1d35b-b795-5bbd-a5eb-6856d4a57592", "mtgoId": "65695", "scryfallId": "5c907e23-c637-4984-84f7-b06db90d26df", "scryfallIllustrationId": "c5c3c791-5d7f-4d4c-8537-ea2111d9001d", "scryfallOracleId": "9b084cd4-cc21-4f3a-9ac5-1e1160a31aa6"}, "isOnlineOnly": true, "isReprint": true, "isStarter": true, "keywords": ["Goad"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}{R}", "manaValue": 4.0, "name": "Disrupt Decorum", "number": "65695", "printings": ["AFC", "C17", "CLB", "PZ2"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2017-08-25", "text": "Creatures that enter the battlefield after Disrupt Decorum resolves won't be goaded."}, {"date": "2017-08-25", "text": "During a player's declare attackers step, if a creature that player controls that's been goaded is tapped, is affected by a spell or ability that says it can't attack, or hasn't been under that player's control continuously since the turn began (and doesn't have haste), then it doesn't attack."}, {"date": "2017-08-25", "text": "If there's a cost associated with having a creature attack, its controller isn't forced to pay that cost, so it doesn't have to attack in that case either."}, {"date": "2017-08-25", "text": "If the creature doesn't meet any of the above exceptions and can attack, it must attack a player other than the controller of the spell or ability that goaded it if able. It the creature can't attack any of those players but could otherwise attack, it must attack an opposing planeswalker (controlled by any opponent) or the player who goaded it."}, {"date": "2017-08-25", "text": "Attacking with a goaded creature doesn't cause it to stop being goaded. If there is an additional combat phase that turn, or if another player gains control of that creature before it stops being goaded, it must attack again if able."}, {"date": "2017-08-25", "text": "If a creature you control has been goaded by multiple opponents, it must attack one of your opponents who hasn't goaded it, as that fulfills the maximum number of goad requirements. If a creature you control has been goaded by each of your opponents, you choose which opponent it attacks."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": [], "supertypes": [], "text": "Goad all creatures you don't control. (Until your next turn, those creatures attack each combat if able and attack a player other than you if able.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "021ab9ac-79c0-5272-b813-4c3ab5226b7e"}