{"artist": "Yohann Schepacz", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": [], "convertedManaCost": 8.0, "edhrecRank": 11915, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "207992", "cardsphereId": "37137", "mcmId": "291215", "mtgjsonV4Id": "92f1c623-cbb2-57aa-b3ce-156b859b8a3c", "scryfallId": "e866be54-75fc-4e39-806a-06756aca660c", "scryfallIllustrationId": "26d9861d-3a1a-49e9-ba5a-b4b32e25b62a", "scryfallOracleId": "36d32194-d547-4e2d-894f-f4bf13cf7da6", "tcgplayerProductId": "120725"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Emerge"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{8}", "manaValue": 8.0, "name": "Distended Mindbender", "number": "3s", "power": "5", "printings": ["EMN", "PEMN"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/6bbdf61e26849edd", "tcgplayer": "https://mtgjson.com/links/13a2cbad93d6475d"}, "rarity": "rare", "rulings": [{"date": "2016-07-13", "text": "Distended Mindbender’s last ability triggers after you’ve taken all the actions necessary to cast the spell."}, {"date": "2016-07-13", "text": "If a card in a player’s hand has {X} in its mana cost, X is considered to be 0."}, {"date": "2016-07-13", "text": "You must choose two appropriate cards if able."}, {"date": "2016-07-13", "text": "If there aren’t two appropriate cards to choose, choose whichever you can and that player discards that card."}, {"date": "2016-07-13", "text": "A “when you cast” triggered ability resolves before the original spell resolves. It resolves even if the original spell is countered, and the original spell resolves even if the triggered ability is countered."}, {"date": "2016-07-13", "text": "Each card with emerge is colorless and has an emerge cost that includes one or more colors of mana. These cards are still colorless if you pay the emerge cost."}, {"date": "2016-07-13", "text": "A creature’s converted mana cost is determined solely by the mana symbols printed in its upper right corner (unless that creature is the back face of a double-faced card, is a melded permanent, or is copying something else; see below). If the mana cost includes {X}, X is considered to be 0. If it’s a single-faced card with no mana symbols in its upper right corner (because it’s an animated land, for example), its converted mana cost is 0. Ignore any alternative costs or additional costs (such as kicker) that were paid as the creature was cast."}, {"date": "2016-07-13", "text": "Colored mana components of emerge costs can’t be reduced with emerge."}, {"date": "2016-07-13", "text": "You may sacrifice a creature with a converted mana cost of 0, such as a token creature that’s not a copy of another permanent, to cast a spell for its emerge cost. You’ll just pay the full emerge cost with no reduction."}, {"date": "2016-07-13", "text": "You may sacrifice a creature with converted mana cost greater than or equal to the emerge cost. If you do, you’ll pay only the colored mana component of the emerge cost."}, {"date": "2016-07-13", "text": "If you sacrifice a creature with {X} in its mana cost, that X is considered to be 0."}, {"date": "2016-07-13", "text": "The converted mana cost of the back face of a double-faced card is the converted mana cost of its front face. The converted mana cost of a melded permanent is the sum of the converted mana costs of its front faces. A creature that’s a copy of either has a converted mana cost of 0."}, {"date": "2016-07-13", "text": "The converted mana cost of a creature spell with emerge isn’t affected by whether its emerge cost is paid. For example, if you cast Elder Deep-Fiend for its emerge cost and sacrifice a creature whose converted mana cost is 3, Elder Deep-Fiend’s converted mana cost remains 8."}, {"date": "2016-07-13", "text": "The creature chosen to be sacrificed is still on the battlefield up through the time that you activate mana abilities. Its abilities may affect the spell’s cost, be activated to generate mana, and so on. However, if it has an ability that triggers when a spell is cast, it will have been sacrificed before that ability can trigger."}, {"date": "2016-07-13", "text": "Once you begin to cast a spell with emerge, no player may take actions until you’re done. Notably, opponents can’t try to remove the creature you wish to sacrifice."}], "securityStamp": "oval", "setCode": "PEMN", "subtypes": ["Eldrazi", "Insect"], "supertypes": [], "text": "Emerge {5}{B}{B} (You may cast this spell by sacrificing a creature and paying the emerge cost reduced by that creature's mana value.)\nWhen you cast this spell, target opponent reveals their hand. You choose from it a nonland card with mana value 3 or less and a card with mana value 4 or greater. That player discards those cards.", "toughness": "5", "type": "Creature — Eldrazi Insect", "types": ["Creature"], "uuid": "e5b4b25d-a1a4-5e8a-a2c6-676282d8e9ee"}