{"artist": "Larry MacDougall", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 2.0, "edhrecRank": 18527, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 174541, "name": "Beunruhigender Plan", "text": "Bringe eine Kreaturenkarte deiner Wahl aus einem Friedhof auf die Hand ihres Besitzers zurück.\nVerschwören (Sowie du diesen Zauberspruch spielst, kannst du zwei ungetappte Kreaturen tappen, die du kontrollierst und die mindestens eine Farbe mit dem Zauberspruch gemeinsam haben. Wenn du das tust, kopiere den Zauberspruch; du kannst für die Kopie ein neues Ziel bestimmen.)", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 172735, "name": "Plan perturbador", "text": "Regresa la carta de criatura objetivo en un cementerio a la mano de su propietario.\nConspirar. (En cuanto juegues este hechizo puedes girar dos criaturas enderezadas que controles que compartan un color con él. Cuando lo hagas, cópialo y puedes elegir un nuevo objetivo para la copia.)", "type": "Conjuro"}, {"language": "French", "multiverseId": 173337, "name": "Conspiration troublante", "text": "Renvoyez la carte de créature ciblée dans un cimetière dans la main de son propriétaire.\nConspiration (Au moment où vous jouez ce sort, vous pouvez engager deux créatures dégagées que vous contrôlez qui partagent une couleur avec lui. Quand vous faites ainsi, copiez-le et vous pouvez choisir une nouvelle cible pour la copie.)", "type": "Rituel"}, {"language": "Italian", "multiverseId": 173638, "name": "Complotto Inquietante", "text": "Fai tornare una carta creatura bersaglio in un cimitero in mano al suo proprietario.\nCospirare (Mentre giochi questa magia, puoi TAPpare due creature STAPpate che controlli che condividono un colore con essa. Quando lo fai, copia la magia. Puoi scegliere un nuovo bersaglio per la copia.)", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 173939, "name": "困惑する策謀", "text": "いずれかの墓地にあるクリーチャー・カード１枚を対象とし、それをオーナーの手札に戻す。\n共謀 （この呪文をプレイするに際し、あなたはあなたがコントロールするこの呪文と共通の色を持つアンタップ状態のクリーチャー２体をタップしてもよい。 そうした場合、この呪文をコピーする。あなたはそのコピーの新たな対象を選んでもよい。）", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 172133, "name": "Conspiração Perturbadora", "text": "Devolva o card de criatura alvo que esteja num cemitério para a mão de seu dono.\nConspirar (Conforme você joga essa mágica, você pode virar duas criaturas desviradas que você controla e que compartilhem uma cor com ela. Quando fizer isso, faça uma cópia dela e você poderá escolher um novo alvo para a cópia.)", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 172434, "name": "Недобрый Замысел", "text": "Верните целевую карту существа из кладбища в руку ее владельца.\nЗаговор (При разыгрывании этого заклинания вы можете повернуть два неповернутых существа под вашим контролем, у которых есть такой же цвет, как у него. Когда вы это делаете, скопируйте его, и вы можете выбрать новую цель для этой копии.)", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 173036, "name": "搅扰阴谋", "text": "将目标生物牌从坟墓场移回其拥有者手上。\n协力 （于你使用此咒语时，你可以横置两个由你操控、且与此咒语有共通颜色的未横置生物。 当你如此作，则复制此咒语，且你可以为该复制品选择新的目标。）", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "124841", "cardKingdomId": "124555", "cardsphereId": "41108", "mcmId": "19078", "mcmMetaId": "9628", "mtgjsonV4Id": "eb02132a-3599-5c57-a910-09d56c29d0fa", "mtgoFoilId": "29788", "mtgoId": "29787", "multiverseId": "158689", "scryfallId": "b7796925-fe69-4019-82ab-7cb75760b045", "scryfallIllustrationId": "06e442f8-aa75-4df4-ae21-15820c4cc556", "scryfallOracleId": "3efecb6c-7c21-4b3b-9612-e3916f91c680", "tcgplayerProductId": "18610"}, "keywords": ["Conspire"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{B}", "manaValue": 2.0, "name": "Disturbing Plot", "number": "64", "originalText": "Return target creature card in a graveyard to its owner's hand.\nConspire (As you play this spell, you may tap two untapped creatures you control that share a color with it. When you do, copy it and you may choose a new target for the copy.)", "originalType": "Sorcery", "printings": ["SHM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/cf361f50b1783192", "cardKingdomFoil": "https://mtgjson.com/links/29ae75c46e06d11d", "cardmarket": "https://mtgjson.com/links/ecedd9c0c425d08b", "tcgplayer": "https://mtgjson.com/links/961d0019a5df6aeb"}, "rarity": "common", "rulings": [], "setCode": "SHM", "subtypes": [], "supertypes": [], "text": "Return target creature card from a graveyard to its owner's hand.\nConspire (As you cast this spell, you may tap two untapped creatures you control that share a color with it. When you do, copy it and you may choose a new target for the copy.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "0c8876cb-2821-549e-a9a6-c61f177806a6"}