{"artist": "Kev Walker", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 7.0, "edhrecRank": 5629, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 421336, "name": "Abweichende Transformationen", "text": "Unverzagt (Dieser Zauberspruch kostet beim Wirken für jeden Gegner {1} weniger.)\nSchicke zwei Kreaturen deiner Wahl ins Exil. Für jede dieser Kreaturen deckt ihr Beherrscher Karten oben von seiner Bibliothek auf, bis er eine Kreaturenkarte aufdeckt. Er bringt die Karte ins Spiel und mischt dann den Rest der aufgedeckten Karten in seine Bibliothek.", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 423091, "name": "Transformaciones divergentes", "text": "Audacia. (Cuesta {1} menos lanzar este hechizo por cada oponente.)\nExilia dos criaturas objetivo. Por cada una de esas criaturas, su controlador muestra cartas de la parte superior de su biblioteca hasta que muestre una carta de criatura, la pone en el campo de batalla y luego baraja el resto en su biblioteca.", "type": "Instantáneo"}, {"language": "French", "multiverseId": 421687, "name": "Transformations divergentes", "text": "Témérité (Ce sort coûte {1} de moins à lancer pour chaque adversaire.)\nExilez deux créatures ciblées. Pour chacune de ces créatures, son contrôleur révèle les cartes du dessus de sa bibliothèque jusqu'à ce qu'il révèle une carte de créature, met cette carte sur le champ de bataille, puis mélange le reste dans sa bibliothèque.", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 422038, "name": "Trasformazioni Divergenti", "text": "Impavido (Questa magia costa {1} in meno per essere lanciata per ogni avversario.)\nEsilia due creature bersaglio. Per ognuna di quelle creature, il suo controllore rivela carte dalla cima del suo grimorio finché non rivela una carta creatura, mette quella carta sul campo di battaglia, poi rimescola le altre nel suo grimorio.", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 422389, "name": "分岐変容", "text": "不抜（この呪文を唱えるためのコストは対戦相手１人につき{1}少なくなる。）\nクリーチャー２体を対象とし、それらを追放する。それらのクリーチャー１体につき、それのコントローラーは、クリーチャー・カードが公開されるまで自分のライブラリーの一番上から１枚ずつ公開し、そのカードを戦場に出し、その後残りを自分のライブラリーに加えて切り直す。", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 422740, "name": "Transformações Divergentes", "text": "Inabalável (Esta mágica custa {1} a menos por cada oponente para ser conjurada.)\nExile duas criaturas alvo. Para cada uma dessas criaturas, seu controlador revela cards do topo do próprio grimório até revelar um card de criatura, coloca aquele card no campo de batalha e, em seguida, embaralha os demais no próprio grimório.", "type": "Mágica Instantânea"}, {"language": "Chinese Simplified", "multiverseId": 420985, "name": "趋异转化", "text": "不屈（每有一位对手，此咒语便减少{1}来施放。）\n放逐两个目标生物。为每个这类生物各进行以下流程～其操控者从其牌库顶开始展示牌，直到展示出一张生物牌为止，将该牌放进战场，然后将其余的牌洗回牌库。", "type": "瞬间"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "209630", "cardsphereId": "10691", "mcmId": "293542", "mcmMetaId": "224084", "mtgjsonV4Id": "37faea42-a912-5c49-8487-9681f62c27de", "multiverseId": "420634", "scryfallId": "2fb220db-604d-4779-9f57-fbcaf5c92cbf", "scryfallIllustrationId": "556d5272-223d-4f97-a942-40962b0fb044", "scryfallOracleId": "f08e835a-7827-4fdc-8dcf-ae74507da052", "tcgplayerProductId": "124455"}, "isStarter": true, "keywords": ["Undaunted"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{6}{R}", "manaValue": 7.0, "name": "Divergent Transformations", "number": "17", "originalText": "Undaunted (This spell costs {1} less to cast for each opponent.)\nExile two target creatures. For each of those creatures, its controller reveals cards from the top of his or her library until he or she reveals a creature card, puts that card onto the battlefield, then shuffles the rest into his or her library.", "originalType": "Instant", "printings": ["C16"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7ab1329f683f3df9", "cardmarket": "https://mtgjson.com/links/10b8d7d7c98cfc3b", "tcgplayer": "https://mtgjson.com/links/c907328beb4ba855"}, "rarity": "rare", "rulings": [{"date": "2016-11-08", "text": "You can’t cast Divergent Transformations without two target creatures. If a targeted creature becomes an illegal target for Divergent Transformations after it’s been cast, its controller won’t exile or replace that creature, but the other creature is still affected."}, {"date": "2016-11-08", "text": "If two players’ creatures are exiled this way, start with the player whose turn it is. If that player controlled a creature exiled this way, that player follows the process on Divergent Transformations to replace it. If not, proceed to the next player in turn order. Repeat until the players who controlled the exiled creatures have each replaced those creatures."}, {"date": "2016-11-08", "text": "If one player’s creatures are exiled this way, that player repeats this process twice."}, {"date": "2016-11-08", "text": "The two creatures that are put onto the battlefield are put onto the battlefield sequentially. Triggered abilities of the second won’t see the first enter the battlefield."}, {"date": "2016-11-08", "text": "Any abilities that trigger during the resolution of Divergent Transformations will wait to be put onto the stack until Divergent Transformations finishes resolving. An ability that triggers on the first creature entering the battlefield may target the second creature and vice versa."}, {"date": "2016-11-08", "text": "If the controller of a creature exiled this way has no creature cards left in their library, that player reveals the cards in their library, then shuffles it."}, {"date": "2016-11-08", "text": "Causing an opponent to lose the game after you’ve announced that you’re casting a spell with undaunted and determined its total cost won’t cause you to have to pay more mana."}, {"date": "2016-11-08", "text": "Effects that reduce what you pay to cast a spell don’t affect its converted mana cost. Sublime Exhalation’s converted mana cost is 7, regardless of how many opponents you have or how much mana you spent to cast it."}], "securityStamp": "oval", "setCode": "C16", "subtypes": [], "supertypes": [], "text": "Undaunted (This spell costs {1} less to cast for each opponent.)\nExile two target creatures. For each of those creatures, its controller reveals cards from the top of their library until they reveal a creature card, puts that card onto the battlefield, then shuffles the rest into their library.", "type": "Instant", "types": ["Instant"], "uuid": "3349b314-3e08-5132-9177-3813d3136376"}