{"artist": "Bryan Sola", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 2.0, "edhrecRank": 13764, "finishes": ["nonfoil", "foil"], "flavorText": "\"When darkness closes in around us, my blade will light our path.\"", "foreignData": [{"flavorText": "„Wenn die Dunkelheit über uns hereinbricht, beleuchtet meine Klinge unseren Weg.\"", "language": "German", "multiverseId": 527559, "name": "Göttliches Niederstrecken", "text": "Eine Kreatur oder ein Planeswalker deiner Wahl, die bzw. den ein Gegner kontrolliert, destabilisiert sich. Falls jene bleibende Karte schwarz ist, schicke sie stattdessen ins Exil. (Falls sich die bleibende Karte destabilisiert, behandle sie und alles, was an sie angelegt ist, bis zum Beginn des nächsten Zuges ihres Beherrschers, als würde es nicht existieren.)", "type": "Spontanzauber"}, {"flavorText": "\"Mi espada iluminará el camino cuando la oscuridad se cierna sobre nosotros\".", "language": "Spanish", "multiverseId": 527820, "name": "Castigo sagrado", "text": "La criatura o planeswalker objetivo que controla un oponente sale de fase. Si ese permanente es negro, en vez de eso, exílialo. (Si sale de fase, trátalo a él y a cualquier carta anexada a él como si no existiese hasta el próximo turno de su controlador.)", "type": "Instantáneo"}, {"flavorText": "« Lorsque les ténèbres se refermeront sur nous, ma lame éclairera notre voie. »", "language": "French", "multiverseId": 528081, "name": "Frappe divine", "text": "Une cible, créature ou planeswalker, qu'un adversaire contrôle passe hors phase. Si ce permanent est noir, exilez-le à la place. (S'il passe hors phase, traitez-le et tout ce qui lui est attaché comme s'il n'existait pas jusqu'au prochain tour de son contrôleur.)", "type": "Éphémère"}, {"flavorText": "\"Quando l'oscurità ci circonda, la mia lama illuminerà il cammino.\"", "language": "Italian", "multiverseId": 528342, "name": "Castigo Divino", "text": "Una creatura o un planeswalker bersaglio controllato da un avversario scompare. Se quel permanente è nero, invece esilialo. (Se scompare, tratta quella creatura e qualsiasi permanente ad essa assegnato come se non esistessero fino al prossimo turno del controllore della creatura.)", "type": "Istantaneo"}, {"flavorText": "「闇が我々に迫って来たら、我が剣が道を照らす。」", "language": "Japanese", "multiverseId": 528603, "name": "神聖なる一撃", "text": "クリーチャーやプレインズウォーカーのうち対戦相手がコントロールしている１つを対象とする。それはフェイズ・アウトする。そのパーマネントが黒であるなら、代わりに追放する。（それがフェイズ・アウトしたなら、それのコントローラーの次のターンまで、それやそれについているすべてのものは存在しないかのように扱う。）", "type": "インスタント"}, {"flavorText": "\"암흑이 우리 주변을 뒤덮으면, 내 검이 우리의 앞길을 비춰 줄 걸세.\"", "language": "Korean", "multiverseId": 528863, "name": "신성한 강타", "text": "상대가 조종하는 생물 또는 플레인즈워커를 목표로 정한다. 그 목표는 페이즈 아웃한다. 그 지속물이 흑색이라면, 대신 그 지속물을 추방한다. (지속물이 페이즈 아웃하면, 그 지속물의 조종자의 다음 턴까지 그 지속물 및 그 지속물에 부착되어 있는 것들이 존재하지 않는 것처럼 취급한다.)", "type": "순간마법"}, {"flavorText": "\"Quando as trevas nos envolverem, minha lâmina iluminará nosso caminho.\"", "language": "Portuguese (Brazil)", "multiverseId": 529124, "name": "Destruição Divina", "text": "A criatura ou o planeswalker alvo que um oponente controla sai de fase. Se aquela permanente for preta, em vez disso, exile-a. (Se ela sair de fase, trate-a, assim como qualquer coisa anexada a ela, como se não existisse até o próximo turno de seu controlador.)", "type": "Mágica Instantânea"}, {"flavorText": "«Когда тьма сомкнется вокруг нас, мой клинок осветит нам путь».", "language": "Russian", "multiverseId": 529385, "name": "Божественная Кара", "text": "Целевое существо или planeswalker под контролем оппонента уходит в противофазу. Если тот перманент черный, изгоните его вместо этого. (Если он уходит в противофазу, до следующего хода контролирующего его игрока обращайтесь с ним и всеми прикрепленными к нему объектами, как будто они не существуют.)", "type": "Мгновенное заклинание"}, {"flavorText": "「当黑暗迫近时，手中宝剑便会照亮前路。」", "language": "Chinese Simplified", "multiverseId": 529645, "name": "至圣斩", "text": "目标由对手操控的生物或鹏洛客跃离。如果该永久物是黑色，则改为将它放逐。（如果其跃离，则直到其操控者的下一个回合，它及贴附于其上的所有东西都视作不存在。）", "type": "瞬间"}, {"flavorText": "「當黑暗迫近時，手中寶劍便會照亮前路。」", "language": "Chinese Traditional", "multiverseId": 529905, "name": "至聖斬", "text": "目標由對手操控的生物或鵬洛客躍離。如果該永久物是黑色，則改為將它放逐。（如果其躍離，則直到其操控者的下一個回合，它及貼附於其上的所有東西都視作不存在。）", "type": "瞬間"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "248516", "cardKingdomId": "248209", "cardsphereId": "79277", "mcmId": "571728", "mcmMetaId": "344011", "mtgArenaId": "77117", "mtgjsonV4Id": "22081ad4-1608-574e-b100-89d3379670a4", "mtgoId": "91526", "multiverseId": "527299", "scryfallId": "6b8d0852-4df3-4b29-830d-c6975265ef53", "scryfallIllustrationId": "559ec34b-03b3-4455-867d-22a5c42ec1a1", "scryfallOracleId": "3b06b242-caed-4c8f-b5ab-30e86061286e", "tcgplayerProductId": "243399"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}", "manaValue": 2.0, "name": "Divine Smite", "number": "12", "originalText": "Target creature or planeswalker an opponent controls phases out. If that permanent is black, exile it instead. (If it phases out, treat it and anything attached to it as though they don't exist until its controller's next turn.)", "originalType": "Instant", "printings": ["AFR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/e8ce47e5415c8ee8", "cardKingdomFoil": "https://mtgjson.com/links/75811b135d772577", "cardmarket": "https://mtgjson.com/links/01fee45de4bec0ab", "tcgplayer": "https://mtgjson.com/links/95ec2dc103005bf1"}, "rarity": "uncommon", "rulings": [{"date": "2021-07-23", "text": "An attacking or blocking creature that phases out is removed from combat."}, {"date": "2021-07-23", "text": "Phasing out doesn't cause any “leaves the battlefield” abilities to trigger. Similarly, phasing in won't cause any “enters the battlefield” abilities to trigger."}, {"date": "2021-07-23", "text": "Phased out permanents are treated as though they don't exist. They can't be the target of spells or abilities, their static abilities have no effect on the game, their triggered abilities can't trigger, they can't attack or block, and so on."}, {"date": "2021-07-23", "text": "As a creature is phased out, Auras and Equipment attached to it also phase out at the same time. Those Auras and Equipment will phase in at the same time that creature does, and they'll phase in still attached to that creature."}, {"date": "2021-07-23", "text": "Permanents phase back in during their controller's untap step, immediately before that player untaps their permanents. Creatures that phase in this way are able to attack and pay a cost of {T} during that turn. If a permanent had counters on it when it phased out, it will have those counters when it phases back in."}, {"date": "2021-07-23", "text": "Any continuous effects with a “for as long as” duration, such as that of Mind Flayer, ignore phased-out objects. If ignoring those objects causes the effect's conditions to no longer be met, the duration will expire."}, {"date": "2021-07-23", "text": "Choices made for permanents as they entered the battlefield are remembered when they phase in."}, {"date": "2021-07-23", "text": "If an opponent gains control of your nonblack creature, you phase it out with Divine Smite, and the duration of the control-change effect expires before it phases back in, your creature phases in under your control as that opponent's next untap step begins. If they leave the game before their next untap step, it phases in as the next untap step begins after their turn would have begun."}], "setCode": "AFR", "subtypes": [], "supertypes": [], "text": "Target creature or planeswalker an opponent controls phases out. If that permanent is black, exile it instead. (If it phases out, treat it and anything attached to it as though they don't exist until its controller's next turn.)", "type": "Instant", "types": ["Instant"], "uuid": "c1ec41d7-43c7-52ec-a449-716175cd2b71"}