{"artist": "Amy Weber", "availability": ["mtgo"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 8.0, "edhrecRank": 12856, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "483b12ba-b26e-5d06-ae6d-883c149a377b", "mtgoFoilId": "33755", "mtgoId": "33754", "multiverseId": "201237", "scryfallId": "e250897e-a875-4c3c-bfec-4a09143dd587", "scryfallIllustrationId": "24d5623c-8647-41a3-9209-7fa8fc8cd8e8", "scryfallOracleId": "0158a440-6573-4f12-958b-a5f0cf190d5b"}, "isOnlineOnly": true, "isReprint": true, "isReserved": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{6}{W}{W}", "manaValue": 8.0, "name": "Divine Intervention", "number": "8", "originalText": "Divine Intervention enters the battlefield with two intervention counters on it.\nAt the beginning of your upkeep, remove an intervention counter from Divine Intervention. If there are no intervention counters on it, the game is a draw.", "originalType": "Enchantment", "printings": ["LEG", "ME3"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2009-10-01", "text": "When Divine Intervention’s third ability resolves, the game ends immediately. The game is a draw, meaning neither player wins and neither player loses."}, {"date": "2009-10-01", "text": "Divine Intervention’s third ability triggers only if its controller removes the last intervention counter from it. It doesn’t matter how that happens. For example, if you control Divine Intervention and the last intervention counter is removed as a result of a Clockspinning you control, the ability will trigger. On the other hand, if the last intervention counter is removed as a result of a Clockspinning another player controls, the ability won’t trigger (and won’t ever be able to)."}, {"date": "2009-10-01", "text": "In a multiplayer game played with the limited range of influence option, Divine Intervention won’t necessarily end the entire game when its third ability resolves. All players within range of Divine Intervention will leave the game. They’ll neither win nor lose; as far as they’re concerned, the result of the game is a draw. All other players will continue playing."}], "setCode": "ME3", "subtypes": [], "supertypes": [], "text": "Divine Intervention enters the battlefield with two intervention counters on it.\nAt the beginning of your upkeep, remove an intervention counter from Divine Intervention.\nWhen you remove the last intervention counter from Divine Intervention, the game is a draw.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "5da5e526-628b-590f-9d34-cf1cd9c46272"}