{"artist": "Zack Stella", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G", "R"], "colors": ["G", "R"], "convertedManaCost": 4.0, "edhrecRank": 7072, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 457569, "name": "Domri der Chaosstifter", "text": "+1: Erzeuge {R} oder {G}. Falls dieses Mana für einen Kreaturenzauber verwendet wird, erhält er Aufruhr.\n−3: Schaue dir die obersten vier Karten deiner Bibliothek an. Du kannst davon bis zu zwei Kreaturenkarten offen vorzeigen und auf deine Hand nehmen. Lege den Rest in zufälliger Reihenfolge unter deine Bibliothek.\n−8: Du erhältst ein Emblem mit „Erzeuge zu Beginn jedes Endsegments einen 4/4 roten und grünen Bestie-Kreaturenspielstein, der Trampelschaden verursacht.\"", "type": "Legendärer Planeswalker — Domri"}, {"language": "Spanish", "multiverseId": 457828, "name": "Domri, adalid del caos", "text": "+1: Agrega {R} o {G}. Si ese maná se usa en un hechizo de criatura, esa criatura gana la habilidad de insurgencia.\n−3: Mira las cuatro primeras cartas de tu biblioteca. Puedes mostrar hasta dos cartas de criatura que se encuentren entre ellas y ponerlas en tu mano. Pon el resto en el fondo de tu biblioteca en un orden aleatorio.\n−8: Obtienes un emblema con \"Al comienzo de cada paso final, crea una ficha de criatura Bestia roja y verde 4/4 con la habilidad de arrollar\".", "type": "Planeswalker legendario — Domri"}, {"language": "French", "multiverseId": 458087, "name": "Domri, porteur de chaos", "text": "+1 : Ajoutez {R} ou {G}. Si ce mana est dépensé pour un sort de créature, cette créature acquiert l'émeute.\n-3 : Regardez les quatre cartes du dessus de votre bibliothèque. Vous pouvez révéler jusqu'à deux cartes de créature parmi elles et les mettre dans votre main. Mettez le reste au-dessous de votre bibliothèque dans un ordre aléatoire.\n-8 : Vous gagnez un emblème avec « Au début de chaque étape de fin, créez un jeton de créature 4/4 rouge et verte Bête avec le piétinement. »", "type": "Planeswalker légendaire : Domri"}, {"language": "Italian", "multiverseId": 458346, "name": "Domri, Portatore del Caos", "text": "+1: Aggiungi {R} o {G}. Se quel mana viene speso per una magia creatura, quella creatura ha tumulto.\n-3: Guarda le prime quattro carte del tuo grimorio. Puoi rivelare fino a due carte creatura scelte tra esse e aggiungerle alla tua mano. Metti le altre in fondo al tuo grimorio in ordine casuale.\n-8: Ottieni un emblema con \"All'inizio di ogni sottofase finale, crea una pedina creatura Bestia 4/4 rossa e verde con travolgere\".", "type": "Planeswalker Leggendario — Domri"}, {"language": "Japanese", "multiverseId": 458605, "name": "混沌をもたらす者、ドムリ", "text": "+1：{R}か{G}を加える。このマナがクリーチャー・呪文のために使われたなら、それは暴動を得る。\n-3：あなたのライブラリーの一番上からカードを４枚見る。あなたはその中からクリーチャー・カード最大２枚を公開してあなたの手札に加えてもよい。残りをあなたのライブラリーの一番下に無作為の順番で置く。\n-8：あなたは「各終了ステップの開始時に、トランプルを持ち赤であり緑である４/４のビースト・クリーチャー・トークンを１体生成する。」を持つ紋章を得る。", "type": "伝説のプレインズウォーカー — ドムリ"}, {"language": "Korean", "multiverseId": 458864, "name": "혼돈을 가져오는 자, 돔리", "text": "+1: {R} 또는 {G}를 추가한다. 그 마나가 생물 주문에 지불된다면, 그 생물은 폭동을 얻는다.\n-3: 당신의 서고 맨 위 카드 네 장을 본다. 당신은 그중에서 생물 카드를 최대 두 장까지 공개하고 그 카드들을 당신의 손으로 가져갈 수 있다. 나머지 카드들은 무작위 순서로 당신의 서고 맨 밑에 놓는다.\n−8: 당신은 \"각 종료단 시작에, 돌진을 가진 4/4 적색 및 녹색 야수 생물 토큰 한 개를 만든다.\"를 가진 휘장을 얻는다.", "type": "전설적 플레인즈워커 — 돔리"}, {"language": "Portuguese (Brazil)", "multiverseId": 459123, "name": "Domri, Portador do Caos", "text": "+1: Adicione {R} ou {G}. Se esse mana for gasto numa mágica de criatura, aquela criatura ganhará tumulto.\n−3: Olhe os quatro cards do topo do seu grimório. Você pode revelar até dois cards de criatura dentre eles e colocá-los em sua mão. Coloque o restante no fundo de seu grimório em ordem aleatória.\n−8: Você recebe um emblema com \"No início de cada etapa final, crie uma ficha de criatura vermelha e verde 4/4 do tipo Besta com atropelar.\"", "type": "Planeswalker Lendário — Domri"}, {"language": "Russian", "multiverseId": 459382, "name": "Домри, Несущий Хаос", "text": "+1: добавьте {R} или {G}. Если та мана тратится на заклинание существа, то существо получает способность Беспорядков.\n—3: посмотрите четыре верхние карты вашей библиотеки. Вы можете показать не более двух находящихся среди них карт существ и положить их в вашу руку. Положите остальные карты в низ вашей библиотеки в случайном порядке.\n—8: вы получаете эмблему со способностью «В начале каждого заключительного шага создайте одну фишку существа 4/4 красный и зеленый Зверь с Пробивным ударом».", "type": "Легендарный Planeswalker — Домри"}, {"language": "Chinese Simplified", "multiverseId": 459641, "name": "致乱多密", "text": "+1：加{R}或{G}。如果该法术力用以支付生物咒语，则它获得起事异能。\n-3：检视你牌库顶的四张牌。你可以展示其中至多两张生物牌，并将它们置于你手上。将其余的牌以随机顺序置于你的牌库底。\n−8：你获得具有「在每个结束步骤开始时，派出一个4/4，红绿双色，具践踏异能的野兽衍生生物」的徽记。", "type": "传奇鹏洛客 ～多密"}, {"language": "Chinese Traditional", "multiverseId": 459900, "name": "致亂多密", "text": "+1：加{R}或{G}。如果該魔法力用以支付生物咒語，則它獲得起事異能。\n-3：檢視你牌庫頂的四張牌。你可以展示其中至多兩張生物牌，並將它們置於你手上。將其餘的牌以隨機順序置於你的牌庫底。\n−8：你獲得具有「在每個結束步驟開始時，派出一個4/4，紅綠雙色，具踐踏異能的野獸衍生生物」的徽記。", "type": "傳奇鵬洛客 ～多密"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "223519", "cardKingdomId": "223207", "cardsphereId": "58294", "mcmId": "368251", "mcmMetaId": "267620", "mtgArenaId": "69294", "mtgjsonV4Id": "d7eb83c2-7182-5f09-987b-2c40975e5dee", "mtgoId": "71332", "multiverseId": "457310", "scryfallId": "1f56bbf3-3884-495a-b9cd-6585d86f76f1", "scryfallIllustrationId": "7874c54e-ba11-4fd5-bbfb-8db587abb99b", "scryfallOracleId": "2a5408ed-8b47-4896-97e4-aa102a4b85c9", "tcgplayerProductId": "183182"}, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "loyalty": "5", "manaCost": "{2}{R}{G}", "manaValue": 4.0, "name": "Domri, Chaos Bringer", "number": "166", "originalText": "+1: Add {R} or {G}. If that mana is spent on a creature spell, it gains riot.\n−3: Look at the top four cards of your library. You may reveal up to two creature cards from among them and put them into your hand. Put the rest on the bottom of your library in a random order.\n−8: You get an emblem with \"At the beginning of each end step, create a 4/4 red and green Beast creature token with trample.\"", "originalType": "Legendary Planeswalker — Domri", "printings": ["MED", "RNA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/62ae30ca4eaa5cac", "cardKingdomFoil": "https://mtgjson.com/links/15080a7f84bbd8d9", "cardmarket": "https://mtgjson.com/links/2d6e4a0e6c7a8393", "tcgplayer": "https://mtgjson.com/links/ddcb76c3dfc2a7a2"}, "rarity": "mythic", "rulings": [{"date": "2019-01-25", "text": "Because it’s a loyalty ability, Domri’s first ability isn’t a mana ability. It can be activated only any time you could cast a sorcery. It uses the stack and can be responded to."}, {"date": "2019-01-25", "text": "Riot is a replacement effect. Players can’t respond to your choice of +1/+1 counter or haste, and they can’t take actions while the creature is on the battlefield without one or the other."}, {"date": "2019-01-25", "text": "If a creature entering the battlefield has riot but can’t have a +1/+1 counter put onto it, it gains haste."}, {"date": "2019-01-25", "text": "If you choose for the creature to gain haste, it gains haste indefinitely. It won’t lose it as the turn ends or as another player gains control of it."}, {"date": "2019-01-25", "text": "If a creature enters the battlefield with two instances of riot, you may choose to have it get two +1/+1 counters, one +1/+1 counter and haste, or two instances of haste. Multiple instances of haste on the same creature are redundant, but we’re not going to tell the Gruul how to live their lives."}], "securityStamp": "oval", "setCode": "RNA", "subtypes": ["Domri"], "supertypes": ["Legendary"], "text": "[+1]: Add {R} or {G}. If that mana is spent on a creature spell, it gains riot. (It enters the battlefield with your choice of a +1/+1 counter or haste.)\n[−3]: Look at the top four cards of your library. You may reveal up to two creature cards from among them and put them into your hand. Put the rest on the bottom of your library in a random order.\n[−8]: You get an emblem with \"At the beginning of each end step, create a 4/4 red and green Beast creature token with trample.\"", "type": "Legendary Planeswalker — Domri", "types": ["Planeswalker"], "uuid": "68e69f37-48d2-57c9-ada5-677f8775da2a"}