{"artist": "Wayne Reynolds", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 5.0, "edhrecRank": 326, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 111660, "name": "Zeit der Verdopplung", "text": "Würde ein Effekt einen oder mehrere Spielsteine unter deiner Kontrolle ins Spiel bringen, bringt er stattdessen doppelt so viele ins Spiel.\nWürde ein Effekt einen oder mehrere Marken auf eine bleibende Karte, die du kontrollierst, legen, legt er stattdessen doppelt so viele auf diese bleibende Karte.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 113190, "name": "Temporada duplicadora", "text": "Si un efecto fuera a poner en juego una o más fichas bajo tu control, en vez de eso, pone en juego el doble de esa cantidad.\nSi un efecto fuera a poner en juego uno o más contadores sobre un permanente que controlas, en vez de eso, pone en juego el doble de esa cantidad sobre ese permanente.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 111966, "name": "Saison de dédoublement", "text": "Si un effet devait mettre en jeu au moins un jeton sous votre contrôle, il met en jeu deux fois ce nombre de jetons en jeu à la place.\nSi un effet devait placer au moins un marqueur sur un permanent que vous contrôlez, il place deux fois ce nombre de marqueurs sur ce permanent à la place.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 112272, "name": "Stagione del Raddoppio", "text": "Se un effetto sta per mettere in gioco sotto il tuo controllo una o più pedine, invece mette in gioco il doppio di quelle pedine.\nSe un effetto sta per mettere su un permanente che controlli uno o più segnalini, invece mette su quel permanente il doppio di quei segnalini.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 112578, "name": "倍増の季節", "text": "いずれかの効果により１個以上のトークンがあなたのコントロール下で場に出る場合、代わりにそれはその２倍の数を出す。\nいずれかの効果によりあなたがコントロールするパーマネントの上にカウンターが置かれる場合、代わりにそれはその２倍の数をパーマネントの上に置く。", "type": "エンチャント"}, {"language": "Portuguese (Brazil)", "multiverseId": 112884, "name": "Temporada da Multiplicação", "text": "Se um efeito for colocar uma ou mais fichas em jogo sob seu controle, ao invés disso, ele colocará o dobro.\nSe um efeito for colocar um ou mais marcadores em uma permanente que você controla, ao invés disso, ele colocará o dobro naquela permanente.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 114292, "name": "Сезон удвоения", "text": "Если эффект должен ввести в игру одну или более фишек под вашим контролем, вместо этого он вводит вдвое больше.\nЕсли эффект должен поместить на перманент, который вы контролируете, один или более счетчиков, вместо этого он помещает вдвое больше.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 111354, "name": "倍产旺季", "text": "若任一效应将把一个或数个衍生物放置进场并由你操控，则改为将两倍数量的衍生物放置进场。\n若任一效应将在由你操控的永久物上放置一个或数个指示物，则改为在该永久物上放置两倍数量的指示物。", "type": "结界"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "118717", "cardKingdomId": "118426", "cardsphereId": "37996", "mcmId": "13364", "mcmMetaId": "7941", "mtgjsonV4Id": "fbaeb0ac-3883-52ad-b113-709ed5f13aa6", "mtgoFoilId": "23519", "mtgoId": "23518", "multiverseId": "89116", "scryfallId": "c7e71299-98f6-494e-b187-8d22ce5f50af", "scryfallIllustrationId": "da106099-46e1-4739-88b9-20543678899a", "scryfallOracleId": "01546b7d-a233-4176-8843-d732074dc5b6", "tcgplayerProductId": "13261"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "vintage": "Legal"}, "manaCost": "{4}{G}", "manaValue": 5.0, "name": "Doubling Season", "number": "158", "originalText": "If an effect would put one or more tokens into play under your control, it puts twice that many into play instead.\nIf an effect would place one or more counters on a permanent you control, it places twice that many on that permanent instead.", "originalType": "Enchantment", "printings": ["2XM", "BBD", "G11", "MMA", "PRM", "RAV"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/0fafa85f66f97dab", "cardKingdomFoil": "https://mtgjson.com/links/18bc2b83449dad9f", "cardmarket": "https://mtgjson.com/links/4334e741c2abdba8", "tcgplayer": "https://mtgjson.com/links/e63799a62828c89c"}, "rarity": "rare", "rulings": [{"date": "2020-08-07", "text": "Doubling Season affects permanents that enter the battlefield with a certain number of counters."}, {"date": "2020-08-07", "text": "Planeswalkers will enter the battlefield with double the normal number of loyalty counters. However, if you activate an ability whose cost has you put loyalty counters on a planeswalker, the number you put on isn't doubled. This is because those counters are put on as a cost, not as an effect."}, {"date": "2020-08-07", "text": "If there are two Doubling Seasons on the battlefield, then the number of tokens or counters is four times the original number. If there are three on the battlefield, then the number of tokens or counters is eight times the original number, and so on."}], "setCode": "RAV", "subtypes": [], "supertypes": [], "text": "If an effect would create one or more tokens under your control, it creates twice that many of those tokens instead.\nIf an effect would put one or more counters on a permanent you control, it puts twice that many of those counters on that permanent instead.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "ba3c07bc-9856-59e2-ba17-7329df4b456a"}