{"artist": "Even Amundsen", "availability": ["arena"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 5763, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"mtgArenaId": "68814", "mtgjsonV4Id": "f4e79c2b-dff4-5e75-b802-a8fed5ed36c9", "scryfallId": "34bef63a-cb84-4013-856c-8211b76d5efa", "scryfallIllustrationId": "f5207166-5407-4087-bec1-dba6b714a0dd", "scryfallOracleId": "946675f5-8998-4f1b-934b-85ffe6e2f002"}, "isOnlineOnly": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {}, "manaCost": "{R}{R}", "manaValue": 2.0, "name": "Doublecast", "number": "37", "printings": ["JMP", "M19", "XANA"], "purchaseUrls": {}, "rarity": "uncommon", "rulings": [{"date": "2018-07-13", "text": "If you cast one Doublecast after another, you’ll copy the second Doublecast. Each resolves, creating two delayed triggered abilities. The next spell you cast after that will be copied twice. If that spell is also a Doublecast, the following spell will be copied three times, and so on."}, {"date": "2018-07-13", "text": "Doublecast’s ability will copy any instant or sorcery spell, not just one with targets."}, {"date": "2018-07-13", "text": "A copy is created even if the spell that caused Doublecast’s ability to trigger has been countered by the time that ability resolves. The copy resolves before the original spell."}, {"date": "2018-07-13", "text": "The copy will have the same targets as the spell it’s copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. The new targets must be legal."}, {"date": "2018-07-13", "text": "If the spell that’s copied is modal (that is, it says “Choose one —” or the like), the copy will have the same mode or modes. You can’t choose different ones."}, {"date": "2018-07-13", "text": "If the spell that’s copied has an X whose value was determined as it was cast, the copy has the same value of X."}, {"date": "2018-07-13", "text": "You can’t choose to pay any additional costs for the copy. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too."}, {"date": "2018-07-13", "text": "The copy that Doublecast’s ability creates is created on the stack, so it’s not “cast.” Abilities that trigger when a player casts a spell won’t trigger."}], "setCode": "XANA", "subtypes": [], "supertypes": [], "text": "When you cast your next instant or sorcery spell this turn, copy that spell. You may choose new targets for the copy.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "e4a5382a-a5ff-5785-9b4b-4567a3c36ab7"}