{"artist": "Cristi Balanescu", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 5.0, "edhrecRank": 7617, "finishes": ["etched"], "flavorText": "You know that mighty dracoliches will one day rule over this world. For you, that day can't come soon enough.", "foreignData": [], "frameEffects": ["legendary", "inverted"], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": false, "identifiers": {"cardKingdomEtchedId": "260973", "cardsphereId": "89659", "mcmId": "660003", "mcmMetaId": "408427", "mtgjsonV4Id": "9f780f36-ba81-55f2-85fe-8f66d09f4677", "scryfallId": "465cb37e-627d-44ec-9d2d-6a630b14c25f", "scryfallIllustrationId": "a8ee7a5f-68cf-41f7-a83e-fa5dd71ca4f3", "scryfallOracleId": "d1d7c5fa-a92a-4815-a558-6d3daf37f4c4", "tcgplayerEtchedProductId": "272801"}, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "paupercommander": "Restricted", "vintage": "Legal"}, "manaCost": "{4}{R}", "manaValue": 5.0, "name": "Dragon Cultist", "number": "503", "printings": ["CLB"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdomEtched": "https://mtgjson.com/links/8adc2cba89b2164f", "cardmarket": "https://mtgjson.com/links/87d908d6bd4cbb72", "tcgplayerEtched": "https://mtgjson.com/links/d49dc39341114484"}, "rarity": "uncommon", "rulings": [{"date": "2022-06-10", "text": "The triggered ability granted by Dragon Cultist looks for the total amount of damage dealt by a single source, even if that damage wasn't dealt all at once or wasn't dealt to the same player or permanent. For example, if an attacking 3/3 creature with double strike deals 3 damage to one blocker in the first combat damage step and 3 damage to another blocker in the second combat damage step, then it has dealt a total of 6 damage and will cause this ability to trigger."}, {"date": "2022-06-10", "text": "You need to control the source that dealt damage only at the time that the damage was dealt. If it dies or changes control after that point, this ability will still trigger at the beginning of your end step as long as you control a commander creature with the ability."}, {"date": "2022-06-10", "text": "Choose a Background is a variant of the partner ability. You may have two commanders if one of them is a legendary creature with the choose a background ability and the other is a legendary Background enchantment. Backgrounds and cards with choose a Background do not interact with cards which have any other partner ability."}, {"date": "2022-06-10", "text": "If your Commander deck has two commanders, you can include only cards whose own color identities are also found in your commanders’ combined color identities."}, {"date": "2022-06-10", "text": "Both commanders start in the command zone, and the remaining 98 cards (or 58 cards in a Commander Draft game) of your deck are shuffled to become your library."}, {"date": "2022-06-10", "text": "If your commander loses the choose a Background ability or stops being a Background during the game, as appropriate, it is still your commander."}, {"date": "2022-06-10", "text": "Once the game begins, your two commanders are tracked separately. If you cast one, you won’t have to pay an additional {2} the first time you cast the other. A player loses the game after having been dealt 21 combat damage from any one of them, not from both of them combined (although your Background won’t usually be a creature anyway)."}, {"date": "2022-06-10", "text": "If something refers to your commander while you have two commanders, it refers to one of them of your choice. If you are instructed to perform an action on your commander (e.g. put it from the command zone into your hand due to Command Beacon), you choose one of your commanders at the time the effect happens."}, {"date": "2022-06-10", "text": "An effect that checks whether you control your commander is satisfied if you control one or both of your two commanders."}, {"date": "2022-06-10", "text": "You can choose two commanders that are the same color or colors."}, {"date": "2022-06-10", "text": "If a card refers to a commander creature you own, a Background won't usually be counted or included for that effect. If another spell or ability causes your Background to become a creature, however, it will be included. Any effect that refers to your commander or a commander you own or control without specifying creature will apply to a Background that is your commander, as appropriate."}, {"date": "2022-06-10", "text": "If you control a Background that grants an ability to commander creatures you own, and you own more than one commander creature, each of them will have that ability."}], "setCode": "CLB", "subtypes": ["Background"], "supertypes": ["Legendary"], "text": "Commander creatures you own have \"At the beginning of your end step, if a source you controlled dealt 5 or more damage this turn, create a 4/4 red Dragon creature token with flying.\"", "type": "Legendary Enchantment — Background", "types": ["Enchantment"], "uuid": "ee86be06-ffc1-5473-9080-fdb4a1202eae", "variations": ["5d06c6e2-573f-5abb-9bce-20a0924efd93"]}