{"artist": "Seb McKinnon", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 6.0, "edhrecRank": 11577, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 395343, "name": "Vorrecht des Drachenfürsten", "text": "Als zusätzliche Kosten, um das Vorrecht des Drachenfürsten zu wirken, kannst du eine Drache-Karte aus deiner Hand offen vorzeigen.\nFalls du eine Drache-Karte offen vorgezeigt oder einen Drachen kontrolliert hast, sowie du das Vorrecht des Drachenfürsten gewirkt hast, kann das Vorrecht des Drachenfürsten nicht neutralisiert werden.\nZiehe vier Karten.", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 397191, "name": "Prerrogativa del señor dragón", "text": "Como coste adicional para lanzar la Prerrogativa del señor dragón, puedes mostrar una carta de Dragón de tu mano.\nSi mostraste una carta de Dragón o controlabas un Dragón al lanzar la Prerrogativa del señor dragón, la Prerrogativa del señor dragón no puede ser contrarrestada.\nRoba cuatro cartas.", "type": "Instantáneo"}, {"language": "French", "multiverseId": 395607, "name": "Privilège du seigneur-dragon", "text": "En tant que coût supplémentaire pour lancer le Privilège du seigneur-dragon, vous pouvez révéler une carte de dragon de votre main.\nSi vous avez révélé une carte de dragon ou si vous contrôliez un dragon au moment où vous avez lancé le Privilège du seigneur-dragon, le Privilège du seigneur-dragon ne peut pas être contrecarré.\nPiochez quatre cartes.", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 395871, "name": "Prerogativa del Signore dei Draghi", "text": "Come costo addizionale per lanciare la Prerogativa del Signore dei Draghi, puoi rivelare una carta Drago dalla tua mano.\nSe hai rivelato una carta Drago o controllavi un Drago mentre hai lanciato la Prerogativa del Signore dei Draghi, la Prerogativa del Signore dei Draghi non può essere neutralizzata.\nPesca quattro carte.", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 396135, "name": "龍王の大権", "text": "龍王の大権を唱えるための追加コストとして、あなたの手札にあるドラゴン・カードを１枚公開してもよい。\nあなたが龍王の大権を唱えた時点でドラゴン・カードを公開したかドラゴンをコントロールしていたなら、龍王の大権は打ち消されない。\nカードを４枚引く。", "type": "インスタント"}, {"language": "Korean", "multiverseId": 396399, "name": "용군주의 특권", "text": "용군주의 특권을 발동하기 위한 추가비용으로, 당신의 손에서 용 카드 한 장을 공개할 수 있다.\n용군주의 특권을 발동하면서 당신이 용 카드를 공개했거나 용을 조종했다면, 용군주의 특권은 무효화될 수 없다.\n카드 네 장을 뽑는다.", "type": "순간마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 396663, "name": "Regalia dos Soberanos Dragões", "text": "Como custo adicional para conjurar Regalia dos Soberanos Dragões, você pode revelar um card de Dragão da sua mão.\nSe você tiver revelado um card de Dragão ou controlado um Dragão conforme conjurava Regalia dos Soberanos Dragões, Regalia dos Soberanos Dragões não poderá ser anulado.\nCompre quatro cards.", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 396927, "name": "Право Владыки Драконов", "text": "В качестве дополнительной стоимости разыгрывания Права Владыки Драконов вы можете показать карту Дракона из вашей руки.\nЕсли при разыгрывании Права Владыки Драконов вы показали карту Дракона или контролировали Дракона, Право Владыки Драконов не может быть отменено.\nВозьмите четыре карты.", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 394815, "name": "龙王的特权", "text": "你可以从你手上展示一张龙牌，以作为施放龙王的特权之额外费用。\n如果于你施放龙王的特权时，你展示了龙牌或操控龙，则龙王的特权不能被反击。\n抓四张牌。", "type": "瞬间"}, {"language": "Chinese Traditional", "multiverseId": 395079, "name": "龍王的特權", "text": "你可以從你手上展示一張龍牌，以作為施放龍王的特權之額外費用。\n如果於你施放龍王的特權時，你展示了龍牌或操控龍，則龍王的特權不能被反擊。\n抽四張牌。", "type": "瞬間"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "199785", "cardKingdomId": "199363", "cardsphereId": "13690", "mcmId": "273199", "mcmMetaId": "211211", "mtgjsonV4Id": "39cbc474-d7d2-5250-9841-06f5a777c733", "mtgoFoilId": "56399", "mtgoId": "56398", "multiverseId": "394551", "scryfallId": "53f2d2b3-6e48-413e-ad8f-9ce40c7ff167", "scryfallIllustrationId": "891c38e5-d4fa-4c94-991e-9b8589b6eb1a", "scryfallOracleId": "46bc0aaf-987f-4c8d-b98b-50b90f97c9a3", "tcgplayerProductId": "96516"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U}{U}", "manaValue": 6.0, "name": "Dragonlord's Prerogative", "number": "52", "originalText": "As an additional cost to cast Dragonlord's Prerogative, you may reveal a Dragon card from your hand.\nIf you revealed a Dragon card or controlled a Dragon as you cast Dragonlord's Prerogative, Dragonlord's Prerogative can't be countered.\nDraw four cards.", "originalType": "Instant", "printings": ["DTK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7014f7c484a56238", "cardKingdomFoil": "https://mtgjson.com/links/edb922abb6dbec1c", "cardmarket": "https://mtgjson.com/links/9c53f30c3d1f5cf1", "tcgplayer": "https://mtgjson.com/links/ecbb94c0b79089d9"}, "rarity": "rare", "rulings": [{"date": "2015-02-25", "text": "If one of these spells is copied, the controller of the copy will get the “Dragon bonus” only if a Dragon card was revealed as an additional cost. The copy wasn’t cast, so whether you controlled a Dragon won’t matter."}, {"date": "2015-02-25", "text": "You can’t reveal more than one Dragon card to multiply the bonus. There is also no additional benefit for both revealing a Dragon card as an additional cost and controlling a Dragon as you cast the spell."}, {"date": "2015-02-25", "text": "If you don’t reveal a Dragon card from your hand, you must control a Dragon as you are finished casting the spell to get the bonus. For example, if you lose control of your only Dragon while casting the spell (because, for example, you sacrificed it to activate a mana ability), you won’t get the bonus."}], "securityStamp": "oval", "setCode": "DTK", "subtypes": [], "supertypes": [], "text": "As an additional cost to cast this spell, you may reveal a Dragon card from your hand.\nIf you revealed a Dragon card or controlled a Dragon as you cast this spell, this spell can't be countered.\nDraw four cards.", "type": "Instant", "types": ["Instant"], "uuid": "b1f0d601-bb0f-52a6-bbd7-d626495cbee9"}