{"artist": "Greg Staples", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "U"], "colors": ["B", "U"], "convertedManaCost": 5.0, "edhrecRank": 11149, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 509905, "name": "Dralnu, Lichfürst", "text": "Falls Dralnu, Lichfürst, Schaden zugefügt würde, opfere stattdessen entsprechend viele bleibende Karten.\n{T}: Eine Spontanzauber- oder Hexereikarte deiner Wahl in deinem Friedhof erhält Rückblende bis zum Ende des Zuges. Die Rückblendekosten sind gleich ihrer Manakosten. (Du kannst die Karte aus deinem Friedhof für ihre Rückblendekosten wirken. Schicke sie danach ins Exil.)", "type": "Legendäre Kreatur — Zombie, Zauberer"}, {"language": "Spanish", "multiverseId": 510194, "name": "Dralnu, señor liche", "text": "Si se le fuera a hacer daño a Dralnu, señor liche, en vez de eso, sacrifica esa misma cantidad de permanentes.\n{T}: La carta de instantáneo o de conjuro objetivo de tu cementerio gana la habilidad de retrospectiva hasta el final del turno. Su coste de retrospectiva es igual a su coste de maná. &lt;I&gt;(Puedes lanzar esa carta desde tu cementerio pagando su coste de retrospectiva. Luego exíliala.)&lt;/I&gt;", "type": "Criatura legendaria — Hechicero zombie"}, {"language": "French", "multiverseId": 510483, "name": "Dralnu, seigneur liche", "text": "Si des blessures devaient être infligées à Dralnu, seigneur liche, sacrifiez autant de permanents à la place.\n{T} : Une carte d'éphémère ou de rituel ciblée de votre cimetière acquiert le flashback jusqu'à la fin du tour. Le coût de flashback est égal à son coût de mana. &lt;I&gt;(Vous pouvez lancer cette carte depuis votre cimetière pour son coût de flashback. Exilez-la ensuite.)&lt;/I&gt;", "type": "Créature légendaire : zombie et sorcier"}, {"language": "Italian", "multiverseId": 510772, "name": "Dralnu, Signore dei Lich", "text": "Se sta per essere inflitto danno a Dralnu, Signore dei Lich, sacrifica invece altrettanti permanenti.\n{T}: Una carta istantaneo o stregoneria bersaglio nel tuo cimitero ha flashback fino alla fine del turno. Il costo di flashback è pari al suo costo di mana. &lt;I&gt;(Puoi lanciare quella carta dal tuo cimitero pagando il suo costo di flashback. Poi esiliala.)&lt;/I&gt;", "type": "Creatura Leggendaria — Mago Zombie"}, {"language": "Japanese", "multiverseId": 511061, "name": "死者の王、ドラルヌ", "text": "死者の王、ドラルヌにダメージが与えられるなら、代わりにその点数に等しい数のパーマネントを生け贄に捧げる。\n{T}：あなたの墓地にあるインスタント・カード１枚かソーサリー・カード１枚を対象とする。ターン終了時まで、それはフラッシュバックを得る。そのフラッシュバック・コストは、それのマナ・コストに等しい。&lt;I&gt;（あなたはあなたの墓地からそのカードをそれのフラッシュバック・コストで唱えてもよい。その後、それを追放する。）&lt;/I&gt;", "type": "伝説のクリーチャー — ゾンビ・ウィザード"}, {"language": "Portuguese (Brazil)", "multiverseId": 511350, "name": "Dralnu, Senhor Lich", "text": "Se dano for ser causado a Dralnu, Senhor Lich, em vez disso, sacrifique a mesma quantidade de permanentes.\n{T}: O card de mágica instantânea ou de feitiço alvo em seu cemitério ganha recapitular até o final do turno. Seu custo de recapitular é igual ao seu custo de mana. &lt;I&gt;(Você pode conjurar aquele card de seu cemitério pagando seu custo de recapitular. Em seguida, exile-o.)&lt;/I&gt;", "type": "Criatura Lendária — Zumbi Mago"}, {"language": "Russian", "multiverseId": 511639, "name": "Дралну, Лорд Лич", "text": "Если Дралну, Лорду Личу должны быть нанесены повреждения, вместо этого пожертвуйте такое же количество перманентов.\n{T}: целевая карта мгновенного заклинания или волшебства на вашем кладбище получает Воспоминание до конца хода. Стоимость Воспоминания равна ее мана-стоимости. &lt;I&gt;(Вы можете разыграть ту карту из вашего кладбища за ее стоимость Воспоминания. Затем изгоните ее.)&lt;/I&gt;", "type": "Легендарное Существо — Зомби Чародей"}, {"language": "Chinese Simplified", "multiverseId": 511928, "name": "巫妖领主卓尔努", "text": "如果巫妖领主卓尔努将受到伤害，则改为牺牲等量的永久物。\n{T}：目标在你坟墓场中的瞬间或法术牌获得返照异能直到回合结束。其返照费用等同于该牌的法术力费用。&lt;I&gt;（你可以从你的坟墓场施放该牌，并支付其返照费用，然后将它放逐。）&lt;/I&gt;", "type": "传奇生物 ～灵俑／法术师"}, {"language": "Chinese Traditional", "multiverseId": 512217, "name": "巫妖領主卓爾努", "text": "如果巫妖領主卓爾努將受到傷害，則改為犧牲等量的永久物。\n{T}：目標在你墳墓場中的瞬間或巫術牌獲得返照異能直到回合結束。其返照費用等同於該牌的魔法力費用。&lt;I&gt;（你可以從你的墳墓場施放該牌，並支付其返照費用，然後將它放逐。）&lt;/I&gt;", "type": "傳奇生物 ～殭屍／魔法師"}], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "242988", "cardKingdomId": "242483", "cardsphereId": "74704", "mcmId": "543001", "mcmMetaId": "8359", "mtgjsonV4Id": "d72dc24b-9ca5-5fa3-9997-44df452dbfe5", "mtgoId": "86877", "multiverseId": "509616", "scryfallId": "9554f402-35d4-43ac-9494-9d17d2a79092", "scryfallIllustrationId": "1b8c0369-aec6-4514-a83b-e2c85db29b7b", "scryfallOracleId": "35ab189a-adc8-48d6-82d2-53eb56a4d5e4", "tcgplayerProductId": "233784"}, "isReprint": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}{B}", "manaValue": 5.0, "name": "Dralnu, Lich Lord", "number": "251", "originalText": "If damage would be dealt to Dralnu, Lich Lord, sacrifice that many permanents instead.\n{T}: Target instant or sorcery card in your graveyard gains flashback until end of turn. The flashback cost is equal to its mana cost. (You may cast that card from your graveyard for its flashback cost. Then exile it.)", "originalType": "Legendary Creature — Zombie Wizard", "power": "3", "printings": ["TSP", "TSR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/106f840c52fa2dec", "cardKingdomFoil": "https://mtgjson.com/links/7478cf54a76e455d", "cardmarket": "https://mtgjson.com/links/5aac756d911f3605", "tcgplayer": "https://mtgjson.com/links/bad3647abc3295c7"}, "rarity": "rare", "rulings": [{"date": "2021-03-19", "text": "Dralnu may be one of the permanents you sacrifice while applying its replacement effect."}, {"date": "2021-03-19", "text": "If Dralnu would be dealt more damage than the number of permanents you control, instead you sacrifice all permanents you control."}, {"date": "2021-03-19", "text": "If any of the sacrificed permanents would deal or be dealt damage at the same time as Dralnu, they deal or are dealt damage at the same time that they’re sacrificed. Any abilities of the sacrificed permanents that would trigger on that damage don’t trigger, but abilities of other permanents that trigger on that damage do."}, {"date": "2021-03-19", "text": "“Flashback [cost]” means “You may cast this card from your graveyard by paying [cost] rather than paying its mana cost” and “If the flashback cost was paid, exile this card instead of putting it anywhere else any time it would leave the stack.”"}, {"date": "2021-03-19", "text": "You must still follow any timing restrictions and permissions, including those based on the card’s type. For instance, you can cast a sorcery using flashback only when you could normally cast a sorcery."}, {"date": "2021-03-19", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a flashback cost) you’re paying, add any cost increases, then apply any cost reductions. The mana value of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2021-03-19", "text": "A spell cast using flashback will always be exiled afterward, whether it resolves, is countered, or leaves the stack in some other way."}, {"date": "2021-03-19", "text": "You can cast a spell using flashback even if it was somehow put into your graveyard without having been cast."}, {"date": "2021-03-19", "text": "If a card with flashback is put into your graveyard during your turn, you can cast it if it’s legal to do so before any other player can take any actions."}, {"date": "2021-03-19", "text": "If you cast an instant or sorcery with {X} in its mana cost this way, you still choose the value of X as part of casting the spell and pay that cost."}, {"date": "2021-03-19", "text": "If you cast a spell with flashback, you can’t pay any alternative costs such as overload costs. You can pay additional costs such as kicker costs. If the spell has any mandatory additional costs, you must pay those to cast the spell with flashback."}, {"date": "2021-03-19", "text": "If a card has multiple instances of flashback, you may choose any of its flashback costs to pay."}, {"date": "2021-03-19", "text": "If a split card gains flashback, you pay only the cost of the half you’re casting."}, {"date": "2021-03-19", "text": "If a card with no mana cost gains flashback, it has no flashback cost. It can’t be cast this way."}], "securityStamp": "oval", "setCode": "TSR", "subtypes": ["Zombie", "Wizard"], "supertypes": ["Legendary"], "text": "If damage would be dealt to Dralnu, Lich Lord, sacrifice that many permanents instead.\n{T}: Target instant or sorcery card in your graveyard gains flashback until end of turn. The flashback cost is equal to its mana cost. (You may cast that card from your graveyard for its flashback cost. Then exile it.)", "toughness": "3", "type": "Legendary Creature — Zombie Wizard", "types": ["Creature"], "uuid": "be81a18f-717e-556d-be81-9524470bf7e5"}