{"artist": "David Rapoza", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 3406, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "c97d8809-edd6-5683-8f33-e35bc71ab8f8", "mtgoId": "88280", "scryfallId": "29fb5ded-4126-449e-a5ae-52da04378561", "scryfallIllustrationId": "5dd25712-8fb9-461b-b2b4-67cadc9a0334", "scryfallOracleId": "ccdf3399-b836-47ab-802d-af5a9c24d759"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}", "manaValue": 4.0, "name": "Draugr Necromancer", "number": "88280", "originalReleaseDate": "2021-02-28", "power": "4", "printings": ["KHM", "PKHM", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "If an opponent controls a nontoken creature that you own and that creature would die, it will be exiled with an ice counter on it. However, you won’t be able to cast that card from exile."}, {"date": "2021-02-05", "text": "Similarly, if a nontoken land an opponent controls that’s become a creature dies, that card will be exiled with an ice counter, but Draugr Necromancer doesn’t allow you to play lands from exile."}, {"date": "2021-02-05", "text": "Casting a spell from exile this way follows the normal rules for casting that spell. You must pay its costs, and you must follow all applicable timing rules."}, {"date": "2021-02-05", "text": "Draugr Necromancer allows you to cast spells from among any cards in exile your opponents own with ice counters on them, including cards that were exiled by previous Draugr Necromancers."}, {"date": "2021-02-05", "text": "Snow is a supertype, not a card type. It has no rules meaning or function by itself, but spells and abilities may refer to it."}, {"date": "2021-02-05", "text": "The {S} symbol is a generic mana symbol. It represents a cost that can be paid by one mana that was produced by a snow source. That mana can be any color or colorless."}, {"date": "2021-02-05", "text": "Snow isn’t a type of mana. If an effect says you may spend mana as though it were any type, you can’t pay for {S} using mana that wasn’t produced by a snow source."}, {"date": "2021-02-05", "text": "Some cards have additional effects for each {S} spent to cast them. You can cast these spells even if you don’t spend any snow mana to cast them; their additional effects simply won’t do anything."}, {"date": "2021-02-05", "text": "The Kaldheim set doesn’t have any cards with mana costs that include {S}, but some previous sets do. If an effect says such a spell costs {1} less to cast, that reduction doesn’t apply to any {S} costs. This is also true for activated abilities that include {S} in their activation costs and effects that reduce those costs."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Zombie", "Cleric"], "supertypes": ["Snow"], "text": "If a nontoken creature an opponent controls would die, exile that card with an ice counter on it instead.\nYou may cast spells from among cards in exile your opponents own with ice counters on them, and you may spend mana from snow sources as though it were mana of any color to cast those spells.", "toughness": "4", "type": "Snow Creature — Zombie Cleric", "types": ["Creature"], "uuid": "53af2b3e-551d-5b2c-888f-d82d27099bde"}