{"artist": "David Rapoza", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 2.0, "edhrecRank": 1908, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "953aa636-782d-523e-806c-07c7e9908304", "mtgoId": "88276", "scryfallId": "e55ab47e-f7b2-4f8e-985c-7121a87829ac", "scryfallIllustrationId": "a098ac08-1bc4-448c-b989-0a97f8f92567", "scryfallOracleId": "0ff7440b-b831-40a9-81c4-99d77bf93b8d"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{B}", "manaValue": 2.0, "name": "Dream Devourer", "number": "88276", "originalReleaseDate": "2021-02-28", "power": "0", "printings": ["KHM", "PKHM", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "It doesn’t matter if Dream Devourer is still on the battlefield or still under your control as you cast the spell from exile."}, {"date": "2021-02-05", "text": "Cards that are foretold by virtue of Dream Devourer’s ability won’t continue to have the foretell ability once they leave your hand, but you can still cast them from exile on a later turn for the foretell costs they were given by Dream Devourer."}, {"date": "2021-02-05", "text": "The reduction of the foretell cost applies only to generic mana in the foretell cost. It can’t reduce requirements of specific colors of mana. For example, if you foretell a card in your hand with mana cost {1}{G}{G}, its foretell cost will be {G}{G}."}, {"date": "2021-02-05", "text": "If you foretell a modal double-faced card, the foretell cost will be based on the mana cost of the face you cast from exile. For example, if you foretell Kolvori, God of Kinship/The Ringhart Crest, you can cast Kolvori by paying {G}{G} or The Ringhart Crest by paying {G} on a future turn. If you foretell a modal double-faced card whose front face is a nonland face but whose back face is a land face, you can’t play that card as a land."}, {"date": "2021-02-05", "text": "The last ability triggers when you exile a card from your hand using foretell, not when you cast a foretold card from exile."}, {"date": "2021-02-05", "text": "Because exiling a card with foretell from your hand is a special action, you can do so any time you have priority during your turn, including in response to spells and abilities. Once you announce you’re taking the action, no other player can respond by trying to remove the card from your hand."}, {"date": "2021-02-05", "text": "Casting a foretold card from exile follows the timing rules for that card. If you foretell an instant card, you can cast it as soon as the next player’s turn. In most cases, if you foretell a card that isn’t an instant (or doesn’t have flash), you’ll have to wait until your next turn to cast it."}, {"date": "2021-02-05", "text": "If you’re casting a foretold card from exile for its foretell cost, you can’t choose to cast it for any other alternative costs. You can, however, pay additional costs, such as kicker costs. If the card has any mandatory additional costs, those must be paid to cast the spell."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Demon", "Cleric"], "supertypes": [], "text": "Each nonland card in your hand without foretell has foretell. Its foretell cost is equal to its mana cost reduced by {2}. (During your turn, you may pay {2} and exile it from your hand face down. Cast it on a later turn for its foretell cost.)\nWhenever you foretell a card, Dream Devourer gets +2/+0 until end of turn.", "toughness": "3", "type": "Creature — Demon Cleric", "types": ["Creature"], "uuid": "fd130d32-5e1b-5382-a189-07c02ada0e24"}