{"artist": "G-host Lee", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 4766, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 461316, "name": "Arkanist der Schreckenshorde", "text": "Verursacht Trampelschaden\nImmer wenn der Arkanist der Schreckenshorde angreift, kannst du eine Spontanzauber- oder Hexereikarte deiner Wahl, deren umgewandelte Manakosten kleiner oder gleich der Stärke des Arkanisten der Schreckenshorde sind, aus deinem Friedhof wirken, ohne ihre Manakosten zu bezahlen. Falls die Karte in diesem Zug auf deinen Friedhof gelegt würde, schicke sie stattdessen ins Exil.", "type": "Kreatur — Zombie, Zauberer"}, {"language": "Spanish", "multiverseId": 461580, "name": "Arcanista de la Horda del Terror", "text": "Arrolla.\nSiempre que el Arcanista de la Horda del Terror ataque, puedes lanzar la carta de instantáneo o de conjuro objetivo con coste de maná convertido menor o igual que la fuerza del Arcanista de la Horda del Terror desde tu cementerio sin pagar su coste de maná. Si esa carta fuera a ir a tu cementerio este turno, en vez de eso, exíliala.", "type": "Criatura — Hechicero zombie"}, {"language": "French", "multiverseId": 461844, "name": "Arcaniste de la Horde de l'effroi", "text": "Piétinement\nÀ chaque fois que l'Arcaniste de la Horde de l'effroi attaque, vous pouvez lancer une carte d'éphémère ou de rituel ciblée avec un coût converti de mana inférieur ou égal à la force de l'Arcaniste de la Horde de l'effroi depuis votre cimetière sans payer son coût de mana. Si cette carte devait être mise dans votre cimetière ce tour-ci, exilez-la à la place.", "type": "Créature : zombie et sorcier"}, {"language": "Italian", "multiverseId": 462108, "name": "Arcanista dell'Orda Atroce", "text": "Travolgere\nOgniqualvolta l'Arcanista dell'Orda Atroce attacca, puoi lanciare una carta istantaneo o stregoneria bersaglio con costo di mana convertito pari o inferiore alla forza dell'Arcanista dell'Orda Atroce dal tuo cimitero senza pagare il suo costo di mana. Se quella carta sta per essere messa nel tuo cimitero in questo turno, invece esiliala.", "type": "Creatura — Mago Zombie"}, {"language": "Japanese", "multiverseId": 462372, "name": "戦慄衆の秘儀術師", "text": "トランプル\n戦慄衆の秘儀術師が攻撃するたび、あなたの墓地から、点数で見たマナ・コストが戦慄衆の秘儀術師のパワー以下でありインスタントかソーサリーであるカード１枚を対象とする。あなたはそれをそのマナ・コストを支払うことなく唱えてもよい。このターン、そのカードがあなたの墓地に置かれるなら、代わりにそれを追放する。", "type": "クリーチャー — ゾンビ・ウィザード"}, {"language": "Korean", "multiverseId": 462636, "name": "공포군단 비전술사", "text": "돌진\n공포군단 비전술사가 공격할 때마다, 당신의 무덤에 있는 전환마나비용이 공포군단 비전술사의 공격력 이하인 순간마법 또는 집중마법 카드를 목표로 정한다. 당신은 그 카드를 마나 비용을 지불하지 않고 발동할 수 있다. 그 카드가 이 턴에 당신의 무덤에 들어가려고 하면, 대신에 그 카드를 추방한다.", "type": "생물 — 좀비 마법사"}, {"language": "Portuguese (Brazil)", "multiverseId": 462900, "name": "Arcanista da Horda Medonha", "text": "Atropelar\nToda vez que Arcanista da Horda Medonha ataca, você pode conjurar o card de mágica instantânea ou feitiço alvo com custo de mana convertido igual ou inferior ao poder de Arcanista da Horda Medonha do seu cemitério sem pagar seu custo de mana. Se aquele card seria colocado no seu cemitério neste turno, em vez disso, exile-o.", "type": "Criatura — Zumbi Mago"}, {"language": "Russian", "multiverseId": 463164, "name": "Арканист Орды Ужаса", "text": "Пробивной удар\nКаждый раз, когда Арканист Орды Ужаса атакует, вы можете разыграть целевую карту мгновенного заклинания или волшебства с конвертированной мана-стоимостью, не превышающей значение силы Арканиста Орды Ужаса, из вашего кладбища без уплаты ее мана-стоимости. Если та карта должна быть положена на ваше кладбище в этом ходу, изгоните ее вместо этого.", "type": "Существо — Зомби Чародей"}, {"language": "Chinese Simplified", "multiverseId": 463428, "name": "震惧军奥术师", "text": "践踏\n每当震惧军奥术师攻击时，选择目标在你坟墓场中且总法术力费用等于或小于震惧军奥术师力量的瞬间或法术牌。你可以从该处施放该牌，且不需支付其法术力费用。如果该牌于本回合中将置入你的坟墓场，则改为将其放逐。", "type": "生物 ～灵俑／法术师"}, {"language": "Chinese Traditional", "multiverseId": 463692, "name": "震懼軍奧術師", "text": "踐踏\n每當震懼軍奧術師攻擊時，選擇目標在你墳墓場中且總魔法力費用等於或小於震懼軍奧術師力量的瞬間或巫術牌。你可以從該處施放該牌，且不需支付其魔法力費用。如果該牌於本回合中將置入你的墳墓場，則改為將其放逐。", "type": "生物 ～殭屍／魔法師"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "224410", "cardKingdomId": "224097", "cardsphereId": "59169", "mcmId": "371914", "mcmMetaId": "269340", "mtgArenaId": "69576", "mtgjsonV4Id": "168abdf6-68de-57e8-a0a4-1b46062137a0", "mtgoId": "71856", "multiverseId": "461052", "scryfallId": "fd97b3cf-924e-4f77-bb82-0bf19592389f", "scryfallIllustrationId": "d2fac82e-f4c0-4b9b-a724-b2514972fc38", "scryfallOracleId": "4c05b382-58ab-4a2d-a81c-408ea273b6b6", "tcgplayerProductId": "187242"}, "keywords": ["Trample"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Banned", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}", "manaValue": 2.0, "name": "Dreadhorde Arcanist", "number": "125", "originalText": "Trample\nWhenever Dreadhorde Arcanist attacks, you may cast target instant or sorcery card with converted mana cost less than or equal to Dreadhorde Arcanist's power from your graveyard without paying its mana cost. If that card would be put into your graveyard this turn, exile it instead.", "originalType": "Creature — Zombie Wizard", "power": "1", "printings": ["PWAR", "TSR", "WAR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/b477c68d803cd1e7", "cardKingdomFoil": "https://mtgjson.com/links/6491f8e632f6d600", "cardmarket": "https://mtgjson.com/links/90c1673713e93571", "tcgplayer": "https://mtgjson.com/links/661bc2deaeb347bb"}, "rarity": "rare", "rulings": [{"date": "2021-03-19", "text": "The instant or sorcery card you target must have mana value less than or equal to Dreadhorde Arcanist’s power immediately after Dreadhorde Arcanist has attacked. Any other abilities that trigger when creatures you control attack won’t have resolved yet."}, {"date": "2021-03-19", "text": "If Dreadhorde Arcanist leaves the battlefield before its triggered ability resolves, use its power as it last existed on the battlefield to check whether the card is still a legal target."}, {"date": "2021-03-19", "text": "If you cast the card, you do so as part of the resolution of Dreadhorde Arcanist’s triggered ability. You can’t wait to cast it later in the turn. Timing permissions based on a card’s type are ignored, and the spell will resolve before blockers are declared."}, {"date": "2021-03-19", "text": "If you cast a card “without paying its mana cost,” you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those to cast the card."}, {"date": "2021-03-19", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}], "securityStamp": "oval", "setCode": "WAR", "subtypes": ["Zombie", "Wizard"], "supertypes": [], "text": "Trample\nWhenever Dreadhorde Arcanist attacks, you may cast target instant or sorcery card with mana value less than or equal to Dreadhorde Arcanist's power from your graveyard without paying its mana cost. If that spell would be put into your graveyard, exile it instead.", "toughness": "3", "type": "Creature — Zombie Wizard", "types": ["Creature"], "uuid": "f9c065dc-1677-52a6-891c-0130e443c624"}