{"artist": "Nestor Ossandon Leal", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 5065, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 504045, "name": "Zweifacher Treffer", "text": "Wenn du in diesem Zug deinen nächsten Spontanzauber oder deine nächste Hexerei mit umgewandelten Manakosten von 4 oder weniger wirkst, kopiere ihn bzw. sie. Du kannst neue Ziele für die Kopie bestimmen.\nVorherbestimmung {R} (Während deines Zuges kannst du {2} bezahlen und diese Karte aus deiner Hand verdeckt ins Exil schicken. Wirke sie in einem späteren Zug für ihre Vorherbestimmungskosten.)", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 504346, "name": "Golpe doble", "text": "Cuando lances tu siguiente hechizo de instantáneo o de conjuro con coste de maná convertido de 4 o menos este turno, copia ese hechizo. Puedes elegir nuevos objetivos para la copia.\nProfetizar {R}. (Durante tu turno, puedes pagar {2} y exiliar esta carta de tu mano boca abajo. Puedes lanzarla en un turno posterior pagando su coste de profetizar.)", "type": "Instantáneo"}, {"language": "French", "multiverseId": 504647, "name": "Frappe double", "text": "Quand vous lancez votre prochain sort d'éphémère ou de rituel avec un coût converti de mana inférieur ou égal à 4 ce tour-ci, copiez ce sort. Vous pouvez choisir de nouvelles cibles pour la copie.\nPrédiction {R} (Pendant votre tour, vous pouvez payer {2} et exiler cette carte depuis votre main face cachée. Lancez-la pendant un autre tour pour son coût de prédiction.)", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 504948, "name": "Impatto Duplice", "text": "Quando lanci la tua prossima magia istantaneo o stregoneria con costo di mana convertito pari o inferiore a 4 in questo turno, copiala. Puoi scegliere nuovi bersagli per la copia.\nPredire {R} (Durante il tuo turno, puoi pagare {2} ed esiliare questa carta dalla tua mano a faccia in giù. Lanciala in un turno successivo per il suo costo di predire.)", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 505249, "name": "二重の一撃", "text": "このターン、あなたが次に点数で見たマナ・コストが４以下でありインスタントやソーサリーである呪文を唱えたとき、その呪文をコピーする。あなたはそのコピーの新しい対象を選んでもよい。\n予顕{R}（あなたのターンの間、あなたは{2}を支払って、あなたの手札からこのカードを裏向きに追放してもよい。後のターンに、これの予顕コストでこれを唱えてもよい。）", "type": "インスタント"}, {"language": "Korean", "multiverseId": 505550, "name": "이중 타격", "text": "이 턴에 당신이 전환마나비용이 4 이하인 다음 순간마법 또는 집중마법 주문을 발동할 때, 그 주문을 복사한다. 당신은 그 복사본의 목표를 새로 정할 수 있다.\n예고 {R} (당신의 턴 동안, 당신은 {2}를 지불하고 이 카드를 당신의 손에서 뒷면 상태로 추방할 수 있다. 다음 턴부터 예고 비용을 지불해 이 카드를 발동할 수 있다.)", "type": "순간마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 505851, "name": "Ataque Duplo", "text": "Quando você conjurar sua próxima mágica instantânea ou feitiço com custo de mana convertido igual ou inferior a 4 neste turno, copie aquela mágica. Você pode escolher novos alvos para a cópia.\nProfetizar {R} (Durante o seu turno, você pode pagar {2} e exilar este card de sua mão voltado para baixo. Conjure-o em um turno posterior pagando seu custo de profetizar.)", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 506152, "name": "Удар за Ударом", "text": "Когда вы будете разыгрывать ваше следующее мгновенное заклинание или заклинание волшебства с конвертированной мана-стоимостью не более 4 в этом ходу, скопируйте то заклинание. Вы можете выбрать новые цели для той копии.\nПророчество {R} (Во время вашего хода вы можете заплатить {2} и изгнать эту карту из вашей руки рубашкой вверх. Разыграйте ее во время одного из последующих ходов за ее стоимость Пророчества.)", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 506453, "name": "接连掷击", "text": "本回合中，当你施放你的下一个总法术力费用等于或小于4之瞬间或法术咒语时，复制该咒语。你可以为该复制品选择新的目标。\n预示{R}（在你的回合中，你可以支付{2}并从你手上牌面朝下地放逐此牌。过了该回合后，便可利用其预示费用来施放之。）", "type": "瞬间"}, {"language": "Chinese Traditional", "multiverseId": 506754, "name": "接連擲擊", "text": "本回合中，當你施放你的下一個總魔法力費用等於或小於4之瞬間或巫術咒語時，複製該咒語。你可以為該複製品選擇新的目標。\n預示{R}（在你的回合中，你可以支付{2}並從你手上牌面朝下地放逐此牌。過了該回合後，便可利用其預示費用來施放之。）", "type": "瞬間"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "240981", "cardKingdomId": "240521", "cardsphereId": "73483", "mcmId": "530852", "mcmMetaId": "328927", "mtgArenaId": "75175", "mtgjsonV4Id": "4c88ee44-c86a-5dc0-9852-6cf6e9c414fa", "mtgoId": "87599", "multiverseId": "503744", "scryfallId": "6ef580f8-efec-4d31-8dc3-2018dd48b6f4", "scryfallIllustrationId": "5a6291c4-dd77-4ec1-8a9e-c143109306ec", "scryfallOracleId": "a498ca5f-7743-47b7-a57a-471efa1a99e8", "tcgplayerProductId": "230416"}, "keywords": ["Foretell"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{R}{R}", "manaValue": 2.0, "name": "Dual Strike", "number": "132", "originalText": "When you cast your next instant or sorcery spell with converted mana cost 4 or less this turn, copy that spell. You may choose new targets for the copy.\nForetell {R} (During your turn, you may pay {2} and exile this card from your hand face down. Cast it on a later turn for its foretell cost.)", "originalType": "Instant", "printings": ["KHM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1abd55ebf2c09b9f", "cardKingdomFoil": "https://mtgjson.com/links/0249069d46703368", "cardmarket": "https://mtgjson.com/links/a6c8f3b4a111b16a", "tcgplayer": "https://mtgjson.com/links/6e56778b3f75b1bc"}, "rarity": "uncommon", "rulings": [{"date": "2021-02-05", "text": "Dual Strike will copy any instant or sorcery spell with converted mana cost 4 or less, not just one that requires targets."}, {"date": "2021-02-05", "text": "A copy is created even if the spell you cast has been countered or otherwise left the stack by the time the copy ability resolves. The copy will resolve before the original spell."}, {"date": "2021-02-05", "text": "If you copy a spell with targets, the copy will have the same targets unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for any of the targets, you can’t choose a new legal target, that target remains unchanged (even if the current target is illegal)."}, {"date": "2021-02-05", "text": "If the spell that’s copied is modal (that is, it has a bulleted list of modes), the copy will have the same mode or modes. You can’t choose different ones."}, {"date": "2021-02-05", "text": "If a spell has {X} in its mana cost, use the value of X to determine whether its converted mana cost is 4 or less. If the spell is copied, the copy will have the same value of X."}, {"date": "2021-02-05", "text": "If the spell has damage divided as it was cast, the division can’t be changed, although the targets receiving that damage still can. The same is true of spells that distribute counters."}, {"date": "2021-02-05", "text": "You can’t choose to pay any alternative or additional costs for the copy. However, effects based on any alternative or additional costs that were paid for the original spell are copied as though those same costs were paid for the copy."}, {"date": "2021-02-05", "text": "The copy is created on the stack, so it’s not “cast.” Abilities that trigger when a player casts a spell won’t trigger."}, {"date": "2021-02-05", "text": "Because exiling a card with foretell from your hand is a special action, you can do so any time you have priority during your turn, including in response to spells and abilities. Once you announce you’re taking the action, no other player can respond by trying to remove the card from your hand."}, {"date": "2021-02-05", "text": "Casting a foretold card from exile follows the timing rules for that card. If you foretell an instant card, you can cast it as soon as the next player’s turn. In most cases, if you foretell a card that isn’t an instant (or doesn’t have flash), you’ll have to wait until your next turn to cast it."}, {"date": "2021-02-05", "text": "If you’re casting a foretold card from exile for its foretell cost, you can’t choose to cast it for any other alternative costs. You can, however, pay additional costs, such as kicker costs. If the card has any mandatory additional costs, those must be paid to cast the spell."}], "setCode": "KHM", "subtypes": [], "supertypes": [], "text": "When you cast your next instant or sorcery spell with mana value 4 or less this turn, copy that spell. You may choose new targets for the copy.\nForetell {R} (During your turn, you may pay {2} and exile this card from your hand face down. Cast it on a later turn for its foretell cost.)", "type": "Instant", "types": ["Instant"], "uuid": "3d0256fd-0186-57dc-8827-8175eeb21af0", "watermark": "foretell"}