{"artist": "Ryan Pancoast", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 2.0, "edhrecRank": 8711, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 535287, "name": "Duell um die Vorherrschaft", "text": "Hexenzirkel — Bestimme eine Kreatur deiner Wahl, die du kontrollierst, und eine Kreatur deiner Wahl, die du nicht kontrollierst. Falls du drei oder mehr Kreaturen mit unterschiedlicher Stärke kontrollierst, lege eine +1/+1-Marke auf die bestimmte Kreatur, die du kontrollierst. Dann kämpfen die bestimmten Kreaturen gegeneinander. (Jede fügt der anderen Schadenspunkte in Höhe ihrer Stärke zu.)", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 535603, "name": "Duelo por la supremacía", "text": "Aquelarre — Elige una criatura objetivo que controlas y una criatura objetivo que no controlas. Si controlas tres o más criaturas con fuerzas distintas, pon un contador +1/+1 sobre la criatura elegida que controlas. Luego, las criaturas elegidas luchan entre sí. (Cada una hace un daño igual a su fuerza a la otra.)", "type": "Instantáneo"}, {"language": "French", "multiverseId": 535919, "name": "Duel de domination", "text": "Congrégation — Choisissez une créature ciblée que vous contrôlez et une créature ciblée que vous ne contrôlez pas. Si vous contrôlez au moins trois créatures avec des forces différentes, mettez un marqueur +1/+1 sur la créature choisie que vous contrôlez. Puis les créatures choisies se battent l'une contre l'autre. (Chacune inflige un nombre de blessures égal à sa force à l'autre.)", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 536235, "name": "Duello per il Comando", "text": "Congrega — Scegli una creatura bersaglio che controlli e una creatura bersaglio che non controlli. Se controlli tre o più creature con forza diversa, metti un segnalino +1/+1 sulla creatura scelta che controlli. Poi le creature scelte lottano l'una con l'altra. (Ogni creatura infligge all'altra danno pari alla propria forza.)", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 536551, "name": "支配を懸けた決闘", "text": "集会 — あなたがコントロールしているクリーチャー１体とあなたがコントロールしていないクリーチャー１体を対象とする。あなたがパワーが異なる３体以上のクリーチャーをコントロールしているなら、その前者の上に＋１/＋１カウンター１個を置く。その後、その前者とその後者は互いに格闘を行う。（それぞれはもう一方に自身のパワーに等しい点数のダメージを与える。）", "type": "インスタント"}, {"language": "Korean", "multiverseId": 536867, "name": "우위를 결정하는 결투", "text": "집회 — 당신이 조종하는 생물 및 당신이 조종하지 않는 생물을 목표로 정한다. 당신이 서로 공격력이 다른 생물을 세 개 이상 조종한다면, 당신이 조종하는 그 생물에 +1/+1 카운터 한 개를 올려놓는다. 그 후 목표 생물들은 서로 싸운다. (그 생물들은 서로에게 각자 자신의 공격력만큼 피해를 입힌다.)", "type": "순간마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 537183, "name": "Duelo pelo Domínio", "text": "Conventículo — Escolha uma criatura alvo que você controla e uma criatura alvo que você não controla. Se você controlar três ou mais criaturas com poderes diferentes, coloque um marcador +1/+1 na criatura escolhida que você controla. Depois, as criaturas escolhidas lutam uma com a outra. (Cada uma causa à outra uma quantidade de dano igual ao próprio poder.)", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 537499, "name": "Дуэль за Превосходство", "text": "Шабаш — Выберите целевое существо под вашим контролем и целевое существо не под вашим контролем. Если вы контролируете не менее трех существ с различными значениями силы, положите один жетон +1/+1 на выбранное существо под вашим контролем. Затем выбранные существа дерутся друг с другом. (Они наносят друг другу повреждения, равные своей силе.)", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 537815, "name": "夺权决斗", "text": "鸠集～选择目标由你操控的生物和目标不由你操控的生物。如果你操控三个或更多力量各不相同的生物，则在所选之由你操控的生物上放置一个+1/+1指示物。然后所选的生物互斗。（它们各向对方造成等同于本身力量的伤害。）", "type": "瞬间"}, {"language": "Chinese Traditional", "multiverseId": 538131, "name": "奪權決鬥", "text": "鳩集～選擇目標由你操控的生物和目標不由你操控的生物。如果你操控三個或更多力量各不相同的生物，則在所選之由你操控的生物上放置一個+1/+1指示物。然後所選的生物互鬥。（它們各向對方造成等同於本身力量的傷害。）", "type": "瞬間"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "250899", "cardKingdomId": "250493", "cardsphereId": "80831", "mcmId": "574912", "mcmMetaId": "345419", "mtgArenaId": "78542", "mtgjsonV4Id": "f2bd15db-1a7b-5a3f-bc3f-bd61517b4630", "mtgoId": "93356", "multiverseId": "534971", "scryfallId": "9bb0a0c8-158e-4a6f-976e-3de9f57c3463", "scryfallIllustrationId": "cc2132d2-06bc-4b34-a36f-76d011983425", "scryfallOracleId": "5064a55a-9692-4a67-9e82-16250b9140d1", "tcgplayerProductId": "248080"}, "isStorySpotlight": true, "keywords": ["Coven", "Fight"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}", "manaValue": 2.0, "name": "Duel for Dominance", "number": "184", "originalText": "Coven — Choose target creature you control and target creature you don't control. If you control three or more creatures with different powers, put a +1/+1 counter on the chosen creature you control. Then the chosen creatures fight each other. (They each deal damage equal to their power to the other.)", "originalType": "Instant", "printings": ["DBL", "MID"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/aa8c37eaa7dfa8e3", "cardKingdomFoil": "https://mtgjson.com/links/f0a60412759f7b8d", "cardmarket": "https://mtgjson.com/links/c5145c64c6253e1a", "tcgplayer": "https://mtgjson.com/links/52f0a87e0c94b186"}, "rarity": "common", "rulings": [{"date": "2021-09-24", "text": "Only the +1/+1 counter is contingent on having three or more creatures with different powers. The target creatures will still fight even if you don't have three or more creatures with different powers when Duel for Dominance resolves."}, {"date": "2021-09-24", "text": "If you control three or more creatures with different powers and the target creature you control is still a legal target as Duel for Dominance resolves but the target creature you don't control isn't, you will still put a +1/+1 counter on the creature you control. It isn't much of a duel, but your creature is still dominant."}, {"date": "2021-09-24", "text": "“Flashback [cost]” means “You may cast this card from your graveyard by paying [cost] rather than paying its mana cost” and “If the flashback cost was paid, exile this card instead of putting it anywhere else any time it would leave the stack.”"}, {"date": "2021-09-24", "text": "You must still follow any timing restrictions and permissions, including those based on the card's type. For instance, you can cast a sorcery using flashback only when you could normally cast a sorcery."}, {"date": "2021-09-24", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a flashback cost) you're paying, add any cost increases, then apply any cost reductions. The mana value of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2021-09-24", "text": "A spell cast using flashback will always be exiled afterward, whether it resolves, is countered, or leaves the stack in some other way."}, {"date": "2021-09-24", "text": "You can cast a spell using flashback even if it was somehow put into your graveyard without having been cast."}, {"date": "2021-09-24", "text": "If a card with flashback is put into your graveyard during your turn, you can cast it if it's legal to do so before any other player can take any actions."}], "setCode": "MID", "subtypes": [], "supertypes": [], "text": "Coven — Choose target creature you control and target creature you don't control. If you control three or more creatures with different powers, put a +1/+1 counter on the chosen creature you control. Then the chosen creatures fight each other. (They each deal damage equal to their power to the other.)", "type": "Instant", "types": ["Instant"], "uuid": "e1d365f7-5c80-512e-b3df-eb466148ff98"}