{"artist": "Jason A. Engle", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 12841, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "213434", "cardsphereId": "50515", "mcmId": "298986", "mtgjsonV4Id": "0aab72a3-9b7a-54c6-8df5-e2246c3f3b31", "scryfallId": "064310bd-4a37-4774-b3b4-e7a163571040", "scryfallIllustrationId": "d88a844a-4a88-4704-a865-71b575c5a2d6", "scryfallOracleId": "df660a8e-39c2-455d-8860-522e2998a95e", "tcgplayerProductId": "137134"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Eternalize", "Haste"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}", "manaValue": 2.0, "name": "Earthshaker Khenra", "number": "90s", "power": "2", "printings": ["AKR", "HOU", "PHOU"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/a3ea5fe195891a06", "tcgplayer": "https://mtgjson.com/links/32320de08bcaf37b"}, "rarity": "rare", "rulings": [{"date": "2017-07-14", "text": "The target creature’s power is checked when you target it with Earthshaker Khenra’s ability and when that ability resolves. Once the ability resolves, if the creature’s power increases or Earthshaker Khenra’s power decreases, the target creature will still be unable to block."}, {"date": "2017-07-14", "text": "Spells, activated abilities, and triggered abilities can’t raise Earthshaker Khenra’s power before you have to choose a target for its ability. Static abilities, such as that of Lord of the Accursed, will raise its power in time to let you target a larger creature."}, {"date": "2017-07-14", "text": "For each card with eternalize, a corresponding game play supplement token can be found in some Hour of Devastation booster packs. These supplements are not required to play with cards with eternalize; you can use the same items to represent an eternalized token as you would any other token."}, {"date": "2017-07-14", "text": "If a creature card with eternalize is put into your graveyard during your main phase, you’ll have priority immediately afterward. You can activate its eternalize ability before any player can try to exile it, such as with Crook of Condemnation, if it’s legal for you to do so."}, {"date": "2017-07-14", "text": "Once you’ve activated an eternalize ability, the card is immediately exiled. Opponents can’t try to stop the ability by exiling the card with an effect such as that of Crook of Condemnation."}, {"date": "2017-07-14", "text": "The token copies exactly what was printed on the original card and nothing else, except the characteristics specifically modified by eternalize. It doesn’t copy any information about the object the card was before it was put into your graveyard."}, {"date": "2017-07-14", "text": "The token is a Zombie in addition to its other types and is black instead of its other colors. Its base power and toughness are 4/4. It has no mana cost, and thus its converted mana cost is 0. These are copiable values of the token that other effects may copy."}, {"date": "2017-07-14", "text": "If the card copied by the token had any “when [this permanent] enters the battlefield” abilities, then the token also has those abilities and will trigger them when it’s created. Similarly, any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities that the token has copied will also work."}], "securityStamp": "oval", "setCode": "PHOU", "subtypes": ["Jackal", "Warrior"], "supertypes": [], "text": "Haste\nWhen Earthshaker Khenra enters the battlefield, target creature with power less than or equal to Earthshaker Khenra's power can't block this turn.\nEternalize {4}{R}{R} ({4}{R}{R}, Exile this card from your graveyard: Create a token that's a copy of it, except it's a 4/4 black Zombie Jackal Warrior with no mana cost. Eternalize only as a sorcery.)", "toughness": "1", "type": "Creature — Jackal Warrior", "types": ["Creature"], "uuid": "c8c30547-14df-5ff7-9206-f79882c16a17"}