{"artist": "Campbell White", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 6965, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 527604, "name": "Exzentrischer Lehrling", "text": "Fliegend\nWenn der Exzentrische Lehrling ins Spiel kommt, wage dich ins Gewölbe. (Betritt den ersten Raum oder rücke in den nächsten Raum vor.)\nZu Beginn des Kampfes in deinem Zug und falls du ein Gewölbe absolviert hast, wird bis zu eine Kreatur deiner Wahl bis zum Ende des Zuges zu einem Vogel mit Basis-Stärke und -Widerstandskraft 1/1 und Flugfähigkeit.", "type": "Kreatur — Tiefling, Zauberer"}, {"language": "Spanish", "multiverseId": 527865, "name": "Aprendiz excéntrica", "text": "Vuela.\nCuando la Aprendiz excéntrica entre al campo de batalla, adéntrate en la mazmorra. (Entra en la primera sala o avanza a la siguiente.)\nAl comienzo del combate en tu turno, si completaste una mazmorra, hasta una criatura objetivo se convierte en un Ave con fuerza y resistencia base de 1/1 y la habilidad de volar hasta el final del turno.", "type": "Criatura — Hechicero tiefling"}, {"language": "French", "multiverseId": 528126, "name": "Apprentie excentrique", "text": "Vol\nQuand l'Apprentie excentrique arrive sur le champ de bataille, aventurez-vous dans le donjon. (Entrez dans la première pièce ou avancez jusqu'à la pièce suivante.)\nAu début du combat pendant votre tour, si vous avez terminé un donjon, jusqu'à une créature ciblée devient un oiseau avec une force et une endurance de base de 1/1 et le vol jusqu'à la fin du tour.", "type": "Créature : tieffelin et sorcier"}, {"language": "Italian", "multiverseId": 528387, "name": "Apprendista Eccentrica", "text": "Volare\nQuando l'Apprendista Eccentrica entra nel campo di battaglia, esplora il dungeon. (Entra nella prima stanza o avanza a quella successiva.)\nAll'inizio del combattimento nel tuo turno, se hai completato un dungeon, fino a una creatura bersaglio diventa un Uccello con forza e costituzione base 1/1 e volare fino alla fine del turno.", "type": "Creatura — Mago Tiefling"}, {"language": "Japanese", "multiverseId": 528648, "name": "奇抜な弟子", "text": "飛行\n奇抜な弟子が戦場に出たとき、ダンジョン探索をする。（ダンジョン探索をするとは、最初の部屋へ入るか、次の部屋へ進むことである。）\nあなたのターンの戦闘の開始時に、あなたがダンジョンを踏破したことがある場合、クリーチャー最大１体を対象とする。ターン終了時まで、それは基本のパワーとタフネスが１/１で飛行を持つ鳥・クリーチャーになる。", "type": "クリーチャー — ティーフリング・ウィザード"}, {"language": "Korean", "multiverseId": 528908, "name": "별난 견습생", "text": "비행\n별난 견습생이 전장에 들어올 때, 던전에 진입한다. (첫 번째 방에 들어가거나 다음 방으로 전진한다.)\n당신의 턴 전투 시작에, 당신이 던전을 완료했다면, 생물을 최대 한 개까지 목표로 정한다. 그 생물은 턴종료까지 기본 공격력 및 방어력이 1/1이며 비행을 가진 조류가 된다.", "type": "생물 — 티플링 마법사"}, {"language": "Portuguese (Brazil)", "multiverseId": 529169, "name": "Aprendiz Excêntrica", "text": "Voar\nQuando Aprendiz Excêntrica entrar no campo de batalha, aventure-se na masmorra. (Entre na primeira sala ou prossiga para a próxima.)\nNo início do combate no seu turno, se você completou uma masmorra, até uma criatura alvo se torna uma Ave com poder e resistência básicos 1/1 e voar até o final do turno.", "type": "Criatura — Tiferino Mago"}, {"language": "Russian", "multiverseId": 529430, "name": "Эксцентричная Ученица", "text": "Полет\nКогда Эксцентричная Ученица выходит на поле битвы, углубитесь в подземелье. (Войдите в первую комнату или перейдите в следующую комнату.)\nВ начале боя во время вашего хода, если вы прошли подземелье, не более одного целевого существа становится Птицей с базовыми силой и выносливостью 1/1 и Полетом до конца хода.", "type": "Существо — Тифлинг Чародей"}, {"language": "Chinese Simplified", "multiverseId": 529690, "name": "古怪学徒", "text": "飞行\n当古怪学徒进战场时，深入地城。（进入第一个房间，或前进至下一个房间。）\n在你回合的战斗开始时，若你完成过地城，则直到回合结束，至多一个目标生物成为基础力量与防御力为1/1，具飞行异能的鸟。", "type": "生物 ～魔人／法术师"}, {"language": "Chinese Traditional", "multiverseId": 529950, "name": "古怪學徒", "text": "飛行\n當古怪學徒進戰場時，深入地城。（進入第一個房間，或前進至下一個房間。）\n在你回合的戰鬥開始時，若你完成過地城，則直到回合結束，至多一個目標生物成為基礎力量與防禦力為1/1，具飛行異能的鳥。", "type": "生物 ～魔人／魔法師"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "248431", "cardKingdomId": "248088", "cardsphereId": "79106", "mcmId": "571330", "mcmMetaId": "343740", "mtgArenaId": "77162", "mtgjsonV4Id": "1a8f19c2-c91d-558c-b25e-e6ec743e0ac4", "mtgoId": "91616", "multiverseId": "527344", "scryfallId": "3baa08ac-9a94-4e22-91bb-c6966cd0a0de", "scryfallIllustrationId": "0177c378-f4d4-43f0-a1ec-bb6f352d4235", "scryfallOracleId": "27dbe95e-6274-416a-a45b-a2a0a64d5403", "tcgplayerProductId": "243220"}, "keywords": ["Flying", "Venture into the dungeon"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}", "manaValue": 3.0, "name": "Eccentric Apprentice", "number": "57", "originalText": "Flying\nWhen Eccentric Apprentice enters the battlefield, venture into the dungeon. (Enter the first room or advance to the next room.)\nAt the beginning of combat on your turn, if you've completed a dungeon, up to one target creature becomes a Bird with base power and toughness 1/1 and flying until end of turn.", "originalType": "Creature — Tiefling Wizard", "power": "2", "printings": ["AFR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/67d4612e2df9702d", "cardKingdomFoil": "https://mtgjson.com/links/da4b256640ed9d39", "cardmarket": "https://mtgjson.com/links/b1f79783361869e3", "tcgplayer": "https://mtgjson.com/links/38b7728f68d8be31"}, "rarity": "uncommon", "rulings": [{"date": "2021-07-23", "text": "Eccentric Apprentice's last ability works even if it wasn't on the battlefield when you completed a dungeon and even if the dungeon was completed on a previous turn."}, {"date": "2021-07-23", "text": "A creature that becomes a Bird this way loses all other creature types but does not lose any of its abilities."}, {"date": "2021-07-23", "text": "The last ability will overwrite any previous effects that set the creature's power and toughness to specific numbers. Effects that otherwise modify the target creature's power and toughness will still apply no matter when they took effect. The same is true for +1/+1 counters."}, {"date": "2021-07-23", "text": "To venture into the dungeon, a player moves their venture marker into the next room of the dungeon they are currently in. If they aren't currently in a dungeon, that player instead chooses a dungeon card from outside the game, puts it into the command zone, and moves their venture marker onto the first room."}, {"date": "2021-07-23", "text": "Moving into a dungeon room will cause its room ability to trigger."}, {"date": "2021-07-23", "text": "Once you resolve the last room ability of a dungeon, that dungeon is now completed and is removed from the game."}, {"date": "2021-07-23", "text": "A player may only have one dungeon in the command zone at a time."}, {"date": "2021-07-23", "text": "The player venturing into the dungeon chooses which dungeon they will venture into. They may choose a dungeon that they have already completed this game."}, {"date": "2021-07-23", "text": "Dungeon cards are not part of a player's deck or sideboard. In both constructed and limited formats, players can use any dungeon card when they venture into the dungeon."}, {"date": "2021-07-23", "text": "You can only move forward (well, downward) in a dungeon, never backwards or sideways."}, {"date": "2021-07-23", "text": "Dungeons are removed from the game as a state-based action."}, {"date": "2021-07-23", "text": "If you somehow venture into the dungeon while a room's ability is on the stack, you will continue on in the dungeon. If you're already in the last room, complete that dungeon and start a new one."}, {"date": "2021-07-23", "text": "Choosing the dungeon or room to venture into is part of resolving the venture into the dungeon keyword action. Once that choice is made, players may not respond until after the appropriate room ability has triggered."}], "setCode": "AFR", "subtypes": ["Tiefling", "Wizard"], "supertypes": [], "text": "Flying\nWhen Eccentric Apprentice enters the battlefield, venture into the dungeon. (Enter the first room or advance to the next room.)\nAt the beginning of combat on your turn, if you've completed a dungeon, up to one target creature becomes a Bird with base power and toughness 1/1 and flying until end of turn.", "toughness": "2", "type": "Creature — Tiefling Wizard", "types": ["Creature"], "uuid": "7be456da-7ee8-5b46-ba63-eab6fd8cccfc"}