{"artist": "Mark Poole", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 6598, "finishes": ["nonfoil", "foil"], "flavorText": "An organized and methodical reproduction.", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "7ace2205-25ff-55b9-a098-2c06558bc80c", "mtgoId": "70695", "scryfallId": "34c5cf93-e321-4f28-a860-c2256d9ee788", "scryfallIllustrationId": "6d5bae07-455f-4363-b91b-ee66636575ed", "scryfallOracleId": "92442ca0-e49d-4fab-8d3a-83405c1b1437"}, "isOnlineOnly": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}{U}", "manaValue": 5.0, "name": "Echo Storm", "number": "70695", "originalReleaseDate": "2018-12-06", "printings": ["C18", "PZ2"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2018-07-13", "text": "The token copies exactly what was printed on the original artifact and nothing else (unless that artifact is copying something else or is a token; see below). It doesn’t copy whether that artifact is tapped or untapped, whether it has any counters on it or Auras attached to it, or any non-copy effects that have changed its types, color, or so on."}, {"date": "2018-07-13", "text": "If the copied artifact has {X} in its mana cost, X is considered to be 0."}, {"date": "2018-07-13", "text": "If the copied artifact is a token, the token that’s created copies the original characteristics of that token as stated by the effect that created the token."}, {"date": "2018-07-13", "text": "If the copied artifact is copying something else (for example, if the copied artifact is a Sculpting Steel), then the token enters the battlefield as whatever that artifact copied."}, {"date": "2018-07-13", "text": "Each copy resolves one at a time. Any abilities that trigger on the artifact token entering the battlefield resolve before the next copy resolves. The original spell is the last to resolve."}, {"date": "2018-07-13", "text": "Each Storm’s triggered ability counts only how many times you’ve cast your commander from the command zone before that triggered ability resolves. If you cast your commander again later, you won’t get another copy."}, {"date": "2018-07-13", "text": "If your commander was countered, that time you cast it still counts."}, {"date": "2018-07-13", "text": "Each Storm’s triggered ability can copy the Storm spell even if that spell is countered before that ability resolves."}, {"date": "2018-07-13", "text": "The copies are created on the stack, so they’re not “cast.” Abilities that trigger when a player casts a spell (such as the Storm’s ability itself) won’t trigger."}, {"date": "2018-07-13", "text": "Any enters-the-battlefield abilities of the copied artifact will trigger when the token enters the battlefield. Any “as [this artifact] enters the battlefield” or “[this artifact] enters the battlefield with” abilities of the chosen artifact will also work."}, {"date": "2018-10-05", "text": "If you have multiple commanders, you’ll copy this spell for each time you’ve cast either of them. For example, if you’ve cast one commander once and one twice, you’ll copy this spell three times."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": [], "supertypes": [], "text": "When you cast this spell, copy it for each time you've cast your commander from the command zone this game. You may choose new targets for the copies.\nCreate a token that's a copy of target artifact.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "5b8fe77d-d1aa-5784-970c-3b1a24d3841b"}