{"artist": "Raymond Swanland", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 3564, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 378874, "name": "Eidolon der zahllosen Schlachten", "text": "Göttergabe {2}{W}{W} (Falls du diese Karte für ihre Göttergabe-Kosten wirkst, ist sie ein Aura-Zauberspruch und verzaubert eine Kreatur. Die Aura wird wieder zu einer Kreatur, falls sie nicht an eine Kreatur angelegt ist.)\nDas Eidolon der zahllosen Schlachten und die verzauberte Kreatur erhalten +1/+1 für jede Kreatur, die du kontrollierst, und +1/+1 für jede Aura, die du kontrollierst.", "type": "Verzauberungskreatur — Geist"}, {"language": "Spanish", "multiverseId": 380029, "name": "Eidolón de innumerables batallas", "text": "Concesión {2}{W}{W}. (Si lanzas esta carta pagando su coste de concesión, es un hechizo de aura con encantar criatura. Si no está anexada a una criatura, se convierte en una criatura de nuevo.)\nEl Eidolón de innumerables batallas y la criatura encantada obtienen +1/+1 cada uno por cada criatura que controlas y +1/+1 por cada aura que controlas.", "type": "Criatura encantamiento — Espíritu"}, {"language": "French", "multiverseId": 379039, "name": "Eidôlon des batailles innombrables", "text": "Grâce {2}{W}{W} (Si vous lancez cette carte pour son coût de grâce, c'est un sort d'aura avec enchanter : créature. Elle redevient une créature si elle n'est pas attachée à une créature.)\nL'Eidôlon des batailles innombrables et la créature enchantée gagnent chacun +1/+1 pour chaque créature que vous contrôlez et +1/+1 pour chaque aura que vous contrôlez.", "type": "Créature-enchantement : esprit"}, {"language": "Italian", "multiverseId": 379204, "name": "Apparizione di Infinite Battaglie", "text": "Conferire {2}{W}{W} (Se lanci questa carta per il suo costo di conferire, è una magia Aura con incanta creatura. Diventa una creatura se non è assegnata a una creatura.)\nL'Apparizione di Infinite Battaglie e la creatura incantata prendono +1/+1 per ogni creatura che controlli e +1/+1 per ogni Aura che controlli.", "type": "Creatura Incantesimo — Spirito"}, {"language": "Japanese", "multiverseId": 379369, "name": "万戦の幻霊", "text": "授与 {2}{W}{W} （このカードを授与コストで唱えたなら、これはエンチャント（クリーチャー）を持つオーラ呪文である。クリーチャーにつけられていないなら、これは再びクリーチャーになる。）\n万戦の幻霊とエンチャントされているクリーチャーは、それぞれあなたがコントロールするクリーチャー１体につき＋１/＋１の修整を受けるとともにあなたがコントロールするオーラ１つにつき＋１/＋１の修整を受ける。", "type": "クリーチャー・エンチャント — スピリット"}, {"language": "Korean", "multiverseId": 379534, "name": "수많은 전투의 에이돌론", "text": "권능 {2}{W}{W} (이 카드의 권능 비용을 지불하고 발동하면, 이 카드는 생물에게 부여하는 마법진 주문이다. 이 카드는 생물에 부착되지 않은 상태가 되면 다시 생물이 된다.)\n수많은 전투의 에이돌론과 부여된 생물은 당신이 조종하는 각 생물 하나당 +1/+1을 받고 당신이 조종하는 각 마법진 한 개당 +1/+1을 받는다.", "type": "부여마법 생물 — 신령"}, {"language": "Portuguese (Brazil)", "multiverseId": 379699, "name": "Eidolon das Batalhas Incontáveis", "text": "Agraciar {2}{W}{W} (Se você conjurar este card pagando seu custo de agraciar, ele será uma mágica de Aura com encantar criatura. Ele se tornará novamente uma criatura se não estiver anexado a uma criatura.)\nEidolon das Batalhas Incontáveis e a criatura encantada recebem, cada um, +1/+1 para cada criatura que você controla e +1/+1 para cada Aura que você controla.", "type": "Criatura Encantamento — Espírito"}, {"language": "Russian", "multiverseId": 379864, "name": "Эйдолон Бесчисленных Битв", "text": "Дар {2}{W}{W} (Если вы разыгрываете эту карту за ее стоимость Дара, она является заклинанием Ауры со способностью «зачаровать существо». Она снова становится существом, если не прикреплена к существу.)\nЭйдолон Бесчисленных Битв и зачарованное существо получают по +1/+1 за каждое существо под вашим контролем и по +1/+1 за каждую Ауру под вашим контролем.", "type": "Чары Существо — Дух"}, {"language": "Chinese Simplified", "multiverseId": 378544, "name": "百战幻灵", "text": "神授{2}{W}{W}（如果你支付此牌的神授费用来施放它，则它便是具「结附于生物」的灵气咒语。如果它未结附于生物上，就会再度成为生物。）\n对百战幻灵与所结附的生物而言，你每操控一个生物，它们便各得+1/+1，且你每操控一个灵气，它们便各得+1/+1。", "type": "结界生物～精怪"}, {"language": "Chinese Traditional", "multiverseId": 378709, "name": "百戰幻靈", "text": "神授{2}{W}{W}（如果你支付此牌的神授費用來施放它，則它便是具「結附於生物」的靈氣咒語。如果它未結附於生物上，就會再度成為生物。）\n對百戰幻靈與所結附的生物而言，你每操控一個生物，它們便各得+1/+1，且你每操控一個靈氣，它們便各得+1/+1。", "type": "結界生物～精靈"}], "frameEffects": ["nyxtouched"], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "193621", "cardKingdomId": "193398", "cardsphereId": "7450", "mcmId": "265865", "mcmMetaId": "209328", "mtgjsonV4Id": "317a7c08-bca5-5638-be85-79db96f88081", "mtgoFoilId": "51718", "mtgoId": "51717", "multiverseId": "378379", "scryfallId": "4d16283b-b5bb-48e8-8c97-db5ad74fd544", "scryfallIllustrationId": "2995fefc-15c0-4ff1-91f6-a2075a208f7b", "scryfallOracleId": "441b51b0-ecd0-466d-9ca8-e754eb563aec", "tcgplayerProductId": "79101"}, "keywords": ["Bestow"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}{W}", "manaValue": 3.0, "name": "Eidolon of Countless Battles", "number": "7", "originalText": "Bestow {2}{W}{W} (If you cast this card for its bestow cost, it's an Aura spell with enchant creature. It becomes a creature again if it's not attached to a creature.)\nEidolon of Countless Battles and enchanted creature each get +1/+1 for each creature you control and +1/+1 for each Aura you control.", "originalType": "Enchantment Creature — Spirit", "power": "0", "printings": ["BNG"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/769d903a68ef202a", "cardKingdomFoil": "https://mtgjson.com/links/fb16c565f7421cd5", "cardmarket": "https://mtgjson.com/links/ba0047b1edf8c60a", "tcgplayer": "https://mtgjson.com/links/0d4b4fa8f0586172"}, "rarity": "rare", "rulings": [{"date": "2013-09-15", "text": "Unlike other Aura spells, an Aura spell with bestow isn’t countered if its target is illegal as it begins to resolve. Rather, the effect making it an Aura spell ends, it loses enchant creature, it returns to being an enchantment creature spell, and it resolves and enters the battlefield as an enchantment creature."}, {"date": "2013-09-15", "text": "Unlike other Auras, an Aura with bestow isn’t put into its owner’s graveyard if it becomes unattached. Rather, the effect making it an Aura ends, it loses enchant creature, and it remains on the battlefield as an enchantment creature. It can attack (and its {T} abilities can be activated, if it has any) on the turn it becomes unattached if it’s been under your control continuously, even as an Aura, since your most recent turn began."}, {"date": "2013-09-15", "text": "On the stack, a spell with bestow is either a creature spell or an Aura spell. It’s never both, although it’s an enchantment spell in either case."}, {"date": "2013-09-15", "text": "Auras attached to a creature don’t become tapped when the creature becomes tapped. Except in some rare cases, an Aura with bestow remains untapped when it becomes unattached and becomes a creature."}, {"date": "2013-09-15", "text": "An Aura that becomes a creature is no longer put into its owner’s graveyard as a state-based action. Rather, it becomes unattached and remains on the battlefield as long as it’s a creature. While it’s a creature, it can’t be attached to another permanent or player. An Aura that’s not attached to a legal permanent or player as defined by its enchant ability and also isn’t a creature will be put into its owner’s graveyard as a state-based action."}, {"date": "2013-09-15", "text": "If a permanent with bestow enters the battlefield by any method other than being cast, it will be an enchantment creature. You can’t choose to pay the bestow cost and have it become an Aura."}, {"date": "2013-09-15", "text": "You don’t choose whether the spell is going to be an Aura spell or not until the spell is already on the stack. Abilities that affect when you can cast a spell, such as flash, will apply to the spell after you’ve made this choice. For example, an effect that said you can cast creature spells as though they have flash won’t allow you to cast a creature card with bestow as an Aura spell anytime you could cast an instant, but one that said you can cast Aura spells as though they have flash will."}, {"date": "2014-02-01", "text": "Eidolon of Countless Battles’s last ability functions only on the battlefield. In other zones, it is a 0/0 enchantment creature card."}, {"date": "2014-02-01", "text": "A permanent with bestow is either a creature or an Aura, not both (although it’s an enchantment either way). It will contribute just +1/+1 toward the bonus given by Eidolon of Countless Battles."}], "setCode": "BNG", "subtypes": ["Spirit"], "supertypes": [], "text": "Bestow {2}{W}{W} (If you cast this card for its bestow cost, it's an Aura spell with enchant creature. It becomes a creature again if it's not attached to a creature.)\nEidolon of Countless Battles and enchanted creature each get +1/+1 for each creature you control and +1/+1 for each Aura you control.", "toughness": "0", "type": "Enchantment Creature — Spirit", "types": ["Enchantment", "Creature"], "uuid": "5f6e46ac-59e1-56bd-8816-383d6096fe0d"}