{"artist": "Jason Rainville", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 3.0, "edhrecRank": 531, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "207994", "cardsphereId": "37171", "mcmId": "291217", "mtgjsonV4Id": "834abbe6-a3b8-5ae7-9c54-9e7318080d00", "scryfallId": "215d9d11-8b15-4ec8-8bdc-48c69928a860", "scryfallIllustrationId": "92788404-913f-49aa-aca7-a2f2da9a0758", "scryfallOracleId": "0f77c0c9-4dc4-489a-b547-e93287c4d1a5", "tcgplayerProductId": "120728"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}{G}", "manaValue": 3.0, "name": "Eldritch Evolution", "number": "155s", "printings": ["EMN", "MB1", "PEMN"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/4797f64496113c2c", "tcgplayer": "https://mtgjson.com/links/aaccdbbff4c9c34d"}, "rarity": "rare", "rulings": [{"date": "2016-07-13", "text": "Sacrificing a creature is part of Eldritch Evolution’s cost. You can’t sacrifice more creatures to search for more creature cards, and you can’t cast Eldritch Evolution at all if you control no creatures."}, {"date": "2016-07-13", "text": "Once you begin to cast Eldritch Evolution, no player may take actions until you’re done. Notably, opponents can’t try to remove the creature you wish to sacrifice."}, {"date": "2016-07-13", "text": "A creature’s converted mana cost is determined solely by the mana symbols printed in its upper right corner (unless that creature is the back face of a double-faced card, a melded card, or is copying something else; see below). If the mana cost includes {X}, X is considered to be 0. If it’s a single-faced card with no mana symbols in its upper right corner (because it’s an animated land, for example), its converted mana cost is 0. Ignore any alternative costs or additional costs (such as kicker) paid when the creature was cast."}, {"date": "2016-07-13", "text": "A token that isn’t a copy of another permanent has a converted mana cost of 0. A token that is a copy or a creature that has become a copy of another permanent has the converted mana cost of what it’s copying."}, {"date": "2016-07-13", "text": "The converted mana cost of a permanent that’s a double-faced card with its back face up is the converted mana cost of its front face. The converted mana cost of a melded permanent is the sum of the converted mana costs of its front faces. A creature that’s a copy of either has a converted mana cost of 0."}, {"date": "2016-07-13", "text": "If a card in a library has {X} in its mana cost, X is considered to be 0. If you find such a card this way, you won’t have an opportunity to spend mana on {X}."}], "securityStamp": "oval", "setCode": "PEMN", "subtypes": [], "supertypes": [], "text": "As an additional cost to cast this spell, sacrifice a creature.\nSearch your library for a creature card with mana value X or less, where X is 2 plus the sacrificed creature's mana value. Put that card onto the battlefield, then shuffle. Exile Eldritch Evolution.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "6430da9a-ee2f-550e-9f44-5f86852c844c"}