{"artist": "Zack Stella", "availability": ["arena", "mtgo", "paper"], "borderColor": "black", "colorIdentity": ["R", "U"], "colors": ["R", "U"], "convertedManaCost": 4.0, "edhrecRank": 14161, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 517037, "name": "Elementarer Expressionist", "text": "Magiefertigkeit — Immer wenn du einen Spontanzauber oder eine Hexerei wirkst oder kopierst, bestimme eine Kreatur deiner Wahl, die du kontrollierst. Bis zum Ende des Zuges erhält sie „Falls diese Kreatur das Spiel verlassen würde, schicke sie ins Exil, anstatt sie irgendwo anders hinzulegen\" und „Wenn du diese Kreatur ins Exil schickst, erzeuge einen 4/4 blauen und roten Elementarwesen-Kreaturenspielstein.\"", "type": "Kreatur — Ork, Zauberer"}, {"language": "Spanish", "multiverseId": 517132, "name": "Expresionista elemental", "text": "Hechicería — Siempre que lances o copies un hechizo de instantáneo o de conjuro, elige una criatura objetivo que controlas. Hasta el final del turno, gana \"Si esta criatura fuera a dejar el campo de batalla, exíliala en vez de ponerla en cualquier otro lado\" y \"Cuando exilies esta criatura, crea una ficha de criatura Elemental azul y roja 4/4\".", "type": "Criatura — Hechicero orco"}, {"language": "French", "multiverseId": 517227, "name": "Expressionniste élémentaire", "text": "Sorcellerie — À chaque fois que vous lancez ou copiez un sort d'éphémère ou de rituel, choisissez une créature ciblée que vous contrôlez. Jusqu'à la fin du tour, elle acquiert « Si cette créature devait quitter le champ de bataille, exilez-la à la place de la mettre autre part » et « Quand vous exilez cette créature, créez un jeton de créature 4/4 bleue et rouge Élémental ».", "type": "Créature : orque et sorcier"}, {"language": "Italian", "multiverseId": 517322, "name": "Espressionista Elementale", "text": "Artemagica — Ogniqualvolta lanci o copi una magia istantaneo o stregoneria, scegli una creatura bersaglio che controlli. Fino alla fine del turno, ha \"Se questa creatura sta per lasciare il campo di battaglia, esiliala invece di metterla in qualsiasi altra zona\" e \"Quando esili questa creatura, crea una pedina creatura Elementale 4/4 blu e rossa\".", "type": "Creatura — Mago Orco"}, {"language": "Japanese", "multiverseId": 517417, "name": "精霊表現者", "text": "魔技 ― あなたがインスタントやソーサリーである呪文を唱えるかコピーするたび、あなたがコントロールしているクリーチャー１体を対象とする。ターン終了時まで、それは「このクリーチャーが戦場を離れるなら、これを戦場以外に置く代わりに追放する。」と「あなたがこのクリーチャーを追放したとき、青赤の４/４のエレメンタル・クリーチャー・トークンを生成する。」を得る。", "type": "クリーチャー — オーク・ウィザード"}], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "244911", "cardKingdomId": "244336", "cardsphereId": "76258", "mcmId": "557622", "mcmMetaId": "338909", "mtgjsonV4Id": "caff37ab-805b-5001-af9d-5f16ef57fbd3", "multiverseId": "516942", "scryfallId": "34b6e53f-f605-430e-9455-b3653cbd8e1d", "scryfallIllustrationId": "4e6e17f6-1a4a-47e0-8060-470f89c8f317", "scryfallOracleId": "dfc45c58-821c-42f3-ab48-05b912748bdf", "tcgplayerProductId": "235860"}, "isStarter": true, "keywords": ["Magecraft"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{U/R}{U/R}{U/R}{U/R}", "manaValue": 4.0, "name": "Elemental Expressionist", "number": "342", "originalText": "Magecraft — Whenever you cast or copy an instant or sorcery spell, choose target creature you control. Until end of turn, it gains \"If this creature would leave the battlefield, exile it instead of putting it anywhere else\" and \"When you exile this creature, create a 4/4 blue and red Elemental creature token.\"", "originalType": "Creature — Orc Wizard", "power": "4", "printings": ["PRM", "PSTX", "STX"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/873edd737406b71c", "cardKingdomFoil": "https://mtgjson.com/links/673012b6b45cc76a", "cardmarket": "https://mtgjson.com/links/4702f8d681650bee", "tcgplayer": "https://mtgjson.com/links/04bb794956612e43"}, "rarity": "rare", "rulings": [{"date": "2021-04-16", "text": "Elemental Expressionist has received an update to its Oracle text. The official text is listed above. Specifically, the second ability granted to the target creature doesn’t care that the creature’s controller is the one exiling it. If the creature is put into exile for any reason, that ability will trigger."}, {"date": "2021-04-16", "text": "If you target a creature token with Elemental Expressionist’s ability, and that token would leave the battlefield, it is still exiled (very briefly) before it ceases to exist, and you will still create an Elemental token."}, {"date": "2021-04-16", "text": "If the magecraft ability triggers and resolves more than once with the same creature as the target, that creature will have multiple instances of each of the two triggered abilities the magecraft ability grants it. Each instance of the second ability will trigger separately, and you’ll create an Elemental token for each of them. (Multiple instances of the first granted ability are redundant.)"}, {"date": "2021-04-16", "text": "Each magecraft ability has a different effect, although they all have the same trigger condition, whenever you cast or copy an instant or sorcery spell."}, {"date": "2021-04-16", "text": "For example, if you control Archmage Emeritus and cast an instant or sorcery spell, Archmage Emeritus’s magecraft ability will trigger and you will draw a card."}, {"date": "2021-04-16", "text": "If an effect creates a copy of an instant or sorcery spell, this will also cause the magecraft ability to trigger."}, {"date": "2021-04-16", "text": "If an effect creates multiple copies of an instant or sorcery spell, magecraft abilities trigger once for each copy created by the effect."}, {"date": "2021-04-16", "text": "Some effects instruct you to copy an instant or sorcery card in a zone other than the stack. These copies do not cause magecraft abilities to trigger. However, most effects that do this also allow you to cast the copy, and casting the copy will cause magecraft abilities to trigger."}], "securityStamp": "oval", "setCode": "STX", "subtypes": ["Orc", "Wizard"], "supertypes": [], "text": "Magecraft — Whenever you cast or copy an instant or sorcery spell, choose target creature you control. Until end of turn, it gains \"If this creature would leave the battlefield, exile it instead of putting it anywhere else\" and \"When this creature is put into exile, create a 4/4 blue and red Elemental creature token.\" (Each instance of that ability triggers separately.)", "toughness": "4", "type": "Creature — Orc Wizard", "types": ["Creature"], "uuid": "77ca5ad4-bc4d-5cc4-a709-a12592fbfcb1", "variations": ["72c86b4a-6059-595a-a3ca-5db89652ac16"], "watermark": "prismari"}