{"artist": "Darrell Riche", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210254", "mcmId": "294416", "mtgjsonV4Id": "14653736-c428-5bf3-8119-0632c8eeb12f", "multiverseId": "423602", "scryfallId": "bec61f7a-cf02-4150-aff9-9465fa14c779", "scryfallIllustrationId": "3c601dc2-c9f5-4d8d-9d78-d05ac5a968d5", "scryfallOracleId": "23fe1c21-c396-4ebf-a8b0-22d697952b34", "tcgplayerProductId": "125581"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Eloren Wilds", "number": "21", "originalText": "Whenever a player taps a permanent for mana, that player adds one mana to his or her mana pool of any type that permanent produced.\nWhenever you roll {Chaos}, target player can't cast spells until a player planeswalks.", "originalType": "Plane — Shandalar", "printings": ["OHOP", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/147909952313f9a2", "tcgplayer": "https://mtgjson.com/links/6eee9430bd4fbb1f"}, "rarity": "common", "rulings": [{"date": "2009-10-01", "text": "A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"}, {"date": "2009-10-01", "text": "A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."}, {"date": "2009-10-01", "text": "The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."}, {"date": "2009-10-01", "text": "If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}, {"date": "2009-10-01", "text": "You’re “tapping a permanent for mana” only if you’re activating an activated ability of that permanent that includes the {T} symbol in its cost and produces mana as part of its effect."}, {"date": "2009-10-01", "text": "Eloren Wilds’s first ability affects any permanent players tap for mana, not just lands they tap for mana."}, {"date": "2009-10-01", "text": "The additional mana is produced by Eloren Wilds, not the permanent that was tapped for mana."}, {"date": "2009-10-01", "text": "The chaos ability prevents the affected player from casting permanent spells (artifacts, creatures, enchantments, and planeswalkers), not just instant and sorcery spells. It doesn’t stop the player from playing lands or activating abilities (such as cycling or unearth)."}], "setCode": "OPCA", "subtypes": ["Shandalar"], "supertypes": [], "text": "Whenever a player taps a permanent for mana, that player adds one mana of any type that permanent produced.\nWhenever you roll {CHAOS}, target player can't cast spells until a player planeswalks.", "type": "Plane — Shandalar", "types": ["Plane"], "uuid": "daee13c3-5b15-51f9-9b63-dc148f0e060f"}