{"artist": "Ryan Yee", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 5.0, "edhrecRank": 1754, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 476518, "name": "Elspeth bezwingt den Tod", "text": "(Je eine Sagenmarke beim Ins-Spiel-Kommen und nach deinem Ziehsegment. Opfern nach III.)\nI — Schicke eine bleibende Karte deiner Wahl mit umgewandelten Manakosten von 3 oder mehr, die ein Gegner kontrolliert, ins Exil.\nII — Bis zu deinem nächsten Zug kosten Nichtkreatur-Zaubersprüche, die deine Gegner wirken, beim Wirken {2} mehr.\nIII — Bringe eine Kreaturen- oder Planeswalkerkarte deiner Wahl aus deinem Friedhof ins Spiel zurück. Lege eine +1/+1-Marke bzw. eine Loyalitätsmarke darauf.", "type": "Verzauberung — Sage"}, {"language": "Spanish", "multiverseId": 476772, "name": "Elspeth vence a la muerte", "text": "(En cuanto esta Saga entre y después de tu paso de robar, agrega un contador de sabiduría. Sacrifícala después de III.)\nI — Exilia el permanente objetivo con coste de maná convertido de 3 o más que controla un oponente.\nII — A tus oponentes les cuesta {2} más lanzar hechizos que no sean de criatura hasta tu próximo turno.\nIII — Regresa la carta de criatura o planeswalker objetivo de tu cementerio al campo de batalla. Pon un contador +1/+1 o un contador de lealtad sobre esa carta.", "type": "Encantamiento — Saga"}, {"language": "French", "multiverseId": 477026, "name": "Elspeth conquiert la Mort", "text": "(Au moment où cette saga arrive sur le champ de bataille et après votre étape de pioche, ajoutez un marqueur « sapience ». Sacrifiez après III.)\nI — Exilez un permanent ciblé qu'un adversaire contrôle avec un coût converti de mana supérieur ou égal à 3.\nII — Les sorts non-créature que vos adversaires lancent coûtent {2} de plus à lancer jusqu'à votre prochain tour.\nIII — Renvoyez sur le champ de bataille une carte de créature ou de planeswalker ciblée depuis votre cimetière. Mettez un marqueur +1/+1 ou un marqueur « loyauté » sur elle.", "type": "Enchantement : saga"}, {"language": "Italian", "multiverseId": 477280, "name": "Elspeth Vince la Morte", "text": "(Mentre questa Saga entra e dopo la tua sottofase di acquisizione, aggiungi un segnalino sapere. Sacrifica dopo III.)\nI — Esilia un permanente bersaglio controllato da un avversario con costo di mana convertito pari o superiore a 3.\nII — Le magie non creatura che lanciano i tuoi avversari costano {2} in più per essere lanciate fino al tuo prossimo turno.\nIII — Rimetti sul campo di battaglia una carta creatura o planeswalker bersaglio dal tuo cimitero. Metti un segnalino +1/+1 o un segnalino fedeltà su di essa.", "type": "Incantesimo — Saga"}, {"language": "Japanese", "multiverseId": 477534, "name": "エルズペス、死に打ち勝つ", "text": "（この英雄譚が出た際とあなたのドロー・ステップの後に、伝承カウンターを１個加える。IIIの後に、生け贄に捧げる。）\nI ― 対戦相手がコントロールしていて点数で見たマナ・コストが３以上のパーマネント１つを対象とし、それを追放する。\nII ― あなたの次のターンまで、対戦相手がクリーチャーでない呪文を唱えるためのコストは{2}多くなる。\nIII ― あなたの墓地からクリーチャーかプレインズウォーカーであるカード１枚を対象とし、それを戦場に戻す。それの上に＋１/＋１カウンターか忠誠カウンターを１個置く。", "type": "エンチャント — 英雄譚"}, {"language": "Korean", "multiverseId": 477788, "name": "엘스페스가 죽음을 정복하다", "text": "(이 서사시가 들어오면서 그리고 당신의 뽑기단 후에, 전승 카운터 한 개를 추가한다. III 이후에 희생한다.)\nI — 상대가 조종하는 전환마나비용이 3 이상인 지속물을 목표로 정한다. 그 지속물을 추방한다.\nII — 당신의 다음 턴까지, 당신의 상대들이 조종하는 생물이 아닌 주문들은 발동하는데 {2}가 더 든다.\nIII — 당신의 무덤에 있는 생물 또는 플레인즈워커 카드를 목표로 정한다. 그 카드를 전장으로 되돌린다. 그 카드에 +1/+1 카운터 또는 충성 카운터 한 개를 올려놓는다.", "type": "부여마법 — 서사시"}, {"language": "Portuguese (Brazil)", "multiverseId": 478042, "name": "Elspeth Derrota a Morte", "text": "(Conforme esta Saga entra e após sua etapa de compra, adicione um marcador de conhecimento. Sacrifique-a após III.)\nI — Exile a permanente alvo que um oponente controla com custo de mana convertido igual ou superior a 3.\nII — As mágicas que seus oponentes conjuram que não sejam de criatura custam {2} a mais para serem conjuradas até seu próximo turno.\nIII — Devolva o card de criatura ou planeswalker alvo de seu cemitério para o campo de batalha. Coloque um marcador +1/+1 ou um marcador de lealdade nele.", "type": "Encantamento — Saga"}, {"language": "Russian", "multiverseId": 478296, "name": "Элспет Превозмогает Смерть", "text": "(При выходе этой Саги и после вашего шага взятия карты добавьте один жетон знаний. Пожертвуйте после III.)\nI — Изгоните целевой перманент под контролем оппонента с конвертированной мана-стоимостью 3 или больше.\nII — До вашего следующего хода разыгрывание вашими оппонентами не являющихся существами заклинаний стоит на {2} больше.\nIII — Верните целевую карту существа или planeswalker'а из вашего кладбища на поле битвы. Положите на нее один жетон +1/+1 или жетон верности.", "type": "Чары — Сага"}, {"language": "Chinese Simplified", "multiverseId": 478550, "name": "艾紫培转生纪", "text": "（于此传纪进战场时及于你抓牌步骤后，加一个学问指示物。到III后牺牲之。）\nI — 放逐目标由对手操控且总法术力费用等于或大于3的永久物。\nII — 直到你的下一个回合，对手施放的非生物咒语增加{2}来施放。\nIII — 将目标生物或鹏洛客牌从你的坟墓场移回战场。在其上放置一个+1/+1指示物或一个忠诚指示物。", "type": "结界 ～传纪"}, {"language": "Chinese Traditional", "multiverseId": 478804, "name": "艾紫培轉生紀", "text": "（於此傳紀進戰場時及於你抽牌步驟後，加一個學問指示物。到III後犧牲之。）\nI — 放逐目標由對手操控且總魔法力費用等於或大於3的永久物。\nII — 直到你的下一個回合，對手施放的非生物咒語增加{2}來施放。\nIII — 將目標生物或鵬洛客牌從你的墳墓場移回戰場。在其上放置一個+1/+1指示物或一個忠誠指示物。", "type": "結界 ～傳紀"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "231181", "cardKingdomId": "230913", "cardsphereId": "65085", "mcmId": "431709", "mcmMetaId": "291899", "mtgArenaId": "70524", "mtgjsonV4Id": "378ab108-aaeb-5b72-8b76-71dfc1c494ff", "mtgoId": "79150", "multiverseId": "476264", "scryfallId": "ea20208b-1939-4c69-8cfd-c0a42f9dc427", "scryfallIllustrationId": "25037ca3-c6c7-460a-8b42-788e13557ffb", "scryfallOracleId": "40c88392-2aa7-4e12-86a4-8d680219e670", "tcgplayerProductId": "207052"}, "language": "English", "layout": "saga", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}{W}", "manaValue": 5.0, "name": "Elspeth Conquers Death", "number": "13", "originalText": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI — Exile target permanent an opponent controls with converted mana cost 3 or greater.\nII — Noncreature spells your opponents cast cost {2} more to cast until your next turn.\nIII — Return target creature or planeswalker card from your graveyard to the battlefield. Put a +1/+1 counter or a loyalty counter on it.", "originalType": "Enchantment — Saga", "printings": ["PLIST", "PTHB", "THB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/03fc92d8d7e3bff7", "cardKingdomFoil": "https://mtgjson.com/links/9eeaab180f565ddd", "cardmarket": "https://mtgjson.com/links/15d9a9e6aca57ecb", "tcgplayer": "https://mtgjson.com/links/4f2c9aab25aeb6eb"}, "rarity": "rare", "rulings": [{"date": "2020-01-24", "text": "If multiple chapter abilities trigger at the same time, their controller puts them on the stack in any order. If any of them require targets, those targets are chosen as you put the abilities on the stack, before any of those abilities resolve."}, {"date": "2020-01-24", "text": "Removing lore counters won’t cause a previous chapter ability to trigger. If lore counters are removed from a Saga, the appropriate chapter abilities will trigger again when the Saga receives lore counters."}, {"date": "2020-01-24", "text": "If a creature on the battlefield has {X} in its mana cost, X is considered to be 0."}, {"date": "2020-01-24", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost you’re paying, add any cost increases (such as that of this Saga’s second chapter), then apply any cost reductions. The converted mana cost of the spell remains unchanged, no matter what the total cost to cast it was."}, {"date": "2020-01-24", "text": "The effect of the second chapter lasts until your next turn even if this Saga leaves the battlefield before then."}, {"date": "2020-01-24", "text": "You choose which kind of counter to put on the returned permanent after it has entered the battlefield. You may put a +1/+1 counter on a planeswalker or a loyalty counter on a creature, but this isn’t normally going to have any effect."}, {"date": "2020-01-24", "text": "In a multiplayer game, if you leave the game after this Saga’s second chapter ability resolves but before your next turn begins, its effect lasts until your next turn would have begun. It neither expires immediately nor lasts indefinitely."}, {"date": "2020-01-24", "text": "As a Saga enters the battlefield, its controller puts a lore counter on it. As your precombat main phase begins (immediately after your draw step), you put another lore counter on each Saga you control. Putting a lore counter on a Saga in either of these ways doesn’t use the stack."}, {"date": "2020-01-24", "text": "Each symbol on the left of a Saga’s text box represents a chapter ability. A chapter ability is a triggered ability that triggers when a lore counter that is put on the Saga causes the number of lore counters on the Saga to become equal to or greater than the ability’s chapter number. Chapter abilities are put onto the stack and may be responded to."}, {"date": "2020-01-24", "text": "A chapter ability doesn’t trigger if a lore counter is put on a Saga that already had a number of lore counters greater than or equal to that chapter’s number. For example, the third lore counter put on a Saga causes the III chapter ability to trigger, but I and II won’t trigger again."}, {"date": "2020-01-24", "text": "Once a chapter ability has triggered, the ability on the stack won’t be affected if the Saga gains or loses counters, or if it leaves the battlefield."}, {"date": "2020-01-24", "text": "Once the number of lore counters on a Saga is greater than or equal to the greatest number among its chapter abilities, the Saga’s controller sacrifices it as soon as its chapter ability has left the stack, most likely by resolving or being countered. This state-based action doesn’t use the stack."}], "securityStamp": "oval", "setCode": "THB", "subtypes": ["Saga"], "supertypes": [], "text": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI — Exile target permanent an opponent controls with mana value 3 or greater.\nII — Noncreature spells your opponents cast cost {2} more to cast until your next turn.\nIII — Return target creature or planeswalker card from your graveyard to the battlefield. Put a +1/+1 counter or a loyalty counter on it.", "type": "Enchantment — Saga", "types": ["Enchantment"], "uuid": "1ac3ade3-a329-5325-a710-ef85dc8aa014"}