{"artist": "Tyler Walpole", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 1556, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "f855d558-36e7-55e6-a765-c10e42c50d5b", "mtgoId": "86012", "scryfallId": "1872af8f-aa13-4e72-a6b5-cc01d9960151", "scryfallIllustrationId": "767f5d55-50ef-4011-8b22-97a4a9bcaa43", "scryfallOracleId": "4f4ec0fa-fcaf-4dc2-9c67-ee7881f5f77d"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}", "manaValue": 4.0, "name": "Emberwilde Captain", "number": "86012", "originalReleaseDate": "2020-12-15", "power": "4", "printings": ["CMR", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-11-10", "text": "Emberwilde Captain’s last ability triggers once for each player who attacks you, no matter how many creatures they attack with beyond the first."}, {"date": "2020-11-10", "text": "Emberwilde Captain’s last ability won’t trigger if an opponent attacks only planeswalkers you control and not you."}, {"date": "2020-11-10", "text": "If another player becomes the monarch after Emberwilde Captain’s last ability triggers but before it resolves, the ability will resolve as normal. The player who attacked you will be dealt damage, even if that player was the one who became the monarch."}, {"date": "2020-11-10", "text": "The game starts with no monarch. Once an effect makes one player the monarch, the game will have exactly one monarch from that point forward. As a player becomes the monarch, the current monarch (if any) ceases being the monarch."}, {"date": "2020-11-10", "text": "There are two inherent triggered abilities associated with being the monarch. These triggered abilities have no source and are controlled by the player who was the monarch at the time the abilities triggered. The full texts of these abilities are “At the beginning of the monarch’s end step, that player draws a card” and “Whenever a creature deals combat damage to the monarch, its controller becomes the monarch.”"}, {"date": "2020-11-10", "text": "If the triggered ability that causes the monarch to draw a card goes on the stack and a different player becomes the monarch before that ability resolves, the first player will still draw the card."}, {"date": "2020-11-10", "text": "If the monarch leaves the game during another player’s turn, that player becomes the monarch. If the monarch leaves the game during their turn, the next player in turn order becomes the monarch."}, {"date": "2020-11-10", "text": "If combat damage dealt to the monarch causes that player to lose the game, the triggered ability that causes the controller of the attacking creature to become the monarch doesn’t resolve. In most cases, the controller of the attacking creature will still become the monarch as it is likely their turn."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Djinn", "Pirate"], "supertypes": [], "text": "When Emberwilde Captain enters the battlefield, you become the monarch.\nWhenever an opponent attacks you while you're the monarch, Emberwilde Captain deals damage to that player equal to the number of cards in their hand.", "toughness": "2", "type": "Creature — Djinn Pirate", "types": ["Creature"], "uuid": "4b9f4240-cc37-5a0f-96b3-9563425518c0"}