{"artist": "Diego Gisbert", "availability": ["arena"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 6.0, "edhrecRank": 7011, "faceConvertedManaCost": 3.0, "faceManaValue": 3.0, "faceName": "Dissonant Wave", "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"mtgArenaId": "81805", "mtgjsonV4Id": "92dd63dc-93f8-5c0f-b4ac-8f630a229466", "scryfallId": "5543a456-0f2d-476f-ab10-51c535ec848c", "scryfallIllustrationId": "fa6d8b18-3362-4e62-b064-28d95ff744f0", "scryfallOracleId": "c5632f18-7904-4a29-82be-6a6ef8e85e18"}, "isOnlineOnly": true, "isReprint": true, "language": "English", "layout": "adventure", "legalities": {"commander": "Legal", "duel": "Legal", "gladiator": "Legal", "legacy": "Legal", "paupercommander": "Restricted", "vintage": "Legal"}, "manaCost": "{2}{G}", "manaValue": 6.0, "name": "Emerald Dragon // Dissonant Wave", "number": "210", "otherFaceIds": ["c70342ee-3d20-5ca1-9438-74729f08704c"], "printings": ["CLB", "HBG"], "purchaseUrls": {}, "rarity": "uncommon", "rebalancedPrintings": ["ab89d376-0d99-5b20-9d36-9fa40a2d9fdb", "57aafc71-eb75-576e-b60e-c90ad81fcc4c"], "rulings": [{"date": "2022-06-10", "text": "Activated abilities are written in the form “Cost: Effect.” Some keyword abilities, such as equip, are activated abilities and will have colons in their reminder texts."}, {"date": "2022-06-10", "text": "Triggered abilities use the word “when,” “whenever,” or “at.” They're often written as “[Trigger condition], [effect].” Some keyword abilities, such as prowess and myriad, are triggered abilities and will have “when,” “whenever,” or “at” in their reminder texts."}, {"date": "2022-06-10", "text": "If you counter a delayed triggered ability that triggers at the beginning of the “next” occurrence of a specified step or phase, that ability won't trigger again the following time that phase or step occurs."}, {"date": "2022-06-10", "text": "Mana abilities can't be targeted. An activated mana ability is one that could produce mana as it resolves, doesn't require a target, and isn't a loyalty ability. A triggered mana ability is one that could produce mana as it resolves, triggers on the resolution of an activated mana ability or on mana being added, and doesn't require a target."}, {"date": "2022-06-10", "text": "Abilities that create replacement effects, such as a permanent entering the battlefield tapped or with counters on it, can't be targeted. Abilities that apply “as [this creature] enters the battlefield” are also replacement effects and can't be targeted."}, {"date": "2022-06-10", "text": "Activated and triggered abilities from noncreature sources include abilities of noncreature cards that can be activated or triggered from other zones, such as cycling abilities."}, {"date": "2022-06-10", "text": "An adventurer card is a permanent card in every zone except the stack, as well as while on the stack if not cast as an Adventure. Ignore its alternative characteristics in those cases. For example, while it’s in your graveyard, Altar of Bhaal is an artifact card whose mana value is 2."}, {"date": "2022-06-10", "text": "When casting a spell as an Adventure, use the alternative characteristics and ignore all of the card’s normal characteristics. The spell’s color, mana cost, mana value, and so on are determined by only those alternative characteristics. If the spell leaves the stack, it immediately resumes using its normal characteristics."}, {"date": "2022-06-10", "text": "If you cast an adventurer card as an Adventure, use only its alternative characteristics to determine whether it’s legal to cast that spell."}, {"date": "2022-06-10", "text": "If a spell is cast as an Adventure, its controller exiles it instead of putting it into its owner’s graveyard as it resolves. For as long as it remains exiled, that player may cast it as a permanent spell. If an Adventure spell leaves the stack in any way other than resolving (most likely by being countered or by failing to resolve because its targets have all become illegal), that card won’t be exiled and the spell’s controller won’t be able to cast it as a permanent later."}, {"date": "2022-06-10", "text": "If an adventurer card ends up in exile for any other reason than by exiling itself while resolving, it won’t give you permission to cast it as a permanent spell."}, {"date": "2022-06-10", "text": "You must still follow any relevant timing rules for the permanent spell you cast from exile. Normally, you’ll be able to cast it only during your main phase while the stack is empty."}, {"date": "2022-06-10", "text": "If an effect copies an Adventure spell, that copy is exiled as it resolves. It ceases to exist as a state-based action; it’s not possible to cast the copy from exile."}, {"date": "2022-06-10", "text": "An effect may refer to a card, spell, or permanent that “has an Adventure.” This refers to a card, spell, or permanent that has an adventurer card’s set of alternative characteristics, even if they’re not being used and even if that card was never cast as an Adventure."}, {"date": "2022-06-10", "text": "If an object becomes a copy of an object that has an Adventure, the copy also has an Adventure. If it changes zones, it will either cease to exist (if it’s a token) or cease to be a copy (if it’s a nontoken permanent), and so you won’t be able to cast it as an Adventure."}, {"date": "2022-06-10", "text": "If an effect instructs you to choose a card name, you may choose the alternative Adventure name. Consider only the alternative characteristics to determine whether that is an appropriate name to choose."}, {"date": "2022-06-10", "text": "Casting a card as an Adventure isn’t casting it for an alternative cost. Effects that allow you to cast a spell for an alternative cost or without paying its mana cost may allow you to apply those to the Adventure."}], "securityStamp": "arena", "setCode": "HBG", "side": "b", "subtypes": ["Adventure"], "supertypes": [], "text": "Counter target activated or triggered ability from a noncreature source. (Then exile this card. You may cast the creature later from exile.)", "type": "Instant — Adventure", "types": ["Instant"], "uuid": "458085b4-b285-597d-8ae4-08641fb7a2f1"}