{"artist": "Joshua Hagler", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 9346, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 181532, "name": "Endlose Horizonte", "text": "Wenn die Endlosen Horizonte ins Spiel kommen, durchsuche deine Bibliothek nach einer beliebigen Anzahl an Ebenenkarten und entferne sie ganz aus dem Spiel. Mische danach deine Bibliothek.\nZu Beginn deines Versorgungssegments kannst du eine Karte, die du besitzt und die mit den Endlosen Horizonten ganz aus dem Spiel entfernt wurde, auf deine Hand zurückbringen.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 180632, "name": "Horizontes interminables", "text": "Cuando Horizontes interminables entre en juego, busca en tu biblioteca cualquier cantidad de cartas de llanura y remuévelas del juego. Luego baraja tu biblioteca.\nAl comienzo de tu mantenimiento, puedes poner en tu mano una carta removida del juego con Horizontes interminables de la cual eres propietario.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 181712, "name": "Horizons interminables", "text": "Quand les Horizons interminables arrivent en jeu, cherchez dans votre bibliothèque le nombre de cartes de plaine de votre choix et retirez-les de la partie. Mélangez ensuite votre bibliothèque.\nAu début de votre entretien, vous pouvez mettre dans votre main une carte qui vous appartient et qui a été retirée de la partie avec les Horizons interminables.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 181352, "name": "Orizzonti Infiniti", "text": "Quando gli Orizzonti Infiniti entrano in gioco, passa in rassegna il tuo grimorio per un qualsiasi numero di carte Pianura e rimuovile dal gioco. Poi rimescola il tuo grimorio.\nAll'inizio del tuo mantenimento, puoi aggiungere alla tua mano una carta che possiedi rimossa dal gioco con gli Orizzonti Infiniti.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 180992, "name": "終わり無き地平線", "text": "終わり無き地平線が場に出たとき、あなたのライブラリーから望む枚数の平地カードを探し、それらをゲームから取り除く。 その後あなたのライブラリーを切り直す。\nあなたのアップキープの開始時に、あなたは終わり無き地平線によりゲームから取り除かれた、あなたがオーナーであるカードを１枚あなたの手札に加えてもよい。", "type": "エンチャント"}, {"language": "Portuguese (Brazil)", "multiverseId": 181892, "name": "Horizontes Sem Fim", "text": "Quando Horizontes Sem Fim entrar em jogo, procure em seu grimório por um número qualquer de cards de Planície e remova-os do jogo. Depois, embaralhe seu grimório.\nNo início de sua manutenção, você pode colocar na sua mão um card seu que tenha sido removido do jogo com Horizontes Sem Fim.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 181172, "name": "Бесконечные Горизонты", "text": "Когда Бесконечные Горизонты входят в игру, найдите в вашей библиотеке любое количество карт Равнин и удалите их из игры. Затем перетасуйте вашу библиотеку.\nВ начале вашего шага поддержки вы можете положить в вашу руку карту, владельцем которой вы являетесь, удаленную из игры с помощью Бесконечных Горизонтов.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 180812, "name": "无垠地平线", "text": "当无垠地平线进场时，从你的牌库中搜寻任意数量的平原牌，并将它们移出对战。 然后将你的牌库洗牌。\n在你的维持开始时，你可以将一张由你拥有、且以无垠地平线移出对战之牌置于你手上。", "type": "结界"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "125333", "cardKingdomId": "125111", "cardsphereId": "16897", "mcmId": "19466", "mcmMetaId": "9855", "mtgjsonV4Id": "ec8e69bd-3131-5a49-a300-3790265ad1e6", "mtgoFoilId": "30223", "mtgoId": "30222", "multiverseId": "157975", "scryfallId": "32385604-dcff-41e4-97a5-fcf230033a87", "scryfallIllustrationId": "e930eedd-85e5-4c0e-bde1-cae07aab79d9", "scryfallOracleId": "ca945c1e-efa3-4bb2-bf5a-379b93409855", "tcgplayerProductId": "27108"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}", "manaValue": 4.0, "name": "Endless Horizons", "number": "4", "originalText": "When Endless Horizons comes into play, search your library for any number of Plains cards and remove them from the game. Then shuffle your library.\nAt the beginning of your upkeep, you may put a card you own removed from the game with Endless Horizons into your hand.", "originalType": "Enchantment", "printings": ["EVE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/4ff0a5f9cb32690d", "cardKingdomFoil": "https://mtgjson.com/links/ddf35a843fe8e545", "cardmarket": "https://mtgjson.com/links/2450618fd43739cf", "tcgplayer": "https://mtgjson.com/links/22c322b5a9805bdf"}, "rarity": "rare", "rulings": [{"date": "2008-08-01", "text": "If Endless Horizons leaves the battlefield, the remaining Plains cards stay exiled. If Endless Horizons returns to the battlefield, it’s a new object with no relation to its previous existence. The previously exiled Plains cards will still stay exiled."}, {"date": "2008-08-01", "text": "If a different player gains control of Endless Horizons, its ability will trigger at the beginning of that player’s upkeep, but it won’t do anything when it resolves."}], "setCode": "EVE", "subtypes": [], "supertypes": [], "text": "When Endless Horizons enters the battlefield, search your library for any number of Plains cards, exile them, then shuffle.\nAt the beginning of your upkeep, you may put a card you own exiled with Endless Horizons into your hand.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "a3a49712-f5da-5b9a-a8b3-1566ea539b09"}