{"artist": "Chris Rahn", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B", "U", "W"], "colors": ["B", "U", "W"], "convertedManaCost": 7.0, "edhrecRank": 7199, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210066", "cardsphereId": "35839", "mcmId": "294327", "mcmMetaId": "10519", "mtgjsonV4Id": "63363e5f-0721-568f-b995-9ee3fd4feaa4", "multiverseId": "423514", "scryfallId": "ae197165-53ad-4e85-92e0-e3531c2db412", "scryfallIllustrationId": "24b1ced6-8d94-4487-86b7-dd6066ed1ea7", "scryfallOracleId": "6fb84ecd-ab60-4c2c-987d-8a0749db5777", "tcgplayerProductId": "125411"}, "isReprint": true, "isStarter": true, "keywords": ["Cascade", "Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{W}{U}{B}", "manaValue": 7.0, "name": "Enigma Sphinx", "number": "89", "originalText": "Flying\nWhen Enigma Sphinx is put into your graveyard from the battlefield, put it into your library third from the top.\nCascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom in a random order.)", "originalType": "Artifact Creature — Sphinx", "power": "5", "printings": ["ARB", "C18", "PC2", "PCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/5fa189ce8a1e4bd2", "cardmarket": "https://mtgjson.com/links/7dccb80fdefcab26", "tcgplayer": "https://mtgjson.com/links/e0d5622e93285c5c"}, "rarity": "rare", "rulings": [{"date": "2009-05-01", "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."}, {"date": "2009-05-01", "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."}, {"date": "2009-05-01", "text": "You exile the cards face-up. All players will be able to see them."}, {"date": "2009-05-01", "text": "If you cast the last exiled card, you’re casting it as a spell. It can be countered. If that card has cascade, the new spell’s cascade ability will trigger, and you’ll repeat the process for the new spell."}, {"date": "2009-05-01", "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."}, {"date": "2009-05-01", "text": "After Enigma Sphinx’s middle ability triggers, if Enigma Sphinx is removed from your graveyard in response, it won’t be put into your library."}, {"date": "2009-05-01", "text": "If you have zero or one card left in your library when Enigma Sphinx’s middle ability resolves, Enigma Sphinx is put on the bottom of your library."}, {"date": "2009-05-01", "text": "If you control an Enigma Sphinx that’s owned by another player, it’s put into that player’s graveyard from the battlefield, so Enigma Sphinx’s middle ability won’t trigger."}, {"date": "2009-05-01", "text": "After you’re done exiling cards and casting the last one if you chose to do so, the remaining exiled cards are randomly placed on the bottom of your library. Neither you nor any other player is allowed to know the order of those cards."}, {"date": "2017-04-18", "text": "The converted mana cost of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."}], "securityStamp": "oval", "setCode": "PCA", "subtypes": ["Sphinx"], "supertypes": [], "text": "Flying\nWhen Enigma Sphinx is put into your graveyard from the battlefield, put it into your library third from the top.\nCascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)", "toughness": "4", "type": "Artifact Creature — Sphinx", "types": ["Artifact", "Creature"], "uuid": "1aea1713-06c8-5100-a71b-ff22713db819"}