{"artist": "Daniel Ljunggren", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "U"], "colors": ["B", "U"], "convertedManaCost": 5.0, "edhrecRank": 8747, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 461387, "name": "Einmarsch der Gott-Verewigten", "text": "Der Einmarsch der Gott-Verewigten fügt einer Kreatur deiner Wahl 4 Schadenspunkte zu und du erhältst Lebenspunkte in Höhe des auf diese Weise zugefügten Schadens dazu. Ein Spieler deiner Wahl legt die obersten vier Karten seiner Bibliothek auf seinen Friedhof. Aufmarsch 4. (Lege vier +1/+1-Marken auf eine Armee, die du kontrollierst. Falls du keine kontrollierst, erzeuge zuerst einen 0/0 schwarzen Zombie-Armee-Kreaturenspielstein.)", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 461651, "name": "Llegada de los dioses eternos", "text": "La Llegada de los dioses eternos hace 4 puntos de daño a la criatura objetivo y tú ganas una cantidad de vidas igual al daño hecho de esta manera. El jugador objetivo pone las cuatro primeras cartas de su biblioteca en su cementerio. Enrola 4. (Pon cuatro contadores +1/+1 sobre un Ejército que controlas. Si no controlas ninguno, crea primero una ficha de criatura Ejército Zombie negra 0/0.)", "type": "Conjuro"}, {"language": "French", "multiverseId": 461915, "name": "Arrivée des Éternels-dieux", "text": "L'Arrivée des Éternels-dieux inflige 4 blessures à une créature ciblée et vous gagnez autant de points de vie que de blessures infligées de cette manière. Le joueur ciblé met les quatre cartes du dessus de sa bibliothèque dans son cimetière. Amassez 4. (Mettez quatre marqueurs +1/+1 sur une armée que vous contrôlez. Si vous n'en contrôlez pas, créez d'abord un jeton de créature 0/0 noire Zombie et Armée.)", "type": "Rituel"}, {"language": "Italian", "multiverseId": 462179, "name": "Apparizione degli Dei Eterni", "text": "L'Apparizione degli Dei Eterni infligge 4 danni a una creatura bersaglio e tu guadagni punti vita pari al danno inflitto in questo modo. Un giocatore bersaglio mette nel suo cimitero le prime quattro carte del suo grimorio. Recluta 4. (Metti quattro segnalini +1/+1 su un Esercito che controlli. Se non ne controlli uno, crea prima una pedina creatura Esercito Zombie 0/0 nera.)", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 462443, "name": "永遠神の投入", "text": "クリーチャー１体とプレイヤー１人を対象とする。永遠神の投入はそのクリーチャーに４点のダメージを与え、あなたはこれにより与えられたダメージに等しい点数のライフを得る。そのプレイヤーは、自分のライブラリーの一番上からカードを４枚自分の墓地に置く。動員４を行う。（あなたがコントロールしている軍団１体の上に＋１/＋１カウンターを４個置く。あなたが軍団をコントロールしていないなら、その前に、黒の０/０のゾンビ・軍団・クリーチャー・トークンを１体生成する。）", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 462707, "name": "신 영생자들의 등장", "text": "생물을 목표로 정한다. 신 영생자들의 등장은 그 생물에게 피해 4점을 입히고 당신은 이런 식으로 입혀진 피해만큼 생명점을 얻는다. 플레이어를 목표로 정한다. 그 플레이어는 자신의 서고 맨 위 카드 네 장을 자신의 무덤에 넣는다. 축적 4를 한다. (당신이 조종하는 군대 한 개에 +1/+1 카운터 네 개를 올려놓는다. 당신이 군대를 조종하고 있지 않다면, 먼저 0/0 흑색 좀비 군대 생물 토큰 한 개를 만든다.)", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 462971, "name": "Chegada dos Eternos-deuses", "text": "Chegada dos Eternos-deuses causa 4 pontos de dano à criatura alvo e você ganha uma quantidade de pontos de vida igual ao dano causado desta forma. O jogador alvo coloca os quatro cards do topo do próprio grimório no próprio cemitério. Arregimente 4. (Coloque quatro marcadores +1/+1 em um Exército que você controla. Se você não controlar um, crie antes uma ficha de criatura preta 0/0 do tipo Zumbi Exército.)", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 463235, "name": "Явление Вековечных Богов", "text": "Явление Вековечных Богов наносит 4 повреждения целевому существу, и вы получаете столько жизней, сколько повреждений было нанесено таким образом. Целевой игрок кладет четыре верхние карты своей библиотеки на свое кладбище. Скопище 4. (Положите четыре жетона +1/+1 на Армию под вашим контролем. Если под вашим контролем нет Армии, то сначала создайте одну фишку существа 0/0 черная Армия Зомби.)", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 463499, "name": "永生煞神降临", "text": "永生煞神降临对目标生物造成4点伤害，且你获得等同于以此法造成之伤害数量的生命。目标牌手将其牌库顶的四张牌置入其坟墓场。囤兵4。（在一个由你操控的军队上放置四个+1/+1指示物。如果你未操控军队，则先派出一个0/0黑色灵俑／军队衍生物。）", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 463763, "name": "永生煞神降臨", "text": "永生煞神降臨對目標生物造成4點傷害，且你獲得等同於以此法造成之傷害數量的生命。目標玩家將其牌庫頂的四張牌置入其墳墓場。囤兵4。（在一個由你操控的軍隊上放置四個+1/+1指示物。如果你未操控軍隊，則先派出一個0/0黑色殭屍／軍隊衍生物。）", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "224522", "cardKingdomId": "224223", "cardsphereId": "59187", "mcmId": "372184", "mcmMetaId": "269526", "mtgArenaId": "69646", "mtgjsonV4Id": "e972e7e4-f08d-5cd0-9a03-8fee84d3dd1d", "mtgoId": "71998", "multiverseId": "461123", "scryfallId": "f67e7070-2266-4c93-8c89-084e12ba7a4e", "scryfallIllustrationId": "d5ad6aab-0019-4c14-b74b-3f0261d6871b", "scryfallOracleId": "67ee7c8b-afcc-4f09-a184-3db01f2ab175", "tcgplayerProductId": "188487"}, "isStorySpotlight": true, "keywords": ["Amass", "Mill"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{U}{B}", "manaValue": 5.0, "name": "Enter the God-Eternals", "number": "196", "originalText": "Enter the God-Eternals deals 4 damage to target creature and you gain life equal to the damage dealt this way. Target player puts the top four cards of their library into their graveyard. Amass 4. (Put four +1/+1 counters on an Army you control. If you don't control one, create a 0/0 black Zombie Army creature token first.)", "originalType": "Sorcery", "printings": ["PWAR", "SCD", "WAR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/631aa2295fcf6877", "cardKingdomFoil": "https://mtgjson.com/links/95f35f2f37a27d8f", "cardmarket": "https://mtgjson.com/links/1038aa12cae50799", "tcgplayer": "https://mtgjson.com/links/8991dc33fdb0d7dd"}, "rarity": "rare", "rulings": [{"date": "2019-05-03", "text": "You can’t cast Enter the God-Eternals without targeting a creature and a player."}, {"date": "2019-05-03", "text": "If the target creature has less than 4 toughness, Enter the God-Eternals still deals 4 damage to it and you’ll gain 4 life."}, {"date": "2019-05-03", "text": "If the target creature is no longer a legal target as the spell resolves but the player is a legal target, no creature is dealt damage and you gain no life, but the target player still moves the top cards of their library and you still amass 4."}, {"date": "2019-05-03", "text": "If the target player is no longer a legal target as the spell resolves but the creature is a legal target, the creature is dealt damage, you gain that much life, and you amass 4. No player moves cards from their library."}, {"date": "2019-05-03", "text": "If both targets are no longer legal targets as the spell tries to resolve, it doesn’t resolve. You don’t amass 4."}, {"date": "2019-05-03", "text": "If the target creature is dealt lethal damage by Enter the God-Eternals, it’ll still be on the battlefield while you gain life, the target player moves cards, and you amass 4. Any abilities it has may affect these actions and may trigger on them."}, {"date": "2019-05-03", "text": "Abilities that trigger while Enter the God-Eternals is resolving or that trigger as the target creature dies are all put onto the stack after the spell has finished resolving and the target creature has (if lethally damaged) died."}, {"date": "2019-05-03", "text": "Army is a new creature type. It’s possible to control a nontoken Army (perhaps a creature with the changeling ability) and, through combinations of other cards, it’s possible to control multiple Army tokens. When instructed to amass, you may put +1/+1 counters on any of your Army creatures, and you may choose a different one each time."}, {"date": "2019-05-03", "text": "If you don’t control an Army, the Zombie Army token that you create enters the battlefield as a 0/0 creature. Any abilities that trigger when a creature with a certain power enters the battlefield, such as that of Mentor of the Meek, will see the token enter as a 0/0 creature before it gets +1/+1 counters."}], "securityStamp": "oval", "setCode": "WAR", "subtypes": [], "supertypes": [], "text": "Enter the God-Eternals deals 4 damage to target creature and you gain life equal to the damage dealt this way. Target player mills four cards. Amass 4. (Put four +1/+1 counters on an Army you control. If you don't control one, create a 0/0 black Zombie Army creature token first.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "be4eef08-4518-53f7-8d86-e380aaabe591"}