{"artist": "Todd Lockwood", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 3667, "finishes": ["foil"], "foreignData": [], "frameEffects": ["miracle"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "202313", "cardsphereId": "18409", "mcmId": "283953", "mcmMetaId": "205348", "mtgjsonV4Id": "3ac8b237-a0df-50c5-bb82-d148c3323a36", "mtgoFoilId": "58910", "mtgoId": "58909", "multiverseId": "401634", "scryfallId": "5ae63280-c39a-4e1a-9407-1b4a82b23135", "scryfallIllustrationId": "96a87a30-6b17-44e9-818a-26c2c4ad9f81", "scryfallOracleId": "b349f018-c20b-48b0-9e65-d5fd56b24b88", "tcgplayerProductId": "102780"}, "isReprint": true, "isStarter": true, "keywords": ["Miracle"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "vintage": "Legal"}, "manaCost": "{X}{X}{W}{W}{W}", "manaValue": 3.0, "name": "Entreat the Angels", "number": "7", "originalText": "Put X 4/4 white Angel creature tokens with flying onto the battlefield.\nMiracle {X}{W}{W} (You may cast this card for its miracle cost when you draw it if it's the first card you drew this turn.)", "originalType": "Sorcery", "printings": ["AVR", "C18", "MM3", "PLIST", "V15"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/0c3050737399ee4b", "cardmarket": "https://mtgjson.com/links/3fd49a740739c310", "tcgplayer": "https://mtgjson.com/links/9ce6cd820781dd08"}, "rarity": "mythic", "rulings": [{"date": "2017-03-14", "text": "A mana cost of {X}{X} means that you pay twice X. If you want X to be 3, you pay {6}{W}{W}{W} to cast Entreat the Angels."}, {"date": "2017-03-14", "text": "Entreat the Angels’s converted mana cost is based on its mana cost of {X}{X}{W}{W}{W}, even if you’re casting it for its miracle cost. For example, if you cast Entreat the Angels for its miracle cost and choose 4 for X, its converted mana cost is 11."}, {"date": "2018-07-13", "text": "You still draw the card, whether you use the miracle ability or not. Any ability that triggers whenever you draw a card, for example, will trigger. If you don’t cast the card using its miracle ability, it will remain in your hand."}, {"date": "2018-07-13", "text": "If the card with miracle leaves your hand before the triggered ability resolves, you won’t be able to cast it using its miracle ability."}, {"date": "2018-07-13", "text": "You can reveal and cast a card with miracle on any turn, not just your own, if it’s the first card you’ve drawn that turn."}, {"date": "2018-07-13", "text": "It’s important to reveal a card with miracle before it is mixed with the other cards in your hand."}, {"date": "2018-07-13", "text": "Multiple card draws are always treated as a sequence of individual card draws. For example, if you haven’t drawn any cards yet during a turn and cast a spell that instructs you to draw three cards, you’ll draw them one at a time. Only the first card drawn this way may be revealed and cast using its miracle ability."}, {"date": "2018-07-13", "text": "If an effect puts a card into your hand without using the word “draw,” the card wasn’t drawn."}, {"date": "2018-07-13", "text": "You don’t have to reveal a drawn card with miracle if you don’t wish to cast it at that time."}, {"date": "2018-07-13", "text": "You can cast a card for its miracle cost only as the miracle triggered ability resolves. If you don’t want to cast it at that time (or you can’t cast it, perhaps because there are no legal targets available), you won’t be able to cast it later for the miracle cost."}, {"date": "2018-07-13", "text": "You cast the card with miracle during the resolution of the triggered ability. Ignore any timing rules based on the card’s type."}, {"date": "2018-07-13", "text": "Miracle is an alternative cost to cast the spell with miracle. It can’t be combined with other alternative costs, such as casting a spell “without paying its mana cost.”"}, {"date": "2018-07-13", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a miracle cost) you’re paying, add any cost increases, then apply any cost reductions. The converted mana cost of the spell remains unchanged, no matter what the total cost to cast it was."}], "securityStamp": "oval", "setCode": "V15", "subtypes": [], "supertypes": [], "text": "Create X 4/4 white Angel creature tokens with flying.\nMiracle {X}{W}{W} (You may cast this card for its miracle cost when you draw it if it's the first card you drew this turn.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "db2b357d-fb82-5213-9443-d6f1cf491269"}