{"artist": "Jason A. Engle", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U", "W"], "colors": ["U", "W"], "convertedManaCost": 4.0, "edhrecRank": 2975, "finishes": ["foil"], "foreignData": [], "frameEffects": ["nyxtouched", "legendary", "showcase"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "231890", "cardsphereId": "66035", "mcmId": "440273", "mtgjsonV4Id": "a9270102-aa87-53b2-89da-73b35dddc816", "multiverseId": "479501", "scryfallId": "e549057e-fb55-4752-903c-41355f9a0589", "scryfallIllustrationId": "ba9d788a-df6d-4c22-bbe5-d92e00df0dc8", "scryfallOracleId": "5968ecb5-5728-429f-9324-0c108820ebe8", "tcgplayerProductId": "209389"}, "isFullArt": true, "isReprint": true, "isStarter": true, "keywords": ["Indestructible"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}{U}", "manaValue": 4.0, "name": "Ephara, God of the Polis", "number": "72", "originalReleaseDate": "2020-02-14", "originalText": "Indestructible\nAs long as your devotion to white and blue is less than seven, Ephara isn't a creature.\nAt the beginning of each upkeep, if you had another creature enter the battlefield under your control last turn, draw a card.", "originalType": "Legendary Enchantment Creature — God", "power": "6", "printings": ["BNG", "SLD"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/0e66524941aeca9a", "tcgplayer": "https://mtgjson.com/links/ea575dd16ab98ff4"}, "rarity": "mythic", "rulings": [{"date": "2013-09-15", "text": "If an activated ability or triggered ability has an effect that depends on your devotion to a color, you count the number of mana symbols of that color among the mana costs of permanents you control as the ability resolves. The permanent with that ability will be counted if it’s still on the battlefield at that time."}, {"date": "2013-09-15", "text": "The type-changing ability that can make the God not be a creature functions only on the battlefield. It’s always a creature card in other zones, regardless of your devotion to its color."}, {"date": "2013-09-15", "text": "If a God enters the battlefield, your devotion to its color (including the mana symbols in the mana cost of the God itself) will determine if a creature entered the battlefield or not, for abilities that trigger whenever a creature enters the battlefield."}, {"date": "2013-09-15", "text": "Numeric mana symbols ({0}, {1}, and so on) in mana costs of permanents you control don’t count toward your devotion to any color."}, {"date": "2013-09-15", "text": "The abilities of Gods function as long as they’re on the battlefield, regardless of whether they’re creatures."}, {"date": "2013-09-15", "text": "If a God is attacking or blocking and it stops being a creature, it will be removed from combat."}, {"date": "2013-09-15", "text": "If a God is dealt damage, then stops being a creature, then becomes a creature again later in the same turn, the damage will still be marked on it. This is also true for any effects that were affecting the God when it was originally a creature. (Note that in most cases, the damage marked on the God won’t matter because it has indestructible.)"}, {"date": "2013-09-15", "text": "If a God stops being a creature, it loses the type creature and all creature subtypes. It continues to be a legendary enchantment."}, {"date": "2013-09-15", "text": "Mana symbols in the text boxes of permanents you control don’t count toward your devotion to any color."}, {"date": "2013-09-15", "text": "Hybrid mana symbols, monocolored hybrid mana symbols, and Phyrexian mana symbols do count toward your devotion to their color(s)."}, {"date": "2014-02-01", "text": "Ephara’s last ability checks at the beginning of each upkeep whether another creature entered the battlefield under your control last turn. If one did, it will trigger; otherwise, it won’t. The ability will trigger only once no matter how many creatures entered the battlefield under your control that turn, as long as at least one did."}, {"date": "2014-02-01", "text": "The last ability will trigger regardless of what has happened to the creature that entered the battlefield on the previous turn. It doesn’t matter whether it’s still under your control or whether it’s still on the battlefield."}, {"date": "2014-02-01", "text": "If a noncreature permanent you control (such as an Aura with bestow) becomes a creature, it will not cause Ephara’s last ability to trigger the following turn. This is true even if that noncreature permanent became a creature the same turn it entered the battlefield."}], "securityStamp": "oval", "setCode": "SLD", "subset": ["Theros Stargazing, Volume II"], "subtypes": ["God"], "supertypes": ["Legendary"], "text": "Indestructible\nAs long as your devotion to white and blue is less than seven, Ephara isn't a creature.\nAt the beginning of each upkeep, if you had another creature enter the battlefield under your control last turn, draw a card.", "toughness": "5", "type": "Legendary Enchantment Creature — God", "types": ["Enchantment", "Creature"], "uuid": "1639b187-476f-5d5a-bf22-7e7d9a324a9d"}