{"artist": "Jason A. Engle", "availability": ["arena", "mtgo", "paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 2080, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameEffects": ["nyxtouched", "showcase", "legendary", "fullart"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "231305", "cardKingdomId": "230758", "cardsphereId": "65630", "mcmId": "430184", "mcmMetaId": "290859", "mtgArenaId": "73755", "mtgjsonV4Id": "b6e0e0c1-c044-533d-9caa-e95ba08a73d8", "scryfallId": "68f3c60d-2fcb-476f-bcc6-eec5879b08ee", "scryfallIllustrationId": "6af1a9a5-3dfe-4cf9-b5dd-7aee2c965140", "scryfallOracleId": "a5690dc9-f12e-4ecc-b528-f2f83c79c3c8", "tcgplayerProductId": "206645"}, "isFullArt": true, "isStarter": true, "keywords": ["Indestructible"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}", "manaValue": 4.0, "name": "Erebos, Bleak-Hearted", "number": "262", "power": "5", "printings": ["PRM", "PTHB", "THB"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/26b4e58957183ed0", "cardKingdomFoil": "https://mtgjson.com/links/dc25c85d96e3c9c6", "cardmarket": "https://mtgjson.com/links/2192086098b6a603", "tcgplayer": "https://mtgjson.com/links/c6e57db1fa2a4676"}, "rarity": "mythic", "rulings": [{"date": "2020-01-24", "text": "While resolving Erebos’s triggered ability, you can’t pay more than 2 life to draw more than one card."}, {"date": "2020-01-24", "text": "Colorless and generic mana symbols ({C}, {0}, {1}, {2}, {X}, and so on) in mana costs of permanents you control don’t count toward your devotion to any color."}, {"date": "2020-01-24", "text": "Mana symbols in the text boxes of permanents you control don’t count toward your devotion to any color."}, {"date": "2020-01-24", "text": "If one or more creatures you control die at the same time as Erebos, its triggered ability triggers for each of those creatures."}, {"date": "2020-01-24", "text": "Erebos’s last ability can target the creature you’ll sacrifice to pay its cost. In this case, the ability won’t resolve, but Erebos’s triggered ability will trigger."}, {"date": "2020-01-24", "text": "Hybrid mana symbols, monocolored hybrid mana symbols, and Phyrexian mana symbols do count toward your devotion to their color(s)."}, {"date": "2020-01-24", "text": "If an activated ability or triggered ability has an effect that depends on your devotion to a color, you count the number of mana symbols of that color among the mana costs of permanents you control as the ability resolves. The permanent with that ability will be counted if it’s still on the battlefield at that time."}, {"date": "2020-01-24", "text": "If you put an Aura on an opponent’s permanent, you still control the Aura, and mana symbols in its mana cost count towards your devotion."}, {"date": "2020-01-24", "text": "The type-changing ability that can make a God not be a creature functions only on the battlefield. It’s always a creature card in other zones, regardless of your devotion to its color. It’s always a creature spell while it’s on the stack."}, {"date": "2020-01-24", "text": "As a God enters the battlefield, your devotion to its color will determine whether any replacement effects that affect creatures entering the battlefield apply to that God. Because replacement effects are considered before the God is on the battlefield, the mana symbols in its mana cost won’t be counted when determining this."}, {"date": "2020-01-24", "text": "When a God enters the battlefield, your devotion to its color (including the mana symbols in the mana cost of the God itself) will determine if a creature entered the battlefield or not for abilities that trigger whenever a creature enters the battlefield."}, {"date": "2020-01-24", "text": "If a God stops being a creature, it loses the type creature and the creature type God. It continues to be a legendary enchantment."}, {"date": "2020-01-24", "text": "The abilities of Gods function as long as they’re on the battlefield, regardless of whether they’re creatures."}, {"date": "2020-01-24", "text": "If a God is attacking or blocking and it stops being a creature, it will be removed from combat. It won’t rejoin combat if it resumes being a creature later during that combat."}, {"date": "2020-01-24", "text": "Counters put on a God remain on it while it’s not a creature, even if they have no effect."}, {"date": "2020-01-24", "text": "If an effect causes a God to lose all abilities, its ability that causes it to stop being a creature still applies if appropriate."}], "securityStamp": "oval", "setCode": "THB", "subtypes": ["God"], "supertypes": ["Legendary"], "text": "Indestructible\nAs long as your devotion to black is less than five, Erebos isn't a creature.\nWhenever another creature you control dies, you may pay 2 life. If you do, draw a card.\n{1}{B}, Sacrifice another creature: Target creature gets -2/-1 until end of turn.", "toughness": "6", "type": "Legendary Enchantment Creature — God", "types": ["Enchantment", "Creature"], "uuid": "f57a58d7-d4b4-5c54-86a3-2a5c79c5fc90", "variations": ["1cd63876-2f4e-5b7a-aa3b-b76a31e836e6"]}