{"artist": "Steve Luke", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 1.0, "edhrecRank": 10725, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "name": "Ertais Einmischung", "text": "Lege X Verzögerungsmarken auf einen Zauberspruch Deiner Wahl, wenn dieser erfolgreich gesprochen wurde. X kann nicht 0 sein.\nEntferne während der Versorgungsphase des Urhebers des verzögerten Zauberspruchs eine Verzögerungsmarke von diesem Zauberspruch. Wenn auf dem Zauberspruch keine Verzögerungsmarken liegen, wird er verrechnet.", "type": "Unterbrechungszauber"}, {"language": "Spanish", "name": "La intromisión de Ertai"}, {"language": "French", "name": "Ingérence selon Ertaï"}, {"language": "Italian", "name": "Ingerenza di Ertai"}, {"language": "Japanese", "name": "アーテイのおせっかい"}, {"language": "Portuguese (Brazil)", "name": "Intromissão de Ertai"}], "frameVersion": "1997", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "28091", "cardsphereId": "43160", "mcmId": "8796", "mcmMetaId": "1860", "mtgjsonV4Id": "4402494a-43a9-5ef0-900a-a9450b8c9190", "mtgoFoilId": "9902", "mtgoId": "9901", "multiverseId": "4698", "scryfallId": "35c7e7fa-1493-4ef8-9cdb-b02b07a1ad85", "scryfallIllustrationId": "62a50f39-0df4-4775-881c-0e8db22ac179", "scryfallOracleId": "609c529a-b3b3-46d5-b9d0-ae0117507d6e", "tcgplayerProductId": "5542"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{X}{U}", "manaValue": 1.0, "name": "Ertai's Meddling", "number": "61", "originalText": "When target spell is successfully cast, put X delay counters on it. X cannot be 0.\nDuring each upkeep of that spell's caster, remove a delay counter from the spell. If the spell has no delay counters on it, it resolves.", "originalType": "Interrupt", "printings": ["PLIST", "TMP"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/c9b88d8640ae75f9", "cardmarket": "https://mtgjson.com/links/949aa5e1d6c213e0", "tcgplayer": "https://mtgjson.com/links/1669133b667556fd"}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "Once it is put back on the stack, it is a “new” spell again and can be countered or even targeted by another Ertai’s Meddling."}, {"date": "2004-10-04", "text": "Note that a delayed spell that targets another spell won’t resolve when it resolves since it will find that its target is no longer on the stack."}, {"date": "2004-10-04", "text": "If Ertai’s Meddling is used to copy a spell being cast face down due to Morph ability, the spell will create a face up, 2/2, colorless, nameless creature with no text. This may be a little counter-intuitive, because you might expect the card to enter the battlefield face down like it would have when originally cast, but Ertai’s Meddling copies only the original spell and not the entire card the spell represented."}, {"date": "2004-10-04", "text": "A targeted spell which is delayed will still succeed even if its target has phased out and back in again."}, {"date": "2004-10-04", "text": "Ertai’s Meddling can’t be cast through any way that doesn’t pay its mana cost. This is because the X in the Meddling’s mana cost can’t be 0, but effects that allow spells to be cast without paying their mana costs set X to 0."}, {"date": "2004-10-04", "text": "If a copy of a spell (one that has no card representing it) is affected by Ertai’s Meddling, the spell ceases to exist when exiled. It will not gain counters and will not be put back on the stack."}, {"date": "2008-04-01", "text": "This now exiles the spell as part of Ertai’s Meddling’s resolution, instead of waiting for the targeted spell to start resolving."}, {"date": "2011-01-22", "text": "If the spell was cast using flashback, Ertai’s Meddling will still exile it with delay counters on it. When the card is returned to the stack, it still “remembers” the flashback cost was originally paid. It’ll be exiled when it resolves or otherwise leaves the stack."}, {"date": "2013-04-15", "text": "If Ertai’s Meddling is used to copy an arcane spell that had effects spliced onto it, it will create a spell with all of those effects. That spell’s controller will not be able to splice additional effects onto the spell, since they did not re-cast the spell and instead simply put it back onto the stack."}, {"date": "2013-04-15", "text": "Ertai’s Meddling has the spell’s controller put the spell back onto the stack; it does not have its controller cast the spell again. Anything that triggers off of casting spells, such as Contemplation , won’t trigger. Simillarly, effects that count spells that are cast (like Rule of Law) or prevent spells from being cast (like Iona, Shield of Emeria) won’t count or affect the copy that is put onto the stack since the copy wasn’t cast."}], "setCode": "TMP", "subtypes": [], "supertypes": [], "text": "X can't be 0.\nTarget spell's controller exiles it with X delay counters on it.\nAt the beginning of each of that player's upkeeps, if that card is exiled, remove a delay counter from it. If the card has no delay counters on it, the player puts it onto the stack as a copy of the original spell.", "type": "Instant", "types": ["Instant"], "uuid": "dd3eaad9-b4e2-5cba-a484-067b6f6ccc8f"}