{"artist": "Deruchenko Alexander", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 9647, "finishes": ["nonfoil", "foil"], "flavorText": "Sanctuaries harnessed the glowstones' natural reaction to monsters to create a warning system.", "foreignData": [{"flavorText": "Die Zufluchtsorte nutzen die natürliche Reaktion der Glimmsteine auf Monster als Warnsystem.", "language": "German", "multiverseId": 479827, "name": "Fluchtprotokoll", "text": "Immer wenn du eine Karte umwandelst, kannst du {1} bezahlen. Wenn du dies tust, schicke ein Artefakt oder eine Kreatur deiner Wahl, das bzw. die du kontrollierst, ins Exil und bringe es bzw. sie dann unter der Kontrolle ihres Besitzers ins Spiel zurück.", "type": "Verzauberung"}, {"flavorText": "Los santuarios aprovecharon la reacción natural de las rocas irradialuz ante los monstruos para crear un sistema de advertencia.", "language": "Spanish", "multiverseId": 480086, "name": "Protocolo de escapatoria", "text": "Siempre que actives una habilidad de ciclo de una carta, puedes pagar {1}. Cuando lo hagas, exilia el artefacto o la criatura objetivo que controlas, luego regrésala al campo de batalla bajo el control de su propietario.", "type": "Encantamiento"}, {"flavorText": "Les sanctuaires ont exploité la réaction naturelle des nitescenthes face aux monstres pour en faire un système d'alerte.", "language": "French", "multiverseId": 480345, "name": "Protocole d'évasion", "text": "À chaque fois que vous recyclez une carte, vous pouvez payer {1}. Quand vous faites ainsi, exilez un artefact ciblé ou une créature ciblée que vous contrôlez, puis renvoyez-la sur le champ de bataille sous le contrôle de son propriétaire.", "type": "Enchantement"}, {"flavorText": "I santuari hanno sfruttato la reazione naturale delle splendipietre ai mostri per creare un sistema di allerta.", "language": "Italian", "multiverseId": 480604, "name": "Protocollo di Fuga", "text": "Ogniqualvolta cicli una carta, puoi pagare {1}. Quando lo fai, esilia un artefatto o una creatura bersaglio che controlli, poi rimetti quel permanente sul campo di battaglia sotto il controllo del suo proprietario.", "type": "Incantesimo"}, {"flavorText": "聖域では輝き石の怪物に対する自然な反応が、警報機構の構築に利用された。", "language": "Japanese", "multiverseId": 480863, "name": "脱出の儀礼", "text": "あなたがカードをサイクリングするたび、あなたは{1}を支払ってもよい。そうしたとき、あなたがコントロールしている、アーティファクト１つかクリーチャー１体を対象とし、それを追放し、その後オーナーのコントロール下で戦場に戻す。", "type": "エンチャント"}, {"flavorText": "성소들은 발광석이 괴수들에게 자연적으로 반응하는 것을 이용해 경고 체계로 삼았다.", "language": "Korean", "multiverseId": 481122, "name": "탈출 규약", "text": "당신이 카드를 순환할 때마다, 당신은 {1}을 지불할 수 있다. 그렇게 할 때, 당신이 조종하는 마법물체 또는 생물을 목표로 정한다. 그 목표를 추방한 후, 소유자의 조종하에 전장으로 되돌린다.", "type": "부여마법"}, {"flavorText": "Os santuários aproveitaram a reação natural dos luminólitos aos monstros para criar um sistema de alerta.", "language": "Portuguese (Brazil)", "multiverseId": 481381, "name": "Protocolo de Fuga", "text": "Toda vez que você recicla um card, você pode pagar {1}. Quando fizer isso, exile o artefato ou a criatura alvo que você controla, depois devolva-o ao campo de batalha sob o controle de seu dono.", "type": "Encantamento"}, {"flavorText": "Используя естественную реакцию светокамня на чудовищ, в убежищах устроили систему предупреждения.", "language": "Russian", "multiverseId": 481640, "name": "Протокол Побега", "text": "Каждый раз, когда вы совершаете Цикл карты, вы можете заплатить {1}. Когда вы это делаете, изгоните целевой артефакт или существо под вашим контролем, затем верните его на поле битвы под контролем его владельца.", "type": "Чары"}, {"flavorText": "光晶对怪兽有着自然反应。待庇护地掌握其间规律后，便藉此建立了一套预警机制。", "language": "Chinese Simplified", "multiverseId": 481899, "name": "逃离方案", "text": "每当你循环一张牌时，你可以支付{1}。当你如此作时，放逐目标由你操控的神器或生物，然后将它在其拥有者的操控下移回战场。", "type": "结界"}, {"flavorText": "光晶對怪獸有著自然反應。待庇護地掌握其間規律後，便藉此建立了一套預警機制。", "language": "Chinese Traditional", "multiverseId": 482158, "name": "逃離方案", "text": "每當你循環一張牌時，你可以支付{1}。當你如此作時，放逐目標由你操控的神器或生物，然後將它在其擁有者的操控下移回戰場。", "type": "結界"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "232937", "cardKingdomId": "232372", "cardsphereId": "66725", "mcmId": "452938", "mcmMetaId": "301143", "mtgArenaId": "71115", "mtgjsonV4Id": "c56306ce-d991-5ae3-ad56-a85089591dd2", "mtgoId": "80105", "multiverseId": "479568", "scryfallId": "2d3eeddd-c86d-4f35-ba57-3caa9565fcb0", "scryfallIllustrationId": "df6fc2d6-b802-4ef3-876b-a50d5ce6b530", "scryfallOracleId": "e875b468-b475-4573-adf6-312ca4ab6994", "tcgplayerProductId": "212258"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Escape Protocol", "number": "48", "originalText": "Whenever you cycle a card, you may pay {1}. When you do, exile target artifact or creature you control, then return it to the battlefield under its owner's control.", "originalType": "Enchantment", "printings": ["IKO"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/a8b12fe6acd3f0ff", "cardKingdomFoil": "https://mtgjson.com/links/034668329fb2a48a", "cardmarket": "https://mtgjson.com/links/140c0a1e7e2a3e10", "tcgplayer": "https://mtgjson.com/links/ad165fc1d7cad0a1"}, "rarity": "uncommon", "rulings": [{"date": "2020-04-17", "text": "If a token is exiled this way, it will cease to exist and won’t return to the battlefield."}, {"date": "2020-04-17", "text": "When the card returns to the battlefield, it will be a new object with no connection to the card that was exiled. Auras attached to the exiled permanent will be put into their owners’ graveyards. Any Equipment will become unattached and remain on the battlefield. Any counters on the exiled permanent will cease to exist."}, {"date": "2020-04-17", "text": "While resolving Escape Protocol’s triggered ability, you can’t pay {1} multiple times to exile multiple permanents you control."}, {"date": "2020-04-17", "text": "Escape Protocol’s triggered ability goes on the stack without a target. While that ability is resolving, you may pay {1}. If you do, a second ability triggers and you pick a target artifact or creature you control. This is different from abilities that say “If you do . . .” in that players may cast spells and activate abilities after mana is paid but before the target changes zones."}, {"date": "2020-04-17", "text": "Some cards with cycling have an ability that triggers when you cycle them, and some cards have an ability that triggers whenever you cycle any card. These triggered abilities resolve before you draw from the cycling ability."}, {"date": "2020-04-17", "text": "Triggered abilities from cycling a card and the cycling ability itself aren’t spells. Effects that interact with spells (such as that of Cancel) won’t affect them."}, {"date": "2020-04-17", "text": "You can cycle a card even if it has a triggered ability from cycling that won’t have a legal target. This is because the cycling ability and the triggered ability are separate. This also means that if either ability is countered (with Disallow, for example), the other ability will still resolve."}], "setCode": "IKO", "subtypes": [], "supertypes": [], "text": "Whenever you cycle a card, you may pay {1}. When you do, exile target artifact or creature you control, then return it to the battlefield under its owner's control.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "8540ff2d-cb92-5dd7-8c70-db705397019c"}