{"artist": "Terese Nielsen", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 6.0, "edhrecRank": 14324, "finishes": ["nonfoil", "foil"], "flavorText": "Wander too far into the wild and it may take you for its own.", "foreignData": [{"flavorText": "Wandere zu weit in die Wildnis, und sie hält dich für ihresgleichen.", "language": "German", "multiverseId": 273708, "name": "Wesen der Wildnis", "text": "Kreaturen, die du kontrollierst, kommen als Kopie des Wesens der Wildnis ins Spiel.", "type": "Kreatur — Avatar"}, {"flavorText": "Si te alejas por el bosque te atrapará para siempre.", "language": "Spanish", "multiverseId": 273992, "name": "Esencia de lo salvaje", "text": "Las criaturas que controlas entran al campo de batalla como una copia de la Esencia de lo salvaje.", "type": "Criatura — Avatar"}, {"flavorText": "Aventurez-vous trop loin dans la Nature et elle pourrait vous faire sienne.", "language": "French", "multiverseId": 273140, "name": "Essence de la Nature", "text": "Les créatures que vous contrôlez arrivent sur le champ de bataille en tant que copie de l'Essence de la Nature.", "type": "Créature : avatar"}, {"flavorText": "Spingiti troppo nel territorio selvaggio e potrebbe farti suo.", "language": "Italian", "multiverseId": 274276, "name": "Essenza del Selvaggio", "text": "Le creature che controlli entrano nel campo di battaglia come una copia dell'Essenza del Selvaggio.", "type": "Creatura — Avatar"}, {"flavorText": "荒れ野の奥に行き過ぎると、荒れ野がお前をさらっていく。", "language": "Japanese", "multiverseId": 274560, "name": "荒れ野の本質", "text": "あなたがコントロールするクリーチャーは、荒れ野の本質のコピーとして戦場に出る。", "type": "クリーチャー — アバター"}, {"flavorText": "자연에 너무 깊이 빠져버리면 자연은 당신을 자신의 것으로 만들어버릴 수 있다.", "language": "Korean", "name": "야생의 정수", "text": "당신이 조종하는 생물들은 야생의 정수의 복사본으로 전장에 들어온다.", "type": "생물 — 아바타"}, {"flavorText": "Quem se aventura longe demais no mundo selvagem acaba tornando-se parte dele.", "language": "Portuguese (Brazil)", "multiverseId": 272856, "name": "Essência Selvagem", "text": "As criaturas que você controla entram no campo de batalha como uma cópia de Essência Selvagem.", "type": "Criatura — Avatar"}, {"flavorText": "Забреди подальше в дикую чащу, и она может принять тебя за своего.", "language": "Russian", "multiverseId": 273424, "name": "Сущность Дикой Природы", "text": "Существа под вашим контролем выходят на поле битвы в качестве копии Сущности Дикой Природы.", "type": "Существо — Аватара"}, {"flavorText": "如果太深入野境，它可能会把你当成自己。", "language": "Chinese Simplified", "multiverseId": 272288, "name": "蛮荒精魂", "text": "由你操控的生物进场时是蛮荒精魂的复制品。", "type": "生物～圣者"}, {"flavorText": "如果太深入野境，它可能會把你當成自己。", "language": "Chinese Traditional", "multiverseId": 272572, "name": "蠻荒精魂", "text": "由你操控的生物進場時是蠻荒精魂的複製品。", "type": "生物～聖者"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "185948", "cardKingdomId": "185622", "cardsphereId": "20511", "mcmId": "250583", "mcmMetaId": "204025", "mtgjsonV4Id": "61997c8d-6faf-58ad-87b9-e0ff317e9280", "mtgoFoilId": "42807", "mtgoId": "42806", "multiverseId": "254133", "scryfallId": "dec48cba-1b5d-44e7-9e25-16922dedb67d", "scryfallIllustrationId": "af7acf1d-dfe8-4630-9710-10b6e9a763a5", "scryfallOracleId": "9d105f83-583d-438b-8f26-b39e818ed295", "tcgplayerProductId": "52211"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{G}{G}{G}", "manaValue": 6.0, "name": "Essence of the Wild", "number": "178", "originalText": "Creatures you control enter the battlefield as a copy of Essence of the Wild.", "originalType": "Creature — Avatar", "power": "6", "printings": ["ISD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/961bd9c0754e874d", "cardKingdomFoil": "https://mtgjson.com/links/6cfd52305244e175", "cardmarket": "https://mtgjson.com/links/3afc840502b00654", "tcgplayer": "https://mtgjson.com/links/585a584acc0d4e45"}, "rarity": "mythic", "rulings": [{"date": "2011-09-22", "text": "Creatures you control don’t copy whether Essence of the Wild is tapped or untapped, whether it has any counters on it or any Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, or so on."}, {"date": "2011-09-22", "text": "Because creatures you control enter the battlefield as a copy of Essence of the Wild, any enters-the-battlefield triggered abilities printed on such creatures won’t trigger."}, {"date": "2011-09-22", "text": "Replacement effects that modify how a creature enters the battlefield are applied in the following order: first control-changing effects (such as Gather Specimens), then copy effects (such as the abilities of Essence of the Wild and Clone), then all other effects. This is a minor rules change to make Essence of the Wild and similar cards in the future work intuitively."}, {"date": "2011-09-22", "text": "If a creature such as Clone is entering the battlefield under your control, there will be two copy effects to apply: the creature’s own and Essence of the Wild’s. No matter what order these effects are applied, the creature will be a copy of Essence of the Wild when it enters the battlefield."}, {"date": "2011-09-22", "text": "Other enters-the-battlefield replacement abilities printed on the creature entering the battlefield won’t be applied because the creature will already be Essence of the Wild at that point (and therefore it won’t have those abilities). For example, a creature that normally enters the battlefield tapped will enter the battlefield as an untapped Essence of the Wild, and a creature that would normally enter the battlefield with counters on it will enter the battlefield as an Essence of the Wild with no counters."}, {"date": "2011-09-22", "text": "External abilities may still affect how a creature enters the battlefield. For example, if your opponent controls Urabrask the Hidden, which reads, in part, “Creatures your opponents control enter the battlefield tapped,” a creature entering the battlefield under your control will be a tapped Essence of the Wild."}, {"date": "2011-09-22", "text": "If a creature such as Cryptoplasm that’s already on the battlefield copies Essence of the Wild and modifies its own copy effect, that modification is also copied by creatures entering the battlefield under your control."}, {"date": "2011-09-22", "text": "If you control more than one Essence of the Wild, creatures you control will enter the battlefield as a copy of the one whose copy effect you apply last."}], "setCode": "ISD", "subtypes": ["Avatar"], "supertypes": [], "text": "Creatures you control enter the battlefield as a copy of Essence of the Wild.", "toughness": "6", "type": "Creature — Avatar", "types": ["Creature"], "uuid": "5fb1dcd8-0daf-5280-96e5-af6101d9a719"}