{"artist": "Johannes Voss", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G", "U", "W"], "colors": ["G", "U", "W"], "convertedManaCost": 4.0, "edhrecRank": 5034, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "e70f7d1b-9645-59fa-abdd-55cb9c477711", "mtgoId": "70739", "scryfallId": "fab1667b-f8ca-424c-8e6a-275fc2522f7d", "scryfallIllustrationId": "9b71b26a-81f1-4cb1-bb3b-9669ca6493e1", "scryfallOracleId": "7cf1fa2e-1572-4d9d-8e93-e49016b34458"}, "isOnlineOnly": true, "isReprint": true, "keywords": ["Mill"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "loyalty": "3", "manaCost": "{1}{G}{W}{U}", "manaValue": 4.0, "name": "Estrid, the Masked", "number": "70739", "originalReleaseDate": "2018-12-06", "printings": ["C18", "OC18", "PZ2"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2018-07-13", "text": "An enchanted permanent is one with an Aura attached to it. Enchantment permanents you control that don’t have Auras attached to them aren’t enchanted."}, {"date": "2018-07-13", "text": "If an Aura with totem armor is itself enchanted by another Aura with totem armor, destroying either the first Aura or the permanent it enchants will result in only the second Aura being destroyed instead."}, {"date": "2018-07-13", "text": "Estrid’s second ability might target a permanent that can’t have the Aura token attached to it. In this case, the token isn’t created at all."}, {"date": "2018-07-13", "text": "Estrid’s second ability can’t target Estrid, but the Mask token may legally enchant Estrid if you find a way to move it onto her."}, {"date": "2018-07-13", "text": "All of the non-Aura enchantments put onto the battlefield with Estrid’s third ability enter at the same time. If any have triggered abilities that trigger on something else entering the battlefield, they’ll see each other."}, {"date": "2018-07-13", "text": "Aura cards returned with Estrid’s third ability may enchant non-Aura enchantments put onto the battlefield with that ability."}, {"date": "2018-07-13", "text": "You choose what each returning Aura will enchant just before that Aura enters the battlefield. The chosen recipient must be able to legally be enchanted by the Aura. This doesn’t target the player or permanent it will enchant, so an opponent’s permanent with hexproof may be chosen this way."}, {"date": "2018-07-13", "text": "If an Aura card can’t enchant anything, it remains in your graveyard."}, {"date": "2018-07-13", "text": "Totem armor’s effect is mandatory. If the enchanted permanent would be destroyed, you must remove all damage from it (if it has any) and destroy the Aura that has totem armor instead."}, {"date": "2018-07-13", "text": "Totem armor’s effect is applied no matter why the enchanted permanent would be destroyed: because it’s been dealt lethal damage, or because it’s being affected by an effect that says to “destroy” it (such as Putrefy). In either case, all damage is removed from the permanent and the Aura is destroyed instead."}, {"date": "2018-07-13", "text": "If a permanent you control is enchanted with multiple Auras that have totem armor, and the enchanted permanent would be destroyed, one of those Auras is destroyed instead — but only one of them. You choose which one because you control the enchanted permanent."}, {"date": "2018-07-13", "text": "If a permanent enchanted with an Aura that has totem armor would be destroyed by multiple state-based actions at the same time (most likely because a creature with deathtouch has dealt damage to that creature greater than or equal to its toughness) totem armor’s effect will replace all of them and save the creature."}, {"date": "2018-07-13", "text": "If a spell or ability (such as Akroma’s Vengeance) would destroy both an Aura with totem armor and the permanent it’s enchanting at the same time, totem armor’s effect will save the enchanted permanent from being destroyed. Instead, the spell or ability will destroy the Aura in two different ways at the same time, but the result is the same as destroying it once."}, {"date": "2018-07-13", "text": "Totem armor’s effect is not regeneration. Specifically, if totem armor’s effect is applied, the enchanted permanent does not become tapped and is not removed from combat as a result. Effects that say the enchanted permanent can’t be regenerated (as Putrefy does) won’t prevent totem armor’s effect from being applied."}, {"date": "2018-07-13", "text": "If a spell or ability says that it would “destroy” a permanent enchanted with an Aura that has totem armor, that spell or ability is what causes the Aura to be destroyed instead. Totem armor doesn’t destroy the Aura; rather, it changes the effects of the spell or ability. On the other hand, if a spell or ability deals lethal damage to a creature enchanted with an Aura that has totem armor, the game rules regarding lethal damage cause the Aura to be destroyed, not that spell or ability."}, {"date": "2018-07-13", "text": "Totem armor has no effect if the enchanted permanent is put into a graveyard for any other reason, such as if it’s sacrificed, if the “legend rule” applies to it, or if its toughness is 0 or less."}, {"date": "2018-07-13", "text": "If a permanent enchanted with an Aura that has totem armor has indestructible, lethal damage and effects that try to destroy it simply have no effect. Totem armor won’t do anything because it won’t have to."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": ["Estrid"], "supertypes": ["Legendary"], "text": "[+2]: Untap each enchanted permanent you control.\n[−1]: Create a white Aura enchantment token named Mask attached to another target permanent. The token has enchant permanent and totem armor.\n[−7]: Mill seven cards. Return all non-Aura enchantment cards from your graveyard to the battlefield, then do the same for Aura cards.\nEstrid, the Masked can be your commander.", "type": "Legendary Planeswalker — Estrid", "types": ["Planeswalker"], "uuid": "15521e84-8666-5288-a9cd-7296fad1e042"}