{"artist": "Johannes Voss", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 2234, "finishes": ["nonfoil", "foil"], "flavorText": "Enchanters add layer upon layer of complexity to the world around them.", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "5bb0394c-e6c4-5466-a5c5-dc00efbc027a", "mtgoId": "70765", "scryfallId": "7b32a8f5-9883-4507-9403-c8abfd51870f", "scryfallIllustrationId": "97015034-0971-433e-ae02-ba877461628a", "scryfallOracleId": "7f5f10ee-6428-4053-8824-3bc70420ec2c"}, "isOnlineOnly": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}", "manaValue": 3.0, "name": "Estrid's Invocation", "number": "70765", "originalReleaseDate": "2018-12-06", "printings": ["C18", "PZ2"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2018-07-13", "text": "If Estrid’s Invocation doesn’t copy an enchantment as it enters the battlefield, it won’t have the ability to exile it at the beginning of your upkeep. You can’t have it copy itself to get this ability."}, {"date": "2018-07-13", "text": "Once Estrid’s Invocation returns, it’s considered a new object with no relation to the object that it was. You must choose an enchantment that’s currently on the battlefield to copy (or to not copy anything). Auras that were attached to it will be put into their owners’ graveyards. Any counters that were on it cease to exist."}, {"date": "2018-07-13", "text": "Estrid’s Invocation copies exactly what was printed on the original enchantment (unless that enchantment is copying something else or is a token; see below). It doesn’t copy whether that enchantment is tapped or untapped, whether it has any counters on it or any Auras attached to it, or any non-copy effects that have changed its types, color, or so on."}, {"date": "2018-07-13", "text": "If the copied enchantment has {X} in its mana cost, X is considered to be 0."}, {"date": "2018-07-13", "text": "If the chosen enchantment is copying something else (for example, if the chosen enchantment is another Estrid’s Invocation), then Estrid’s Invocation enters the battlefield as whatever the chosen enchantment copied."}, {"date": "2018-07-13", "text": "If the chosen enchantment is a token, Estrid’s Invocation copies the original characteristics of that token as stated by the effect that created the token. Estrid’s Invocation doesn’t become a token in this case."}, {"date": "2018-07-13", "text": "If the chosen enchantment is an Aura, you choose what it enchants just before Estrid’s Invocation enters the battlefield. The chosen recipient must be able to legally be enchanted by the Aura Estrid’s Invocation will be. This doesn’t target the player or permanent it will enchant, so an opponent’s permanent with hexproof may be chosen this way."}, {"date": "2018-07-13", "text": "If the chosen enchantment is an Aura but Estrid’s Invocation won’t be able to legally enchant anything, Estrid’s Invocation remains in its current zone and doesn’t enter the battlefield. If Estrid’s Invocation is on the stack, it’s put into its owner’s graveyard."}, {"date": "2018-07-13", "text": "Any enters-the-battlefield abilities of the copied enchantment will trigger when Estrid’s Invocation enters the battlefield. Any “as [this enchantment] enters the battlefield” or “[this enchantment] enters the battlefield with” abilities of the chosen enchantment will also work."}, {"date": "2018-07-13", "text": "If Estrid’s Invocation somehow enters the battlefield at the same time as another enchantment, it can’t become a copy of that enchantment. You may choose only an enchantment that’s already on the battlefield."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": [], "supertypes": [], "text": "You may have Estrid's Invocation enter the battlefield as a copy of an enchantment you control, except it has \"At the beginning of your upkeep, you may exile this enchantment. If you do, return it to the battlefield under its owner's control.\"", "type": "Enchantment", "types": ["Enchantment"], "uuid": "fe60df37-a712-52ea-a9fd-87dc3edf6be2"}