{"artist": "Ryan Pancoast", "availability": ["mtgo"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 4.0, "edhrecRank": 14645, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "600cacab-df15-5845-b388-237d6e54b967", "mtgoFoilId": "53166", "mtgoId": "53165", "multiverseId": "382927", "scryfallId": "71725234-14fa-4a29-9efc-6dd2366d9798", "scryfallIllustrationId": "a3105f66-0341-432b-853f-9c608d0e7dca", "scryfallOracleId": "917f2b4b-79ec-4ded-b4c8-cbcf363cb23b"}, "isOnlineOnly": true, "isReprint": true, "isReserved": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}{G}", "manaValue": 4.0, "name": "Eureka", "number": "208", "originalText": "Starting with you, each player may put a permanent card from his or her hand onto the battlefield. Repeat this process until no one puts a card onto the battlefield.", "originalType": "Sorcery", "printings": ["LEG", "ME1", "PRM", "VMA"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2004-10-04", "text": "The cards are put onto the battlefield and will not trigger effects which trigger on such cards being “cast” or “played”."}, {"date": "2004-10-04", "text": "In a game of N players, the process ends when all N players in sequence (starting with you) choose not to put a card onto the battlefield. It doesn’t end the first time a player chooses not to put a card onto the battlefield. If a player chooses not to put a card onto the battlefield but the process continues, that player may put a card onto the battlefield the next time the process gets around to them."}, {"date": "2004-10-04", "text": "If the card has an X in its mana cost, treat X as zero."}, {"date": "2006-10-15", "text": "Anything that triggers during the resolution of this will wait to be put on the stack until everything is put onto the battlefield and resolution is complete. The player whose turn it is will put all of their triggered abilities on the stack in any order, then each other player in turn order will do the same. (The last ability put on the stack will be the first one that resolves.)"}, {"date": "2007-09-16", "text": "A “permanent card” is a card that would be a permanent once it’s on the battlefield. Specifically, it’s an artifact, creature, enchantment, land, or planeswalker card."}], "securityStamp": "oval", "setCode": "VMA", "subtypes": [], "supertypes": [], "text": "Starting with you, each player may put a permanent card from their hand onto the battlefield. Repeat this process until no one puts a card onto the battlefield.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "2f01c9c8-d51d-5793-a1ba-6ae52078dce4"}