{"artist": "Jason A. Engle", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 1.0, "edhrecRank": 10804, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "f1641470-60bf-51d0-b61c-8cf36f513799", "mtgoId": "103422", "scryfallId": "7373c825-0d31-4736-88fe-b46adc8251ca", "scryfallIllustrationId": "93eb16d8-a415-4fb2-9e46-a8341d913829", "scryfallOracleId": "12367806-5924-485c-814a-5b67dd79235e"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{B}", "manaValue": 1.0, "name": "Evolved Sleeper", "number": "103422", "originalReleaseDate": "2022-09-09", "power": "1", "printings": ["DMU", "PDMU", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2022-09-09", "text": "None of these abilities has a duration. If one of them resolves, it will remain in effect until the game ends, Evolved Sleeper leaves the battlefield, or some subsequent effect changes its characteristics, whichever comes first."}, {"date": "2022-09-09", "text": "Evolved Sleeper’s first two abilities overwrite its power, toughness, and creature types. Typically, those abilities are activated in the order they appear on the card. However, if Evolved Sleeper is a 3/3 Phyrexian Human Cleric and you activate its first ability again, it will become a 2/2 Human Cleric as that ability resolves."}, {"date": "2022-09-09", "text": "You can activate Evolved Sleeper’s second and third abilities regardless of what creature types it is. Each of those abilities checks Evolved Sleeper’s creature types when that ability resolves. If Evolved Sleeper isn’t the appropriate creature type at that time, the ability does nothing."}, {"date": "2022-09-09", "text": "Evolved Sleeper’s second ability checks whether it’s a Cleric, and its third ability checks whether it’s a Phyrexian. It doesn’t matter how it became the appropriate creature type."}, {"date": "2022-09-09", "text": "The effects from the first and second abilities overwrite other effects that set power and/or toughness if and only if those effects existed before the ability resolved. It will not overwrite effects that modify power or toughness without setting it (whether from a static ability, counters, or a resolved spell or ability), nor will it overwrite effects that set power and toughness which come into existence after the ability resolves. Effects that switch the creature’s power and toughness are always applied after any other power or toughness changing effects, including this one, regardless of the order in which they are created."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Human"], "supertypes": [], "text": "{B}: Evolved Sleeper becomes a Human Cleric with base power and toughness 2/2.\n{1}{B}: If Evolved Sleeper is a Cleric, put a deathtouch counter on it and it becomes a Phyrexian Human Cleric with base power and toughness 3/3.\n{1}{B}{B}: If Evolved Sleeper is a Phyrexian, put a +1/+1 counter on it, then you draw a card and you lose 1 life.", "toughness": "1", "type": "Creature — Human", "types": ["Creature"], "uuid": "6564ccd4-0e9c-5f11-860a-8e9d2c22bb96"}