{"artist": "Steven Belledin", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "edhrecRank": 9, "finishes": ["nonfoil"], "flavorText": "\"It was a strange morning. When we awoke, we found our trees transformed. We didn't know whether to water them or polish them.\"\n—Pulan, Bant orchardist", "foreignData": [{"flavorText": "„Das war ein seltsamer Morgen. Als wir aufwachten, hatten sich unsere Bäume verwandelt. Wir wussten nicht, ob wir sie gießen oder polieren sollten.\"\n—Pulan, Hainpfleger aus Bant", "language": "German", "multiverseId": 545905, "name": "Exotischer Obstgarten", "text": "{T}: Erzeuge ein Mana einer beliebigen Farbe, das ein Land, das ein Gegner kontrolliert, produzieren könnte.", "type": "Land"}, {"flavorText": "\"Fue una mañana extraña. Cuando despertamos, encontramos nuestros árboles transformados. No sabíamos si regarlos o lustrarlos\".\n—Pulan, jardinero de Bant", "language": "Spanish", "multiverseId": 546017, "name": "Huerto exótico", "text": "{T}: Agrega un maná de cualquier color que pueda producir una tierra que controla un oponente.", "type": "Tierra"}, {"flavorText": "« C'était une étrange matinée. Quand nous nous sommes réveillés, nos arbres avaient été transformés. Nous ne savions plus si nous devions les arroser ou les polir. »\n—Pulan, arboriste de Bant", "language": "French", "multiverseId": 546129, "name": "Verger exotique", "text": "{T} : Ajoutez un mana de la couleur de votre choix qu'un terrain qu'un adversaire contrôle pourrait produire.", "type": "Terrain"}, {"flavorText": "\"Era una strana mattina. Quando ci siamo svegliati, abbiamo trovato i nostri alberi completamente trasformati. Non sapevamo più se innaffiarli o lucidarli.\"\n—Pulan, agricoltore di Bant", "language": "Italian", "multiverseId": 546241, "name": "Frutteto Esotico", "text": "{T}: Aggiungi un mana di un qualsiasi colore che una terra controllata da un avversario potrebbe produrre.", "type": "Terra"}, {"flavorText": "「変な朝だったよ。起きたら、俺らの樹が変わっちまってたんだ。水やったらいいのか磨いたらいいのかわかんなくってな。」\n――バントの果樹園主、プーラン", "language": "Japanese", "multiverseId": 546353, "name": "風変わりな果樹園", "text": "{T}：対戦相手がコントロールしている土地が生み出すことのできる色１色のマナ１点を加える。", "type": "土地"}, {"flavorText": "\"Foi uma manhã estranha. Quando acordamos, encontramos nossas árvores transformadas. Não sabíamos se deveriam ser regadas ou polidas.\"\n— Pulan, pomareiro de Bant", "language": "Portuguese (Brazil)", "multiverseId": 546465, "name": "Pomar Exótico", "text": "{T}: Adicione um mana de qualquer cor que um terreno controlado por um oponente possa gerar.", "type": "Terreno"}, {"flavorText": "«Утро было странное. Когда мы проснулись, то обнаружили, что деревья вокруг полностью преобразились. Мы даже не знали, поливать их или полировать».\n— Пулан, бэнтский садовник", "language": "Russian", "multiverseId": 546577, "name": "Экзотический Сад", "text": "{T}: добавьте одну ману любого цвета, которую может производить земля под контролем оппонента.", "type": "Земля"}, {"flavorText": "「那是个奇怪的早晨。我们醒来时，就发现树变了样子。不晓得该要替它浇水还是把它擦亮。」\n～班特栽果人普兰", "language": "Chinese Simplified", "multiverseId": 546689, "name": "异国果园", "text": "{T}：加一点法术力，其颜色为由对手操控的地能产生之任一颜色。", "type": "地"}, {"flavorText": "「那是個奇怪的早晨。我們醒來時，就發現樹變了樣子。不曉得該要替它澆水還是把它擦亮。」\n～班特栽果人普蘭", "language": "Chinese Traditional", "multiverseId": 546801, "name": "異國果園", "text": "{T}：加一點魔法力，其顏色為由對手操控的地能產生之任一顏色。", "type": "地"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "253441", "cardsphereId": "82569", "mcmId": "584153", "mtgjsonV4Id": "494a9d60-b6ed-59a8-af07-15bd67df9e8a", "multiverseId": "545793", "scryfallId": "103e7314-d7ca-4be0-b21a-d249602d4502", "scryfallIllustrationId": "f67845cb-fe3b-4f90-8de2-bdb69daca307", "scryfallOracleId": "27b047e3-0d41-45e2-98e9-9391d7923a1e", "tcgplayerProductId": "254226"}, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "vintage": "Legal"}, "manaValue": 0.0, "name": "Exotic Orchard", "number": "173", "originalText": "{T}: Add one mana of any color that a land an opponent controls could produce.", "originalType": "Land", "printings": ["40K", "AFC", "BRC", "C16", "C17", "C19", "C20", "C21", "CLB", "CM2", "CN2", "CON", "DMC", "MIC", "NCC", "NEC", "PC2", "PCA", "PHED", "VOC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/b7a4894c9ec327e3", "tcgplayer": "https://mtgjson.com/links/35ac633c582ab033"}, "rarity": "rare", "rulings": [{"date": "2009-02-01", "text": "The colors of mana are white, blue, black, red, and green. Exotic Orchard can't be tapped for colorless mana, even if a land an opponent controls could produce colorless mana."}, {"date": "2009-02-01", "text": "Exotic Orchard checks the effects of all mana-producing abilities of lands your opponents control, but it doesn't check their costs. For example, Vivid Crag has the ability “{T}, Remove a charge counter from Vivid Crag: Add one mana of any color.” If an opponent controls Vivid Crag and you control Exotic Orchard, you can tap Exotic Orchard for any color of mana. It doesn't matter whether Vivid Crag has a charge counter on it, and it doesn't matter whether it's untapped."}, {"date": "2009-02-01", "text": "When determining what colors of mana your opponents' lands could produce, Exotic Orchard takes into account any applicable replacement effects that would apply to those lands' mana abilities (such as Contamination's effect, for example). If there are more than one, consider them in any possible order."}, {"date": "2009-02-01", "text": "Exotic Orchard doesn't care about any restrictions or riders your opponents' lands (such as Ancient Ziggurat or Hall of the Bandit Lord) put on the mana they produce. It just cares about colors of mana."}, {"date": "2009-02-01", "text": "Lands that produce mana based only on what other lands “could produce” won't help each other unless some other land allows one of them to actually produce some type of mana. For example, if you control an Exotic Orchard and your opponent controls an Exotic Orchard and a Reflecting Pool, none of those lands would produce mana if their mana abilities were activated. On the other hand, if you control a Forest and an Exotic Orchard, and your opponent controls an Exotic Orchard and a Reflecting Pool, then each of those lands can be tapped to produce {G}. Your opponent's Exotic Orchard can produce {G} because you control a Forest. Your Exotic Orchard and your opponent's Reflecting Pool can each produce {G} because your opponent's Exotic Orchard can produce {G}."}], "securityStamp": "oval", "setCode": "VOC", "subtypes": [], "supertypes": [], "text": "{T}: Add one mana of any color that a land an opponent controls could produce.", "type": "Land", "types": ["Land"], "uuid": "99af4c0a-9acf-5313-89e7-b9e42a2bde69"}