{"artist": "Zoltan Boros & Gabor Szikszai", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G", "R"], "colors": ["G", "R"], "convertedManaCost": 4.0, "edhrecRank": 15963, "finishes": ["nonfoil", "foil"], "flavorText": "Reuniting a world is not a gentle process.", "foreignData": [{"flavorText": "Die Wiedervereinigung einer Welt geht nie sanft über die Bühne.", "language": "German", "multiverseId": 193209, "name": "Explodierende Grenzen", "text": "Domäne Durchsuche deine Bibliothek nach einem Standardland, bringe diese Karte getappt ins Spiel und mische danach deine Bibliothek. Die Explodierenden Grenzen fügen einem Spieler deiner Wahl X Schadenspunkte zu, wobei X gleich der Anzahl an Standardlandtypen unter den Ländern ist, die du kontrollierst.", "type": "Hexerei"}, {"flavorText": "Reunir un mundo no es un proceso delicado.", "language": "Spanish", "multiverseId": 192339, "name": "Fronteras explosivas", "text": "Dominio Busca en tu biblioteca una carta de tierra básica, pon esa carta en juego girada, luego baraja tu biblioteca. Las Fronteras explosivas hacen X puntos de daño al jugador objetivo, donde X es el número de tipos de tierra básica entre las tierras que controlas.", "type": "Conjuro"}, {"flavorText": "Reconstituer un monde n'est pas un processus sans heurts.", "language": "French", "multiverseId": 192484, "name": "Frontières éclatées", "text": "Domaine — Cherchez dans votre bibliothèque une carte de terrain de base, mettez cette carte en jeu engagée et mélangez ensuite votre bibliothèque. Les Frontières éclatées infligent X blessures au joueur ciblé, X étant le nombre de types de terrain de base parmi les terrains que vous contrôlez.", "type": "Rituel"}, {"flavorText": "Riunificare un mondo non è certo un processo delicato.", "language": "Italian", "multiverseId": 192629, "name": "Confini Esplosivi", "text": "Dominio Passa in rassegna il tuo grimorio per una carta terra base e mettila in gioco TAPpata, poi rimescola il tuo grimorio. I Confini Esplosivi infliggono X danni a un giocatore bersaglio, dove X è pari al numero di tipi di terre base tra le terre che controlli.", "type": "Stregoneria"}, {"flavorText": "世界を再びつなぎ合わせるのは、おとなしくは行われない。", "language": "Japanese", "multiverseId": 193064, "name": "爆発する境界", "text": "版図 ― プレイヤー１人を対象とする。あなたのライブラリーから基本土地カードを１枚探し、それをタップ状態で場に出す。その後、あなたのライブラリーを切り直す。 爆発する境界は、そのプレイヤーにＸ点のダメージを与える。Ｘは、あなたがコントロールする土地の中の基本土地タイプの数に等しい。", "type": "ソーサリー"}, {"flavorText": "Reunificar um mundo não é um processo simples.", "language": "Portuguese (Brazil)", "multiverseId": 193354, "name": "Explosão de Fronteiras", "text": "Dominar Procure em seu grimório um card de terreno básico, coloque-o em jogo virado e depois embaralhe seu grimório. Explosão de Fronteiras causa X pontos de dano ao jogador alvo, sendo X igual ao número de tipos de terreno básico entre os terrenos que você controla.", "type": "Feitiço"}, {"flavorText": "Объединение мира не самый спокойный процесс.", "language": "Russian", "multiverseId": 192919, "name": "Взрывающиеся Границы", "text": "Владения Найдите в вашей библиотеке карту базовой земли, положите ту карту в игру повернутой, затем перетасуйте вашу библиотеку. Взрывающиеся Границы наносят Х повреждений целевому игроку, где Х количество типов базовых земель среди земель под вашим контролем.", "type": "Волшебство"}, {"flavorText": "让世界合一的过程绝不会温和。", "language": "Chinese Simplified", "multiverseId": 192774, "name": "暴现边境", "text": "领土～从你的牌库中搜寻一张基本地牌，将之横置进场，然后将你的牌库洗牌。 暴现边境对目标牌手造成X点伤害，X为由你操控的地之中基本地类别的数量。", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "126441", "cardKingdomId": "126278", "cardsphereId": "11064", "mcmId": "20749", "mcmMetaId": "10374", "mtgjsonV4Id": "3dccb23d-b80f-5e86-9b4f-95e837888b22", "mtgoFoilId": "31942", "mtgoId": "31941", "multiverseId": "189378", "scryfallId": "f247aaaf-4d65-4dfc-bab2-3c1331762647", "scryfallIllustrationId": "7fa5a5c1-2c72-47a8-8131-0df270213c41", "scryfallOracleId": "1a19fc9e-a822-49ca-ade0-d58054f3caf6", "tcgplayerProductId": "28532"}, "keywords": ["Domain"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}{G}", "manaValue": 4.0, "name": "Exploding Borders", "number": "106", "originalText": "Domain Search your library for a basic land card, put that card into play tapped, then shuffle your library. Exploding Borders deals X damage to target player, where X is the number of basic land types among lands you control.", "originalType": "Sorcery", "printings": ["CON"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/0973f050a309212b", "cardKingdomFoil": "https://mtgjson.com/links/d48d0df784d42a68", "cardmarket": "https://mtgjson.com/links/62b2f2e581e978aa", "tcgplayer": "https://mtgjson.com/links/6fe88f46ac3e6809"}, "rarity": "common", "rulings": [{"date": "2009-02-01", "text": "To determine the number of basic land types among lands you control, look at the lands you have on the battlefield and ask yourself whether the subtypes Plains, Island, Swamp, Mountain, and Forest appear within that group. The number of times you say yes (topping out at five) tells you how powerful your domain abilities will be."}, {"date": "2009-02-01", "text": "How many lands you control of a particular basic land type is irrelevant to a domain ability, as long as that number is greater than zero. As far as domain is concerned, ten Forests is the same as one Forest."}, {"date": "2009-02-01", "text": "A number of nonbasic lands have basic land types. Domain abilities don’t count the number of lands you control — they count the number of basic land types among lands you control, even if that means checking the same land twice. For example, if you control a Tundra, an Overgrown Tomb, and a Madblind Mountain, you’ll have a Plains, Island, Swamp, Mountain, and Forest among the lands you control. Your domain abilities will be maxed out."}, {"date": "2009-02-01", "text": "You do what the spell says in order, so you’ll put a new basic land card onto the battlefield before you determine the value of X."}, {"date": "2009-02-01", "text": "Exploding Borders will still deal damage even if you don’t put a land card onto the battlefield."}, {"date": "2009-02-01", "text": "Exploding Borders has only one target: the player. If that player becomes an illegal target by the time Exploding Borders would resolve, the entire spell doesn’t resolve. You won’t get to search for a basic land card."}], "setCode": "CON", "subtypes": [], "supertypes": [], "text": "Domain — Search your library for a basic land card, put that card onto the battlefield tapped, then shuffle. Exploding Borders deals X damage to target player or planeswalker, where X is the number of basic land types among lands you control.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "186ea9aa-9c4f-52f3-bcc1-5e36fed2bec2"}