{"artist": "Jon Foster", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 1.0, "edhrecRank": 16942, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 509768, "name": "Ausrupfen", "text": "Sekundenbruchteil (Solange dieser Zauberspruch sich auf dem Stapel befindet, können Spieler keine Zaubersprüche wirken oder Fähigkeiten aktivieren, die keine Manafähigkeiten sind.)\nBestimme eine Karte deiner Wahl in einem Friedhof, die keine Standardland-Karte ist. Durchsuche den Friedhof, die Hand und die Bibliothek ihres Besitzers nach allen Karten mit demselben Namen wie die bestimmte Karte und schicke sie ins Exil. Dann mischt der Spieler seine Bibliothek.", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 510057, "name": "Extirpar", "text": "Fracción de segundo. (Mientras este hechizo esté en la pila, los jugadores no pueden lanzar hechizos o activar habilidades que no sean habilidades de maná.)\nElige una carta objetivo en un cementerio que no sea una carta de tierra básica. Busca en el cementerio, mano y biblioteca de su propietario todas las cartas con el mismo nombre que esa carta y exílialas. Luego ese jugador baraja su biblioteca.", "type": "Instantáneo"}, {"language": "French", "multiverseId": 510346, "name": "Extirpation", "text": "Fraction de seconde (Tant que ce sort est sur la pile, les joueurs ne peuvent pas lancer de sorts ou activer de capacités qui ne sont pas des capacités de mana.)\nChoisissez une carte ciblée dans un cimetière autre qu'une carte de terrain de base. Cherchez dans le cimetière, la main et la bibliothèque de son propriétaire toutes les cartes ayant le même nom que cette carte et exilez-les. Ce joueur mélange ensuite sa bibliothèque.", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 510635, "name": "Asportare", "text": "Battibaleno (Fintanto che questa magia è in pila, i giocatori non possono lanciare magie o attivare abilità che non siano abilità di mana.)\nScegli una carta bersaglio in un cimitero diversa da una carta terra base. Passa in rassegna il cimitero, la mano e il grimorio del suo proprietario per tutte le carte con lo stesso nome di quella carta ed esiliale. Poi quel giocatore rimescola il suo grimorio.", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 510924, "name": "根絶", "text": "刹那（この呪文がスタック上にあるかぎり、プレイヤーは呪文を唱えられず、マナ能力でない起動型能力を起動できない。）\nいずれかの墓地にある基本土地・カードでないカード１枚を対象とする。それのオーナーの墓地と手札とライブラリーから、そのカードと同じ名前を持つすべてのカードを探し、追放する。その後、そのプレイヤーは自分のライブラリーを切り直す。", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 511213, "name": "Extirpar", "text": "Fração de segundo (Enquanto esta mágica estiver na pilha, os jogadores não poderão conjurar mágicas ou ativar habilidades que não sejam habilidades de mana.)\nEscolha o card alvo de um cemitério que não seja um terreno básico. Procure no cemitério, na mão e no grimório de seu dono todos os cards com o mesmo nome daquele card e exile-os. Em seguida, aquele jogador embaralha o próprio grimório.", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 511502, "name": "Искоренение", "text": "Мгновение ока (Пока это заклинание находится в стеке, игроки не могут разыгрывать заклинания или активировать способности, которые не являются мана-способностями.)\nВыберите находящуюся на кладбище целевую карту, не являющуюся картой базовой земли. Найдите на кладбище, в руке и в библиотеке ее владельца все карты с таким же именем, как у той карты, и изгоните их. Затем тот игрок тасует свою библиотеку.", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 511791, "name": "根除", "text": "转瞬（只要此咒语在堆叠上，牌手便不能施放咒语或起动不是法术力异能的异能。）\n选择目标在坟墓场中的牌，且不能是基本地牌。从其拥有者的坟墓场，手牌及牌库中搜寻所有与该牌同名的牌，并将它们放逐。然后该牌手将其牌库洗牌。", "type": "瞬间"}, {"language": "Chinese Traditional", "multiverseId": 512080, "name": "根除", "text": "轉瞬（只要此咒語在堆疊上，玩家便不能施放咒語或起動不是魔法力異能的異能。）\n選擇目標在墳墓場中的牌，且不能是基本地牌。從其擁有者的墳墓場，手牌及牌庫中搜尋所有與該牌同名的牌，並將它們放逐。然後該玩家將其牌庫洗牌。", "type": "瞬間"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "243060", "cardKingdomId": "242622", "cardsphereId": "74811", "mcmId": "543401", "mcmMetaId": "8657", "mtgjsonV4Id": "1700f554-1006-5817-949d-7617a7c2bbb5", "mtgoId": "86591", "multiverseId": "509479", "scryfallId": "4171dbd3-96d6-4e7a-afac-5b2882bf3872", "scryfallIllustrationId": "4e32083e-9e5f-4cac-a274-1be1c7ddb6ba", "scryfallOracleId": "fa857e9d-dfe4-4348-9c1f-16aa240d69cd", "tcgplayerProductId": "233836"}, "isReprint": true, "keywords": ["Split second"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "vintage": "Legal"}, "manaCost": "{B}", "manaValue": 1.0, "name": "Extirpate", "number": "114", "originalText": "Split second (As long as this spell is on the stack, players can't cast spells or activate abilities that aren't mana abilities.)\nChoose target card in a graveyard other than a basic land card. Search its owner's graveyard, hand, and library for all cards with the same name as that card and exile them. Then that player shuffles their library.", "originalType": "Instant", "printings": ["MMA", "PLC", "TSR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/c09cb03a71da3783", "cardKingdomFoil": "https://mtgjson.com/links/fa902a312a5c6e21", "cardmarket": "https://mtgjson.com/links/19af078c5281c12c", "tcgplayer": "https://mtgjson.com/links/b575464de4c44d26"}, "rarity": "rare", "rulings": [{"date": "2021-03-19", "text": "Because the first step of casting a spell is to move it from the zone it’s in, Extirpate can’t be used to stop a spell with flashback from being cast after its controller has announced that they’re casting it."}, {"date": "2021-03-19", "text": "You don’t have to find and exile cards with the same name as the target card in its owner’s hand or library if you don’t want to, but you do have to exile the cards from the player’s graveyard."}, {"date": "2021-03-19", "text": "Players still get priority while a card with split second is on the stack; their options are just limited to mana abilities and certain special actions."}, {"date": "2021-03-19", "text": "Players may turn face-down creatures face up while a spell with split second is on the stack."}, {"date": "2021-03-19", "text": "Split second doesn’t stop triggered abilities from triggering, such as that of Chalice of the Void. If one does, its controller puts it on the stack and chooses targets for it, if any. Those abilities will resolve as normal."}, {"date": "2021-03-19", "text": "Casting a spell with split second won’t affect spells and abilities that are already on the stack."}, {"date": "2021-03-19", "text": "If the resolution of a triggered ability involves casting a spell, that spell can’t be cast if a spell with split second is on the stack."}, {"date": "2021-03-19", "text": "After a spell with split second resolves (or otherwise leaves the stack), players may again cast spells and activate abilities before the next object on the stack resolves."}], "securityStamp": "oval", "setCode": "TSR", "subtypes": [], "supertypes": [], "text": "Split second (As long as this spell is on the stack, players can't cast spells or activate abilities that aren't mana abilities.)\nChoose target card in a graveyard other than a basic land card. Search its owner's graveyard, hand, and library for all cards with the same name as that card and exile them. Then that player shuffles.", "type": "Instant", "types": ["Instant"], "uuid": "02b99e1b-e604-5be0-9193-485daf8df84e"}