{"artist": "Lars Grant-West", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 1740, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 73309, "name": "Außerweltliche Linse", "text": "Einprägen Wenn die Außerweltliche Linse ins Spiel kommt, kannst du ein Land deiner Wahl, das du kontrollierst, ganz aus dem Spiel entfernen. (Die entfernte Karte wird in dieses Artefakt eingeprägt.)\nImmer wenn ein Land mit demselben Namen wie die eingeprägte Karte für Mana getappt wird, erhöht sein Beherrscher seinen Manavorrat um ein Mana eines beliebigen Typs, den dieses Land produziert hat.", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 162049, "name": "Lente extraplanar", "text": "Estampa Cuando el Lente extraplanar entre en juego, puedes remover del juego la tierra objetivo que controles. (La carta removida es estampada en este artefacto.)\nSiempre que se gire una tierra con el mismo nombre que la carta estampada para obtener maná, su controlador agrega un maná a su reserva de maná de algún tipo que produzca esa tierra.", "type": "Artefacto"}, {"language": "French", "multiverseId": 161671, "name": "Lentille extraplanaire", "text": "Empreinte Quand la Lentille extraplanaire arrive en jeu, vous pouvez retirer de la partie la carte de terrain ciblée que vous contrôlez. (Cet artefact a l'empreinte de la carte retirée.)À chaque fois qu'un terrain du même nom que la carte dont la Lentille extraplanaire a l'empreinte est engagée pour du mana, son contrôleur ajoute à sa réserve un mana de n'importe quel type produit par ce terrain\n.", "type": "Artefact"}, {"language": "Italian", "multiverseId": 160140, "name": "Lenti Extradimensionali", "text": "Imprimere Quando le Lenti Extradimensionali entrano in gioco, puoi rimuovere dal gioco una terra bersaglio che controlli (La carta rimossa viene impressa su questo artefatto.)\nOgniqualvolta una terra con lo stesso nome della carta impressa viene TAPpata per attingere mana, il suo controllore aggiunge alla propria riserva un mana di qualsiasi tipo che quella terra può produrre.", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 73662, "name": "超次元レンズ", "text": "刻印 ― 超次元レンズが場に出たとき、あなたがコントロールする土地１つを対象とする。あなたはそれをゲームから取り除いてもよい。 （取り除かれたカードは、このアーティファクトに刻印される。）\n刻印されているカードと同じ名前の土地がマナのためにタップされるたび、それのコントローラーのマナ・プールに、その土地が出せるタイプの好きなマナ１点を加える。", "type": "アーティファクト"}, {"language": "Portuguese (Brazil)", "multiverseId": 162365, "name": "Lentes Extraplanares", "text": "Estampar Quando Lentes Extraplanares entra em jogo, você pode remover de jogo o terreno alvo que você controla. (O card removido fica estampado neste artefato.)\nToda vez que um terreno com o mesmo nome do card estampado for virado para produzir mana, o seu controlador adiciona à sua própria reserva de mana uma mana de qualquer tipo que aquele terreno produzia.", "type": "Artefato"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "73168", "cardKingdomId": "72168", "cardsphereId": "30587", "mcmId": "169", "mcmMetaId": "1916", "mtgjsonV4Id": "972535fa-b8b1-5075-b9ff-b35bb518c778", "mtgoFoilId": "20218", "mtgoId": "20217", "multiverseId": "49440", "scryfallId": "622a6523-3b12-4657-a656-00a57a3ae59c", "scryfallIllustrationId": "23de9f3d-5a53-46c5-9bc2-85231f7e1ea8", "scryfallOracleId": "e48f9fc7-72cf-4c3a-b3b3-d237edc01310", "tcgplayerProductId": "11306"}, "keywords": ["Imprint"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Extraplanar Lens", "number": "169", "originalText": "Imprint When Extraplanar Lens comes into play, you may remove target land you control from the game. (The removed card is imprinted on this artifact.)\nWhenever a land with the same name as the imprinted card is tapped for mana, its controller adds one mana to his or her mana pool of any type that land produced.", "originalType": "Artifact", "printings": ["MPS", "MRD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/49484ed61dcf4fa0", "cardKingdomFoil": "https://mtgjson.com/links/f62ef1ce31edb2eb", "cardmarket": "https://mtgjson.com/links/b2f5ee3f15a55e5d", "tcgplayer": "https://mtgjson.com/links/8e09f783f51205fa"}, "rarity": "rare", "rulings": [], "setCode": "MRD", "subtypes": [], "supertypes": [], "text": "Imprint — When Extraplanar Lens enters the battlefield, you may exile target land you control.\nWhenever a land with the same name as the exiled card is tapped for mana, its controller adds one mana of any type that land produced.", "type": "Artifact", "types": ["Artifact"], "uuid": "1308e781-9fc1-572d-a99a-84e1b694eed9"}