{"artist": "Kekai Kotaki", "availability": ["arena", "mtgo", "paper"], "borderColor": "black", "colorIdentity": ["B", "R", "W"], "colors": ["B", "R"], "convertedManaCost": 8.0, "edhrecRank": 5250, "faceName": "Awaken the Blood Avatar", "finishes": ["nonfoil", "foil"], "foreignData": [], "frameEffects": ["legendary", "extendedart"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardsphereId": "76309", "mcmId": "557626", "mcmMetaId": "338799", "mtgjsonV4Id": "25e2f34e-a69e-5ce8-b44c-d13c89b359ef", "multiverseId": "513629", "scryfallId": "786156ce-544c-4aa4-8381-756042d0bcda", "scryfallIllustrationId": "ed8629b5-b79b-4b2a-a3dd-e230f0b8b3ea", "scryfallOracleId": "0b299983-9f0f-404a-acd1-8f142572b1f1", "tcgplayerProductId": "235864"}, "isStarter": true, "language": "English", "layout": "modal_dfc", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{6}{B}{R}", "manaValue": 8.0, "name": "Extus, Oriq Overlord // Awaken the Blood Avatar", "number": "323", "originalText": "Double strike\nMagecraft — Whenever you cast or copy an instant or sorcery spell, return target nonlegendary creature card from your graveyard to your hand.\n\n\nSorcery\n{6}{B}{R}", "originalType": "Legendary Creature — Human Warlock", "otherFaceIds": ["47229f00-8426-5346-b41f-1d2c5b926197"], "printings": ["PRM", "PSTX", "STX"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardmarket": "https://mtgjson.com/links/e343980b141e8957", "tcgplayer": "https://mtgjson.com/links/1d280f90f702cd03"}, "rarity": "mythic", "rulings": [{"date": "2021-04-16", "text": "Returning a nonlegendary creature card is not optional. If there is at least one in your graveyard, you must target it with the magecraft ability."}, {"date": "2021-04-16", "text": "Awaken the Blood Avatar’s first ability can’t reduce its cost below {B}{R}. However, you can sacrifice any number of creatures, even if they won’t reduce its cost any further."}, {"date": "2021-04-16", "text": "Include any additional costs to cast Awaken the Blood Avatar before applying its own cost reduction. For example, if Extus is your commander, and an additional cost of {6} applies from the “commander tax,” you may cast Awaken the Blood Avatar by sacrificing four creatures and paying {4}{B}{R}."}, {"date": "2021-04-16", "text": "As Awaken the Blood Avatar resolves, first the next opponent in turn order (or, if it’s an opponent’s turn, the opponent whose turn it is) chooses a creature they control, then each other opponent in turn order does the same knowing the choices made before them. Then all the chosen creatures are sacrificed at the same time."}, {"date": "2021-04-16", "text": "The Blood Avatar will be awakened even if no player has creatures to sacrifice when it resolves."}, {"date": "2021-04-16", "text": "Each magecraft ability has a different effect, although they all have the same trigger condition, whenever you cast or copy an instant or sorcery spell."}, {"date": "2021-04-16", "text": "For example, if you control Archmage Emeritus and cast an instant or sorcery spell, Archmage Emeritus’s magecraft ability will trigger and you will draw a card."}, {"date": "2021-04-16", "text": "If an effect creates a copy of an instant or sorcery spell, this will also cause the magecraft ability to trigger."}, {"date": "2021-04-16", "text": "If an effect creates multiple copies of an instant or sorcery spell, magecraft abilities trigger once for each copy created by the effect."}, {"date": "2021-04-16", "text": "Some effects instruct you to copy an instant or sorcery card in a zone other than the stack. These copies do not cause magecraft abilities to trigger. However, most effects that do this also allow you to cast the copy, and casting the copy will cause magecraft abilities to trigger."}], "securityStamp": "oval", "setCode": "STX", "side": "b", "subtypes": [], "supertypes": [], "text": "As an additional cost to cast this spell, you may sacrifice any number of creatures. This spell costs {2} less to cast for each creature sacrificed this way.\nEach opponent sacrifices a creature. Create a 3/6 black and red Avatar creature token with haste and \"Whenever this creature attacks, it deals 3 damage to each opponent.\"", "type": "Sorcery", "types": ["Sorcery"], "uuid": "b3ce0192-4259-50a2-8548-8be986fa454a", "variations": ["1585babb-53a5-5c2b-bcbc-e239fa209d2b"]}