{"artist": "Hideaki Takamura", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 7.0, "edhrecRank": 7630, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 111674, "name": "Auge des Sturms", "text": "Immer wenn ein Spieler eine Spontanzauber- oder eine Hexereikarte spielt, entferne sie ganz aus dem Spiel. Dann kopiert dieser Spieler alle Spontanzauber- und Hexereikarten, die vom Auge des Sturms ganz aus dem Spiel entfernt wurden. Jede Kopie kann der Spieler spielen, ohne ihre Manakosten zu bezahlen.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 113204, "name": "Ojo de la tormenta", "text": "Siempre que un jugador juegue una carta de instantáneo o conjuro, remuévela del juego. Luego ese jugador copia cada carta de instantáneo o conjuro removida del juego con Ojo de la tormenta. Por cada copia, el jugador puede jugarla sin pagar su coste de maná.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 111980, "name": "Œil de la tempête", "text": "À chaque fois qu'un joueur joue une carte d'éphémère ou de rituel, retirez-la de la partie. Ce joueur copie ensuite chaque carte d'éphémère ou de rituel retirée de la partie par l'Œil de la tempête. Pour chaque copie, le joueur peut jouer la copie sans payer son coût de mana.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 112286, "name": "Occhio della Tempesta", "text": "Ogniqualvolta un giocatore gioca una carta istantaneo o stregoneria, rimuovila dal gioco. Poi quel giocatore copia ogni carta istantaneo o stregoneria rimossa dal gioco con l'Occhio della Tempesta. Per ogni copia, il giocatore può giocare la copia senza pagare il suo costo di mana.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 112592, "name": "嵐の目", "text": "いずれかのプレイヤーがインスタント・カードかソーサリー・カードをプレイするたび、それをゲームから取り除く。 その後、そのプレイヤーは嵐の目によりゲームから取り除かれた各インスタント・カードとソーサリー・カードをコピーする。 それぞれのコピーにつき、そのプレイヤーはそのコピーをマナ・コストを支払わずにプレイしてもよい。", "type": "エンチャント"}, {"language": "Portuguese (Brazil)", "multiverseId": 112898, "name": "Olho da Tempestade", "text": "Toda vez que um jogador joga um card de mágica instantânea ou feitiço, remova-o do jogo. Depois, aquele jogador copia cada card de feitiço ou de mágica instantânea removido do jogo com Olho da Tempestade. Para cada cópia, o jogador pode jogar a cópia sem pagar seu custo de mana.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 114306, "name": "Глаз бури", "text": "Каждый раз, когда игрок разыгрывает карту мгновенного заклинания или волшебства, выведите ее из игры. Затем этот игрок копирует каждую карту мгновенного заклинания или волшебства, выведенного из игры Глазом бури. Каждую такую копию игрок может разыгрывать без уплаты стоимости маны.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 111368, "name": "暴风眼", "text": "每当任一牌手使用瞬间或法术咒语时，将它移出对战。 然后该牌手复制每张以暴风眼移出的瞬间或法术牌。 该牌手可以使用这些复制，并且不需支付其法术力费用。", "type": "结界"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "118731", "cardKingdomId": "118440", "cardsphereId": "38024", "mcmId": "13378", "mcmMetaId": "7954", "mtgjsonV4Id": "a1268a72-1505-5a27-8780-a6e0755f6495", "mtgoFoilId": "23573", "mtgoId": "23572", "multiverseId": "83791", "scryfallId": "49967eb9-5020-4f0a-8775-5114f6d96d75", "scryfallIllustrationId": "4b94b922-31d1-4b90-a753-d855a0a4e118", "scryfallOracleId": "01f8db27-1191-488e-b0d5-172821613c15", "tcgplayerProductId": "13275"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{5}{U}{U}", "manaValue": 7.0, "name": "Eye of the Storm", "number": "48", "originalText": "Whenever a player plays an instant or sorcery card, remove it from the game. Then that player copies each instant or sorcery card removed from the game with Eye of the Storm. For each copy, the player may play the copy without paying its mana cost.", "originalType": "Enchantment", "printings": ["PLIST", "RAV"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/cb7fdd335e44096c", "cardKingdomFoil": "https://mtgjson.com/links/f1badf6c1bb02a44", "cardmarket": "https://mtgjson.com/links/be719955b6053f32", "tcgplayer": "https://mtgjson.com/links/2f984645adfb6a98"}, "rarity": "rare", "rulings": [{"date": "2005-10-01", "text": "The ability triggers when a player casts an instant or sorcery *card*. A copy of a card (such as those generated by Eye of the Storm itself) won’t trigger this ability. The card that was cast is exiled and won’t resolve, but the player will get a copy of the spell from Eye of the Storm."}, {"date": "2005-10-01", "text": "When the ability resolves, the player copies all cards exiled with Eye of the Storm, not just the cards they own. That player then chooses which of those copies to cast, if any. All chosen copies are cast in the order the player chooses."}, {"date": "2005-10-01", "text": "The player chooses modes, pays additional costs, chooses targets, and so on for the copies when casting them. Any X in the mana cost of a copy cast this way will be 0. Alternative costs can’t be paid."}, {"date": "2006-01-01", "text": "You must still follow any restrictions on when you can cast the spell, such as “cast only during combat” or “cast only on your own turn.”"}, {"date": "2006-02-01", "text": "When a spell with Replicate is copied by Eye of the Storm, you have the opportunity to pay additional costs, so you may Replicate as much as you like (assuming you have the mana available)."}], "setCode": "RAV", "subtypes": [], "supertypes": [], "text": "Whenever a player casts an instant or sorcery card, exile it. Then that player copies each instant or sorcery card exiled with Eye of the Storm. For each copy, the player may cast the copy without paying its mana cost.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "3d70cd8d-dd52-5ff5-9ede-42571789b7cf"}