{"artist": "Anna Steinbauer", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 1.0, "edhrecRank": 5313, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 545878, "name": "Falkenrath-Gierschlund", "text": "Jede Vampir-Kreaturenkarte, die du besitzt und die nicht im Spiel ist, hat Wahnsinn. Die Wahnsinn-Kosten sind gleich ihren Manakosten. (Falls du eine Karte mit Wahnsinn abwirfst, wirf sie ins Exil ab. Wenn du dies tust, wirke sie für ihre Wahnsinn-Kosten oder lege sie auf deinen Friedhof.)", "type": "Kreatur — Vampir, Berserker"}, {"language": "Spanish", "multiverseId": 545990, "name": "Engullidor de Falkenrath", "text": "Cada carta de criatura Vampiro de la cual eres propietario que no está en el campo de batalla tiene la habilidad de demencia. El coste de demencia es igual a su coste de maná. (Si descartas una carta con la habilidad de demencia, exíliala. Cuando lo hagas, lánzala por su coste de demencia o ponla en tu cementerio.)", "type": "Criatura — Berserker vampiro"}, {"language": "French", "multiverseId": 546102, "name": "Avaleur Falkenrath", "text": "Chaque carte de créature Vampire que vous possédez qui n'est pas sur le champ de bataille a la folie. Le coût de folie est égal à son coût de mana. (Si vous vous défaussez d'une carte avec la folie, défaussez-vous en vers l'exil. Quand vous faites ainsi, lancez-la pour son coût de folie ou mettez-la dans votre cimetière.)", "type": "Créature : vampire et berserker"}, {"language": "Italian", "multiverseId": 546214, "name": "Falkenrath Insaziabile", "text": "Ogni carta creatura Vampiro che possiedi che non è sul campo di battaglia ha follia. Il costo di follia è pari al suo costo di mana. (Se scarti una carta con follia, scartala in esilio. Quando lo fai, lanciala pagando il suo costo di follia o mettila nel tuo cimitero.)", "type": "Creatura — Berserker Vampiro"}, {"language": "Japanese", "multiverseId": 546326, "name": "ファルケンラスの過食者", "text": "あなたがオーナーであり戦場にないすべての吸血鬼・クリーチャー・カードはマッドネスを持つ。それらのマッドネス・コストはマナ・コストに等しい。（あなたがそのカードを捨てるなら、それを追放領域に捨てる。そうしたとき、それをマッドネス・コストで唱えるか、それをあなたの墓地に置く。）", "type": "クリーチャー — 吸血鬼・狂戦士"}, {"language": "Portuguese (Brazil)", "multiverseId": 546438, "name": "Devorador de Falkenrath", "text": "Cada card de criatura Vampiro seu que não esteja no campo de batalha tem loucura. O custo de loucura é igual a seu custo de mana. (Se você descartar um card com loucura, descarte-o para o exílio. Quando fizer isso, conjure-o por seu custo de loucura ou coloque-o em seu cemitério.)", "type": "Criatura — Vampiro Amoque"}, {"language": "Russian", "multiverseId": 546550, "name": "Фалькенратский Пожиратель", "text": "Каждая принадлежащая вам карта существа-Вампира, не находящаяся на поле битвы, имеет Бешенство. Стоимость Бешенства равна ее мана-стоимости. (Если вы сбрасываете карту с Бешенством, сбросьте ее в изгнание. Когда вы это делаете, разыграйте ее за ее стоимость Бешенства или положите на ваше кладбище.)", "type": "Существо — Вампир Берсерк"}, {"language": "Chinese Simplified", "multiverseId": 546662, "name": "伐肯纳暴食客", "text": "每张由你拥有且不在战场上的吸血鬼生物牌都具有疯魔异能。其疯魔费用等同于其法术力费用。（如果你弃掉一张具疯魔异能的牌，将之弃到放逐区。当你如此作时，支付其疯魔费用施放之，否则便将其置入你的坟墓场。）", "type": "生物 ～吸血鬼／狂战士"}, {"language": "Chinese Traditional", "multiverseId": 546774, "name": "伐肯納暴食客", "text": "每張由你擁有且不在戰場上的吸血鬼生物牌都具有瘋魔異能。其瘋魔費用等同於其魔法力費用。（如果你棄掉一張具瘋魔異能的牌，將之棄到放逐區。當你如此作時，支付其瘋魔費用施放之，否則便將其置入你的墳墓場。）", "type": "生物 ～吸血鬼／狂戰士"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "253442", "cardsphereId": "82490", "mcmId": "584126", "mtgjsonV4Id": "aa79eda8-8ccd-5f02-bb4a-2a19567304f5", "multiverseId": "545766", "scryfallId": "6d653a1d-d355-464e-82aa-92028296b7ef", "scryfallIllustrationId": "fd237a0e-9aa6-4290-ba20-e31e24089bee", "scryfallOracleId": "26aba6fa-830f-4a7f-8618-488d8e00215a", "tcgplayerProductId": "254166"}, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{R}", "manaValue": 1.0, "name": "Falkenrath Gorger", "number": "146", "originalText": "Each Vampire creature card you own that isn't on the battlefield has madness. The madness cost is equal to its mana cost. (If you discard a card with madness, discard it into exile. When you do, cast it for its madness cost or put it into your graveyard.)", "originalType": "Creature — Vampire Berserker", "power": "2", "printings": ["PSOI", "SOI", "VOC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/185c9bfda5e74870", "tcgplayer": "https://mtgjson.com/links/688e37be631f28ea"}, "rarity": "rare", "rulings": [{"date": "2016-04-08", "text": "Falkenrath Gorger's ability only applies while it's on the battlefield. If you discard it, it won't give itself madness."}, {"date": "2016-04-08", "text": "If Falkenrath Gorger leaves the battlefield before the madness trigger has resolved for a Vampire card that gained madness with its ability, the madness ability will still let you cast that Vampire card for the appropriate cost even though it no longer has madness."}, {"date": "2016-04-08", "text": "If you discard a Vampire creature card that already has a madness ability, you'll choose which madness ability exiles it. You may choose either the one it normally has or the one it gains from Falkenrath Gorger."}, {"date": "2016-04-08", "text": "Cards are discarded in a Magic game only from a player's hand. Effects that put cards from a player's library into that player's graveyard do not cause those cards to be discarded."}, {"date": "2016-04-08", "text": "A spell cast for its madness cost is put onto the stack like any other spell. It can be countered, copied, and so on. As it resolves, it's put onto the battlefield if it's a permanent card or into its owner's graveyard if it's an instant or sorcery card."}, {"date": "2016-04-08", "text": "Casting a spell for its madness cost doesn't change its mana cost or its mana value. You just pay the madness cost instead."}, {"date": "2016-04-08", "text": "Effects that cause you to pay more or less for a spell will cause you to pay that much more or less for its madness cost, too."}, {"date": "2016-04-08", "text": "Madness works independently of why you're discarding the card. You could discard it to pay a cost, because a spell or ability tells you to, or even because you have too many cards in your hand at the end of your turn. You can't discard a card with madness just because you want to, though."}, {"date": "2016-04-08", "text": "When you cast a card with madness, it was still discarded. If it was discarded to pay a cost, that cost is still paid. Abilities that trigger when a card is discarded will still trigger."}, {"date": "2016-04-08", "text": "If you choose not to cast a card with madness when the madness triggered ability resolves, it's put into your graveyard. You don't get another chance to cast it later."}, {"date": "2016-04-08", "text": "If you discard a card with madness to pay the cost of a spell or activated ability, that card's madness trigger (and the spell that card becomes, if you choose to cast it) will resolve before the spell or ability the discard paid for."}, {"date": "2016-04-08", "text": "If you discard a card with madness while resolving a spell or ability, it moves immediately to exile. Continue resolving that spell or ability—the card is not in your graveyard at this time. Its madness trigger will be placed onto the stack once that spell or ability has completely resolved."}], "securityStamp": "oval", "setCode": "VOC", "subtypes": ["Vampire", "Berserker"], "supertypes": [], "text": "Each Vampire creature card you own that isn't on the battlefield has madness. The madness cost is equal to its mana cost. (If you discard a card with madness, discard it into exile. When you do, cast it for its madness cost or put it into your graveyard.)", "toughness": "1", "type": "Creature — Vampire Berserker", "types": ["Creature"], "uuid": "80372fa9-a5e4-50b0-a46e-3f9b0af2422f"}