{"artist": "Eric Deschamps", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G", "W"], "colors": ["G", "W"], "convertedManaCost": 3.0, "edhrecRank": 7339, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 504125, "name": "Sturz des Emporkömmlings", "text": "(Je eine Sagenmarke beim Ins-Spiel-Kommen und nach deinem Ziehsegment. Opfern nach III.)\nI, II — Lege eine +1/+1-Marke auf bis zu eine Kreatur deiner Wahl.\nIII — Schicke eine Kreatur mit der höchsten Stärke unter den Kreaturen, die ein Gegner deiner Wahl kontrolliert, ins Exil.", "type": "Verzauberung — Sage"}, {"language": "Spanish", "multiverseId": 504426, "name": "Caída del Impostor", "text": "(En cuanto esta Saga entre y después de tu paso de robar, agrega un contador de sabiduría. Sacrifícala después de III.)\nI, II — Pon un contador +1/+1 sobre hasta una criatura objetivo.\nIII — Exilia una criatura con la mayor fuerza entre las criaturas que controla el oponente objetivo.", "type": "Encantamiento — Saga"}, {"language": "French", "multiverseId": 504727, "name": "Chute de l'imposteur", "text": "(Au moment où cette saga arrive sur le champ de bataille et après votre étape de pioche, ajoutez un marqueur « sapience ». Sacrifiez après III.)\nI , II — Mettez un marqueur +1/+1 sur jusqu'à une créature ciblée.\nIII — Exilez une créature avec la force la plus élevée parmi les créatures qu'un adversaire ciblé contrôle.", "type": "Enchantement : saga"}, {"language": "Italian", "multiverseId": 505028, "name": "Caduta dell'Impostore", "text": "(Mentre questa Saga entra e dopo la tua sottofase di acquisizione, aggiungi un segnalino sapere. Sacrifica dopo III.)\nI, II — Scegli fino a una creatura bersaglio. Metti un segnalino +1/+1 su di essa.\nIII — Esilia una creatura con la forza maggiore tra le creature controllate da un avversario bersaglio.", "type": "Incantesimo — Saga"}, {"language": "Japanese", "multiverseId": 505329, "name": "騙し屋の崩落", "text": "（この英雄譚が出た際とあなたのドロー・ステップの後に、伝承カウンターを１個加える。IIIの後に、生け贄に捧げる。）\nI, II ― クリーチャー最大１体を対象とする。それの上に＋１/＋１カウンター１個を置く。\nIII ― 対戦相手１人を対象とする。そのプレイヤーがコントロールしているクリーチャーの中で最大のパワーを持つクリーチャー１体を追放する。", "type": "エンチャント — 英雄譚"}, {"language": "Korean", "multiverseId": 505630, "name": "흉내꾼의 몰락", "text": "(이 서사시가 들어오면서 그리고 당신의 뽑기단 후에, 전승 카운터 한 개를 추가한다. III 이후에 희생한다.)\nI, II — 생물을 최대 한 개까지 목표로 정한다. 그 생물에 +1/+1 카운터 한 개를 올려놓는다.\nIII — 상대를 목표로 정한다. 그 플레이어가 조종하는 생물들 중 가장 높은 공격력을 가진 생물을 추방한다.", "type": "부여마법 — 서사시"}, {"language": "Portuguese (Brazil)", "multiverseId": 505931, "name": "Queda do Impostor", "text": "(Conforme esta Saga entra e após sua etapa de compra, adicione um marcador de conhecimento. Sacrifique-a após III.)\nI , II — Coloque um marcador +1/+1 em até uma criatura alvo.\nIII — Exile uma criatura com o maior poder dentre as criaturas que o oponente alvo controla.", "type": "Encantamento — Saga"}, {"language": "Russian", "multiverseId": 506232, "name": "Падение Самозванца", "text": "(При выходе этой Саги и после вашего шага взятия карты добавьте один жетон знаний. Пожертвуйте после III.)\nI, II — Положите один жетон +1/+1 на не более чем одно целевое существо.\nIII — Изгоните существо с наибольшим значением силы среди существ под контролем целевого оппонента.", "type": "Чары — Сага"}, {"language": "Chinese Simplified", "multiverseId": 506533, "name": "冒名客之死", "text": "（于此传纪进战场时及于你抓牌步骤后，加一个学问指示物。到III后牺牲之。）\nI, II — 在至多一个目标生物上放置一个+1/+1指示物。\nIII — 选择目标对手。放逐一个由他操控的生物，且须为这些生物中力量最大者。", "type": "结界 ～传纪"}, {"language": "Chinese Traditional", "multiverseId": 506834, "name": "冒名客之死", "text": "（於此傳紀進戰場時及於你抽牌步驟後，加一個學問指示物。到III後犧牲之。）\nI, II — 在至多一個目標生物上放置一個+1/+1指示物。\nIII — 選擇目標對手。放逐一個由他操控的生物，且須為這些生物中力量最大者。", "type": "結界 ～傳紀"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "240982", "cardKingdomId": "240522", "cardsphereId": "73475", "mcmId": "530857", "mcmMetaId": "328932", "mtgArenaId": "75255", "mtgjsonV4Id": "8cfbe12f-3c19-5193-8c88-92fb77654247", "mtgoId": "87759", "multiverseId": "503824", "scryfallId": "d7de696a-49c2-421d-a86c-bcffd68870c6", "scryfallIllustrationId": "6eca9b36-6bad-4562-a39e-215931b102a8", "scryfallOracleId": "54deeeef-be90-4975-9213-8355ddf3ce0c", "tcgplayerProductId": "230431"}, "isStorySpotlight": true, "language": "English", "layout": "saga", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}{W}", "manaValue": 3.0, "name": "Fall of the Impostor", "number": "208", "originalText": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI, II — Put a +1/+1 counter on up to one target creature.\nIII — Exile a creature with the greatest power among creatures target opponent controls.", "originalType": "Enchantment — Saga", "printings": ["KHM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ce704e9b9ab98cdc", "cardKingdomFoil": "https://mtgjson.com/links/43989c3e6fa260c2", "cardmarket": "https://mtgjson.com/links/962064a70d8897f4", "tcgplayer": "https://mtgjson.com/links/d89487d937ef656c"}, "rarity": "uncommon", "rebalancedPrintings": ["9c7bb52b-38d8-5d03-8a10-8061470674bb"], "rulings": [{"date": "2021-02-05", "text": "If the target player controls more than one creature tied for the greatest power among creatures that player controls, you choose which one of them is exiled."}, {"date": "2021-02-05", "text": "The greatest power among creatures target opponent controls is determined solely by evaluating the creatures that player controls at that time. You won’t consider creatures controlled by any other player."}, {"date": "2021-02-05", "text": "The chapter III ability doesn’t target any creatures. For example, a creature with protection from white could be exiled this way."}, {"date": "2021-02-05", "text": "As a Saga enters the battlefield, its controller puts a lore counter on it. As your precombat main phase begins (immediately after your draw step), you put another lore counter on each Saga you control. Putting a lore counter on a Saga in either of these ways doesn’t use the stack."}, {"date": "2021-02-05", "text": "Each symbol on the left of a Saga’s text box represents a chapter ability. A chapter ability is a triggered ability that triggers when a lore counter that is put on the Saga causes the number of lore counters on the Saga to become equal to or greater than the ability’s chapter number. Chapter abilities are put onto the stack and may be responded to."}, {"date": "2021-02-05", "text": "A chapter ability doesn’t trigger if a lore counter is put on a Saga that already had a number of lore counters greater than or equal to that chapter’s number. For example, the third lore counter put on a Saga causes the chapter III ability to trigger, but chapters I and II won’t trigger again."}, {"date": "2021-02-05", "text": "Once a chapter ability has triggered, the ability on the stack won’t be affected if the Saga gains or loses counters, or if it leaves the battlefield."}, {"date": "2021-02-05", "text": "If multiple chapter abilities trigger at the same time, their controller puts them on the stack in any order. If any of them require targets, those targets are chosen as you put the abilities on the stack, before any of those abilities resolve."}, {"date": "2021-02-05", "text": "Removing lore counters won’t cause a previous chapter ability to trigger. If lore counters are removed from a Saga, the appropriate chapter abilities will trigger again when the Saga receives more lore counters."}, {"date": "2021-02-05", "text": "Once the number of lore counters on a Saga is greater than or equal to the greatest number among its chapter abilities, the Saga’s controller sacrifices it as soon as its chapter ability has left the stack, most likely by resolving or being countered. This state-based action doesn’t use the stack."}], "setCode": "KHM", "subtypes": ["Saga"], "supertypes": [], "text": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI, II — Put a +1/+1 counter on up to one target creature.\nIII — Exile a creature with the greatest power among creatures target opponent controls.", "type": "Enchantment — Saga", "types": ["Enchantment"], "uuid": "d757bcb3-e373-533f-8baa-054d7d35fb3a"}