{"artist": "Tomasz Jedruszek", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B", "U"], "colors": ["B", "U"], "convertedManaCost": 5.0, "edhrecRank": 1396, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 560167, "name": "Gefallener Shinobi", "text": "Ninjutsu {2}{U}{B} ({2}{U}{B}, bringe einen ungeblockten Angreifer, den du kontrollierst, auf die Hand zurück: Bringe diese Karte aus deiner Hand getappt und angreifend ins Spiel.)\nImmer wenn der Gefallene Shinobi einem Spieler Kampfschaden zufügt, schickt der Spieler die obersten zwei Karten seiner Bibliothek ins Exil. Bis zum Ende des Zuges kannst du die Karten spielen, ohne ihre Manakosten zu bezahlen.", "type": "Kreatur — Zombie, Ninja"}, {"language": "Spanish", "multiverseId": 560424, "name": "Shinobi caída", "text": "Ninjutsu {2}{U}{B}. ({2}{U}{B}, regresar un atacante no bloqueado que controlas a la mano de su propietario: Pon esta carta en el campo de batalla de tu mano girada y atacando.)\nSiempre que la Shinobi caída haga daño de combate a un jugador, ese jugador exilia las dos primeras cartas de su biblioteca. Hasta el final del turno, puedes jugar esas cartas sin pagar sus costes de maná.", "type": "Criatura — Ninja zombie"}, {"language": "French", "multiverseId": 560681, "name": "Shinobi déchu", "text": "Ninjutsu {2}{U}{B} ({2}{U}{B}, renvoyez dans votre main un attaquant non-bloqué que vous contrôlez : Mettez sur le champ de bataille cette carte, engagée et attaquante, depuis votre main.)\nÀ chaque fois que le Shinobi déchu inflige des blessures de combat à un joueur, ce joueur exile les deux cartes du dessus de sa bibliothèque. Jusqu'à la fin du tour, vous pouvez jouer ces cartes sans payer leur coût de mana.", "type": "Créature : zombie et ninja"}, {"language": "Italian", "multiverseId": 560938, "name": "Shinobi Caduto", "text": "Ninjutsu {2}{U}{B} ({2}{U}{B}, Fai tornare in mano al suo proprietario una creatura attaccante non bloccata che controlli: Metti questa carta sul campo di battaglia dalla tua mano TAPpata e attaccante.)\nOgniqualvolta lo Shinobi Caduto infligge danno da combattimento a un giocatore, quel giocatore esilia le prime due carte del suo grimorio. Fino alla fine del turno, puoi giocare quelle carte senza pagare il loro costo di mana.", "type": "Creatura — Ninja Zombie"}, {"language": "Japanese", "multiverseId": 561195, "name": "堕ちた忍び", "text": "忍術{2}{U}{B}（{2}{U}{B}, あなたがコントロールしていてブロックされなかった攻撃クリーチャー１体を手札に戻す：あなたの手札にあるこのカードをタップ状態かつ攻撃している状態で戦場に出す。）\n堕ちた忍びがプレイヤー１人に戦闘ダメージを与えるたび、そのプレイヤーは自分のライブラリーの一番上にあるカード２枚を追放する。ターン終了時まで、あなたはそれらのカードをマナ・コストを支払うことなくプレイしてもよい。", "type": "クリーチャー — ゾンビ・忍者"}, {"language": "Portuguese (Brazil)", "multiverseId": 561452, "name": "Shinobi Caído", "text": "Ninjutsu {2}{U}{B} ({2}{U}{B}, devolva para a mão um atacante que você controla que não tenha sido bloqueado: Coloque este card no campo de batalha de sua mão, virado e atacando.)\nToda vez que Shinobi Caído causa dano de combate a um jogador, aquele jogador exila os dois cards do topo do próprio grimório. Até o final do turno, você pode jogar aqueles cards sem pagar seus custos de mana.", "type": "Criatura — Zumbi Ninja"}, {"language": "Russian", "multiverseId": 561709, "name": "Павший Синоби", "text": "Ниндзюцу {2}{U}{B} ({2}{U}{B}, верните незаблокированного атакующего под вашим контролем в руку: положите эту карту на поле битвы из вашей руки повернутой и атакующей.)\nКаждый раз, когда Павший Синоби наносит боевые повреждения игроку, тот игрок изгоняет две верхние карты своей библиотеки. До конца хода вы можете разыграть те карты без уплаты их мана-стоимости.", "type": "Существо — Зомби Ниндзя"}, {"language": "Chinese Simplified", "multiverseId": 561966, "name": "堕亡忍者", "text": "忍术{2}{U}{B}（{2}{U}{B}，将一个由你操控且未受阻挡的攻击生物回手：将此牌从你手上横置放进战场，且正进行攻击。）\n每当堕亡忍者对任一牌手造成战斗伤害时，该牌手放逐其牌库顶的两张牌。直到回合结束，你可以使用这些牌，且不需支付其法术力费用。", "type": "生物 ～灵俑／忍者"}, {"language": "Chinese Traditional", "multiverseId": 562223, "name": "墮亡忍者", "text": "忍術{2}{U}{B}（{2}{U}{B}，將一個由你操控且未受阻擋的攻擊生物回手：將此牌從你手上橫置放進戰場，且正進行攻擊。）\n每當墮亡忍者對任一玩家造成戰鬥傷害時，該玩家放逐其牌庫頂的兩張牌。直到回合結束，你可以使用這些牌，且不需支付其魔法力費用。", "type": "生物 ～殭屍／忍者"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "259611", "cardsphereId": "87436", "mcmId": "652922", "mtgjsonV4Id": "4ca99e66-237e-5b48-b3cc-3e415bb34cb6", "multiverseId": "559910", "scryfallId": "ed9110d1-508f-4c87-a49e-6ec00039d924", "scryfallIllustrationId": "31c74ea1-86d8-425e-8135-c3143d2db1f2", "scryfallOracleId": "4fc5f871-a809-4a4a-adfb-eb4cd52837c8", "tcgplayerProductId": "269766"}, "isReprint": true, "keywords": ["Ninjutsu"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}{B}", "manaValue": 5.0, "name": "Fallen Shinobi", "number": "338", "originalText": "Ninjutsu {2}{U}{B} ({2}{U}{B}, Return an unblocked attacker you control to hand: Put this card onto the battlefield from your hand tapped and attacking.)\nWhenever Fallen Shinobi deals combat damage to a player, that player exiles the top two cards of their library. Until end of turn, you may play those cards without paying their mana costs.", "originalType": "Creature — Zombie Ninja", "power": "5", "printings": ["MH1", "NCC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/3ae823cec0fc6343", "tcgplayer": "https://mtgjson.com/links/b0dc69f43b3ce44a"}, "rarity": "rare", "rulings": [{"date": "2019-06-14", "text": "Fallen Shinobi's triggered ability doesn't change when you can play the exiled cards. For example, if a sorcery card is exiled, you can cast it only during your main phase when the stack is empty. If a land card is exiled, you can play it only during your main phase and only if you have an available land play remaining."}, {"date": "2019-06-14", "text": "Casting an exiled card causes it to leave exile. You can't cast it multiple times."}, {"date": "2019-06-14", "text": "Any cards you don't cast will remain in exile."}, {"date": "2019-06-14", "text": "The ninjutsu ability can be activated only after blockers have been declared. Before then, attacking creatures are neither blocked nor unblocked."}, {"date": "2019-06-14", "text": "As you activate a ninjutsu ability, you reveal the Ninja card in your hand and return the attacking creature. The Ninja isn't put onto the battlefield until the ability resolves. If it leaves your hand before then, it won't enter the battlefield at all."}, {"date": "2019-06-14", "text": "The creature with ninjutsu enters the battlefield attacking the same player or planeswalker that the returned creature was attacking. This is a rule specific to ninjutsu; in other cases, when a creature is put onto the battlefield attacking, that creature's controller chooses which player or planeswalker it's attacking."}, {"date": "2019-06-14", "text": "Although the Ninja is attacking, it was never declared as an attacking creature (for purposes of abilities that trigger whenever a creature attacks, for example)."}, {"date": "2019-06-14", "text": "The ninjutsu ability can be activated during the declare blockers step, combat damage step, or end of combat step. If you wait until after the declare blockers step, because all combat damage is dealt at once, the Ninja won't normally deal combat damage."}, {"date": "2019-06-14", "text": "If a creature in combat has first strike or double strike, you can activate the ninjutsu ability during the first-strike combat damage step. The Ninja will deal combat damage during the regular combat damage step, even if it has first strike."}], "securityStamp": "oval", "setCode": "NCC", "subtypes": ["Zombie", "Ninja"], "supertypes": [], "text": "Ninjutsu {2}{U}{B} ({2}{U}{B}, Return an unblocked attacker you control to hand: Put this card onto the battlefield from your hand tapped and attacking.)\nWhenever Fallen Shinobi deals combat damage to a player, that player exiles the top two cards of their library. Until end of turn, you may play those cards without paying their mana costs.", "toughness": "4", "type": "Creature — Zombie Ninja", "types": ["Creature"], "uuid": "b146532d-4f30-5933-8084-3cd93ef7f6ea"}