{"artist": "Anthony S. Waters", "availability": ["mtgo"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 19726, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "69455437-d5bf-50ef-9f40-6a0c4b0e1cf5", "mtgoFoilId": "30339", "mtgoId": "30338", "multiverseId": "184643", "scryfallId": "cd5182d9-fc52-4309-a622-41c0b5ae58b8", "scryfallIllustrationId": "2d0da177-592f-4802-a6b3-613e3460521e", "scryfallOracleId": "ffae3ff4-67f7-4e41-b166-c63f88c7aa08"}, "isOnlineOnly": true, "isReprint": true, "keywords": ["Enchant"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}", "manaValue": 3.0, "name": "Farrel's Mantle", "number": "13", "originalText": "Enchant creature\nWhenever enchanted creature attacks and isn't blocked, its controller may have it deal damage equal to its power plus 2 to target creature. If that player does, the attacking creature deals no combat damage this turn.", "originalType": "Enchantment - Aura", "printings": ["FEM", "ME2"], "purchaseUrls": {}, "rarity": "uncommon", "rulings": [{"date": "2004-10-04", "text": "If you put this on your opponent’s creature, they decide whether or not to make their creature deal no damage to you."}, {"date": "2008-10-01", "text": "This ability resolves during the declare blockers step. If the damage dealt this way is enough to destroy an attacking or blocking creature, that other creature won’t be around to deal its combat damage."}, {"date": "2008-10-01", "text": "If the same creature is enchanted with more than one Farrel’s Mantle, they’ll each trigger if that creature attacks and isn’t blocked. The creature’s controller may have it deal damage multiple times. As long as the enchanted creature’s controller chooses to use Farrel’s Mantle’s ability at least once to deal damage, the enchanted creature will deal no combat damage."}, {"date": "2008-10-01", "text": "If the enchanted creature’s controller chooses to have it deal no combat damage, that combat damage is not prevented. It’s simply not dealt. A creature whose damage can’t be prevented (such as Excruciator) would deal no combat damage this way."}, {"date": "2011-01-25", "text": "The enchanted creature’s controller cannot choose to have the enchanted creature deal damage to itself. If there are no other creatures on the battlefield, then a legal target cannot be chosen so the ability does nothing."}, {"date": "2013-04-15", "text": "An ability that triggers when something “attacks and isn’t blocked” triggers in the declare blockers step after blockers are declared if (1) that creature is attacking and (2) no creatures are declared to block it. It will trigger even if that creature was put onto the battlefield attacking rather than having been declared as an attacker in the declare attackers step."}], "setCode": "ME2", "subtypes": ["Aura"], "supertypes": [], "text": "Enchant creature\nWhenever enchanted creature attacks and isn't blocked, its controller may have it deal damage equal to its power plus 2 to another target creature. If that player does, the attacking creature assigns no combat damage this turn.", "type": "Enchantment — Aura", "types": ["Enchantment"], "uuid": "95fb3310-6ed1-54ac-b23f-23e9eecdf5b2"}