{"artist": "Borja Pindado", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 8649, "finishes": ["nonfoil", "foil"], "flavorText": "\"Hello, my fluttering friends! Isn't it a beautiful day?\"", "foreignData": [{"flavorText": "„Hallo, meine flatternden Freunde! Ist heute nicht ein schöner Tag?\"", "language": "German", "multiverseId": 563312, "name": "Feywild-Behüter", "text": "Wenn der Feywild-Behüter ins Spiel kommt, übernimmst du die Initiative.\nZu Beginn deines Endsegments und falls du die Initiative hast, erzeuge einen 1/1 blauen Feenwesen-Drache-Kreaturenspielstein mit Flugfähigkeit.", "type": "Kreatur — Ork, Zauberer"}, {"flavorText": "\"¡Hola, amiguitos alados! ¿No es un día precioso?\".", "language": "Spanish", "multiverseId": 563672, "name": "Cuidador de los Parajes Feéricos", "text": "Cuando el Cuidador de los Parajes Feéricos entre al campo de batalla, tomas la iniciativa.\nAl comienzo de tu paso final, si tienes la iniciativa, crea una ficha de criatura Dragón Hada azul 1/1 con la habilidad de volar.", "type": "Criatura — Hechicero orco"}, {"flavorText": "« Bonjour, mes petits amis papillonnants ! N'est-ce pas une magnifique journée ? »", "language": "French", "multiverseId": 564032, "name": "Pourvoyeur de la Féerie sauvage", "text": "Quand le Pourvoyeur de la Féerie sauvage arrive sur le champ de bataille, vous prenez l'initiative.\nAu début de votre étape de fin, si vous détenez l'initiative, créez un jeton de créature 1/1 bleue Peuple fée et Dragon avec le vol.", "type": "Créature : orque et sorcier"}, {"flavorText": "\"Salve, miei svolazzanti amici! Non trovate anche voi che sia una bella giornata?\"", "language": "Italian", "multiverseId": 564392, "name": "Custode della Selva Fatata", "text": "Quando il Custode della Selva Fatata entra nel campo di battaglia, prendi l'iniziativa.\nAll'inizio della tua sottofase finale, se hai l'iniziativa, crea una pedina creatura Drago Fatato 1/1 blu con volare.", "type": "Creatura — Mago Orco"}, {"flavorText": "「やぁ、身軽な友よ！いい日和じゃないか？」", "language": "Japanese", "multiverseId": 564752, "name": "フェイワイルドの世話人", "text": "フェイワイルドの世話人が戦場に出たとき、あなたはイニシアチブを得る。\nあなたの終了ステップの開始時に、あなたにイニシアチブがある場合、飛行を持つ青の１/１のフェアリー・ドラゴン・クリーチャー・トークン１体を生成する。", "type": "クリーチャー — オーク・ウィザード"}, {"flavorText": "\"안녕, 내 파닥거리는 친구들아! 참 아름다운 날 아니니?\"", "language": "Korean", "multiverseId": 565112, "name": "페이와일드 관리인", "text": "페이와일드 관리인이 전장에 들어올 때, 당신이 이니셔티브를 차지한다.\n당신의 종료단 시작에, 당신에게 이니셔티브가 있다면, 비행을 가진 1/1 청색 페어리 용 생물 토큰 한 개를 만든다.", "type": "생물 — 오크 마법사"}, {"flavorText": "\"Oi, meus amiguinhos alados! Não é um lindo dia?\"", "language": "Portuguese (Brazil)", "multiverseId": 565472, "name": "Custódio de Faéria", "text": "Quando Custódio de Faéria entra no campo de batalha, você assume a dianteira.\nNo início de sua etapa final, se você estiver na dianteira, crie uma ficha de criatura Fada Dragão azul 1/1 com voar.", "type": "Criatura — Orc Mago"}, {"flavorText": "«Привет, мои порхающие друзья! Чудесный сегодня день, не так ли?»", "language": "Russian", "multiverseId": 565832, "name": "Смотритель из Страны Фей", "text": "Когда Смотритель из Страны Фей выходит на поле битвы, вы получаете инициативу.\nВ начале вашего заключительного шага, если у вас есть инициатива, создайте одну фишку существа 1/1 синяя Фея Дракон с Полетом.", "type": "Существо — Орк Чародей"}, {"flavorText": "「你好呀，飞翔的小朋友们！今天的天气可真好！」", "language": "Chinese Simplified", "multiverseId": 566192, "name": "妖精荒野照护人", "text": "当妖精荒野照护人进战场时，你掌握先制。\n在你的结束步骤开始时，若你握有先制，则派出一个1/1蓝色，具飞行异能的仙灵／龙衍生生物。", "type": "生物 ～半兽人／法术师"}, {"flavorText": "「你好呀，飛翔的小朋友們！今天的天氣可真好！」", "language": "Chinese Traditional", "multiverseId": 566552, "name": "妖精荒野照護人", "text": "當妖精荒野照護人進戰場時，你掌握先制。\n在你的結束步驟開始時，若你握有先制，則派出一個1/1藍色，具飛行異能的仙靈／龍衍生生物。", "type": "生物 ～半獸人／魔法師"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "261651", "cardKingdomId": "261258", "cardsphereId": "89173", "mcmId": "660857", "mcmMetaId": "408679", "mtgjsonV4Id": "e6c8d883-5f7d-5ed6-bed7-8e9a731d5354", "mtgoId": "100136", "multiverseId": "562952", "scryfallId": "c959ab97-0727-4589-bfd9-d78dd8ebd86b", "scryfallIllustrationId": "6af5aeb2-7bcb-40da-ac62-a6fbc6335bbf", "scryfallOracleId": "f319b671-0388-48e8-ba98-04161a3e7f1a", "tcgplayerProductId": "273351"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "paupercommander": "Restricted", "vintage": "Legal"}, "manaCost": "{4}{U}", "manaValue": 5.0, "name": "Feywild Caretaker", "number": "69", "originalText": "When Feywild Caretaker enters the battlefield, you take the initiative.\nAt the beginning of your end step, if you have the initiative, create a 1/1 blue Faerie Dragon creature token with flying.", "originalType": "Creature — Orc Wizard", "power": "3", "printings": ["CLB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/724aa2c8b2c26cdd", "cardKingdomFoil": "https://mtgjson.com/links/f164fcde4e79277d", "cardmarket": "https://mtgjson.com/links/48fd02347cb4da8a", "tcgplayer": "https://mtgjson.com/links/48fc19dbdfc2b402"}, "rarity": "uncommon", "rulings": [{"date": "2022-06-10", "text": "The initiative is a designation a player can have. A player with the initiative designation is said to “have the initiative.” The initiative carries two inherent rules. First, whenever a player takes the initiative, and at the beginning of the upkeep of the player with the initiative, that player ventures into Undercity. Second, whenever one or more creatures a player controls deal combat damage to the player who has the initiative, the first player takes the initiative. Also, some abilities will refer to having the initiative and provide other benefits."}, {"date": "2022-06-10", "text": "There is no initiative in a game until an effect instructs a player to take the initiative. Once a player is instructed to do this, they have the initiative until another player takes the initiative."}, {"date": "2022-06-10", "text": "Only one player can have the initiative at a time. As one player takes the initiative, any other player that had the initiative ceases to have it."}, {"date": "2022-06-10", "text": "A player who currently has the initiative may take the initiative again. This causes that player to venture into Undercity again, but does not cause them to have multiple initiative designations."}, {"date": "2022-06-10", "text": "If the player with the initiative leaves the game, the active player takes the initiative at the same time that player leaves the game. If the active player is leaving the game or if there is no active player, the next player in turn order takes the initiative."}, {"date": "2022-06-10", "text": "In a Two-Headed Giant game, if both players on a team deal combat damage to the player that has the initiative at the same time, the player with the initiative will choose the order of the triggered abilities. Then, as those abilities resolve, one team member takes the initiative (and ventures into Undercity) and then the other team member does the same. The last player to take the initiative keeps it until the initiative changes again."}, {"date": "2022-06-10", "text": "You cannot venture into Undercity unless instructed to do so, either because you have the initiative at the beginning of your upkeep or because you take the initiative. Notably, if you aren’t in a dungeon and an effect instructs you to venture into the dungeon (not venture into Undercity), you can’t start Undercity."}, {"date": "2022-06-10", "text": "Similarly, when instructed to venture into Undercity, you can’t start a dungeon that isn’t Undercity."}, {"date": "2022-06-10", "text": "If you aren’t in a dungeon when instructed to venture into Undercity, you will put Undercity into the command zone and move your venture marker to Secret Entrance (the first room)."}, {"date": "2022-06-10", "text": "If you’re already in a dungeon when instructed to venture into Undercity, you move to the next room of that dungeon. If you are already in the last room, you will complete that dungeon and start Undercity. This is true whether you’re already in Undercity or any other dungeon."}], "setCode": "CLB", "subtypes": ["Orc", "Wizard"], "supertypes": [], "text": "When Feywild Caretaker enters the battlefield, you take the initiative.\nAt the beginning of your end step, if you have the initiative, create a 1/1 blue Faerie Dragon creature token with flying.", "toughness": "4", "type": "Creature — Orc Wizard", "types": ["Creature"], "uuid": "b0ef51a7-cf1c-5f4c-b123-df445679cf4a"}