{"artist": "Scott M. Fischer", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R", "W"], "colors": ["R", "W"], "convertedManaCost": 1.0, "edhrecRank": 8768, "finishes": ["foil"], "foreignData": [], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": false, "identifiers": {"mtgjsonV4Id": "4516222f-fa25-5036-b3e2-cccb9e8677df", "mtgoId": "32545", "scryfallId": "8be40ad7-21e4-4a04-a72b-891f386c8230", "scryfallIllustrationId": "ffbf0e5f-d4ed-41a7-b1d5-f53f42cd2dd3", "scryfallOracleId": "cd51cc2d-0d39-4aba-b0ea-70e8118149bc"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{R/W}", "manaValue": 1.0, "name": "Figure of Destiny", "number": "32545", "originalReleaseDate": "2010-11-04", "power": "1", "printings": ["2X2", "DDL", "EVE", "MMA", "PD2", "PEVE", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2008-08-01", "text": "None of these abilities has a duration. If one of them resolves, it will remain in effect until the game ends, Figure of Destiny leaves the battlefield, or some subsequent effect changes its characteristics, whichever comes first."}, {"date": "2008-08-01", "text": "Figure of Destiny’s abilities overwrite its power, toughness, and creature types. Typically, those abilities are activated in the order they appear on the card. However, if Figure of Destiny is an 8/8 Kithkin Spirit Warrior Avatar with flying and first strike, and you activate its first ability, it will become a 2/2 Kithkin Spirit that still has flying and first strike."}, {"date": "2008-08-01", "text": "You can activate Figure of Destiny’s second and third abilities regardless of what creature types it is. Each of those abilities checks Figure of Destiny’s creature types when that ability resolves. If Figure of Destiny isn’t the appropriate creature type at that time, the ability does nothing."}, {"date": "2008-08-01", "text": "Figure of Destiny’s second ability checks whether it’s a Spirit, and its third ability checks whether it’s a Warrior. It doesn’t matter how it became the appropriate creature type."}, {"date": "2009-10-01", "text": "The effect from the ability overwrites other effects that set power and/or toughness if and only if those effects existed before the ability resolved. It will not overwrite effects that modify power or toughness (whether from a static ability, counters, or a resolved spell or ability), nor will it overwrite effects that set power and toughness which come into existence after the ability resolves. Effects that switch the creature’s power and toughness are always applied after any other power or toughness changing effects, including this one, regardless of the order in which they are created."}], "setCode": "PRM", "subtypes": ["Kithkin"], "supertypes": [], "text": "{R/W}: Figure of Destiny becomes a Kithkin Spirit with base power and toughness 2/2.\n{R/W}{R/W}{R/W}: If Figure of Destiny is a Spirit, it becomes a Kithkin Spirit Warrior with base power and toughness 4/4.\n{R/W}{R/W}{R/W}{R/W}{R/W}{R/W}: If Figure of Destiny is a Warrior, it becomes a Kithkin Spirit Warrior Avatar with base power and toughness 8/8, flying, and first strike.", "toughness": "1", "type": "Creature — Kithkin", "types": ["Creature"], "uuid": "9a242bf9-1de4-516e-b5d7-df77cc829a12"}