{"artist": "Jaime Jones", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 3223, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 461318, "name": "Finale der Verheißung", "text": "Du kannst bis zu eine Spontanzauberkarte deiner Wahl und/oder bis zu eine Hexereikarte deiner Wahl, deren umgewandelte Manakosten jeweils X oder weniger betragen, aus deinem Friedhof wirken, ohne ihre Manakosten zu bezahlen. Falls eine Karte, die auf diese Weise gewirkt wurde, in diesem Zug auf deinen Friedhof gelegt würde, schicke sie stattdessen ins Exil. Falls X gleich 10 oder mehr ist, kopiere jeden der Zaubersprüche zweimal. Du kannst neue Ziele für die Kopien bestimmen.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 461582, "name": "Final de promesa", "text": "Puedes lanzar hasta una carta de instantáneo objetivo y/o hasta una carta de conjuro objetivo desde tu cementerio, cada una con coste de maná convertido de X o menos, sin pagar sus costes de maná. Si una carta lanzada de esta manera fuera a ir a tu cementerio este turno, en vez de eso, exíliala. Si X es 10 o más, copia cada uno de esos hechizos dos veces. Puedes elegir nuevos objetivos para las copias.", "type": "Conjuro"}, {"language": "French", "multiverseId": 461846, "name": "Summum de la promesse", "text": "Vous pouvez lancer jusqu'à une carte d'éphémère ciblée et/ou jusqu'à une carte de rituel ciblée chacune avec un coût converti de mana inférieur ou égal à X depuis votre cimetière sans payer leur coût de mana. Si une carte lancée de cette manière devait être mise dans votre cimetière ce tour-ci, exilez-la à la place. Si X est supérieur ou égal à 10, copiez chacun de ces sorts deux fois. Vous pouvez choisir de nouvelles cibles pour ces copies.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 462110, "name": "Finale di Promessa", "text": "Puoi lanciare fino a una carta istantaneo bersaglio e/o fino a una carta stregoneria bersaglio dal tuo cimitero, ognuna con costo di mana convertito pari o inferiore a X, senza pagare i loro costi di mana. Se una carta lanciata in questo modo sta per essere messa nel tuo cimitero in questo turno, invece esiliala. Se X è pari o superiore a 10, copia ciascuna di quelle magie due volte. Puoi scegliere nuovi bersagli per le copie.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 462374, "name": "約束の終焉", "text": "あなたはあなたの墓地から、点数で見たマナ・コストがそれぞれＸ以下である、インスタント・カード最大１枚とソーサリー・カード最大１枚を対象とし、それらをそのマナ・コストを支払うことなく唱えてもよい。このターン、これにより唱えたカードがあなたの墓地に置かれるなら、代わりにそれを追放する。Ｘが10以上なら、それらの呪文をそれぞれ２回コピーする。あなたはそれらのコピーの新しい対象を選んでもよい。", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 462638, "name": "약속의 대단원", "text": "당신의 무덤에서 전환마나비용이 각각 X 이하인 순간마법 카드 최대 한 개 및/또는 집중마법 카드 최대 한 개를 목표로 정한다. 당신은 그 카드들을 마나 비용을 지불하지 않고 발동할 수 있다. 이런 식으로 발동한 카드가 이 턴에 당신의 무덤에 들어가려고 하면, 대신에 그 카드를 추방한다. X가 10 이상이라면, 그 주문들을 각각 두 번 복사한다. 당신은 그 복사본들의 목표를 새로 정할 수 있다.", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 462902, "name": "Final de Promessa", "text": "Você pode conjurar até um card de mágica instantânea alvo e/ou até um card de feitiço alvo de seu cemitério, cada um com custo de mana convertido igual ou inferior a X, sem pagar seus custos de mana. Se um card conjurado dessa maneira seria colocado em seu cemitério neste turno, em vez disso, exile-o. Se X for igual ou superior a 10, copie cada uma daquelas mágicas duas vezes. Você pode escolher novos alvos para as cópias.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 463166, "name": "Апофеоз Завета", "text": "Вы можете разыграть из вашего кладбища без уплаты их мана-стоимости не более одной целевой карты мгновенного заклинания и (или) не более одной целевой карты волшебства, конвертированная мана-стоимость каждой из которых не превышает X. Если разыгранная таким образом карта должна быть положена на ваше кладбище в этом ходу, изгоните ее вместо этого. Если X равен 10 или больше, скопируйте каждое из тех заклинаний дважды. Вы можете выбрать новые цели для тех копий.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 463430, "name": "允诺终时", "text": "选择目标在你坟墓场中的至多一张瞬间牌和／或至多一张法术牌，且两者的总法术力费用均须等于或小于X。你可以从该处施放这些牌，且不需支付其法术力费用。如果以此法施放的牌于本回合中将置入你的坟墓场，则改为将其放逐。如果X等于或大于10，则将这些咒语各复制两次。你可以为每个复制品选择新的目标。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 463694, "name": "允諾終時", "text": "選擇目標在你墳墓場中的至多一張瞬間牌和／或至多一張巫術牌，且兩者的總魔法力費用均須等於或小於X。你可以從該處施放這些牌，且不需支付其魔法力費用。如果以此法施放的牌於本回合中將置入你的墳墓場，則改為將其放逐。如果X等於或大於10，則將這些咒語各複製兩次。你可以為每個複製品選擇新的目標。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "224530", "cardKingdomId": "224231", "cardsphereId": "59208", "mcmId": "372191", "mcmMetaId": "269533", "mtgArenaId": "69578", "mtgjsonV4Id": "2fac29a7-49f6-5403-a86d-feeb1dd1dc37", "mtgoId": "71860", "multiverseId": "461054", "scryfallId": "811b2dda-e1b7-4a46-83cc-5cdc17554836", "scryfallIllustrationId": "d50de204-339e-45aa-aa45-09f21c243fc3", "scryfallOracleId": "d6fafb50-9531-4fbf-bb1e-ebb4dd39281c", "tcgplayerProductId": "188509"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{X}{R}{R}", "manaValue": 2.0, "name": "Finale of Promise", "number": "127", "originalText": "You may cast up to one target instant card and/or up to one target sorcery card from your graveyard each with converted mana cost X or less without paying their mana costs. If a card cast this way would be put into your graveyard this turn, exile it instead. If X is 10 or more, copy each of those spells twice. You may choose new targets for the copies.", "originalType": "Sorcery", "printings": ["PWAR", "WAR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/5364dfc05bc4d29d", "cardKingdomFoil": "https://mtgjson.com/links/3f70ecedc0b6000a", "cardmarket": "https://mtgjson.com/links/2be48a4dca1fc0e4", "tcgplayer": "https://mtgjson.com/links/0e87742a18a4f7fb"}, "rarity": "mythic", "rulings": [{"date": "2019-05-03", "text": "As Finale of Promise resolves, first you cast the target instant card and/or the target sorcery card in either order. Then, if X is 10 or more, you copy each of those twice and put the copies on the stack in any order. The copies will resolve before the original spells."}, {"date": "2019-05-03", "text": "A split card that’s an instant and a sorcery card may be the target of Finale of Promise twice. However, once you cast that card once, it can’t be cast a second time."}, {"date": "2019-05-03", "text": "If a spell has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2019-05-03", "text": "If you cast a card “without paying its mana cost,” you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, such as that of Spark Harvest, you must pay those to cast the card."}, {"date": "2019-05-03", "text": "If the spell that’s copied is modal (that is, it says “Choose one—” or the like), the copies will have the same mode or modes. You can’t choose different ones."}, {"date": "2019-05-03", "text": "If the spell has damage divided as it was cast, the division can’t be changed (although the targets receiving that damage still can). The same is true of spells that distribute counters."}, {"date": "2019-05-03", "text": "You can’t choose to pay any additional costs for the copies. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too."}, {"date": "2019-05-03", "text": "The copies that Finale of Promise creates are created on the stack, so they’re not “cast.” Abilities that trigger when a player casts a spell won’t trigger."}], "securityStamp": "oval", "setCode": "WAR", "subtypes": [], "supertypes": [], "text": "You may cast up to one target instant card and/or up to one target sorcery card from your graveyard each with mana value X or less without paying their mana costs. If a spell cast this way would be put into your graveyard, exile it instead. If X is 10 or more, copy each of those spells twice. You may choose new targets for the copies.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "6f6fdec6-cbe0-594b-bd8f-582ff3a14aa5"}