{"artist": "Joseph Weston", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 6.0, "edhrecRank": 6926, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "262374", "cardsphereId": "88251", "mcmId": "662174", "mtgjsonV4Id": "d60447c6-da6d-5d29-be75-0540bec7725b", "scryfallId": "5d732069-5c97-4bd3-a290-e7bd44fbacb1", "scryfallIllustrationId": "32fa1368-bd4b-4818-9209-2fc4f73d0a5e", "scryfallOracleId": "5bf88cac-5997-4254-8349-2473de854c50", "tcgplayerProductId": "274486"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Enthralling Performance"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{R}{R}", "manaValue": 6.0, "name": "Firbolg Flutist", "number": "174s", "power": "4", "printings": ["CLB", "PCLB"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/2c0c55e841cf8195", "tcgplayer": "https://mtgjson.com/links/2ff9f65dc03b123a"}, "rarity": "rare", "rulings": [{"date": "2022-06-10", "text": "Firbolg Flutist's triggered ability can target any creature you don't control, even one that is untapped."}, {"date": "2022-06-10", "text": "Gaining control of a creature doesn't cause you to gain control of any Auras or Equipment attached to it."}, {"date": "2022-06-10", "text": "The term “defending player” in the myriad rules (or any other ability of an attacking creature) refers to the player the creature with myriad was attacking or the controller of the planeswalker it was attacking at the time the ability resolves. If that creature is no longer attacking, it refers to the player it was last attacking or the controller of the planeswalker it was last attacking."}, {"date": "2022-06-10", "text": "If the defending player is your only opponent, no tokens are put onto the battlefield."}, {"date": "2022-06-10", "text": "You choose whether each token is attacking the player or a planeswalker they control as the token is created. If it’s attacking a planeswalker, you choose which one."}, {"date": "2022-06-10", "text": "Although the tokens enter the battlefield attacking, they were never declared as attackers. Abilities that trigger whenever a creature attacks won’t trigger, including the myriad ability of the tokens. If there are any costs to have a creature attack, those costs won’t apply to the tokens."}, {"date": "2022-06-10", "text": "The tokens all enter the battlefield at the same time."}, {"date": "2022-06-10", "text": "Each token copies exactly what was printed on the original creature and nothing else. It doesn’t copy whether that creature is tapped or untapped, whether it has any counters on it or Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, and so on."}, {"date": "2022-06-10", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when the tokens enter the battlefield. Any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities of the copied creature will also work."}, {"date": "2022-06-10", "text": "If myriad creates more than one token for any given player (due to an effect such as the one Doubling Season creates), you may choose separately for each token whether it’s attacking the player or a planeswalker they control."}, {"date": "2022-06-10", "text": "If a token created with the myriad ability phases out before the next end step, the delayed triggered ability will still trigger at the beginning of the next end step after it phases in again. However, if it phases out with that triggered ability on the stack, it won't be exiled, and the delayed triggered ability won't trigger again during future end steps."}], "securityStamp": "oval", "setCode": "PCLB", "subtypes": ["Giant", "Bard"], "supertypes": [], "text": "Enthralling Performance — When Firbolg Flutist enters the battlefield, gain control of target creature you don't control until end of turn. Untap it. It gains haste and myriad until end of turn. (Whenever it attacks, for each opponent other than defending player, you may create a token that's a copy of that creature that's tapped and attacking that player or a planeswalker they control. Exile the tokens at end of combat.)", "toughness": "4", "type": "Creature — Giant Bard", "types": ["Creature"], "uuid": "2a43ebae-8592-5c25-ab66-e2a80c9c06f1"}