{"artist": "Stanton Feng", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 5517, "finishes": ["foil"], "flavorText": "\"Just tell us how many you want and get out of the way.\"", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "228131", "cardsphereId": "62442", "mcmId": "403464", "mtgjsonV4Id": "c38990ec-d405-5823-8469-b9408c55843f", "scryfallId": "b939b0c9-794c-4190-84db-dac325dce8da", "scryfallIllustrationId": "0b48e863-a302-4bc7-9740-4be5791f2117", "scryfallOracleId": "27e27681-9221-4e64-8c78-e153a86bc6e0", "tcgplayerProductId": "199905"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}", "manaValue": 4.0, "name": "Fires of Invention", "number": "125s", "printings": ["ELD", "PELD"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/3b0ffbb74663c9d5", "tcgplayer": "https://mtgjson.com/links/a8386e6b5aecedde"}, "rarity": "rare", "rulings": [{"date": "2019-10-04", "text": "If a spell has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2019-10-04", "text": "If an effect allows or instructs you to cast a spell during another player's turn, you can't do so. The restriction of Fires of Invention takes precedence over that permission. Similarly, if an effect allows or instructs you to cast a third spell during your turn, you can't do so."}, {"date": "2019-10-04", "text": "Fires of Invention doesn't impose any restrictions on playing lands or activating abilities."}, {"date": "2019-10-04", "text": "Fires of Invention will look at the entire turn to see if you've cast two spells yet that turn, even if Fires of Invention wasn't on the battlefield when those spells were cast. Notably, you can't cast Fires of Invention and then cast two more spells that turn; if Fires of Invention was your second (or third, or fourth) spell that turn, you can't cast another spell at all."}, {"date": "2019-10-04", "text": "If you cast a spell that was countered, it still counts as one of your two spells."}, {"date": "2019-10-04", "text": "You may choose to pay the mana cost or an alternative cost for spells you cast, even if their mana value is less than or equal to the number of lands you control."}, {"date": "2019-10-04", "text": "If you cast a card “without paying its mana cost,” you can't choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs (such as that of Fling), you must pay those to cast the card."}, {"date": "2019-10-04", "text": "If an effect says that you may cast a card that you couldn't otherwise cast if you pay an alternative cost (such as the flashback keyword), you have to pay that alternative cost if you use that permission to cast the card. You can't choose to cast it but cast it without paying its mana cost."}, {"date": "2019-10-04", "text": "If you cast one card twice during a turn (such as by casting it as an Adventure and then casting it from exile as a creature), you've cast two spells."}], "securityStamp": "oval", "setCode": "PELD", "subtypes": [], "supertypes": [], "text": "You can cast spells only during your turn and you can cast no more than two spells each turn.\nYou may cast spells with mana value less than or equal to the number of lands you control without paying their mana costs.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "b0466895-5595-5b87-b13b-8b162b535ea0", "variations": ["550a3a55-00d6-57b1-a904-8041e0bcadc6"]}