{"artist": "Ryan Yee", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 5.0, "edhrecRank": 5227, "finishes": ["foil"], "flavorText": "\"Elemental fire shimmers with rose hues and, unlike terrestrial blazes, smolders long after it's extinguished.\"\n—Jestus Dreya, *Of Elements and Eternity*", "foreignData": [], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "132572", "cardsphereId": "36905", "mcmId": "244227", "mtgjsonV4Id": "3a056220-4543-530a-b75e-5766fffc7ef6", "mtgoFoilId": "39261", "mtgoId": "39260", "multiverseId": "234702", "scryfallId": "0a5c7bb2-37ef-4f99-a447-0c6e4d18fd5c", "scryfallIllustrationId": "6132b309-8ef7-40f7-9c29-b1c5f526e032", "scryfallOracleId": "dbf64afa-ace6-44b9-b47f-750c7e52cc29", "tcgplayerProductId": "38669"}, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}{R}", "manaValue": 5.0, "name": "Fire Servant", "number": "15", "originalText": "If a red instant or sorcery spell you control would deal damage, it deals double that damage instead.", "originalType": "Creature — Elemental", "power": "4", "printings": ["M11", "PD2"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/c2970518f4fe87d2", "tcgplayer": "https://mtgjson.com/links/942b310c40f89a01"}, "rarity": "uncommon", "rulings": [{"date": "2010-08-15", "text": "Fire Servant’s ability applies no matter who or what the damage would be dealt to: a creature, a player, or a planeswalker."}, {"date": "2010-08-15", "text": "If a red instant or sorcery spell you control causes damage to be dealt, that spell will always identify the source of the damage. In most cases, the source is the spell itself. For example, Lightning Bolt says “Lightning Bolt deals 3 damage to any target.” Such a spell is affected by Fire Servant’s ability. If the source of the damage is something else (for example, if the spell is Soul’s Fire, which says “Target creature you control on the battlefield deals damage equal to its power to any target”), it isn’t affected by Fire Servant’s ability."}, {"date": "2010-08-15", "text": "If multiple effects modify how damage will be dealt, the player who would be dealt damage or the controller of the permanent that would be dealt damage chooses the order to apply the effects. For example, Mending Hands says, “Prevent the next 4 damage that would be dealt to any target this turn” and Lava Axe is a red sorcery that says “Lava Axe deals 5 damage to target player or planeswalker.” Suppose a Lava Axe controlled by a player who controls Fire Servant would deal 5 damage to a player who has cast Mending Hands targeting themselves. The player who would be dealt damage can either (a) prevent 4 damage first and then let Fire Servant’s effect double the remaining 1 damage, taking 2 damage, or (b) double the damage to 10 and then prevent 4 damage, taking 6 damage."}, {"date": "2010-08-15", "text": "If a red instant or sorcery spell you control divides damage among multiple recipients (such as Fireball does), the damage is divided before Fire Servant’s effect doubles it."}, {"date": "2010-08-15", "text": "If you control more than one Fire Servant, the effects are cumulative. Two such effects will cause damage from red instant or sorcery spells you control to be multiplied by four; three such effects will cause damage from red instant or sorcery spells you control to be multiplied by eight."}], "setCode": "PD2", "subtypes": ["Elemental"], "supertypes": [], "text": "If a red instant or sorcery spell you control would deal damage, it deals double that damage instead.", "toughness": "3", "type": "Creature — Elemental", "types": ["Creature"], "uuid": "6fb54a10-1c41-5fb6-bf80-9e2087c22c47"}