{"artist": "Mitch Cotie", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["B", "R", "U"], "colors": ["B", "R", "U"], "convertedManaCost": 4.0, "duelDeck": "b", "edhrecRank": 20449, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 266292, "name": "Feuerfeld-Oger", "text": "Erstschlag\nExhumieren {U}{B}{R} ({U}{B}{R}: Bringe diese Karte aus deinem Friedhof ins Spiel zurück. Sie hat Eile. Schicke sie zu Beginn des nächsten Endsegments oder falls sie das Spiel verlassen würde ins Exil. Spiele Exhumieren nur wie eine Hexerei.)", "type": "Kreatur — Oger, Mutant"}, {"language": "Spanish", "multiverseId": 266198, "name": "Ogro campo de fuego", "text": "Daña primero.\nDesenterrar {U}{B}{R}. ({U}{B}{R}: Regresa esta carta de tu cementerio al campo de batalla. Gana la habilidad de prisa. Exíliala al comienzo del próximo paso final o si fuera a dejar el campo de batalla. Desentierra sólo como un conjuro.)", "type": "Criatura — Mutante ogro"}, {"language": "French", "multiverseId": 266434, "name": "Ogre du champ de feu", "text": "Initiative\nExhumation {U}{B}{R} ({U}{B}{R} : Renvoyez sur le champ de bataille cette carte depuis votre cimetière. Elle acquiert la célérité. Exilez-la au début de la prochaine étape de fin ou si elle devait quitter le champ de bataille. N'exhumez que lorsque vous pourriez lancer un rituel.)", "type": "Créature : ogre et mutant"}, {"language": "Italian", "multiverseId": 266255, "name": "Ogre Campo di Fuoco", "text": "Attacco improvviso\nDissotterrare {U}{B}{R} ({U}{B}{R}: Rimetti sul campo di battaglia questa carta dal tuo cimitero. Ha rapidità. Esiliala all'inizio della prossima sottofase finale o se sta per lasciare il campo di battaglia. Dissotterra solo quando potresti lanciare una stregoneria.)", "type": "Creatura — Mutante Ogre"}], "frameVersion": "2003", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "185591", "cardsphereId": "14112", "mcmId": "250480", "mcmMetaId": "10231", "mtgjsonV4Id": "9b36f401-2597-50a2-81c8-cf7713ffd93a", "mtgoFoilId": "42220", "mtgoId": "42219", "multiverseId": "259270", "scryfallId": "0d023dd3-e92f-4b8a-a178-b60db018bf2a", "scryfallIllustrationId": "ac32607e-54ee-487a-8065-9e209292e357", "scryfallOracleId": "343a258e-ea46-4acb-8543-9f869e43bc59", "tcgplayerProductId": "52118"}, "isReprint": true, "isStarter": true, "keywords": ["First strike", "Unearth"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}{B}{R}", "manaValue": 4.0, "name": "Fire-Field Ogre", "number": "53", "originalText": "First strike\nUnearth {U}{B}{R} ({U}{B}{R}: Return this card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.)", "originalType": "Creature — Ogre Mutant", "power": "4", "printings": ["ALA", "DDH"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/0e9ab0307633911d", "cardmarket": "https://mtgjson.com/links/0c1266e729c0a28d", "tcgplayer": "https://mtgjson.com/links/666b6ff436c3e36b"}, "rarity": "uncommon", "rulings": [{"date": "2008-10-01", "text": "If you activate a card’s unearth ability but that card is removed from your graveyard before the ability resolves, that unearth ability will resolve and do nothing."}, {"date": "2008-10-01", "text": "Activating a creature card’s unearth ability isn’t the same as casting the creature card. The unearth ability is put on the stack, but the creature card is not. Spells and abilities that interact with activated abilities (such as Stifle) will interact with unearth, but spells and abilities that interact with spells (such as Remove Soul) will not."}, {"date": "2008-10-01", "text": "At the beginning of the end step, a creature returned to the battlefield with unearth is exiled. This is a delayed triggered ability, and it can be countered by effects such as Stifle or Voidslime that counter triggered abilities. If the ability is countered, the creature will stay on the battlefield and the delayed trigger won’t trigger again. However, the replacement effect will still exile the creature when it eventually leaves the battlefield."}, {"date": "2008-10-01", "text": "Unearth grants haste to the creature that’s returned to the battlefield. However, neither of the “exile” abilities is granted to that creature. If that creature loses all its abilities, it will still be exiled at the beginning of the end step, and if it would leave the battlefield, it is still exiled instead."}, {"date": "2008-10-01", "text": "If a creature returned to the battlefield with unearth would leave the battlefield for any reason, it’s exiled instead — unless the spell or ability that’s causing the creature to leave the battlefield is actually trying to exile it! In that case, it succeeds at exiling it. If it later returns the creature card to the battlefield (as Oblivion Ring or Flickerwisp might, for example), the creature card will return to the battlefield as a new object with no relation to its previous existence. The unearth effect will no longer apply to it."}], "setCode": "DDH", "subtypes": ["Ogre", "Mutant"], "supertypes": [], "text": "First strike\nUnearth {U}{B}{R} ({U}{B}{R}: Return this card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.)", "toughness": "2", "type": "Creature — Ogre Mutant", "types": ["Creature"], "uuid": "29d7141f-0447-59c0-9c00-40ce4d61778b"}