{"artist": "Thomas Denmark", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 20883, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 163596, "name": "Feuerjongleur", "text": "Immer wenn der Feuerjongleur geblockt wird, befehde dich mit einem Gegner. Falls du die Fehde gewinnst, fügt der Feuerjongleur jeder Kreatur, die ihn blockt, 4 Schadenspunkte zu. (Jeder Spieler in einer Fehde deckt die oberste Karte seiner Bibliothek auf und legt diese Karte dann auf oder unter seine Bibliothek. Ein Spieler gewinnt die Fehde, wenn seine Karte die höheren umgewandelten Manakosten hat.)", "type": "Kreatur — Goblin, Schamane"}, {"language": "Spanish", "multiverseId": 163446, "name": "Malabarista de fuego", "text": "Siempre que el Malabarista de fuego sea bloqueado, enfréntate con un oponente. Si ganas, el Malabarista de fuego hace 4 puntos de daño a cada criatura que lo bloquea. (Cada jugador enfrentado muestra la primera carta de su biblioteca, luego pone esa carta en la parte superior o inferior. Gana el jugador cuya carta tenga el mayor coste de maná convertido.)", "type": "Criatura — Chamán trasgo"}, {"language": "French", "multiverseId": 164346, "name": "Jongleur de feu", "text": "À chaque fois que le Jongleur de feu devient bloqué, confrontez un adversaire. Si vous gagnez, le Jongleur de feu inflige 4 blessures à chaque créature qui le bloque. (Chaque joueur impliqué dans la confrontation révèle la carte du dessus de sa bibliothèque et met ensuite cette carte au-dessus ou au-dessous de celle-ci. Un joueur gagne si sa carte a un coût converti de mana plus élevé.)", "type": "Créature : gobelin et shamane"}, {"language": "Italian", "multiverseId": 163746, "name": "Giocoliere Infuocato", "text": "Ogniqualvolta il Giocoliere Infuocato viene bloccato, scontrati con un avversario. Se vinci, il Giocoliere Infuocato infligge 4 danni a ogni creatura che lo blocca. (Ogni giocatore che si scontra rivela la prima carta del suo grimorio, poi la mette in cima o in fondo. Un giocatore vince se la sua carta aveva un costo di mana convertito maggiore.)", "type": "Creatura — Sciamano Goblin"}, {"language": "Japanese", "multiverseId": 164046, "name": "火の曲芸人", "text": "火の曲芸人がブロックされた状態になるたび、いずれかの対戦相手と激突を行う。 あなたが勝った場合、火の曲芸人はそれをブロックしている各クリーチャーにそれぞれ４点のダメージを与える。 （激突を行う各プレイヤーは、自分のライブラリーの一番上のカードを公開し、そのカードを一番上か一番下に置く。 自分のカードの点数で見たマナ・コストの方が大きいプレイヤーが勝つ。）", "type": "クリーチャー — ゴブリン・シャーマン"}, {"language": "Portuguese (Brazil)", "multiverseId": 163896, "name": "Manipulador de Fogo", "text": "Toda vez que Manipulador de Fogo for bloqueado, confronte um oponente. Se você vencer, Manipulador de Fogo causará 4 pontos de dano a cada criatura que o estiver bloqueando. (Cada jogador confrontante revela o card do topo de seu próprio grimório e depois o coloca no topo ou no fundo deste. Vence o jogador que tiver o card com o maior custo de mana convertido.)", "type": "Criatura — Goblin Xamã"}, {"language": "Russian", "multiverseId": 164496, "name": "Жонглер Огнем", "text": "Каждый раз, когда Жонглер Огнем становится заблокированным, столкнитесь с оппонентом. Если вы выиграли, Жонглер Огнем наносит 4 повреждения каждому блокирующему его существу. (Каждый сталкивающийся игрок показывает верхнюю карту своей библиотеки, затем кладет ту карту на верх или в низ своей библиотеки. Выигрывает тот игрок, чья карта имела большую конвертированную мана-стоимость.)", "type": "Существо — Гоблин Шаман"}, {"language": "Chinese Simplified", "multiverseId": 164196, "name": "戏火人", "text": "每当戏火人被阻挡时，与一位对手比点。 若你赢，则戏火人对每个阻挡它的生物各造成4点伤害。 （参与比点的牌手各展示其牌库顶牌，然后将该牌置于牌库顶部或底部。 所展示的牌之总法术力费用比较高的牌手赢得比点。）", "type": "生物～精灵／祭师"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "124352", "cardKingdomId": "124202", "cardsphereId": "32488", "mcmId": "18919", "mcmMetaId": "9506", "mtgjsonV4Id": "8ae368da-5e0c-5985-969c-8a623d6f42b5", "mtgoFoilId": "28995", "mtgoId": "28994", "multiverseId": "152534", "scryfallId": "f04d5eef-da88-496b-a902-b87b0b386f96", "scryfallIllustrationId": "1646888e-ea41-49d7-834a-c2820ad796ee", "scryfallOracleId": "dd1b4235-f053-4c46-8993-ae8d7860a0f3", "tcgplayerProductId": "17985"}, "keywords": ["Clash"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}", "manaValue": 3.0, "name": "Fire Juggler", "number": "90", "originalText": "Whenever Fire Juggler becomes blocked, clash with an opponent. If you win, Fire Juggler deals 4 damage to each creature blocking it. (Each clashing player reveals the top card of his or her library, then puts that card on the top or bottom. A player wins if his or her card had a higher converted mana cost.)", "originalType": "Creature - Goblin Shaman", "power": "2", "printings": ["MOR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/c91ce040e7d18dcc", "cardKingdomFoil": "https://mtgjson.com/links/b1a099340d92b357", "cardmarket": "https://mtgjson.com/links/371316f6accd8594", "tcgplayer": "https://mtgjson.com/links/5793bbc8bfb6abf8"}, "rarity": "common", "rulings": [], "setCode": "MOR", "subtypes": ["Goblin", "Shaman"], "supertypes": [], "text": "Whenever Fire Juggler becomes blocked, clash with an opponent. If you win, Fire Juggler deals 4 damage to each creature blocking it. (Each clashing player reveals the top card of their library, then puts that card on the top or bottom. A player wins if their card had a higher mana value.)", "toughness": "2", "type": "Creature — Goblin Shaman", "types": ["Creature"], "uuid": "2fd08585-c8dd-5bff-9444-418e5524af08"}