{"artist": "Anna Steinbauer", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B", "W"], "colors": ["B", "W"], "convertedManaCost": 4.0, "edhrecRank": 5159, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "241533", "cardsphereId": "74289", "mcmId": "535837", "mtgjsonV4Id": "c1dd1576-1e57-508f-a311-349305a9b8fb", "scryfallId": "1329b3dc-c08a-4e9d-a354-0fdb60fb1a95", "scryfallIllustrationId": "2fbbf041-0506-4b1f-822d-f737064b91d8", "scryfallOracleId": "fea32d4e-ceef-4954-a84d-e7e2509e4a13", "tcgplayerProductId": "231611"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "saga", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}{W}{B}", "manaValue": 4.0, "name": "Firja's Retribution", "number": "210s", "printings": ["CLB", "KHM", "PKHM"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/4d4b3e32f47a0bac", "tcgplayer": "https://mtgjson.com/links/8da5634a78bbd68b"}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "Only Angels you control as the chapter II ability resolves will gain the activated ability. Similarly, only Angels you control as the chapter III ability resolves will gain double strike. In both cases, Angels that come under your control later in the turn won't gain the ability."}, {"date": "2021-02-05", "text": "The power of the target creature must be less than the power of the Angel as you activate the ability. As the ability tries to resolve, the powers are compared again. If the power of the target creature is no longer less than the power of the Angel, the ability won't resolve. If the Angel is no longer on the battlefield at that time, use its power as it last existed on the battlefield to determine if the ability resolves."}, {"date": "2021-02-05", "text": "As a Saga enters the battlefield, its controller puts a lore counter on it. As your precombat main phase begins (immediately after your draw step), you put another lore counter on each Saga you control. Putting a lore counter on a Saga in either of these ways doesn't use the stack."}, {"date": "2021-02-05", "text": "Each symbol on the left of a Saga's text box represents a chapter ability. A chapter ability is a triggered ability that triggers when a lore counter that is put on the Saga causes the number of lore counters on the Saga to become equal to or greater than the ability's chapter number. Chapter abilities are put onto the stack and may be responded to."}, {"date": "2021-02-05", "text": "A chapter ability doesn't trigger if a lore counter is put on a Saga that already had a number of lore counters greater than or equal to that chapter's number. For example, the third lore counter put on a Saga causes the chapter III ability to trigger, but chapters I and II won't trigger again."}, {"date": "2021-02-05", "text": "Once a chapter ability has triggered, the ability on the stack won't be affected if the Saga gains or loses counters, or if it leaves the battlefield."}, {"date": "2021-02-05", "text": "If multiple chapter abilities trigger at the same time, their controller puts them on the stack in any order. If any of them require targets, those targets are chosen as you put the abilities on the stack, before any of those abilities resolve."}, {"date": "2021-02-05", "text": "Removing lore counters won't cause a previous chapter ability to trigger. If lore counters are removed from a Saga, the appropriate chapter abilities will trigger again when the Saga receives more lore counters."}, {"date": "2021-02-05", "text": "Once the number of lore counters on a Saga is greater than or equal to the greatest number among its chapter abilities, the Saga's controller sacrifices it as soon as its chapter ability has left the stack, most likely by resolving or being countered. This state-based action doesn't use the stack."}], "securityStamp": "oval", "setCode": "PKHM", "subtypes": ["Saga"], "supertypes": [], "text": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI — Create a 4/4 white Angel Warrior creature token with flying and vigilance.\nII — Until end of turn, Angels you control gain \"{T}: Destroy target creature with power less than this creature's power.\"\nIII — Angels you control gain double strike until end of turn.", "type": "Enchantment — Saga", "types": ["Enchantment"], "uuid": "619a7762-7a78-5b14-b271-35881739f39d", "variations": ["2f393844-95a1-5c26-9aaa-b62528898311"]}