{"artist": "Viktor Titov", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 5.0, "edhrecRank": 4003, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"mtgjsonV4Id": "24917c6e-5f57-5e7f-a299-d4b2d47e5fe4", "mtgoId": "55713", "scryfallId": "9c561962-6184-4c90-8f48-80919b3b10b7", "scryfallIllustrationId": "c8576b1b-f64f-443c-9181-ffe2d9f5d4cf", "scryfallOracleId": "f797a325-ec2a-4142-b0ff-90cac1356da9"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Dash"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{R}", "manaValue": 5.0, "name": "Flamerush Rider", "number": "55713", "originalReleaseDate": "2015-12-29", "power": "3", "printings": ["C19", "FRF", "PFRF", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2014-11-24", "text": "If a creature enters the battlefield as a copy of or becomes a copy of a creature whose dash cost was paid, the copy won’t have haste and won’t be returned to its owner’s hand."}, {"date": "2014-11-24", "text": "You choose which opponent or opposing planeswalker the token is attacking as you put it onto the battlefield. It doesn’t have to be the same player or planeswalker Flamerush Rider is attacking."}, {"date": "2014-11-24", "text": "Although the token is attacking, it was never declared as an attacking creature (for purposes of abilities that trigger whenever a creature attacks, for example)."}, {"date": "2014-11-24", "text": "The token copies exactly what was printed on the original creature and nothing else (unless that permanent is copying something else or is a token; see below). It doesn’t copy whether that creature has any counters on it or Auras and/or Equipment attached to it, or any non-copy effects that changed its power, toughness, types, color, and so on. Notably, it doesn’t copy any effects that may have turned a noncreature permanent into a creature. If the token isn’t a creature as it enters the battlefield, it won’t be attacking."}, {"date": "2014-11-24", "text": "If the copied creature had {X} in its mana cost, X is 0."}, {"date": "2014-11-24", "text": "If the copied creature was copying something else, the token enters the battlefield as whatever that creature was copying."}, {"date": "2014-11-24", "text": "If the copied creature is a token, the token created by Flamerush Rider copies the original characteristics of that token as stated by the effect that put it onto the battlefield."}, {"date": "2014-11-24", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when the token enters the battlefield. Any “As [this creature] enters the battlefield” or “[This creature] enters the battlefield with” abilities of the copied creature will also work."}, {"date": "2014-11-24", "text": "If another creature becomes or enters the battlefield as a copy of the token, you won’t exile that creature at end of combat. However, if Flamerush Rider creates multiple tokens due to a replacement effect (like the one Doubling Season creates), you’ll exile each of those tokens."}, {"date": "2014-11-24", "text": "If you choose to pay the dash cost rather than the mana cost, you’re still casting the spell. It goes on the stack and can be responded to and countered. You can cast a creature spell for its dash cost only when you otherwise could cast that creature spell. Most of the time, this means during your main phase when the stack is empty."}, {"date": "2014-11-24", "text": "If you pay the dash cost to cast a creature spell, that card will be returned to its owner’s hand only if it’s still on the battlefield when its triggered ability resolves. If it dies or goes to another zone before then, it will stay where it is."}, {"date": "2014-11-24", "text": "You don’t have to attack with the creature with dash unless another ability says you do."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Human", "Warrior"], "supertypes": [], "text": "Whenever Flamerush Rider attacks, create a token that's a copy of another target attacking creature and that's tapped and attacking. Exile the token at end of combat.\nDash {2}{R}{R} (You may cast this spell for its dash cost. If you do, it gains haste, and it's returned from the battlefield to its owner's hand at the beginning of the next end step.)", "toughness": "3", "type": "Creature — Human Warrior", "types": ["Creature"], "uuid": "6f9383cd-9287-5dc8-a4bd-26fcd4425d42", "watermark": "mardu"}