{"artist": "Lucas Graciano", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "G", "R"], "colors": ["R", "G"], "convertedManaCost": 7.0, "edhrecRank": 12393, "faceConvertedManaCost": 2.0, "faceManaValue": 2.0, "faceName": "Blood", "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2003", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardsphereId": "83247", "mcmId": "583934", "mcmMetaId": "207888", "mtgjsonV4Id": "e18a7f3f-f6ac-51ec-8aaf-fba448b2cf6d", "scryfallId": "e23faf50-64e5-4989-96ba-1048c7e5ef23", "scryfallIllustrationId": "5c13b10e-ae6b-4b28-89fa-16aa830f8267", "scryfallOracleId": "0741151a-fec0-4ed3-9295-0d0f56d24165", "tcgplayerProductId": "254573"}, "isReprint": true, "keywords": ["Fuse"], "language": "English", "layout": "split", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{R}{G}", "manaValue": 7.0, "name": "Flesh // Blood", "number": "639", "originalReleaseDate": "2021-11-19", "otherFaceIds": ["05189765-eaf7-5843-be4d-a4931677ebdd"], "printings": ["DGM", "PLIST"], "purchaseUrls": {"cardmarket": "https://mtgjson.com/links/a5d4c1423dd0a771", "tcgplayer": "https://mtgjson.com/links/9ba4b1adb38f2e46"}, "rarity": "rare", "rulings": [{"date": "2013-04-15", "text": "On the stack, a split spell that hasn’t been fused has only that half’s characteristics and converted mana cost. The other half is treated as though it didn’t exist."}, {"date": "2013-04-15", "text": "As Flesh is resolving, if the creature is an illegal target but the creature card is still a legal target, the creature card will be exiled but no counters will be put onto the creature. If the creature is the only legal target, Flesh will still resolve but will have no effect as you didn’t exile a card."}, {"date": "2013-04-15", "text": "The number of +1/+1 counters is based on the power of the creature card as it last existed in the graveyard."}, {"date": "2013-04-15", "text": "If you cast Flesh // Blood as a fused split card, the +1/+1 counters will have been placed before the amount of damage is determined."}, {"date": "2013-04-15", "text": "If you’re casting a split card with fuse from any zone other than your hand, you can’t cast both halves. You’ll only be able to cast one half or the other."}, {"date": "2013-04-15", "text": "To cast a fused split spell, pay both of its mana costs. While the spell is on the stack, its converted mana cost is the total amount of mana in both costs."}, {"date": "2013-04-15", "text": "You can choose the same object as the target of each half of a fused split spell, if appropriate."}, {"date": "2013-04-15", "text": "When resolving a fused split spell with multiple targets, treat it as you would any spell with multiple targets. If all targets are illegal when the spell tries to resolve, the spell doesn’t resolve and none of its effects happen. If at least one target is still legal at that time, the spell resolves, but an illegal target can’t perform any actions or have any actions performed on it."}, {"date": "2013-04-15", "text": "When a fused split spell resolves, follow the instructions of the left half first, then the instructions on the right half."}, {"date": "2013-04-15", "text": "Some split cards with fuse have two monocolor halves of different colors. If such a card is cast as a fused split spell, the resulting spell is multicolored. If only one half is cast, the spell is the color of that half. While not on the stack, such a card is multicolored."}, {"date": "2013-04-15", "text": "Some split cards with fuse have two halves that are both multicolored. That card is multicolored no matter which half is cast, or if both halves are cast. It’s also multicolored while not on the stack."}, {"date": "2013-04-15", "text": "If a player names a card, the player may name either half of a split card, but not both. A split card has the chosen name if one of its two names matches the chosen name."}, {"date": "2013-04-15", "text": "If you cast a split card with fuse from your hand without paying its mana cost, you can choose to use its fuse ability and cast both halves without paying their mana costs."}, {"date": "2013-04-15", "text": "As Blood is resolving, if only one of the targets is legal, Blood will still resolve but will have no effect: If the first target is illegal, it can’t deal damage to anything. If the second target is illegal, it can’t be dealt damage."}, {"date": "2013-04-15", "text": "The amount of damage dealt is based on the first target creature’s power as Blood resolves."}], "setCode": "PLIST", "side": "b", "subtypes": [], "supertypes": [], "text": "Target creature you control deals damage equal to its power to any target.\nFuse (You may cast one or both halves of this card from your hand.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "878df157-90e1-50ff-8f30-1c6d30ddf8ce", "watermark": "golgari"}