{"artist": "Kai Carpenter", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 2.0, "edhrecRank": 4994, "finishes": ["foil"], "flavorText": "Tales of your great deeds follow you no matter how far you travel from your hometown.", "foreignData": [{"flavorText": "Geschichten von deinen Großtaten folgen dir, egal wie weit du von deiner Heimatstadt wegreist.", "language": "German", "multiverseId": 567151, "name": "Volksheld", "text": "Kommandeur-Kreaturen, die du besitzt, haben „Immer wenn du einen Zauberspruch wirkst, der einen Kreaturentyp mit dieser Kreatur gemeinsam hat, ziehe eine Karte. Diese Fähigkeit wird nur einmal pro Zug ausgelöst.\"", "type": "Legendäre Verzauberung — Hintergrund"}, {"flavorText": "Las historias de tus proezas te siguen allá donde viajes, por muy lejos que estés de tu ciudad natal.", "language": "Spanish", "multiverseId": 567159, "name": "Héroe del pueblo", "text": "Las criaturas comandante de las cuales eres propietario tienen \"Siempre que lances un hechizo que comparta un tipo de criatura con esta criatura, roba una carta. Esta habilidad solo se dispara una vez por turno\".", "type": "Encantamiento legendario — Trasfondo"}, {"flavorText": "Les récits de vos hauts faits vous poursuivent, peu importe la distance entre vous et votre ville natale.", "language": "French", "multiverseId": 567167, "name": "Héros du peuple", "text": "Les créatures Commandant que vous possédez ont « À chaque fois que vous lancez un sort qui partage un type de créature avec cette créature, piochez une carte. Cette capacité ne se déclenche qu'une seule fois par tour. »", "type": "Enchantement légendaire : passé"}, {"flavorText": "I racconti delle tue gesta ti seguono ovunque, anche a miglia di distanza dalla tua città natale.", "language": "Italian", "multiverseId": 567175, "name": "Eroe Popolare", "text": "Le creature comandante che possiedi hanno \"Ogniqualvolta lanci una magia che condivide un tipo di creatura con questa creatura, pesca una carta. Questa abilità si innesca solo una volta per turno\".", "type": "Incantesimo Leggendario — Background"}, {"flavorText": "善き行いの話は、故郷をどんなに離れてもついて来るものだ。", "language": "Japanese", "multiverseId": 567183, "name": "民衆英雄", "text": "あなたがオーナーである、統率者であるすべてのクリーチャーは「あなたがこのクリーチャーと共通のクリーチャー・タイプを持つ呪文を唱えるたび、カード１枚を引く。この能力は、毎ターン１回しか誘発しない。」を持つ。", "type": "伝説のエンチャント — 背景"}, {"flavorText": "As histórias de suas grandes façanhas perseguem você, não importa quão longe de casa você esteja.", "language": "Portuguese (Brazil)", "multiverseId": 567191, "name": "Herói do Povo", "text": "As criaturas comandantes que você possui têm \"Toda vez que você conjurar uma mágica que compartilhe um tipo de criatura com esta criatura, compre um card. Esta habilidade é desencadeada apenas uma vez a cada turno\".", "type": "Encantamento Lendário — Antecedente"}, {"flavorText": "Как бы далеко вы ни уехали от родного города, истории о ваших великих деяниях неотступно следуют за вами.", "language": "Russian", "multiverseId": 567199, "name": "Народный Герой", "text": "Принадлежащие вам существа-командиры имеют способность «Каждый раз, когда вы разыгрываете заклинание, у которого есть такой же тип существа, как у этого существа, возьмите карту. Эта способность срабатывает только один раз в каждом ходу».", "type": "Легендарные Чары — Предыстория"}, {"flavorText": "你即便远离家乡，身边依然流传着自己的伟大事迹。", "language": "Chinese Simplified", "multiverseId": 567207, "name": "平民英雄", "text": "由你拥有的指挥官生物具有「每当你施放与此生物具共通生物类别的咒语时，抓一张牌。此异能每回合只会触发一次。」", "type": "传奇结界 ～身世"}, {"flavorText": "你即便遠離家鄉，身邊依然流傳著自己的偉大事蹟。", "language": "Chinese Traditional", "multiverseId": 567215, "name": "平民英雄", "text": "由你擁有的指揮官生物具有「每當你施放與此生物具共通生物類別的咒語時，抽一張牌。此異能每回合只會觸發一次。」", "type": "傳奇結界 ～身世"}], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "262103", "mcmId": "661368", "mtgjsonV4Id": "3f909daf-7c98-5341-8f8a-71c7fd0acdeb", "mtgoId": "101470", "multiverseId": "567143", "scryfallId": "a8b3aae8-fc36-45ed-84ed-efb8f543cada", "scryfallIllustrationId": "b51b15d8-4310-4947-84b1-b05620c8771c", "scryfallOracleId": "c5126d6e-969c-4034-98e3-f8653163346f", "tcgplayerProductId": "273649"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}", "manaValue": 2.0, "name": "Folk Hero", "number": "650", "originalText": "Commander creatures you own have \"Whenever you cast a spell that shares a creature type with this creature, draw a card. This ability triggers only once each turn.\"", "originalType": "Legendary Enchantment — Background", "printings": ["CLB"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/d8570b88a36e1695", "tcgplayer": "https://mtgjson.com/links/aa2ba0017904473d"}, "rarity": "mythic", "rulings": [{"date": "2022-06-10", "text": "Choose a Background is a variant of the partner ability. You may have two commanders if one of them is a legendary creature with the choose a background ability and the other is a legendary Background enchantment. Backgrounds and cards with choose a Background do not interact with cards which have any other partner ability."}, {"date": "2022-06-10", "text": "If your Commander deck has two commanders, you can include only cards whose own color identities are also found in your commanders’ combined color identities."}, {"date": "2022-06-10", "text": "Both commanders start in the command zone, and the remaining 98 cards (or 58 cards in a Commander Draft game) of your deck are shuffled to become your library."}, {"date": "2022-06-10", "text": "If your commander loses the choose a Background ability or stops being a Background during the game, as appropriate, it is still your commander."}, {"date": "2022-06-10", "text": "Once the game begins, your two commanders are tracked separately. If you cast one, you won’t have to pay an additional {2} the first time you cast the other. A player loses the game after having been dealt 21 combat damage from any one of them, not from both of them combined (although your Background won’t usually be a creature anyway)."}, {"date": "2022-06-10", "text": "If something refers to your commander while you have two commanders, it refers to one of them of your choice. If you are instructed to perform an action on your commander (e.g. put it from the command zone into your hand due to Command Beacon), you choose one of your commanders at the time the effect happens."}, {"date": "2022-06-10", "text": "An effect that checks whether you control your commander is satisfied if you control one or both of your two commanders."}, {"date": "2022-06-10", "text": "You can choose two commanders that are the same color or colors."}, {"date": "2022-06-10", "text": "If a card refers to a commander creature you own, a Background won't usually be counted or included for that effect. If another spell or ability causes your Background to become a creature, however, it will be included. Any effect that refers to your commander or a commander you own or control without specifying creature will apply to a Background that is your commander, as appropriate."}, {"date": "2022-06-10", "text": "If you control a Background that grants an ability to commander creatures you own, and you own more than one commander creature, each of them will have that ability."}], "securityStamp": "oval", "setCode": "CLB", "subtypes": ["Background"], "supertypes": ["Legendary"], "text": "Commander creatures you own have \"Whenever you cast a spell that shares a creature type with this creature, draw a card. This ability triggers only once each turn.\"", "type": "Legendary Enchantment — Background", "types": ["Enchantment"], "uuid": "2ccd7f84-1faf-5bda-b964-79b9627de768", "variations": ["af586419-db68-58a4-abe5-d518cd8a8a78"]}