{"artist": "Amy Weber", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "white", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 4781, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "1993", "hasFoil": false, "hasNonFoil": true, "identifiers": {"mcmId": "16650", "mtgjsonV4Id": "54429b0c-5528-5b2c-8f1d-771c51d0d251", "scryfallId": "0906c119-5a30-41e4-8c17-90bce4c68093", "scryfallIllustrationId": "d225980a-5536-4f54-9084-7789cdf59db0", "scryfallOracleId": "50c53ae0-51ba-4046-ac74-87c65e688032", "tcgplayerProductId": "211898"}, "isReprint": true, "isReserved": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "oldschool": "Legal", "vintage": "Legal"}, "manaCost": "{R}{R}", "manaValue": 2.0, "name": "Fork", "number": "153", "printings": ["2ED", "30A", "3ED", "CED", "CEI", "FBB", "LEA", "LEB", "ME4", "PRM", "SUM"], "purchaseUrls": {"tcgplayer": "https://mtgjson.com/links/96ab4d853ae3e278"}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "Fork will not copy changes made by modifying effects to the spell prior to the use of Fork, such as text-changing effects."}, {"date": "2004-10-04", "text": "If mana or other costs need to be spent at resolution of the spell, the player of Fork would still be responsible for paying that cost."}, {"date": "2004-10-04", "text": "You need not (and may not) pay any additional mana or other costs (like sacrifices) to use the spell which is Forked. You get control over a complete copy but can change nothing except the targets."}, {"date": "2004-10-04", "text": "Fork does not let you make non-targeting choices about the spell."}, {"date": "2004-10-04", "text": "When a spell with additional costs is copied, you don’t have to pay those costs again."}, {"date": "2004-10-04", "text": "If you copy a spell for which Buyback has been paid, you get nothing back since the copied spell does not have a card to give you."}, {"date": "2004-10-04", "text": "The copy that is placed on the stack is not considered to have been “cast”."}, {"date": "2004-10-04", "text": "The Fork card goes to the graveyard when it resolves and leaves the copy on the stack. There is no card representing the copy on the stack."}, {"date": "2004-10-04", "text": "It does copy the mana symbols in the mana cost for the card it is copying, but it uses its own color definition and not the one from those mana symbols. This is so it maintains its color just like the text says."}, {"date": "2004-10-04", "text": "If the spell being copied targets a spell on the stack, it is possible to target Fork itself since Fork is still on the stack when you pick the target(s) for the copy. Note that the copy’s target will be illegal when it resolves."}, {"date": "2004-10-04", "text": "For spells that can have a variable number of targets, the controller of the copy must use the same number of targets the original spell did."}, {"date": "2004-10-04", "text": "Forking a spell with an X in the cost requires you to use the same X value."}, {"date": "2004-12-01", "text": "If you Fork a Spliced spell, the spliced text is added during the announcement of the original spell, and therefore is fully copied by Fork."}, {"date": "2009-05-01", "text": "The copy will have the same mana cost as the original spell, but will be red rather than whatever color that mana cost would have made it."}, {"date": "2009-10-01", "text": "If the targeted spell was kicked, then the copy will be kicked as well. If the targeted spell was not kicked, then the copy will not be kicked."}], "setCode": "SUM", "subtypes": [], "supertypes": [], "text": "Copy target instant or sorcery spell, except that the copy is red. You may choose new targets for the copy.", "type": "Instant", "types": ["Instant"], "uuid": "1dba9edd-da53-55bd-a1aa-550851e04c78"}