{"artist": "Ben Wootten", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 5.0, "edhrecRank": 6257, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 567264, "name": "Aus den Katakomben", "text": "Bringe eine Kreaturenkarte deiner Wahl aus einem Friedhof mit einer Leichenmarke unter deiner Kontrolle ins Spiel. Falls jene Kreatur das Spiel verlassen würde, schicke sie ins Exil, anstatt sie irgendwo anders hinzulegen.\nDu übernimmst die Initiative.\nBefreiung — {3}{B}{B}, schicke fünf andere Karten aus deinem Friedhof ins Exil. (Du kannst diese Karte aus deinem Friedhof für ihre Befreiungskosten wirken.)", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 567292, "name": "Alzarse desde las catacumbas", "text": "Pon la carta de criatura objetivo de un cementerio en el campo de batalla bajo tu control y con un contador de cadáveres sobre ella. Si esa criatura fuera a dejar el campo de batalla, exíliala en vez de ponerla en cualquier otro lado.\nTomas la iniciativa.\nEscapatoria—{3}{B}{B}, exiliar otras cinco cartas de tu cementerio. (Puedes lanzar esta carta desde tu cementerio pagando su coste de escapatoria.)", "type": "Conjuro"}, {"language": "French", "multiverseId": 567320, "name": "Venu des catacombes", "text": "Mettez sur le champ de bataille, sous votre contrôle, une carte de créature ciblée depuis un cimetière avec un marqueur « cadavre » sur elle. Si cette créature devait quitter le champ de bataille, exilez-la à la place de la mettre autre part.\nVous prenez l'initiative.\nÉchappée — {3}{B}{B}, exilez cinq autres cartes de votre cimetière. (Vous pouvez lancer cette carte depuis votre cimetière pour son coût d'échappée.)", "type": "Rituel"}, {"language": "Italian", "multiverseId": 567348, "name": "Dalle Catacombe", "text": "Metti sul campo di battaglia sotto il tuo controllo una carta creatura bersaglio da un cimitero con un segnalino carogna. Se quella creatura sta per lasciare il campo di battaglia, esiliala invece di metterla in qualsiasi altra zona.\nPrendi l'iniziativa.\nFuga—{3}{B}{B}, Esilia altre cinque carte dal tuo cimitero. (Puoi lanciare questa carta dal tuo cimitero pagando il suo costo di fuga.)", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 567376, "name": "地下墓地より", "text": "墓地にあるクリーチャー・カード１枚を対象とする。それを死体カウンター１個が置かれた状態であなたのコントロール下で戦場に出す。そのクリーチャーが戦場を離れるなら、それを他の領域に置く代わりに追放する。\nあなたはイニシアチブを得る。\n脱出 ― {3}{B}{B}, あなたの墓地にありこれでないカード５枚を追放する。（あなたはあなたの墓地にあるこのカードを脱出コストで唱えてもよい。）", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 567404, "name": "Das Catacumbas", "text": "Coloque o card de criatura alvo de um cemitério no campo de batalha sob seu controle com um marcador de cadáver. Se aquela criatura for deixar o campo de batalha, em vez de colocá-la em qualquer outro lugar, exile-a.\nVocê assume a dianteira.\nEscapatória — {3}{B}{B}, exile cinco outros cards de seu cemitério. (Você pode conjurar este card de seu cemitério pagando seu custo de escapatória.)", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 567432, "name": "Из Катакомб", "text": "Положите целевую карту существа из кладбища на поле битвы под вашим контролем с одним жетоном трупа на ней. Если то существо должно покинуть поле битвы, изгоните его вместо того, чтобы положить его в какую-либо другую зону.\nВы получаете инициативу.\nПобег — {3}{B}{B}, изгоните пять других карт из вашего кладбища. (Вы можете разыграть эту карту из вашего кладбища за ее стоимость Побега.)", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 567460, "name": "来自陵墓", "text": "将目标生物牌在你的操控下从坟墓场放进战场，且上面有一个尸体指示物。如果该生物将离开战场，则改为将它放逐，而非置入其他区域。\n你掌握先制。\n逸脱～{3}{B}{B}，从你的坟墓场放逐五张其他牌。（你可以从你坟墓场中施放此牌，并支付其逸脱费用。）", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 567488, "name": "來自陵墓", "text": "將目標生物牌在你的操控下從墳墓場放進戰場，且上面有一個屍體指示物。如果該生物將離開戰場，則改為將它放逐，而非置入其他區域。\n你掌握先制。\n逸脫～{3}{B}{B}，從你的墳墓場放逐五張其他牌。（你可以從你墳墓場中施放此牌，並支付其逸脫費用。）", "type": "巫術"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "261892", "mcmId": "661303", "mtgjsonV4Id": "2701a507-6f1c-51e7-87f4-84deb5764cdc", "multiverseId": "567236", "scryfallId": "08737950-4662-4d36-a1ea-6fd87e38c02b", "scryfallIllustrationId": "704ef0b6-d7f9-42db-9e7d-c23053585e38", "scryfallOracleId": "cc21b29f-2d1a-4769-9b65-f92bd2ca1cc8", "tcgplayerProductId": "273529"}, "keywords": ["Escape"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}{B}", "manaValue": 5.0, "name": "From the Catacombs", "number": "671", "originalText": "Put target creature card from a graveyard onto the battlefield under your control with a corpse counter on it. If that creature would leave the battlefield, exile it instead of putting it anywhere else.\nYou take the initiative.\nEscape—{3}{B}{B}, Exile five other cards from your graveyard. (You may cast this card from your graveyard for its escape cost.)", "originalType": "Sorcery", "printings": ["CLB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/4c9c6d7c9dafb8c5", "tcgplayer": "https://mtgjson.com/links/c926313da0e9f636"}, "rarity": "rare", "rulings": [{"date": "2022-06-10", "text": "The corpse counter is only to help remind you which creatures will be exiled if they would leave the battlefield. If you somehow remove a corpse counter from a creature that was put onto the battlefield this way, the replacement effect that will exile it continues to apply. Similarly, moving the corpse counter onto another creature has no effect on that creature; the replacement effect will continue to apply to the original creature."}, {"date": "2022-06-10", "text": "Escape's permission doesn't change when you may cast the spell from your graveyard."}, {"date": "2022-06-10", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost you're paying (such as an escape cost), add any cost increases, then apply any cost reductions. The mana value of the spell remains unchanged, no matter what the total cost to cast it was and no matter whether an alternative cost was paid."}, {"date": "2022-06-10", "text": "After From the Catacombs resolves, it returns to your graveyard. From there, you can use the escape ability to cast it again. Of course, you'll need five more cards to exile."}, {"date": "2022-06-10", "text": "If a card has multiple abilities giving you permission to cast it, such as two escape abilities or an escape ability and a flashback ability, you choose which one to apply. The others have no effect."}, {"date": "2022-06-10", "text": "If you cast a spell with its escape permission, you can't choose to apply any other alternative costs or to cast it without paying its mana cost. If it has any additional costs, you must pay those."}, {"date": "2022-06-10", "text": "If a card with escape is put into your graveyard during your turn, you'll be able to cast it right away if it's legal to do so, before an opponent can take any actions."}, {"date": "2022-06-10", "text": "Once you begin casting a spell with escape, it immediately moves to the stack. Players can't take any other actions until you're done casting the spell."}, {"date": "2022-06-10", "text": "The initiative is a designation a player can have. A player with the initiative designation is said to “have the initiative.” The initiative carries two inherent rules. First, whenever a player takes the initiative, and at the beginning of the upkeep of the player with the initiative, that player ventures into Undercity. Second, whenever one or more creatures a player controls deal combat damage to the player who has the initiative, the first player takes the initiative. Also, some abilities will refer to having the initiative and provide other benefits."}, {"date": "2022-06-10", "text": "There is no initiative in a game until an effect instructs a player to take the initiative. Once a player is instructed to do this, they have the initiative until another player takes the initiative."}, {"date": "2022-06-10", "text": "Only one player can have the initiative at a time. As one player takes the initiative, any other player that had the initiative ceases to have it."}, {"date": "2022-06-10", "text": "A player who currently has the initiative may take the initiative again. This causes that player to venture into Undercity again, but does not cause them to have multiple initiative designations."}, {"date": "2022-06-10", "text": "If the player with the initiative leaves the game, the active player takes the initiative at the same time that player leaves the game. If the active player is leaving the game or if there is no active player, the next player in turn order takes the initiative."}, {"date": "2022-06-10", "text": "In a Two-Headed Giant game, if both players on a team deal combat damage to the player that has the initiative at the same time, the player with the initiative will choose the order of the triggered abilities. Then, as those abilities resolve, one team member takes the initiative (and ventures into Undercity) and then the other team member does the same. The last player to take the initiative keeps it until the initiative changes again."}, {"date": "2022-06-10", "text": "You cannot venture into Undercity unless instructed to do so, either because you have the initiative at the beginning of your upkeep or because you take the initiative. Notably, if you aren’t in a dungeon and an effect instructs you to venture into the dungeon (not venture into Undercity), you can’t start Undercity."}, {"date": "2022-06-10", "text": "Similarly, when instructed to venture into Undercity, you can’t start a dungeon that isn’t Undercity."}, {"date": "2022-06-10", "text": "If you aren’t in a dungeon when instructed to venture into Undercity, you will put Undercity into the command zone and move your venture marker to Secret Entrance (the first room)."}, {"date": "2022-06-10", "text": "If you’re already in a dungeon when instructed to venture into Undercity, you move to the next room of that dungeon. If you are already in the last room, you will complete that dungeon and start Undercity. This is true whether you’re already in Undercity or any other dungeon."}], "securityStamp": "oval", "setCode": "CLB", "subtypes": [], "supertypes": [], "text": "Put target creature card from a graveyard onto the battlefield under your control with a corpse counter on it. If that creature would leave the battlefield, exile it instead of putting it anywhere else.\nYou take the initiative.\nEscape—{3}{B}{B}, Exile five other cards from your graveyard. (You may cast this card from your graveyard for its escape cost.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "b9f86790-237c-5e1f-8f68-332b9917bd93", "variations": ["2fcfa363-39f4-54f9-bfae-585e04667e80"]}