{"artist": "Mark Poole", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 3352, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "1d40735a-47aa-5baf-b022-7dff9cfd2542", "mtgoId": "70751", "scryfallId": "32de270e-14f5-4ae9-91af-beee20e600d3", "scryfallIllustrationId": "88f4af7e-0d73-47b5-b316-4250004c8e2d", "scryfallOracleId": "371fa9e3-5432-4f2f-89d4-55061b0b4e57"}, "isOnlineOnly": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}{R}", "manaValue": 4.0, "name": "Fury Storm", "number": "70751", "originalReleaseDate": "2018-12-06", "printings": ["C18", "PZ2"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2018-07-13", "text": "The copy is created on the stack, so it’s not “cast.” Abilities that trigger when a player casts a spell won’t trigger. This means, for example, that Fury Storm’s copies may target Fury Storm itself, but this won’t trigger the copy’s “when you cast this spell” ability, and it won’t increase the number of copies of other spells you end up with."}, {"date": "2018-07-13", "text": "If you copy a spell, you control the copy. It will resolve before the original spell does."}, {"date": "2018-07-13", "text": "The copy will have the same targets as the spell it’s copying unless you choose new ones. You may change any number of the targets, including all of them or none of them, but not how many targets there are. If, for one of the targets, you can’t choose a new legal target, then it remains unchanged (even if the current target is illegal)."}, {"date": "2018-07-13", "text": "If the spell that’s copied is modal (that is, it says “Choose one —” or the like), the copy will have the same mode. A different mode can’t be chosen."}, {"date": "2018-07-13", "text": "If the spell that’s copied has an X whose value was determined as it was cast (like Lavalanche does), the copy will have the same value of X."}, {"date": "2018-07-13", "text": "Fury Storm can copy any instant or sorcery spell, not just one with targets."}, {"date": "2018-07-13", "text": "The controller of a copy can’t choose to pay any alternative or additional costs for the copy. However, effects based on any alternative or additional costs that were paid for the original spell are copied as though those same costs were paid for the copy."}, {"date": "2018-07-13", "text": "Each Storm’s triggered ability counts only how many times you’ve cast your commander from the command zone before that triggered ability resolves. If you cast your commander again later, you won’t get another copy."}, {"date": "2018-07-13", "text": "If your commander was countered, that time you cast it still counts."}, {"date": "2018-07-13", "text": "Each Storm’s triggered ability can copy the Storm spell even if that spell is countered before that ability resolves."}, {"date": "2018-07-13", "text": "The copies are created on the stack, so they’re not “cast.” Abilities that trigger when a player casts a spell (such as the Storm’s ability itself) won’t trigger."}, {"date": "2018-07-13", "text": "If the spell has damage divided as it was cast (like Chandra’s Pyrohelix), the division can’t be changed (although the targets receiving that damage still can)."}, {"date": "2018-10-05", "text": "If you have multiple commanders, you’ll copy this spell for each time you’ve cast either of them. For example, if you’ve cast one commander once and one twice, you’ll copy this spell three times."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": [], "supertypes": [], "text": "When you cast this spell, copy it for each time you've cast your commander from the command zone this game. You may choose new targets for the copies.\nCopy target instant or sorcery spell. You may choose new targets for the copy.", "type": "Instant", "types": ["Instant"], "uuid": "bc056187-e0e6-5dc6-a3c8-f169e84880d7"}