{"artist": "Dameon Willich", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 6.0, "edhrecRank": 18017, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 131297, "name": "Gaeas Vasall", "text": "Stärke und Widerstandskraft von Gaeas Vasall sind gleich der Anzahl der Wälder, die du kontrollierst. Solange Gaeas Vasall angreift, sind seine Stärke und Widerstandskraft stattdessen gleich der Anzahl der Wälder, die der verteidigende Spieler kontrolliert.\n{T}: Ein Land deiner Wahl wird zu einem Wald, bis Gaeas Vasall das Spiel verlässt.", "type": "Kreatur — Avatar"}, {"language": "Spanish", "multiverseId": 131902, "name": "Siervo de Gaia", "text": "Tanto la fuerza como la resistencia del Siervo de Gaia son iguales al número de bosques que controlas. Mientras el Siervo de Gaia esté atacando, tanto su fuerza como su resistencia son iguales al número de bosques que controla el jugador defensor.\n{T}: La tierra objetivo es un bosque hasta que el Siervo de Gaia deje el juego.", "type": "Criatura — Avatar"}, {"language": "French", "multiverseId": 131176, "name": "Noble féal de Gaia", "text": "La force et l'endurance du Noble féal de Gaia sont chacune égale au nombre de forêts que vous contrôlez. Tant que le Noble féal de Gaia attaque, sa force et son endurance sont chacune égale au nombre de forêts que le joueur défenseur contrôle à la place.\n{T} : Le terrain ciblé devient une forêt jusqu'à ce que le Noble féal de Gaia quitte le jeu.", "type": "Créature : avatar"}, {"language": "Italian", "multiverseId": 131418, "name": "Vassallo di Gea", "text": "La forza e la costituzione del Vassallo di Gea sono pari al numero di Foreste che controlli. Fintanto che il Vassallo di Gea attacca, la sua forza e la sua costituzione sono invece pari al numero di Foreste controllate dal giocatore in difesa.\n{T}: Una terra bersaglio diventa una Foresta fino a quando il Vassallo di Gea lascia il gioco.", "type": "Creatura — Avatar"}, {"language": "Japanese", "multiverseId": 131539, "name": "大地のしもべ", "text": "大地のしもべのパワーとタフネスは、それぞれあなたがコントロールする森の総数に等しい。 大地のしもべが攻撃しているかぎり、それのパワーとタフネスは、代わりにそれぞれ防御プレイヤーがコントロールする森の総数に等しい。\n{T}：土地１つを対象とする。大地のしもべが場を離れるまで、それは森になる。", "type": "クリーチャー — アバター"}, {"language": "Portuguese (Brazil)", "multiverseId": 131660, "name": "Soberano de Géia", "text": "O poder e a resistência de Soberano de Géia são iguais ao número de florestas que você controla. Enquanto Soberano de Géia estiver atacando, seu poder e resistência serão ambos iguais ao número de florestas que o jogador defensor controla.\n{T}: O terreno alvo torna-se uma Floresta até Soberano de Géia sair de jogo.", "type": "Criatura — Avatar"}, {"language": "Russian", "multiverseId": 131781, "name": "Вассал Геи", "text": "Пока Вассал Геи не атакует, его сила и защита равны количеству лесов под вашим контролем. Пока Вассал Геи атакует, его сила и защита равны количеству лесов, контролируемых защищающимся игроком.\n{T}: Целевая земля становится Лесом, пока Вассал Геи не покинет игру.", "type": "Существо — - Аватар"}, {"language": "Chinese Simplified", "multiverseId": 131055, "name": "盖亚的王侯", "text": "盖亚的王侯之力量与防御力各等同于由你操控的树林之数量。 只要盖亚的王侯进行攻击，便改为其力量与防御力各等同于由防御牌手操控的树林之数量。\n{T}：直到盖亚的王侯离场为止，目标地成为树林。", "type": "生物～圣者"}], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "121783", "cardKingdomId": "121086", "cardsphereId": "44338", "mcmId": "14098", "mtgjsonV4Id": "bfd56f4c-6ef6-5042-a4f9-de3cf0971145", "mtgoFoilId": "25970", "mtgoId": "25969", "multiverseId": "109744", "scryfallId": "3ade8d4a-6a47-4a01-9a0f-ff866055fd49", "scryfallIllustrationId": "77c8d33a-4748-43f5-8153-eb2e0ae4a722", "scryfallOracleId": "8d134a60-e1e5-4163-8bdc-36af91567185", "tcgplayerProductId": "14597"}, "isReprint": true, "isTimeshifted": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "oldschool": "Legal", "penny": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{3}{G}{G}{G}", "manaValue": 6.0, "name": "Gaea's Liege", "number": "78", "originalText": "Gaea's Liege's power and toughness are each equal to the number of Forests you control. As long as Gaea's Liege is attacking, its power and toughness are each equal to the number of Forests defending player controls instead.\n{T}: Target land becomes a Forest until Gaea's Liege leaves play.", "originalType": "Creature - Avatar", "power": "*", "printings": ["2ED", "30A", "3ED", "4BB", "4ED", "CED", "CEI", "FBB", "LEA", "LEB", "SUM", "TSB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/e73c49e9aba54789", "cardKingdomFoil": "https://mtgjson.com/links/efc12b737c271e14", "tcgplayer": "https://mtgjson.com/links/66e3201ed42f0f57"}, "rarity": "special", "rulings": [{"date": "2004-10-04", "text": "When being declared as an attacker, use the “not attacking” power and toughness. It only changes after declaration is complete."}, {"date": "2006-09-25", "text": "The activated ability doesn’t affect whether the land is basic or not. It overwrites any other land types. Being a Forest gives the affected land the ability “{T}: Add {G}.”"}, {"date": "2006-10-15", "text": "Will not add or remove the supertype snow to or from a land."}], "setCode": "TSB", "subtypes": ["Avatar"], "supertypes": [], "text": "As long as Gaea's Liege isn't attacking, its power and toughness are each equal to the number of Forests you control. As long as Gaea's Liege is attacking, its power and toughness are each equal to the number of Forests defending player controls.\n{T}: Target land becomes a Forest until Gaea's Liege leaves the battlefield.", "toughness": "*", "type": "Creature — Avatar", "types": ["Creature"], "uuid": "c6973df6-ba16-5695-b91d-3f1468f692af"}