{"artist": "Johann Bodin", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R", "U"], "colors": ["R", "U"], "convertedManaCost": 2.0, "edhrecRank": 2935, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "e6398e42-56b7-5174-944f-8370ce88afab", "mtgoId": "94076", "scryfallId": "d0853012-3fe0-4ffc-aecd-7eb84c3a8622", "scryfallIllustrationId": "51fdbece-9617-4016-92f2-54ee8b32aa47", "scryfallOracleId": "c51ed6e3-813b-49c4-b1de-7f92a77f8f6e"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Flashback"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{U}{R}", "manaValue": 2.0, "name": "Galvanic Iteration", "number": "94076", "originalReleaseDate": "2022-01-28", "printings": ["DBL", "MID", "PMID", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-09-24", "text": "If a card with flashback is put into your graveyard during your turn, you can cast it if it's legal to do so before any other player can take any actions."}, {"date": "2021-09-24", "text": "If you resolve one Galvanic Iteration after another (or cast the same one with flashback), the second Galvanic Iteration will be copied. That copy and spell each resolve, creating two delayed triggered abilities. The next spell you cast after that will be copied twice. If that spell is also a Galvanic Iteration, the following spell will be copied three times, and so on."}, {"date": "2021-09-24", "text": "Galvanic Iteration's ability will copy any instant or sorcery spell, not just one with targets."}, {"date": "2021-09-24", "text": "A copy is created even if the spell that caused Galvanic Iteration's ability to trigger has been countered by the time that ability resolves. The copy resolves before the original spell."}, {"date": "2021-09-24", "text": "The copy will have the same targets as the spell it's copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. The new targets must be legal."}, {"date": "2021-09-24", "text": "If the spell that's copied is modal (that is, it says “Choose one —” or the like), the copy will have the same mode or modes. You can't choose different ones."}, {"date": "2021-09-24", "text": "If the spell that's copied has an X whose value was determined as it was cast, the copy has the same value of X."}, {"date": "2021-09-24", "text": "You can't choose to pay any additional costs for the copy. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too."}, {"date": "2021-09-24", "text": "The copy that Galvanic Iteration's ability creates is created on the stack, so it's not “cast.” Abilities that trigger when a player casts a spell won't trigger."}, {"date": "2021-09-24", "text": "“Flashback [cost]” means “You may cast this card from your graveyard by paying [cost] rather than paying its mana cost” and “If the flashback cost was paid, exile this card instead of putting it anywhere else any time it would leave the stack.”"}, {"date": "2021-09-24", "text": "You must still follow any timing restrictions and permissions, including those based on the card's type. For instance, you can cast a sorcery using flashback only when you could normally cast a sorcery."}, {"date": "2021-09-24", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a flashback cost) you're paying, add any cost increases, then apply any cost reductions. The mana value of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2021-09-24", "text": "A spell cast using flashback will always be exiled afterward, whether it resolves, is countered, or leaves the stack in some other way."}, {"date": "2021-09-24", "text": "You can cast a spell using flashback even if it was somehow put into your graveyard without having been cast."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "When you cast your next instant or sorcery spell this turn, copy that spell. You may choose new targets for the copy.\nFlashback {1}{U}{R} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", "type": "Instant", "types": ["Instant"], "uuid": "4af16961-d177-5bdd-bede-c6249c5b8a97"}