{"artist": "Eric Deschamps", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["deck"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 6.0, "edhrecRank": 12633, "finishes": ["foil"], "foreignData": [{"language": "German", "multiverseId": 488662, "name": "Garruk, Herold der Wildnis", "text": "+1: Decke die oberste Karte deiner Bibliothek auf. Falls es eine Kreaturenkarte ist, nimm sie auf deine Hand. Lege sie sonst unter deine Bibliothek.\n−2: Eine Kreatur deiner Wahl, die du kontrollierst, fügt einer anderen Kreatur deiner Wahl Schadenspunkte in Höhe ihrer Stärke zu.\n−7: Bis zum Ende des Zuges erhalten Kreaturen, die du kontrollierst, „Du kannst diese Kreatur ihren Kampfschaden zuweisen lassen, als ob sie nicht geblockt worden wäre.\"", "type": "Legendärer Planeswalker — Garruk"}, {"language": "Spanish", "multiverseId": 488682, "name": "Garruk, heraldo salvaje", "text": "+1: Muestra la primera carta de tu biblioteca. Si es una carta de criatura, ponla en tu mano. De lo contrario, pon la carta en el fondo de tu biblioteca.\n−2: La criatura objetivo que controlas hace una cantidad de daño igual a su fuerza a otra criatura objetivo.\n−7: Hasta el final del turno, las criaturas que controlas ganan \"Puedes hacer que esta criatura haga su daño de combate como si no hubiera sido bloqueada\".", "type": "Planeswalker legendario — Garruk"}, {"language": "French", "multiverseId": 488702, "name": "Garruk, héraut sauvage", "text": "+1: Révélez la carte du dessus de votre bibliothèque. Si c'est une carte de créature, mettez-la dans votre main. Sinon, mettez-la au-dessous de votre bibliothèque.\n-2: Une créature ciblée que vous contrôlez inflige un nombre de blessures égal à sa force à une autre créature ciblée.\n-7: Jusqu'à la fin du tour, les créatures que vous contrôlez acquièrent « Vous pouvez faire que cette créature attribue ses blessures de combat comme si elle n'était pas bloquée. »", "type": "Planeswalker légendaire : Garruk"}, {"language": "Italian", "multiverseId": 488722, "name": "Garruk, Araldo Selvaggio", "text": "+1: Rivela la prima carta del tuo grimorio. Se è una carta creatura, aggiungila alla tua mano. Altrimenti, mettila in fondo al tuo grimorio.\n-2: Una creatura bersaglio che controlli infligge danno pari alla sua forza a un'altra creatura bersaglio.\n-7: Fino alla fine del turno, le creature che controlli hanno \"Puoi far assegnare a questa creatura il suo danno da combattimento come se non fosse bloccata\".", "type": "Planeswalker Leggendario — Garruk"}, {"language": "Japanese", "multiverseId": 488742, "name": "野蛮な伝令、ガラク", "text": "+1：あなたのライブラリーの一番上のカードを公開する。それがクリーチャー・カードであるなら、それをあなたの手札に加える。そうでないなら、そのカードをあなたのライブラリーの一番下に置く。\n-2：あなたがコントロールしているクリーチャー１体と、他のクリーチャー１体を対象とする。その前者はその後者に、自身のパワーに等しい点数のダメージを与える。\n-7：ターン終了時まで、あなたがコントロールしているクリーチャーは「あなたはこのクリーチャーの戦闘ダメージを、これがブロックされなかったかのように割り振ってもよい。」を得る。", "type": "伝説のプレインズウォーカー — ガラク"}, {"language": "Korean", "multiverseId": 488762, "name": "야만적인 전령, 개럭", "text": "+1: 당신의 서고 맨 위 카드를 공개한다. 그 카드가 생물 카드라면, 그 카드를 당신의 손으로 가져간다. 그렇지 않으면, 그 카드를 당신의 서고 맨 밑에 놓는다.\n−2: 당신이 조종하는 생물을 목표로 정하고 다른 생물을 목표로 정한다. 첫 번째 목표는 두 번째 목표에게 자신의 공격력만큼 피해를 입힌다.\n−7: 턴종료까지, 당신이 조종하는 생물들은 \"당신은 이 생물의 전투피해를 이 생물이 방어되지 않은 것처럼 입히게 할 수 있다.\"를 가진다.", "type": "전설적 플레인즈워커 — 개럭"}, {"language": "Portuguese (Brazil)", "multiverseId": 488782, "name": "Garruk, Arauto Selvagem", "text": "+1: Revele o card do topo de seu grimório. Se este for um card de criatura, coloque-o em sua mão. Caso contrário, coloque-o no fundo de seu grimório.\n−2: A criatura alvo que você controla causa dano igual ao seu poder a outra criatura alvo.\n−7: Até o final do turno, as criaturas que você controla ganham \"Você pode atribuir o dano de combate desta criatura como se ela não tivesse sido bloqueada\".", "type": "Planeswalker Lendário — Garruk"}, {"language": "Russian", "multiverseId": 488802, "name": "Гаррук, Первобытный Предвестник", "text": "+1: покажите верхнюю карту вашей библиотеки. Если это карта существа, положите ее в вашу руку. В противном случае положите ее в низ вашей библиотеки.\n−2: целевое существо под вашим контролем наносит повреждения, равные своей силе, другому целевому существу.\n−7: до конца хода существа под вашим контролем получают способность «Вы можете заставить это существо распределить его боевые повреждения, как если бы оно не было заблокировано».", "type": "Легендарный Planeswalker — Гаррук"}, {"language": "Chinese Simplified", "multiverseId": 488822, "name": "蛮力具现贾路", "text": "+1：展示你的牌库顶牌。如果该牌是生物牌，则将它置于你手上。若否，则将它置于你的牌库底。\n−2：目标由你操控的生物对另一个目标生物造成伤害，其数量等同于前者的力量。\n−7：直到回合结束，由你操控的生物获得「你可以让此生物如同未受阻挡地分配战斗伤害。」", "type": "传奇鹏洛客 ～贾路"}, {"language": "Chinese Traditional", "multiverseId": 488842, "name": "蠻力具現賈路", "text": "+1：展示你的牌庫頂牌。如果該牌是生物牌，則將它置於你手上。若否，則將它置於你的牌庫底。\n−2：目標由你操控的生物對另一個目標生物造成傷害，其數量等同於前者的力量。\n−7：直到回合結束，由你操控的生物獲得「你可以讓此生物如同未受阻擋地分配戰鬥傷害。」", "type": "傳奇鵬洛客 ～賈路"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "233945", "cardsphereId": "68892", "mcmId": "467934", "mtgArenaId": "72058", "mtgjsonV4Id": "e9b79453-4c5e-55a3-9da4-c024359c37fa", "mtgoId": "81191", "multiverseId": "488642", "scryfallId": "48133629-4a5b-4c91-b496-2ee94f6cbc4c", "scryfallIllustrationId": "5a7b8648-f80d-4b5a-b9e4-f924e8554997", "scryfallOracleId": "fc762e40-84c1-4762-82f7-a0fc4f6fd522", "tcgplayerProductId": "215406"}, "isStarter": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "loyalty": "5", "manaCost": "{4}{G}{G}", "manaValue": 6.0, "name": "Garruk, Savage Herald", "number": "336", "originalText": "+1: Reveal the top card of your library. If it's a creature card, put it into your hand. Otherwise, put it on the bottom of your library.\n−2: Target creature you control deals damage equal to its power to another target creature.\n−7: Until end of turn, creatures you control gain \"You may have this creature assign its combat damage as though it weren't blocked.\"", "originalType": "Legendary Planeswalker — Garruk", "printings": ["M21"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/528971c4b8aaf9fb", "tcgplayer": "https://mtgjson.com/links/fbfef0411f13f180"}, "rarity": "mythic", "rulings": [{"date": "2020-06-23", "text": "If either creature is an illegal target as Garruk's second ability tries to resolve, the creature you control won't deal damage to any creature."}, {"date": "2020-06-23", "text": "When assigning combat damage, you choose for each creature whether you want to assign its damage to the creature blocking it, or if you want to assign it to the player or planeswalker the creature is attacking. You can't split the damage assignment between them."}, {"date": "2020-06-23", "text": "Garruk's last ability affects only creatures you control at the time it resolves. Creatures you begin to control later in the turn won't gain the ability."}], "securityStamp": "oval", "setCode": "M21", "subtypes": ["Garruk"], "supertypes": ["Legendary"], "text": "[+1]: Reveal the top card of your library. If it's a creature card, put it into your hand. Otherwise, put it on the bottom of your library.\n[−2]: Target creature you control deals damage equal to its power to another target creature.\n[−7]: Until end of turn, creatures you control gain \"You may have this creature assign its combat damage as though it weren't blocked.\"", "type": "Legendary Planeswalker — Garruk", "types": ["Planeswalker"], "uuid": "193f8e09-b8ca-509c-9b4c-264e29a05cdf"}