{"artist": "Michael Bruinsma", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 6.0, "edhrecRank": 10608, "finishes": ["nonfoil", "foil"], "flavorText": "\"It's free to do whatever it wants. I've merely told it what that is.\"\n—Xorin, Architect of Will", "foreignData": [{"flavorText": "„Es kann alles tun, was es will. Ich habe ihm nur souffliert, um was es sich dabei handelt.\" —Xorin, Architekt des Willens", "language": "German", "multiverseId": 187512, "name": "Exemplare begutachten", "text": "Falls eine Kreatur in diesem Zug unter der Kontrolle eines Gegners ins Spiel kommen würde, kommt sie stattdessen unter deiner Kontrolle ins Spiel.", "type": "Spontanzauber"}, {"flavorText": "\"Es libre de hacer lo que quiera. Yo sólo le digo qué es eso.\" —Xorin, arquitecto de voluntad", "language": "Spanish", "multiverseId": 187761, "name": "Recolectar especímenes", "text": "Si una criatura fuera a entrar en juego bajo el control de un oponente este turno, en vez de eso, entra en juego bajo tu control.", "type": "Instantáneo"}, {"flavorText": "« Il est libre de faire ce qu'il veut. Je n'ai fait que lui dire ce que c'était. » —Xorin, architecte de la Volonté", "language": "French", "multiverseId": 188508, "name": "Rassembler des spécimens", "text": "Si une créature devait arriver en jeu sous le contrôle d'un adversaire ce tour-ci, elle arrive en jeu sous votre contrôle à la place.", "type": "Éphémère"}, {"flavorText": "\"E' libero di fare tutto quel che vuole. Gli ho semplicemente detto che cos'è.\" —Xorin, Architetto della Volontà", "language": "Italian", "multiverseId": 188259, "name": "Raccogliere Esemplari", "text": "Se una creatura sta per entrare in gioco sotto il controllo di un avversario in questo turno, entra invece in gioco sotto il tuo controllo.", "type": "Istantaneo"}, {"flavorText": "「やりたいことをやるのは自由さ。 単にそれがどうなるかって話をしただけで。」 ――意思切る者、ゾリン", "language": "Japanese", "multiverseId": 187014, "name": "標本集め", "text": "このターン、いずれかのクリーチャーがいずれかの対戦相手のコントロール下で場に出る場合、代わりにそれはあなたのコントロール下で場に出る。", "type": "インスタント"}, {"flavorText": "\"Ele é livre para fazer o que quiser. Eu mal lhe disse o que era isso.\" — Xorin, Arquiteto do Arbítrio", "language": "Portuguese (Brazil)", "multiverseId": 188010, "name": "Reunir Espécimes", "text": "Se uma criatura for entrar em jogo sob o controle de um oponente neste turno, em vez disso, ela entrará em jogo sob o seu controle.", "type": "Mágica Instantânea"}, {"flavorText": "«Она может делать все, что захочет. Я просто сказал ей, что именно». — Ксорин, архитектор воли", "language": "Russian", "multiverseId": 188757, "name": "Сбор Образцов", "text": "Если в этом ходу существо должно войти в игру под контролем оппонента, оно входит в игру под вашим контролем вместо этого.", "type": "Мгновенное заклинание"}, {"flavorText": "「他可以随意行事。 我只是告诉他该要些什么。」 ～构念师索林", "language": "Chinese Simplified", "multiverseId": 187263, "name": "收集样本", "text": "本回合中，如果某生物将在对手的操控下进场，则它改为在你的操控下进场。", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "125995", "cardKingdomId": "125756", "cardsphereId": "42392", "mcmId": "19809", "mcmMetaId": "10123", "mtgjsonV4Id": "fde62447-3abc-5334-a4b0-0d5b073036a5", "mtgoFoilId": "31076", "mtgoId": "31075", "multiverseId": "175011", "scryfallId": "bbadf982-f22e-4f4f-b5c9-ac387f25c15f", "scryfallIllustrationId": "c58b8f14-6c53-4cb1-9cb9-97e0fe49e570", "scryfallOracleId": "e3b8d70b-17aa-4a31-a4f9-319907d088c2", "tcgplayerProductId": "27680"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}{U}{U}", "manaValue": 6.0, "name": "Gather Specimens", "number": "45", "originalText": "If a creature would come into play under an opponent's control this turn, it comes into play under your control instead.", "originalType": "Instant", "printings": ["ALA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/4b078e7d2654e01d", "cardKingdomFoil": "https://mtgjson.com/links/43b3ed1e7a029355", "cardmarket": "https://mtgjson.com/links/fc7113ac0026ca4e", "tcgplayer": "https://mtgjson.com/links/cdde25b52af7d18e"}, "rarity": "rare", "rulings": [{"date": "2008-10-01", "text": "Gather Specimens isn’t targeted. It affects creatures that would enter the battlefield under any opponent’s control."}, {"date": "2008-10-01", "text": "Gather Specimens affects both token creatures and nontoken creatures. It affects creatures that would enter the battlefield by any means. This includes, of course, creature spells that resolve. It also includes creatures put onto the battlefield as a result of a resolving spell (such as Call of the Herd or Zombify), resolving ability (such as Verdant Force’s ability or Doomed Necromancer’s ability), cost (such as Varchild’s War-Riders’s cumulative upkeep cost), replacement effect (such as the one created by Words of Wilding), or any other means."}, {"date": "2008-10-01", "text": "If a creature spell controlled by an opponent would resolve, it resolves, but the creature enters the battlefield under your control instead of the opponent’s control. Choices made when casting that spell (such as whether it was kicked or the value of X in the spell’s cost) are remembered. Any “enters the battlefield” triggered abilities will trigger after the creature is on the battlefield under your control."}, {"date": "2008-10-01", "text": "The Gather Specimens replacement effect is applied before any other replacement effects that would also modify how the creature enters the battlefield. These are usually worded “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with.” For example, if your Gather Specimens has resolved, then the following things are true: -- If a creature with devour would enter the battlefield under an opponent's control, you choose and sacrifice your creatures as it enters the battlefield under your control. -- If Voice of All would enter the battlefield under an opponent's control, you choose a color as it enters the battlefield under your control. -- If Clone would enter the battlefield under an opponent's control, you choose which creature it copies as it enters the battlefield under your control. -- If a Wizard would enter the battlefield under an opponent's control and that player controls Sage of Fables, the Wizard will not enter the battlefield with a +1/+1 counter on it as it enters the battlefield under your control. -- If a Wizard would enter the battlefield under an opponent's control and you control Sage of Fables, the Wizard will enter the battlefield with a +1/+1 counter on it as it enters the battlefield under your control."}, {"date": "2008-10-01", "text": "Gather Specimens won’t retroactively change the control of creatures that have already enter the battlefield that turn."}, {"date": "2008-10-01", "text": "Some effects that put creatures onto the battlefield continue to affect those creatures later on. Although Gather Specimens changes whose control the creature enters the battlefield under, the rest of the effect works as normal. For example, if your opponent activates a creature card’s unearth ability and you cast Gather Specimens, that creature enters the battlefield under your control, but the rest of the unearth ability is unchanged. The creature has haste. It’s exiled at the beginning of the end step. If it would leave the battlefield, it’s exiled instead of being put anywhere else."}, {"date": "2008-10-01", "text": "If the effect that puts a creature onto the battlefield also creates a delayed triggered ability, Gather Specimens doesn’t change who controls that ability. In the unearth example above, your opponent controls the ability that exiles the creature at the beginning of the end step. On the other hand, if the effect that puts a creature onto the battlefield grants a triggered ability to the creature (with “gains” or “has”), the player who controls the creature at the time the ability triggers will be the player who controls that ability. For example, if your opponent casts Makeshift Mannequin and you cast Gather Specimens in response, the creature will return to the battlefield under your control with a mannequin counter and it will have the ability “When this creature becomes the target of a spell or ability, sacrifice it.” If the ability triggers, you’ll control it, so you’ll have to sacrifice the creature."}, {"date": "2008-10-01", "text": "If two or more players have each cast Gather Specimens during the same turn and a creature would enter the battlefield, the creature’s would-be controller (the controller of the creature spell, for example) chooses one of the applicable Gather Specimens to apply. Then the new would-be controller of the creature repeats this process among the remaining Gather Specimens, and so on, until there are no more possible Gather Specimens effects to apply."}, {"date": "2008-10-01", "text": "The above procedure means that if two opposing players have each cast Gather Specimens during the same turn and a creature would enter the battlefield under the control of one of them, it really will enter the battlefield under that player’s control. (The creature would enter the battlefield under player A’s control, so player B’s Gather Specimens affects it. Now that creature would enter the battlefield under player B’s control, so player A’s Gather Specimens affects it. Each replacement effect has now been used, so the creature will enter the battlefield under player A’s control.)"}], "setCode": "ALA", "subtypes": [], "supertypes": [], "text": "If a creature would enter the battlefield under an opponent's control this turn, it enters the battlefield under your control instead.", "type": "Instant", "types": ["Instant"], "uuid": "d1cf4186-5ccc-58ef-9b28-fa070e3bf39f"}