{"artist": "Dan Frazier", "availability": ["mtgo"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 5.0, "edhrecRank": 18218, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "8718c4a6-cbe6-5b82-af77-197d7737ab85", "mtgoFoilId": "33525", "mtgoId": "33524", "multiverseId": "201235", "scryfallId": "8ea1b001-1eb6-4bb9-b8f3-1aaea14a9a13", "scryfallIllustrationId": "37b98000-595c-4de2-8d9f-ad2d01dff7b0", "scryfallOracleId": "924ef69f-9977-439c-ace9-353b429e4be6"}, "isOnlineOnly": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "penny": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{5}", "manaValue": 5.0, "name": "Gauntlets of Chaos", "number": "196", "originalText": "{5}, Sacrifice Gauntlets of Chaos: Exchange control of target artifact, creature, or land an opponent controls and a permanent you control if they share one of those types. Destroy all Auras attached to those permanents.", "originalType": "Artifact", "printings": ["5ED", "CHR", "LEG", "ME3"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2009-10-01", "text": "As you activate the ability, the targets you choose must be two artifacts, two creatures, or two lands. As the ability resolves, both targets will be legal only if they are two artifacts, two creatures, or two lands at that time as well, though they may be a different type than they were at the time the ability was activated. For example, if the targets were a creature and an artifact creature when the ability was activated, but the first target became a noncreature artifact by the time the ability resolves, both targets will still be legal (since they’re both artifacts)."}, {"date": "2009-10-01", "text": "If one of the targets is illegal by the time the ability resolves (because the wrong player controls it, or it’s the wrong card type, or for any other reason), the exchange doesn’t happen. The target that’s still legal will remain under its controller’s control. Since the exchange doesn’t happen, no Auras are destroyed. (If both targets are illegal, the ability doesn’t resolve.)"}], "setCode": "ME3", "subtypes": [], "supertypes": [], "text": "{5}, Sacrifice Gauntlets of Chaos: Exchange control of target artifact, creature, or land you control and target permanent an opponent controls that shares one of those types with it. If those permanents are exchanged this way, destroy all Auras attached to them.", "type": "Artifact", "types": ["Artifact"], "uuid": "66911e3b-b715-5f38-bff7-da7f9edbc43e"}