{"artist": "James Paick", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 3.0, "edhrecRank": 1190, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 231166, "name": "Genesiswelle", "text": "Decke die obersten X Karten deiner Bibliothek auf. Du kannst davon eine beliebige Anzahl an bleibenden Karten mit umgewandelten Manakosten von X oder weniger ins Spiel bringen. Lege dann alle Karten, die auf diese Weise aufgedeckt wurden und nicht ins Spiel gebrcht wurden, auf deinen Friedhof.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 232660, "name": "Ola de génesis", "text": "Muestra las primeras X cartas de tu biblioteca. Puedes poner en el campo de batalla cualquier cantidad de cartas de permanente con coste de maná convertido de X o menos que se encuentren entre ellas. Luego pon en tu cementerio todas las cartas mostradas de esta manera que no fueron puestas en el campo de batalla.", "type": "Conjuro"}, {"language": "French", "multiverseId": 231913, "name": "Vague de genèse", "text": "Révélez les X cartes du dessus de votre bibliothèque. Parmi elles, vous pouvez mettre sur le champ de bataille n'importe quel nombre de cartes de permanent de coût converti de mana inférieur ou égal à X. Mettez ensuite toutes les cartes révélées de cette manière qui n'ont pas été mises sur le champ de bataille dans votre cimetière.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 232909, "name": "Flusso d'Origine", "text": "Rivela le prime X carte del tuo grimorio. Puoi mettere sul campo di battaglia un qualsiasi numero di carte permanente con costo di mana convertito pari o inferiore a X scelte tra quelle carte rivelate. Poi metti nel tuo cimitero tutte le carte rivelate in questo modo che non sono state messe sul campo di battaglia.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 231664, "name": "起源の波", "text": "あなたのライブラリーの一番上からＸ枚のカードを公開する。 あなたはその中の点数で見たマナ・コストがＸ以下であるパーマネント・カードを、望む枚数戦場に出してもよい。 その後、これにより公開されて戦場に出されなかったすべてのカードをあなたの墓地に置く。", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 230917, "name": "Onda de Gênese", "text": "Revele os primeiros X cards do topo de seu grimório. Você pode colocar qualquer número de cards de permanente com custo de mana convertido menor ou igual a X dentre eles no campo de batalha. Depois, coloque no seu cemitério todos os cards revelados dessa maneira que não foram colocados no campo de batalha.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 231415, "name": "Волна Зарождения", "text": "Покажите X верхних карт вашей библиотеки. Вы можете положить на поле битвы любое количество находящихся среди них карт перманентов с конвертированной мана-стоимостью не более X. Затем положите все показанные таким образом карты, которые не были положены на поле битвы, на ваше кладбище.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 232411, "name": "创生浪潮", "text": "展示你牌库顶的X张牌。 你可以将其中任意数量总法术力费用小于或等于X的永久物牌放进战场。 然后将所有以此法展示、且未放进战场的牌置入你的坟墓场。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 232162, "name": "創生浪潮", "text": "展示你牌庫頂的X張牌。 你可以將其中任意數量總魔法力費用小於或等於X的永久物牌放進戰場。 然後將所有以此法展示、且未放進戰場的牌置入你的墳墓場。", "type": "巫術"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "132434", "cardKingdomId": "132200", "cardsphereId": "40358", "mcmId": "242694", "mcmMetaId": "200797", "mtgjsonV4Id": "549169fa-7a3a-56ca-a0ad-fcbdc78340b0", "mtgoFoilId": "38190", "mtgoId": "38189", "multiverseId": "207882", "scryfallId": "c920236f-c3d7-421c-b021-103996da790e", "scryfallIllustrationId": "1aa2146b-6ed8-490e-91ea-484cb2ce0cd1", "scryfallOracleId": "e2487868-f386-438e-a73f-b494f6d35fac", "tcgplayerProductId": "36403"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{X}{G}{G}{G}", "manaValue": 3.0, "name": "Genesis Wave", "number": "122", "originalText": "Reveal the top X cards of your library. You may put any number of permanent cards with converted mana cost X or less from among them onto the battlefield. Then put all cards revealed this way that weren't put onto the battlefield into your graveyard.", "originalType": "Sorcery", "printings": ["IMA", "SOM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/71dbee38a67e4011", "cardKingdomFoil": "https://mtgjson.com/links/8d6fa02d464cfb9b", "cardmarket": "https://mtgjson.com/links/3dd97061c7753fdf", "tcgplayer": "https://mtgjson.com/links/6cf6fc2859f6ead5"}, "rarity": "rare", "rulings": [{"date": "2017-11-17", "text": "If you have fewer than X cards in your library, you reveal all of them."}, {"date": "2017-11-17", "text": "If a card in a player’s library has {X} in its mana cost, X is considered to be 0."}, {"date": "2017-11-17", "text": "A permanent card is an artifact, creature, enchantment, land, or planeswalker card."}, {"date": "2017-11-17", "text": "If a card in your library has no mana symbols in its upper right corner (because it’s a land card, for example), its converted mana cost is 0. Such cards can always be put onto the battlefield with Genesis Wave."}, {"date": "2017-11-17", "text": "You don’t have to put permanent cards revealed this way onto the battlefield if you choose not to, regardless of their converted mana costs."}, {"date": "2017-11-17", "text": "All of the permanents put onto the battlefield this way enter at the same time. If any have triggered abilities that trigger on something else entering the battlefield, they’ll see each other."}], "setCode": "SOM", "subtypes": [], "supertypes": [], "text": "Reveal the top X cards of your library. You may put any number of permanent cards with mana value X or less from among them onto the battlefield. Then put all cards revealed this way that weren't put onto the battlefield into your graveyard.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "e0048ebb-4e37-5d4d-8387-1739219bc677", "watermark": "mirran"}