{"artist": "Mark Poole", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 6.0, "edhrecRank": 7920, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "99346496-ba5a-5876-90cc-a5aa48277a37", "mtgoId": "70681", "scryfallId": "767ee81f-d357-49ea-b389-2f6dac0f8e97", "scryfallIllustrationId": "002787b6-9540-4568-9a24-dbd56e91db1e", "scryfallOracleId": "80e72437-0c17-44c0-b0a7-eab075a64569"}, "isOnlineOnly": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Banned", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{G}{G}", "manaValue": 6.0, "name": "Genesis Storm", "number": "70681", "originalReleaseDate": "2018-12-06", "printings": ["C18", "PZ2"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2018-07-13", "text": "If your library no longer has any nonland permanent cards, you’ll reveal your library and then put it back in a random order."}, {"date": "2018-07-13", "text": "Each copy resolves one at a time. Any abilities that trigger on the permanent entering the battlefield resolve before the next copy resolves. The original spell is the last to resolve."}, {"date": "2018-07-13", "text": "Each Storm’s triggered ability counts only how many times you’ve cast your commander from the command zone before that triggered ability resolves. If you cast your commander again later, you won’t get another copy."}, {"date": "2018-07-13", "text": "If you choose not to put the nonland permanent card you reveal onto the battlefield, you’ll put it on the bottom of your library with the other cards."}, {"date": "2018-07-13", "text": "Each Storm’s triggered ability can copy the Storm spell even if that spell is countered before that ability resolves."}, {"date": "2018-07-13", "text": "The copies are created on the stack, so they’re not “cast.” Abilities that trigger when a player casts a spell (such as the Storm’s ability itself) won’t trigger."}, {"date": "2018-07-13", "text": "If your commander was countered, that time you cast it still counts."}, {"date": "2018-10-05", "text": "If you have multiple commanders, you’ll copy this spell for each time you’ve cast either of them. For example, if you’ve cast one commander once and one twice, you’ll copy this spell three times."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": [], "supertypes": [], "text": "When you cast this spell, copy it for each time you've cast your commander from the command zone this game.\nReveal cards from the top of your library until you reveal a nonland permanent card. You may put that card onto the battlefield. Then put all cards revealed this way that weren't put onto the battlefield on the bottom of your library in a random order.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "e957a52b-758d-5f26-b9bf-12dfd66ad6a4"}