{"artist": "YW Tang", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 7.0, "edhrecRank": 6539, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 392398, "name": "Grausige Einberufung", "text": "Schicke alle Kreaturenkarten aus dem Friedhof eines Spielers deiner Wahl zusammen verdeckt ins Exil, mische sie und manifestiere dann diese Karten. (Um eine Karte zu manifestieren, bringe sie als eine 2/2 Kreatur verdeckt ins Spiel. Decke sie zu einem beliebigen Zeitpunkt für ihre Manakosten auf, falls es eine Kreaturenkarte ist.)", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 393693, "name": "Conscripción espantosa", "text": "Exilia todas las cartas de criatura del cementerio del jugador objetivo en una pila boca abajo, baraja esa pila y luego manifiesta esas cartas. (Para manifestar una carta, ponla en el campo de batalla boca abajo como una criatura 2/2. Ponla boca arriba en cualquier momento por su coste de maná si es una carta de criatura.)", "type": "Conjuro"}, {"language": "French", "multiverseId": 392583, "name": "Conscription abominable", "text": "Exilez toutes les cartes de créature du cimetière du joueur ciblé dans un tas face cachée, mélangez-le, puis manifestez ces cartes. (Pour manifester une carte, mettez-la sur le champ de bataille face cachée comme une créature 2/2. Retournez-la face visible à tout moment pour son coût de mana si c'est une carte de créature.)", "type": "Rituel"}, {"language": "Italian", "multiverseId": 392768, "name": "Coscrizione Spettrale", "text": "Esilia tutte le carte creatura dal cimitero di un giocatore bersaglio in una pila a faccia in giù, rimescola quella pila, poi manifesta quelle carte. (Per manifestare una carta, mettila sul campo di battaglia a faccia in giù come una creatura 2/2. Se è una carta creatura, girala a faccia in su in qualsiasi momento pagando il suo costo di mana.)", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 392953, "name": "恐ろしい徴兵", "text": "プレイヤー１人を対象とし、そのプレイヤーの墓地にあるすべてのクリーチャー・カードを裏向きの束にして追放し、その束を切り直してからそれらのカードを予示する。（カードを予示するには、それを裏向きの状態で２/２クリーチャーとして戦場に出す。それがクリーチャー・カードであるなら、そのマナ・コストで、いつでも表向きにしてよい。）", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 393138, "name": "무시무시한 징집", "text": "플레이어를 목표로 정한다. 그 플레이어의 무덤에 있는 모든 생물 카드를 뒷면 상태로 추방해 서로 섞은 다음 그 카드들을 구현화한다. (카드를 구현화하려면 해당 카드를 뒷면 상태의 2/2 생물로 전장에 내려놓는다. 그 카드가 생물 카드라면 언제든 마나 비용을 지불하고 앞면 상태로 뒤집을 수 있다.)", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 393323, "name": "Conscrição Fantasmal", "text": "Exile todos os cards de criatura do cemitério do jogador alvo em um monte voltado para baixo, embaralhe-os e depois, manifeste-os. (Para manifestar um card, coloque-o no campo de batalha com a face voltada para baixo como uma criatura 2/2. Volte sua face para cima a qualquer momento pagando seu custo de mana se for um card de criatura.)", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 393508, "name": "Кошмарный Призыв", "text": "Изгоните все карты существ из кладбища целевого игрока в стопку карт рубашкой вверх, перетасуйте ту стопку, затем воплотите те карты. (Чтобы воплотить карту, положите ее на поле битвы рубашкой вверх как существо 2/2. Если это карта существа, вы в любой момент можете перевернуть ее рубашкой вниз, оплатив ее мана-стоимость.)", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 392028, "name": "骇怖征召", "text": "放逐目标牌手坟墓场中的所有生物牌并牌面朝下地放作一堆，将该堆牌洗牌，然后显化这些牌。（显化某张牌的流程是，将该牌面朝下地放进战场，当成2/2生物。如果该牌是生物牌，则可随时支付其法术力费用使其翻回正面。）", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 392213, "name": "駭怖徵召", "text": "放逐目標玩家墳墓場中的所有生物牌並牌面朝下地放作一堆，將該堆牌洗牌，然後顯化這些牌。（顯化某張牌的流程是，將該牌面朝下地放進戰場，當成2/2生物。如果該牌是生物牌，則可隨時支付其魔法力費用使其翻回正面。）", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "198928", "cardKingdomId": "198606", "cardsphereId": "17822", "mcmId": "271593", "mcmMetaId": "210771", "mtgjsonV4Id": "b6bab0e3-af16-56bf-a998-ae5d584ef61c", "mtgoFoilId": "55371", "mtgoId": "55370", "multiverseId": "391843", "scryfallId": "120f7d4a-27b3-43e8-a301-c81d4d403a8f", "scryfallIllustrationId": "092c6171-366f-4aaa-985f-4eecc1c251e2", "scryfallOracleId": "3bf20e68-0e19-4242-bfba-a8a1bb244685", "tcgplayerProductId": "95355"}, "keywords": ["Manifest"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{5}{B}{B}", "manaValue": 7.0, "name": "Ghastly Conscription", "number": "70", "originalText": "Exile all creature cards from target player's graveyard in a face-down pile, shuffle that pile, then manifest those cards. (To manifest a card, put it onto the battlefield face down as a 2/2 creature. Turn it face up any time for its mana cost if it's a creature card.)", "originalType": "Sorcery", "printings": ["C16", "C19", "FRF"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/cda4e170674af7d1", "cardKingdomFoil": "https://mtgjson.com/links/455f02a4744ec2a4", "cardmarket": "https://mtgjson.com/links/8171c61b97c619cc", "tcgplayer": "https://mtgjson.com/links/a57d128c68309fef"}, "rarity": "mythic", "rulings": [{"date": "2014-11-24", "text": "The pile is shuffled to disguise from your opponents which manifested creature is which. After you manifest the cards, you can look at them."}, {"date": "2014-11-24", "text": "If you manifest a card owned by an opponent and you leave the game, that card is exiled."}, {"date": "2014-11-24", "text": "The face-down permanent is a 2/2 creature with no name, mana cost, creature types, or abilities. It’s colorless and has a converted mana cost of 0. Other effects that apply to the permanent can still grant or change any of these characteristics."}, {"date": "2014-11-24", "text": "Any time you have priority, you may turn a manifested creature face up by revealing that it’s a creature card (ignoring any copy effects or type-changing effects that might be applying to it) and paying its mana cost. This is a special action. It doesn’t use the stack and can’t be responded to."}, {"date": "2014-11-24", "text": "If a manifested creature would have morph if it were face up, you may also turn it face up by paying its morph cost."}, {"date": "2014-11-24", "text": "Unlike a face-down creature that was cast using the morph ability, a manifested creature may still be turned face up after it loses its abilities if it’s a creature card."}, {"date": "2014-11-24", "text": "Because the permanent is on the battlefield both before and after it’s turned face up, turning a permanent face up doesn’t cause any enters-the-battlefield abilities to trigger."}, {"date": "2014-11-24", "text": "Because face-down creatures don’t have names, they can’t have the same name as any other creature, even another face-down creature."}, {"date": "2014-11-24", "text": "A permanent that turns face up or face down changes characteristics but is otherwise the same permanent. Spells and abilities that were targeting that permanent, as well as Auras and Equipment that were attached to the permanent, aren’t affected."}, {"date": "2014-11-24", "text": "Turning a permanent face up or face down doesn’t change whether that permanent is tapped or untapped."}, {"date": "2014-11-24", "text": "At any time, you can look at a face-down permanent you control. You can’t look at face-down permanents you don’t control unless an effect allows you to or instructs you to."}, {"date": "2014-11-24", "text": "If a face-down permanent you control leaves the battlefield, you must reveal it. You must also reveal all face-down spells and permanents you control if you leave the game or if the game ends."}, {"date": "2014-11-24", "text": "You must ensure that your face-down spells and permanents can easily be differentiated from each other. You’re not allowed to mix up the cards that represent them on the battlefield in order to confuse other players. The order they entered the battlefield should remain clear. Common methods for indicating this include using markers or dice, or simply placing them in order on the battlefield. You must also track how each became face down (manifested, cast face down using the morph ability, and so on)."}, {"date": "2014-11-24", "text": "There are no cards in the Fate Reforged set that would turn a face-down instant or sorcery card on the battlefield face up, but some older cards can try to do this. If something tries to turn a face-down instant or sorcery card on the battlefield face up, reveal that card to show all players it’s an instant or sorcery card. The permanent remains on the battlefield face down. Abilities that trigger when a permanent turns face up won’t trigger, because even though you revealed the card, it never turned face up."}, {"date": "2014-11-24", "text": "Some older Magic sets feature double-faced cards, which have a Magic card face on each side rather than a Magic card face on one side and a Magic card back on the other. The rules for double-faced cards are changing slightly to account for the possibility that they are manifested. If a double-faced card is manifested, it will be put onto the battlefield face down. While face down, it can’t transform. If the front face of the card is a creature card, you can turn it face up by paying its mana cost. If you do, its front face will be up. A double-faced permanent on the battlefield still can’t be turned face down."}], "securityStamp": "oval", "setCode": "FRF", "subtypes": [], "supertypes": [], "text": "Exile all creature cards from target player's graveyard in a face-down pile, shuffle that pile, then manifest those cards. (To manifest a card, put it onto the battlefield face down as a 2/2 creature. Turn it face up any time for its mana cost if it's a creature card.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "0fbb9101-a4b5-588f-851b-0b842be73175"}