{"artist": "Ryan Yee", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 9420, "finishes": ["nonfoil"], "foreignData": [], "frameEffects": ["nyxtouched"], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "230357", "cardsphereId": "63849", "mcmId": "415931", "mcmMetaId": "209366", "mtgjsonV4Id": "33bfc30b-813c-501b-b856-cf7e9ee66910", "scryfallId": "fa9701d9-da46-4af6-8b84-09546a718afe", "scryfallIllustrationId": "bcedfa17-00bb-4121-8646-f1f1eab9c0b5", "scryfallOracleId": "78a1f291-22ed-41f1-87fd-0bdc97f9c065", "tcgplayerProductId": "203097"}, "isReprint": true, "keywords": ["Bestow", "Double strike"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}", "manaValue": 3.0, "name": "Ghostblade Eidolon", "number": "117", "power": "1", "printings": ["BNG", "C15", "MB1"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/8327cf1591671fbb", "cardmarket": "https://mtgjson.com/links/ca8e7bb089bfd325", "tcgplayer": "https://mtgjson.com/links/406af626805ed175"}, "rarity": "uncommon", "rulings": [{"date": "2013-09-15", "text": "You don’t choose whether the spell is going to be an Aura spell or not until the spell is already on the stack. Abilities that affect when you can cast a spell, such as flash, will apply to the spell after you’ve made this choice. For example, an effect that said you can cast creature spells as though they have flash won’t allow you to cast a creature card with bestow as an Aura spell anytime you could cast an instant, but one that said you can cast Aura spells as though they have flash will."}, {"date": "2013-09-15", "text": "On the stack, a spell with bestow is either a creature spell or an Aura spell. It’s never both, although it’s an enchantment spell in either case."}, {"date": "2013-09-15", "text": "Unlike other Aura spells, an Aura spell with bestow isn’t countered if its target is illegal as it begins to resolve. Rather, the effect making it an Aura spell ends, it loses enchant creature, it returns to being an enchantment creature spell, and it resolves and enters the battlefield as an enchantment creature."}, {"date": "2013-09-15", "text": "Unlike other Auras, an Aura with bestow isn’t put into its owner’s graveyard if it becomes unattached. Rather, the effect making it an Aura ends, it loses enchant creature, and it remains on the battlefield as an enchantment creature. It can attack (and its {T} abilities can be activated, if it has any) on the turn it becomes unattached if it’s been under your control continuously, even as an Aura, since your most recent turn began."}, {"date": "2013-09-15", "text": "If a permanent with bestow enters the battlefield by any method other than being cast, it will be an enchantment creature. You can’t choose to pay the bestow cost and have it become an Aura."}, {"date": "2013-09-15", "text": "Auras attached to a creature don’t become tapped when the creature becomes tapped. Except in some rare cases, an Aura with bestow remains untapped when it becomes unattached and becomes a creature."}, {"date": "2013-09-15", "text": "An Aura that becomes a creature is no longer put into its owner’s graveyard as a state-based action. Rather, it becomes unattached and remains on the battlefield as long as it’s a creature. While it’s a creature, it can’t be attached to another permanent or player. An Aura that’s not attached to a legal permanent or player as defined by its enchant ability and also isn’t a creature will be put into its owner’s graveyard as a state-based action."}], "setCode": "MB1", "subtypes": ["Spirit"], "supertypes": [], "text": "Bestow {5}{W} (If you cast this card for its bestow cost, it's an Aura spell with enchant creature. It becomes a creature again if it's not attached to a creature.)\nDouble strike (This creature deals both first-strike and regular combat damage.)\nEnchanted creature gets +1/+1 and has double strike.", "toughness": "1", "type": "Enchantment Creature — Spirit", "types": ["Enchantment", "Creature"], "uuid": "65f9c736-1745-5b0b-8924-88a73ac9ac16"}