{"artist": "Kev Walker", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 7.0, "edhrecRank": 19805, "finishes": ["nonfoil", "foil"], "flavorText": "\"Ma said we should offer up blini-cakes and salt to the good ones, but I get that chill up my spine and just shut the door.\"\n—Otak, Tin Street shopkeep", "foreignData": [{"flavorText": "„Mama sagte, wir sollten den Guten immer Blini-Kuchen und Salz anbieten, aber wenn es mir kalt den Rücken herunterläuft, mache ich lieber schnell die Tür zu.\" —Otak, Händler an der Zinnstraße", "language": "German", "multiverseId": 111697, "name": "Geister der Unschuldigen", "text": "Falls eine Quelle einer Kreatur oder einem Spieler Schadenspunkte zufügen würde, fügt sie dieser Kreatur oder diesem Spieler stattdessen halb so viele Schadenspunkte (abgerundet) zu.", "type": "Kreatur — Geist"}, {"flavorText": "\"Mamá dice que deberíamos ofrecerles pasteles y sal a los buenos, pero me dan escalofríos y simplemente cierro la puerta.\" —Otak, comerciante de la Calle Hojalata", "language": "Spanish", "multiverseId": 113227, "name": "Fantasmas de los inocentes", "text": "Si una fuente fuera a hacer daño a una criatura o jugador, en vez de eso, hace la mitad del daño, redondeado hacia abajo, a esa criatura o jugador.", "type": "Criatura — Espíritu"}, {"flavorText": "« Maman disait qu'on devait offrir du sel et des blinis aux bons esprits, mais à chaque fois, j'ai un frisson qui me remonte dans le dos et je verrouille ma porte. » —Otak, commerçant de la rue d'étain", "language": "French", "multiverseId": 112003, "name": "Fantômes des innocents", "text": "Si une source devait infliger des blessures à une créature ou un joueur, elle inflige à la place la moitié de ces blessures, arrondie à l'unité inférieure, à cette créature ou à ce joueur.", "type": "Créature : esprit"}, {"flavorText": "\"Mamma ha detto che avremmo dovuto offrire torte blini e sale a quelli buoni, ma un brivido mi ha percorso la schiena e ho chiuso a chiave la porta.\" —Otak, negoziante di Via Latta", "language": "Italian", "multiverseId": 112309, "name": "Spettri degli Innocenti", "text": "Se una fonte sta per infliggere danno a una creatura o a un giocatore, invece quella fonte infligge la metà di quel danno, arrotondata per difetto, a quella creatura o a quel giocatore.", "type": "Creatura — Spirito"}, {"flavorText": "お袋は善霊ならブリーニ菓子と塩を捧げろって言うけど、そいつを見たときに背筋がぞくっとしたんですぐドアを閉めたね。 ――ブリキ通り市場の店主、オータック", "language": "Japanese", "multiverseId": 112615, "name": "無垢の幽霊", "text": "いずれかの発生源がクリーチャーかプレイヤーにダメージを与える場合、代わりにそれはそのクリーチャーかプレイヤーにその半分のダメージを与える（端数切り捨て）。", "type": "クリーチャー — スピリット"}, {"flavorText": "\"Mamãe disse que deveríamos oferecer panquecas e sal aos bons, mas senti um calafrio na espinha e fechei a porta.\" —Otak, comerciante da Rua do Estanho", "language": "Portuguese (Brazil)", "multiverseId": 112921, "name": "Fantasmas dos Inocentes", "text": "Se uma fonte fosse causar dano a uma criatura ou a um jogador, ao invés disso, essa fonte causará a metade daquela quantidade de pontos de dano, arredondada para baixo, à criatura ou ao jogador.", "type": "Criatura — Espírito"}, {"flavorText": "\"Матушка сказала, что мы должны встретить добрых духов хлебом-солью, но у меня прямо мороз по коже пробежал, и я просто захлопнул дверь\". —Отак, лавочник с улицы Жестянщиков", "language": "Russian", "multiverseId": 114329, "name": "Призраки невинных", "text": "Если источник должен нанести повреждения существу или игроку, вместо этого он наносит этому существу или игроку половину повреждений (округлять в меньшую сторону).", "type": "Существо — Дух"}, {"flavorText": "「妈说我们该用布理尼薄饼与盐来供奉善良灵魂，但我只觉得一阵背脊发凉，就连忙把门关上。」 ～锡街店员欧塔", "language": "Chinese Simplified", "multiverseId": 111391, "name": "无辜魂魅", "text": "若任一来源将对生物或牌手造成伤害，则改为它对该生物或牌手造成一半数量的伤害，小数点后舍去。", "type": "生物～精怪"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "118751", "cardKingdomId": "118460", "cardsphereId": "38069", "mcmId": "13401", "mcmMetaId": "7973", "mtgjsonV4Id": "24814ffa-b410-58a0-b4ab-0c7ae1c6bee0", "mtgoFoilId": "23431", "mtgoId": "23430", "multiverseId": "89042", "scryfallId": "c5b10c5f-261f-4301-b675-d1f52b859360", "scryfallIllustrationId": "26385b1c-4525-4841-95ac-52458d57899f", "scryfallOracleId": "9243bd95-5467-490d-9bd2-4d5ce1ebc589", "tcgplayerProductId": "13295"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{5}{W}{W}", "manaValue": 7.0, "name": "Ghosts of the Innocent", "number": "20", "originalText": "If a source would deal damage to a creature or player, it deals half that damage, rounded down, to that creature or player instead.", "originalType": "Creature - Spirit", "power": "4", "printings": ["RAV"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/be8ab8dbf4c34ce7", "cardKingdomFoil": "https://mtgjson.com/links/85e5a406ddbe7c23", "cardmarket": "https://mtgjson.com/links/314e379c1a74f0dc", "tcgplayer": "https://mtgjson.com/links/60342ac312cd1747"}, "rarity": "rare", "rulings": [{"date": "2005-10-01", "text": "If a damage prevention effect and Ghosts of the Innocent’s effect would apply to the same damage, the player or the controller of the creature being dealt damage may apply the effects in either order (most likely applying the halving effect first)."}, {"date": "2005-10-01", "text": "Half of 1 rounded down is 0. A source that would deal 1 damage won’t deal damage at all."}, {"date": "2005-10-01", "text": "Multiple Ghosts of the Innocent effects are cumulative, and each will halve the damage, rounded down. For example, with three on the battlefield, 14 damage becomes 7, then 3, then finally 1, and only 1 damage would actually be dealt."}, {"date": "2005-10-01", "text": "This isn’t a damage prevention effect. If Excruciator (“Damage that would be dealt by Excruciator can’t be prevented”) would deal 7 damage to a permanent or player, it deals 3 damage instead."}, {"date": "2005-10-01", "text": "If damage is redirected, it’s only halved once."}, {"date": "2005-10-01", "text": "If both Ghosts of the Innocent and Furnace of Rath (which doubles damage) are on the battlefield, the controller of the permanent being dealt damage or the player being dealt damage can apply the effects in either order. This can matter if the original amount of damage is odd. For example, if a source would deal 3 damage, Ghosts of the Innocent would make it 1 damage, then Furnace of Rath would make it 2 damage, if the player chose to apply the effects in that order."}], "setCode": "RAV", "subtypes": ["Spirit"], "supertypes": [], "text": "If a source would deal damage to a permanent or player, it deals half that damage, rounded down, to that permanent or player instead.", "toughness": "5", "type": "Creature — Spirit", "types": ["Creature"], "uuid": "b3b8d0c1-14e6-55de-8e23-4065d18246f5"}