{"artist": "David Rapoza", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 7228, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "270324", "mcmId": "686432", "mcmMetaId": "207100", "mtgjsonV4Id": "f3c85cb2-429e-5be5-b901-ab18ecb13c4d", "scryfallId": "f9eadb92-2a87-4b3b-90b5-f10cb1cfda0f", "scryfallIllustrationId": "86ceca10-0534-4c42-a7b1-92f3e3588f8b", "scryfallOracleId": "5843bf12-27db-4e7d-81ee-98874bea72c7", "tcgplayerProductId": "455016"}, "isReprint": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "loyalty": "4", "manaCost": "{2}{W}{W}", "manaValue": 4.0, "name": "Gideon, Champion of Justice", "number": "189", "printings": ["C21", "GTC", "J22"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7f640d76e32308ad", "cardmarket": "https://mtgjson.com/links/21fcf5c2825cf1fd", "tcgplayer": "https://mtgjson.com/links/c80d244c81977362"}, "rarity": "mythic", "rulings": [{"date": "2013-01-24", "text": "If the first ability doesn’t resolve (perhaps because the target opponent is an illegal target when the ability tries to resolve), you won’t put any additional loyalty counters on Gideon, although the loyalty counter you put on him to activate the ability will remain."}, {"date": "2013-01-24", "text": "If Gideon, Champion of Justice becomes a creature due to his second ability, that doesn’t count as having a creature enter the battlefield. Gideon was already on the battlefield; he only changed his types. Abilities that trigger whenever a creature enters the battlefield won’t trigger."}, {"date": "2013-01-24", "text": "Gideon, Champion of Justice’s power and toughness are set to the number of loyalty counters on him when his second ability resolves. They won’t change later in the turn if the number of loyalty counters on him changes."}, {"date": "2013-01-24", "text": "You put a loyalty counter on Gideon, Champion of Justice as part of the cost of activating the first ability. When that ability resolves, you count the number of creatures controlled by the target opponent and put that many additional loyalty counters on Gideon."}, {"date": "2013-01-24", "text": "Gideon, Champion of Justice’s second ability causes him to become a creature with the creature types Human and Soldier. He remains a planeswalker with the planeswalker type Gideon. (He also retains any other card types or subtypes he may have had.) Each subtype is correlated to the proper card type: Gideon is just a planeswalker type (not a creature type), and Human and Soldier are just creature types (not planeswalker types)."}, {"date": "2013-01-24", "text": "Say you activate Gideon, Champion of Justice’s second ability, and then an opponent gains control of him before combat. You may have any of your creatures attack Gideon, Champion of Justice (since he’s still a planeswalker). Then Gideon, Champion of Justice may block (since he’s a creature). He may block any eligible attacking creature, including one that’s attacking him! During combat, he behaves as an attacked planeswalker and/or a blocking creature, as appropriate. For example, he deals combat damage to any creatures he’s blocking, but he doesn’t deal combat damage to any unblocked creatures that are attacking him."}, {"date": "2013-01-24", "text": "If Gideon, Champion of Justice becomes a creature the same turn he enters the battlefield, you can’t attack with him or use any of his {T} abilities (if he gains any)."}, {"date": "2013-07-01", "text": "If damage that can’t be prevented is dealt to Gideon, Champion of Justice after his second ability has resolved, that damage will have all applicable results: specifically, the damage is marked on Gideon (since he’s a creature) and that damage causes that many loyalty counters to be removed from him (since he’s a planeswalker). Even though he has indestructible, if Gideon, Champion of Justice has no loyalty counters on him, he’s put into his owner’s graveyard as a state-based action."}], "securityStamp": "oval", "setCode": "J22", "subtypes": ["Gideon"], "supertypes": ["Legendary"], "text": "[+1]: Put a loyalty counter on Gideon, Champion of Justice for each creature target opponent controls.\n[0]: Until end of turn, Gideon, Champion of Justice becomes a Human Soldier creature with power and toughness each equal to the number of loyalty counters on him and gains indestructible. He's still a planeswalker. Prevent all damage that would be dealt to him this turn.\n[−15]: Exile all other permanents.", "type": "Legendary Planeswalker — Gideon", "types": ["Planeswalker"], "uuid": "34cef839-95bb-5454-8fbf-3d826e18fdf9"}