{"artist": "Kieran Yanner", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["deck"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 6.0, "edhrecRank": 11057, "finishes": ["foil"], "foreignData": [{"language": "German", "multiverseId": 463843, "name": "Gideon der Eidgebundene", "text": "Immer wenn du mit zwei oder mehr Nicht-Gideon-Kreaturen angreifst, lege auf jede von ihnen eine +1/+1-Marke.\n+2: Bis zum Ende des Zuges wird Gideon der Eidgebundene eine 5/5 weiße Soldat-Kreatur, die immer noch ein Planeswalker ist. Verhindere allen Schaden, der ihm in diesem Zug zugefügt würde. (Er kann nicht angreifen, falls er in diesem Zug gewirkt wurde.)\n−9: Schicke Gideon den Eidgebundenen und alle Kreaturen, die deine Gegner kontrollieren, ins Exil.", "type": "Legendärer Planeswalker — Gideon"}, {"language": "Spanish", "multiverseId": 463854, "name": "Gideon, caballero jurado", "text": "Siempre que ataques con dos o más criaturas que no sean Gideon, pon un contador +1/+1 sobre cada una de esas criaturas.\n+2: Hasta el final del turno, Gideon, caballero jurado es una criatura Soldado blanca 5/5 que sigue siendo un planeswalker. Prevén todo el daño que se le fuera a hacer este turno. (No puede atacar si fue lanzado este turno.)\n−9: Exilia a Gideon, caballero jurado y cada criatura que controlan tus oponentes.", "type": "Planeswalker legendario — Gideon"}, {"language": "French", "multiverseId": 463865, "name": "Gideon, l'assermenté", "text": "À chaque fois que vous attaquez avec au moins deux créatures non-Gideon, mettez un marqueur +1/+1 sur chacune de ces créatures.\n+2 : Jusqu'à la fin du tour, Gideon, l'assermenté devient une créature 5/5 blanche Soldat qui est toujours un planeswalker. Prévenez toutes les blessures qui devraient lui être infligées ce tour-ci. (Il ne peut pas attaquer s'il a été lancé ce tour-ci.)\n-9 : Exilez Gideon, l'assermenté et chaque créature que vos adversaires contrôlent.", "type": "Planeswalker légendaire : Gideon"}, {"language": "Italian", "multiverseId": 463876, "name": "Gideon, Vincolato dal Giuramento", "text": "Ogniqualvolta attacchi con due o più creature non Gideon, metti un segnalino +1/+1 su ognuna di quelle creature.\n+2: Fino alla fine del turno, Gideon, Vincolato dal Giuramento diventa una creatura Soldato 5/5 bianca che è ancora un planeswalker. Previeni tutto il danno che gli verrebbe inflitto in questo turno. (Non può attaccare se è stato lanciato in questo turno.)\n-9: Esilia Gideon, Vincolato dal Giuramento e ogni creatura controllata dai tuoi avversari.", "type": "Planeswalker Leggendario — Gideon"}, {"language": "Japanese", "multiverseId": 463887, "name": "誓いを立てた者、ギデオン", "text": "あなたがギデオンでないクリーチャー２体以上で攻撃するたび、それらのクリーチャーの上に＋１/＋１カウンターをそれぞれ１個置く。\n+2：ターン終了時まで、誓いを立てた者、ギデオンは白の５/５の兵士・クリーチャーになる。これはプレインズウォーカーでもある。このターン、これに与えられるダメージをすべて軽減する。（これがこのターンに唱えられたなら、通常これでは攻撃できない。）\n-9：誓いを立てた者、ギデオンと対戦相手がコントロールしている各クリーチャーを追放する。", "type": "伝説のプレインズウォーカー — ギデオン"}, {"language": "Korean", "multiverseId": 463898, "name": "맹세한 자, 기디온", "text": "당신이 기디온이 아닌 생물 두 개 이상으로 공격할 때마다, 그 생물들에 각각 +1/+1 카운터를 한 개씩 올려놓는다.\n+2: 턴종료까지, 맹세한 자, 기디온은 여전히 플레인즈워커인 5/5 인간 병사 생물이 된다. 이번 턴에 기디온이 입으려고 하는 모든 피해를 방지한다. (기디온이 이번 턴에 발동되었다면 기디온은 공격할 수 없다.)\n−9: 맹세한 자, 기디온과 당신의 상대들이 조종하는 각 생물을 추방한다.", "type": "전설적 플레인즈워커 — 기디온"}, {"language": "Portuguese (Brazil)", "multiverseId": 463909, "name": "Gideon, o Jurado", "text": "Toda vez que você atacar com duas ou mais criaturas que não sejam Gideon, coloque um marcador +1/+1 em cada uma daquelas criaturas.\n+2: Até o final do turno, Gideon, o Jurado, torna-se uma criatura branca 5/5 do tipo Soldado que ainda é um planeswalker. Previna todo o dano que seria causado a ele neste turno. (Ele não pode atacar se tiver sido conjurado neste turno.)\n−9: Exile Gideon, o Jurado, e cada criatura que seus oponentes controlam.", "type": "Planeswalker Lendário — Gideon"}, {"language": "Russian", "multiverseId": 463920, "name": "Гидеон, Поклявшийся", "text": "Каждый раз, когда вы атакуете двумя или более не являющимися Гидеоном существами, положите по одному жетону +1/+1 на каждое из тех существ.\n+2: до конца хода Гидеон, Поклявшийся становится существом 5/5 белый Солдат, которое остается planeswalker-ом. Предотвратите все повреждения, которые должны быть нанесены ему в этом ходу. (Он не может атаковать, если был разыгран в этом ходу.)\n—9: изгоните Гидеона, Поклявшегося и каждое существо под контролем ваших оппонентов.", "type": "Легендарный Planeswalker — Гидеон"}, {"language": "Chinese Simplified", "multiverseId": 463931, "name": "守誓卫士基定", "text": "每当你以两个或更多非基定的生物攻击时，在这些生物上各放置一个+1/+1指示物。\n+2：直到回合结束，守誓卫士基定成为5/5士兵生物，且仍然是鹏洛客。防止本回合中将对他造成的所有伤害。（他于刚被施放的当回合中不能攻击。）\n−9：放逐守誓卫士基定和所有由对手操控的生物。", "type": "传奇鹏洛客 ～基定"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "224236", "cardsphereId": "59235", "mcmId": "372192", "mtgArenaId": "69716", "mtgjsonV4Id": "eed5e204-aa62-50b8-a123-4eeb8a92da14", "mtgoId": "72172", "multiverseId": "463832", "scryfallId": "43e7331d-98b8-420f-a346-3f3521c3b258", "scryfallIllustrationId": "6208ae1a-57d1-480c-a655-de0a63f58484", "scryfallOracleId": "19a81aa7-823b-43fa-abc2-b2700a122bc1", "tcgplayerProductId": "188505"}, "isStarter": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "loyalty": "4", "manaCost": "{4}{W}{W}", "manaValue": 6.0, "name": "Gideon, the Oathsworn", "number": "265", "originalText": "Whenever you attack with two or more non-Gideon creatures, put a +1/+1 counter on each of those creatures.\n+2: Until end of turn, Gideon, the Oathsworn becomes a 5/5 white Soldier creature that's still a planeswalker. Prevent all damage that would be dealt to him this turn. (He can't attack if he was cast this turn.)\n−9: Exile Gideon, the Oathsworn and each creature your opponents control.", "originalType": "Legendary Planeswalker — Gideon", "printings": ["WAR"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/14fcf0184de8d9c4", "tcgplayer": "https://mtgjson.com/links/940c2cb1a19c2f82"}, "rarity": "mythic", "rulings": [{"date": "2019-05-03", "text": "A non-Gideon creature is a creature that isn’t also a Gideon planeswalker. For example, Gideon’s Company is a non-Gideon creature."}, {"date": "2019-05-03", "text": "Any attacking Gideon creatures won’t get a +1/+1 counter, but as long as two or more attacking creatures aren’t Gideons, those attacking creatures each get a +1/+1 counter."}, {"date": "2019-05-03", "text": "Gideon’s first loyalty ability doesn’t count as a creature entering the battlefield. Gideon was already on the battlefield; he only changed his types."}, {"date": "2019-05-03", "text": "If Gideon becomes a creature the same turn he enters the battlefield, you can’t attack with him or use any of his {T} abilities (if he gains any)."}, {"date": "2019-05-03", "text": "Gideon’s first loyalty ability causes him to become a creature with the creature type Soldier. He remains a planeswalker with the planeswalker type Gideon. (He also retains any other card types or subtypes he may have had.) Each subtype is correlated to the proper card type: planeswalker is only a type (not a creature type), and Soldier is just a creature type (not a planeswalker type)."}, {"date": "2019-05-03", "text": "If damage that can’t be prevented is dealt to Gideon after his first loyalty ability has resolved, that damage will have all applicable results: specifically, the damage is marked on Gideon (since he’s a creature) and that damage causes that many loyalty counters to be removed from him (since he’s a planeswalker). Even though he’s also a creature, if Gideon has no loyalty counters on him, he’s put into his owner’s graveyard."}, {"date": "2019-05-03", "text": "If Gideon has 9 loyalty as you activate his last ability, he’ll be put into your graveyard and won’t be exiled."}], "securityStamp": "oval", "setCode": "WAR", "subtypes": ["Gideon"], "supertypes": ["Legendary"], "text": "Whenever you attack with two or more non-Gideon creatures, put a +1/+1 counter on each of those creatures.\n[+2]: Until end of turn, Gideon, the Oathsworn becomes a 5/5 white Soldier creature that's still a planeswalker. Prevent all damage that would be dealt to him this turn. (He can't attack if he was cast this turn.)\n[−9]: Exile Gideon, the Oathsworn and each creature your opponents control.", "type": "Legendary Planeswalker — Gideon", "types": ["Planeswalker"], "uuid": "afa65aca-d3c0-5ec5-a3ab-ae8e45d858c9"}