{"artist": "Terese Nielsen", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 5971, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "220727", "cardsphereId": "56434", "mcmId": "360898", "mtgjsonV4Id": "0a8cb342-6877-5d13-89e4-6246ee55c022", "scryfallId": "08a4a849-47a5-45eb-88ec-5cda0ba95306", "scryfallIllustrationId": "b107d4d0-6093-4ff5-a457-98a1056d4492", "scryfallOracleId": "a9bbaad7-c016-4908-a6a7-2c26112a6bf6", "tcgplayerProductId": "170789"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "loyalty": "3", "manaCost": "{1}{W}{W}", "manaValue": 3.0, "name": "Gideon of the Trials", "number": "14", "printings": ["AKH", "AKR", "PAKH", "PRM", "PS17", "PS18"], "promoTypes": ["convention"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/18b4533d80f8cc5e", "tcgplayer": "https://mtgjson.com/links/4e83709291ef9b02"}, "rarity": "mythic", "rulings": [{"date": "2017-04-18", "text": "Gideon’s first ability will continue to prevent damage dealt by the target permanent even if Gideon leaves the battlefield before your next turn."}, {"date": "2017-04-18", "text": "Gideon’s second ability doesn’t count as a creature entering the battlefield. Gideon was already on the battlefield; he only changed his types."}, {"date": "2017-04-18", "text": "If Gideon becomes a creature the same turn he enters the battlefield, you can’t attack with him or use any of his {T} abilities (if he gains any)."}, {"date": "2017-04-18", "text": "Gideon’s second ability causes him to become a creature with the creature types Human and Soldier. He remains a planeswalker with the planeswalker type Gideon. (He also retains any other card types or subtypes he may have had.) Each subtype is correlated to the proper card type: planeswalker is only a type (not a creature type), and Human and Soldier are just creature types (not planeswalker types)."}, {"date": "2017-04-18", "text": "If damage that can’t be prevented is dealt to Gideon after his second ability has resolved, that damage will have all applicable results: specifically, the damage is marked on Gideon (since he’s a creature) and that damage causes that many loyalty counters to be removed from him (since he’s a planeswalker). Even though he has indestructible, if Gideon has no loyalty counters on him, he’s put into his owner’s graveyard."}, {"date": "2017-04-18", "text": "If Gideon leaves the battlefield after giving you his emblem, you’ll keep the emblem. Its effect will apply again later if another Gideon comes under your control."}, {"date": "2017-04-18", "text": "No game effect can cause you to lose the game or cause any opponent to win the game while Gideon’s emblem is in effect. It doesn’t matter whether you have 0 or less life, you’re forced to draw a card while your library is empty, you have ten or more poison counters, you’re at your Glorious End, your opponent casts a second Approach of the Second Sun, or so on. You keep playing."}, {"date": "2017-04-18", "text": "Other circumstances can still cause you to lose the game. You will lose a game if you concede, if you’re penalized with a Game Loss or a Match Loss during a sanctioned tournament due to a DCI rules infraction, or if your Magic Online® game clock runs out of time."}, {"date": "2017-04-18", "text": "If you have Gideon’s emblem in a Two-Headed Giant game and control a Gideon planeswalker, your team can’t lose the game and the opposing team can’t win the game. If your teammate controls a Gideon planeswalker but you do not, your emblem’s effect doesn’t apply."}], "securityStamp": "oval", "setCode": "PS18", "subtypes": ["Gideon"], "supertypes": ["Legendary"], "text": "[+1]: Until your next turn, prevent all damage target permanent would deal.\n[0]: Until end of turn, Gideon of the Trials becomes a 4/4 Human Soldier creature with indestructible that's still a planeswalker. Prevent all damage that would be dealt to him this turn.\n[0]: You get an emblem with \"As long as you control a Gideon planeswalker, you can't lose the game and your opponents can't win the game.\"", "type": "Legendary Planeswalker — Gideon", "types": ["Planeswalker"], "uuid": "8dca7129-0b5e-59ed-bc3c-94bed6a0b1eb"}