{"artist": "Aleksi Briclot", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 5.0, "edhrecRank": 7583, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "225022", "cardKingdomId": "225014", "cardsphereId": "60970", "mcmId": "372929", "mcmMetaId": "11140", "mtgjsonV4Id": "4b6a406c-8700-57bf-9f6c-e62fdaaeb62a", "multiverseId": "470539", "scryfallId": "8532d72a-b2d2-49e1-85ea-35f4c91c6c8d", "scryfallIllustrationId": "d67bd516-d6f4-466d-8275-7a8c42b49637", "scryfallOracleId": "7340dbcb-4b26-4038-be8c-a89e76294221", "tcgplayerProductId": "188991"}, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "loyalty": "6", "manaCost": "{3}{W}{W}", "manaValue": 5.0, "name": "Gideon Jura", "number": "1", "originalText": "+2: During target opponent's next turn, creatures that player controls attack Gideon Jura if able.\n−2: Destroy target tapped creature.\n0: Until end of turn, Gideon Jura becomes a 6/6 Human Soldier creature that's still a planeswalker. Prevent all damage that would be dealt to him this turn.", "originalType": "Legendary Planeswalker — Gideon", "printings": ["E01", "M12", "MB1", "PRM", "ROE", "SCD", "SS2"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/69b21cf25cff259e", "cardKingdomFoil": "https://mtgjson.com/links/9ad5c79b23d1ab85", "cardmarket": "https://mtgjson.com/links/5a741fc42cd1742f", "tcgplayer": "https://mtgjson.com/links/cbcca462fc160002"}, "rarity": "mythic", "rulings": [{"date": "2010-06-15", "text": "Gideon Jura’s first ability causes creatures to attack him if able. If, during the affected player’s declare attackers step, a creature they control is tapped, is affected by a spell or ability that says it can’t attack, or is affected by “summoning sickness,” then that creature doesn’t attack. If there’s a cost associated with having a creature attack, the player isn’t forced to pay that cost, so the creature doesn’t have to attack in that case either."}, {"date": "2010-06-15", "text": "If a creature controlled by the affected player can’t attack Gideon Jura (because he’s no longer on the battlefield, for example), that player may have it attack you, another one of your planeswalkers, or nothing at all."}, {"date": "2010-06-15", "text": "Gideon Jura’s first ability applies during each combat phase of the affected player’s next turn (as opposed to applying during the affected player’s next combat phase). The distinction is relevant if there are no combat phases during that turn (due to Fatespinner’s effect, for example) or there are multiples (due to World at War, for example)."}, {"date": "2010-06-15", "text": "If Gideon Jura becomes a creature due to his third ability, that doesn’t count as having a creature enter the battlefield. Gideon Jura was already on the battlefield; he only changed his types. Abilities that trigger whenever a creature enters the battlefield won’t trigger."}, {"date": "2010-06-15", "text": "Gideon Jura’s first ability doesn’t lock in what it applies to. That’s because the effect states a true thing about a set of creatures, but doesn’t actually change the characteristics of those creatures. As a result, whatever creatures the targeted opponent controls during the declare attackers step of their next turn must attack Gideon Jura if able. This includes creatures that come under that player’s control after the ability has resolved and creatures that have lost all abilities."}, {"date": "2010-06-15", "text": "Gideon Jura’s third ability causes him to become a creature with the creature types Human Soldier. He remains a planeswalker with the planeswalker type Gideon. (He also retains any other card types or subtypes he may have had.) Each subtype is correlated to the proper card type: Gideon is just a planeswalker type (not a creature type), and Human and Soldier are just creature types (not planeswalker types)."}, {"date": "2010-06-15", "text": "If you activate Gideon Jura’s third ability and then unpreventable damage is dealt to him (due to Unstable Footing, for example), that damage has all applicable results: specifically, the damage is marked on Gideon Jura (since he’s a creature) and that damage causes that many loyalty counters to be removed from him (since he’s a planeswalker). If the total amount of damage marked on Gideon Jura is lethal damage, he’s destroyed as a state-based action. If Gideon Jura has no loyalty counters on him, he’s put into his owner’s graveyard as a state-based action."}, {"date": "2010-06-15", "text": "Say you activate Gideon Jura’s third ability, then an opponent gains control of him before combat. You may have any of your creatures attack Gideon Jura (since he’s still a planeswalker). Then Gideon Jura may block (since he’s a creature). He may block any eligible attacking creature, including one that’s attacking him! During combat, he behaves as an attacked planeswalker and/or a blocking creature, as appropriate. For example, he deals combat damage to any creatures he’s blocking, but he doesn’t deal combat damage to any unblocked creatures that are attacking him."}, {"date": "2010-06-15", "text": "If Gideon Jura becomes a creature, he may be affected by “summoning sickness.” You can’t attack with him or use any of his {T} abilities (if he gains any) unless he began your most recent turn on the battlefield under your control. Note that summoning sickness cares about when Gideon Jura came under your control, not when he became a creature."}, {"date": "2011-01-22", "text": "The first ability only affects the declaration of attackers. If a creature is put onto the battlefield attacking (thanks to Hero of Bladehold, Preeminent Captain, or the Ninjutsu ability, for example), that creature’s controller may choose the defending player or planeswalker that it will be attacking in the normal way."}], "securityStamp": "circle", "setCode": "SS2", "subtypes": ["Gideon"], "supertypes": ["Legendary"], "text": "[+2]: During target opponent's next turn, creatures that player controls attack Gideon Jura if able.\n[−2]: Destroy target tapped creature.\n[0]: Until end of turn, Gideon Jura becomes a 6/6 Human Soldier creature that's still a planeswalker. Prevent all damage that would be dealt to him this turn.", "type": "Legendary Planeswalker — Gideon", "types": ["Planeswalker"], "uuid": "36c5a35f-fe7d-59a7-b582-30cfecdbafaf"}