{"artist": "Kev Walker", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 6562, "finishes": ["nonfoil", "foil"], "flavorText": "\"I appreciate things that exceed expectations.\"\n—Mizzix", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "ebadf34c-e160-5cd8-9847-e968258a7012", "mtgoId": "59207", "scryfallId": "9e724bee-f49c-4637-8fc5-4991ed82375f", "scryfallIllustrationId": "9d0dba67-ffe8-4b0d-9535-779bfa89830c", "scryfallOracleId": "52fdfe4b-10a7-421d-80ea-f6c39013062b"}, "isOnlineOnly": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Gigantoplasm", "number": "27", "power": "0", "printings": ["C15", "J22", "PZ1"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2015-11-04", "text": "The activated ability Gigantoplasm gives itself becomes part of its copiable values. Unless the ability is overwritten by another copy effect, a creature that’s a copy of Gigantoplasm will have that ability."}, {"date": "2015-11-04", "text": "However, the effect of that ability isn’t copiable. That is, if Gigantoplasm is a copy of a creature with base power and toughness 2/2 and you activate its ability making it a 4/4 creature, another creature that becomes a copy of Gigantoplasm will have base power and toughness 2/2."}, {"date": "2015-11-04", "text": "Gigantoplasm copies exactly what was printed on the original creature and nothing more (unless that creature is copying something else or is a token; see below). It doesn’t copy whether that creature is tapped or untapped, whether it has any counters on it or Auras attached to it, or any non-copy effects that have changed its power, toughness, types, color, etc."}, {"date": "2015-11-04", "text": "If Gigantoplasm isn’t a creature (perhaps because it copied a land that had temporarily become a creature), you can still activate the ability “{X}: This creature has base power and toughness X/X.” However, this ability won’t have any effect, and it won’t turn Gigantoplasm into a creature."}, {"date": "2015-11-04", "text": "The activated ability overwrites all previous effects that set Gigantoplasm’s base power and/or toughness to specific values. Other effects that set its base power and/or toughness that start to apply after the ability resolves (including ones created by subsequent activations of the ability) will overwrite the effect of the ability."}, {"date": "2015-11-04", "text": "Effects that modify Gigantoplasm’s power and/or toughness, such as the effect of Giant Growth or Glorious Anthem, will apply to Gigantoplasm no matter when they started applying. The same is true for counters that affect its power and/or toughness and effects that switch its power and toughness."}, {"date": "2015-11-04", "text": "If the chosen creature has {X} in its mana cost, X is 0. The ability that Gigantoplasm gives itself doesn’t affect an {X} in its mana cost."}, {"date": "2015-11-04", "text": "If the chosen creature is copying something else (for example, if the chosen creature is another Gigantoplasm), then Gigantoplasm enters the battlefield as whatever the chosen creature was copying (plus any abilities it gained as part of the copy process, if applicable)."}, {"date": "2015-11-04", "text": "If the chosen creature is a token, Gigantoplasm copies the original characteristics of that token as stated by the effect that put the token onto the battlefield. Gigantoplasm isn’t a token, even if it’s copying one."}, {"date": "2015-11-04", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when Gigantoplasm enters the battlefield. Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities of the chosen creature will also work."}, {"date": "2015-11-04", "text": "If Gigantoplasm somehow enters the battlefield at the same time as another creature, it can’t become a copy of that creature. You may choose only a creature that’s already on the battlefield."}, {"date": "2015-11-04", "text": "You can choose not to copy anything. In that case, Gigantoplasm enters the battlefield as a 0/0 Shapeshifter creature, and is probably put into the graveyard immediately."}], "securityStamp": "oval", "setCode": "PZ1", "subtypes": ["Shapeshifter"], "supertypes": [], "text": "You may have Gigantoplasm enter the battlefield as a copy of any creature on the battlefield, except it has \"{X}: This creature has base power and toughness X/X.\"", "toughness": "0", "type": "Creature — Shapeshifter", "types": ["Creature"], "uuid": "89856390-2dff-5f39-8641-03c6bccbc529"}