{"artist": "Steve Prescott", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 3.0, "edhrecRank": 13925, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 154548, "name": "Überfall der Güldenlaubler", "text": "Bringe zwei 1/1 grüne (Elf, Krieger)-Kreaturspielsteine ins Spiel. Befehde dich mit einem Gegner. Falls du die Fehde gewinnst, erhalten diese Kreaturen bis zum Ende des Zuges Todesberührung. (Jeder Spieler in einer Fehde deckt die oberste Karte seiner Bibliothek auf und legt diese Karte dann auf oder unter seine Bibliothek. Ein Spieler gewinnt die Fehde, wenn seine Karte die höheren umgewandelten Manakosten hat. Immer wenn eine Kreatur mit Todesberührung einer Kreatur Schaden zufügt, zerstöre jene Kreatur.)", "type": "Stammes-Spontanzauber — Elf"}, {"language": "Spanish", "multiverseId": 156665, "name": "Emboscada de Hojas Doradas", "text": "Pon en juego dos fichas de criatura Guerrero Elfo verde 1/1. Enfréntate con un oponente. Si ganas, esas criaturas ganan la habilidad de toque mortal hasta el final del turno. (Cada jugador enfrentado muestra la primera carta de su biblioteca, luego pone esa carta en la parte superior o inferior. Un jugador gana si su carta tiene el mayor coste de maná convertido. Siempre que una criatura con la habilidad de toque mortal haga daño a una criatura, destruye esa criatura.)", "type": "Instantáneo tribal — Elfo"}, {"language": "French", "multiverseId": 155461, "name": "Embuscade de Feuilledor", "text": "Mettez en jeu deux jetons de créature 1/1 verte Elfe et Guerrier. Confrontez un adversaire. Si vous gagnez, ces créatures acquièrent le contact mortel jusqu'à la fin du tour. (Chaque joueur impliqué dans la confrontation révèle la carte du dessus de sa bibliothèque et met ensuite cette carte au-dessus ou au-dessous de celle-ci. Un joueur gagne si sa carte a un coût converti de mana plus élevé. À chaque fois qu'une créature avec le contact mortel inflige des blessures à une créature, détruisez la créature blessée.)", "type": "Éphémère tribal : elfe"}, {"language": "Italian", "multiverseId": 155762, "name": "Imboscata nel Foglia Dorata", "text": "Metti in gioco due pedine creatura Guerriero Elfo 1/1 verdi. Scontrati con un avversario. Se vinci, quelle creature hanno tocco letale fino alla fine del turno. (Ogni giocatore che si scontra rivela la prima carta del suo grimorio, poi la mette in cima o in fondo. Un giocatore vince se la sua carta aveva un costo di mana convertito maggiore. Ogniqualvolta una creatura con tocco letale infligge danno a una creatura, distruggi quella creatura.)", "type": "Istantaneo Tribale — Elfo"}, {"language": "Japanese", "multiverseId": 156063, "name": "光り葉の待ち伏せ", "text": "緑の１/１のエルフ・戦士・クリーチャー・トークンを２体場に出す。 いずれかの対戦相手と激突を行う。 あなたが勝った場合、それらのクリーチャーはターン終了時まで接死を得る。 （激突を行う各プレイヤーは、自分のライブラリーの一番上のカードを公開し、そのカードを一番上か一番下に置く。 自分のカードの点数で見たマナ・コストの方が大きいプレイヤーが勝つ。 接死を持つクリーチャーがいずれかのクリーチャーにダメージを与えるたび、そのクリーチャーを破壊する。）", "type": "部族インスタント — エルフ"}, {"language": "Portuguese (Brazil)", "multiverseId": 156966, "name": "Emboscada de Folha D'Ouro", "text": "Coloque em jogo duas fichas de criatura verdes 1/1 do tipo Elfo Guerreiro. Confronte um oponente. Se você vencer, aquelas criaturas ganham toque mortífero até o final do turno. (Cada jogador confrontante revela o card do topo de seu próprio grimório, e então coloca aquele card no topo ou no fundo deste. Vence o jogador que tiver o card com o maior custo de mana convertido.) Toda vez que uma criatura com toque mortífero causar dano a outra criatura, destrua aquela criatura.)", "type": "Mágica Instantânea Tribal — Elfo"}, {"language": "Russian", "multiverseId": 156364, "name": "Засада Златолесья", "text": "Положите в игру две фишки существа 1/1 зеленый Эльф Воин. Столкнитесь с оппонентом. Если вы выиграли, те существа получают Смертельное касание до конца хода. (Каждый сталкивающийся игрок показывает верхнюю карту своей библиотеки, затем кладет ту карту на верх или в низ своей библиотеки. Выигрывает тот игрок, чья карта имела большую конвертированную мана-стоимость. Каждый раз, когда существо со Смертельным касанием наносит повреждения существу, уничтожьте то существо.)", "type": "Племенное Мгновенное заклинание — Эльф"}, {"language": "Chinese Simplified", "multiverseId": 154849, "name": "金叶伏击", "text": "将两个1/1绿色的地精／战士衍生物放置进场。 与一位对手比点。 若你赢，则这些生物获得死触直到回合结束。 （参与比点的牌手各展示其牌库顶牌，然后将该牌置于牌库顶部或底部。 所展示的牌之总法术力费用比较高的牌手赢得比点。 每当此生物对任一生物造成伤害时，消灭后者。）", "type": "部族瞬间～地精"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "124057", "cardKingdomId": "123713", "cardsphereId": "25326", "mcmId": "17955", "mcmMetaId": "9325", "mtgjsonV4Id": "bb391b52-215d-55c1-a1ed-9037ef606ef2", "mtgoFoilId": "28202", "mtgoId": "28201", "multiverseId": "145984", "scryfallId": "47bf7254-4302-41a0-bc87-d7dc437ff38d", "scryfallIllustrationId": "fcd45621-ad92-4309-8a03-430df87810ba", "scryfallOracleId": "e5a06062-0513-48af-b92a-420ebbeb1695", "tcgplayerProductId": "15505"}, "keywords": ["Clash"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}", "manaValue": 3.0, "name": "Gilt-Leaf Ambush", "number": "214", "originalText": "Put two 1/1 green Elf Warrior creature tokens into play. Clash with an opponent. If you win, those creatures gain deathtouch until end of turn. (Each clashing player reveals the top card of his or her library, then puts that card on the top or bottom. A player wins if his or her card had a higher converted mana cost. Whenever a creature with deathtouch deals damage to a creature, destroy that creature.)", "originalType": "Tribal Instant - Elf", "printings": ["LRW"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/87366e6821fbcec2", "cardKingdomFoil": "https://mtgjson.com/links/cfdde12ea82e0620", "cardmarket": "https://mtgjson.com/links/f695a79454c2aff9", "tcgplayer": "https://mtgjson.com/links/2a67f64dd8f6a0b2"}, "rarity": "common", "rulings": [], "setCode": "LRW", "subtypes": ["Elf"], "supertypes": [], "text": "Create two 1/1 green Elf Warrior creature tokens. Clash with an opponent. If you win, those creatures gain deathtouch until end of turn. (Each clashing player reveals the top card of their library, then puts that card on the top or bottom. A player wins if their card had a higher mana value. Any amount of damage a creature with deathtouch deals to a creature is enough to destroy it.)", "type": "Tribal Instant — Elf", "types": ["Tribal", "Instant"], "uuid": "271ab442-2158-545b-b5a4-4a273a7aaf0a"}