{"artist": "Daarken", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 6.0, "edhrecRank": 22832, "finishes": ["nonfoil", "foil"], "flavorText": "\"Have you spent a winter high in the mountains, where the ice walks and speaks to the wind? It is not a place for those who have not learned respect.\"\n—Ulnok, Temur shaman", "foreignData": [{"flavorText": "„Hast du schon einmal einen Winter hoch droben in den Bergen verbracht, wo das Eis wandert und mit dem Wind spricht? Es ist kein Ort für jene, die keinen Respekt gelernt haben.\" —Ulnok, Schamane der Temur", "language": "German", "multiverseId": 387353, "name": "Gletscher-Pirscher", "text": "Morph {4}{U} (Du kannst diese Karte verdeckt für {3} als eine 2/2 Kreatur wirken. Decke sie zu einem beliebigen Zeitpunkt für ihre Morph-Kosten auf.)", "type": "Kreatur — Elementarwesen"}, {"flavorText": "\"¿Has pasado algún invierno en lo alto de las montañas, donde el hielo camina y habla a los vientos? No es un lugar adecuado para aquellos que no conocen el respeto\". —Ulnok, chamán temur", "language": "Spanish", "multiverseId": 389236, "name": "Acechador glacial", "text": "Metamorfosis {4}{U}. (Puedes lanzar esta carta boca abajo como una criatura 2/2 pagando {3}. Ponla boca arriba en cualquier momento pagando su coste de metamorfosis.)", "type": "Criatura — Elemental"}, {"flavorText": "« Avez-vous déjà passé un hiver au sommet des montagnes, là où la glace marche et converse avec le vent ? Ce n'est pas un lieu pour quiconque n'a pas appris le respect. » —Ulnok, shamane temurien", "language": "French", "multiverseId": 387622, "name": "Pisteur glacial", "text": "Mue {4}{U} (Vous pouvez lancer cette carte face cachée comme une créature 2/2 pour {3}. Retournez-la à tout moment pour son coût de mue.)", "type": "Créature : élémental"}, {"flavorText": "\"Hai mai trascorso un inverno sulle vette dei monti, dove il ghiaccio cammina e conversa col vento? Non è un luogo adatto a chi non conosce il rispetto.\" —Ulnok, sciamano Temur", "language": "Italian", "multiverseId": 387891, "name": "Inseguitore Glaciale", "text": "Metamorfosi {4}{U} (Puoi lanciare questa carta a faccia in giù come una creatura 2/2 pagando {3}. Girala a faccia in su in qualsiasi momento pagando il suo costo di metamorfosi.)", "type": "Creatura — Elementale"}, {"flavorText": "「お前は、氷が歩いて風と会話する山の頂で冬を過ごしたことがあるか？あの地は礼儀を知らぬ者が足を踏み入れるべき場所ではない。」 ――ティムールのシャーマン、ウルナック", "language": "Japanese", "multiverseId": 388160, "name": "氷河の忍び寄り", "text": "変異{4}{U}（あなたはこのカードを、{3}で２/２クリーチャーとして裏向きに唱えてもよい。これの変異コストで、これをいつでも表向きにしてよい。）", "type": "クリーチャー — エレメンタル"}, {"flavorText": "\"얼음이 걸으며 바람과 대화를 나누는 산 정상 부근에서 겨울을 난 적이 있나? 존경하는 법을 배우지 못한 이들이 있을만한 장소는 아니라네.\" —테무르 주술사 울낙", "language": "Korean", "multiverseId": 388429, "name": "빙하 추적자", "text": "변이 {4}{U} (당신은 {3}을 지불해서 이 카드를 뒷면 상태의 2/2 생물로 발동할 수 있다. 언제든지 변이 비용을 지불하고 앞면이 보이도록 뒤집을 수 있다.)", "type": "생물 — 정령"}, {"flavorText": "\"Você passou o inverno no alto das montanhas, onde o gelo caminha e fala com o vento? Lá não é lugar para aqueles que não aprenderam o que é respeito.\" — Ulnok, xamã Temur", "language": "Portuguese (Brazil)", "multiverseId": 388698, "name": "Espreitador Glacial", "text": "Metamorfose {4}{U} (Você pode conjurar este card com a face voltada para baixo como uma criatura 2/2 por {3}. Volte sua face para cima a qualquer momento pagando seu custo de metamorfose.)", "type": "Criatura — Elemental"}, {"flavorText": "«Тебе доводилось зимовать высоко в горах, где лед двигается сам собой и говорит с ветром? Там нет места тем, кто не научился уважению». — Улнок, темурский шаман", "language": "Russian", "multiverseId": 388967, "name": "Ледяной Охотник", "text": "Оборотень {4}{U} (Вы можете разыграть эту карту рубашкой вверх как существо 2/2 за {3}. Переверните ее рубашкой вниз в любой момент за ее стоимость Оборотня.)", "type": "Существо — Элементаль"}, {"flavorText": "「你可曾在山巅过冬？那里有起身踏步，呼啸狂风的冰川。不知道何谓敬畏的人根本待不下去。」 ～铁木尔祭师乌勒诺克", "language": "Chinese Simplified", "multiverseId": 386815, "name": "冰川伏击客", "text": "变身{4}{U}（你可牌面朝下地施放此牌并支付{3}，将其当成2/2生物。可随时支付其变身费用使其翻回正面。）", "type": "生物～元素"}, {"flavorText": "「你可曾在山巔過冬？那裡有起身踏步，呼嘯狂風的冰川。不知道何謂敬畏的人根本待不下去。」 ～鐵木爾祭師烏勒諾克", "language": "Chinese Traditional", "multiverseId": 387084, "name": "冰川伏擊客", "text": "變身{4}{U}（你可牌面朝下地施放此牌並支付{3}，將其當成2/2生物。可隨時支付其變身費用使其翻回正面。）", "type": "生物～元素"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "196422", "cardKingdomId": "196019", "cardsphereId": "23483", "mcmId": "269450", "mcmMetaId": "210326", "mtgjsonV4Id": "186bda47-ea96-54a6-8b71-de17a89c097f", "mtgoFoilId": "53979", "mtgoId": "53978", "multiverseId": "386546", "scryfallId": "8821c7b9-702b-416f-b006-941ad57f9e11", "scryfallIllustrationId": "07cf046e-29f8-4c35-8e12-fd55cbf4fd2a", "scryfallOracleId": "49d06291-c8cb-4e22-b178-d0598582b2ee", "tcgplayerProductId": "93245"}, "keywords": ["Morph"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{5}{U}", "manaValue": 6.0, "name": "Glacial Stalker", "number": "41", "originalText": "Morph {4}{U} (You may cast this card face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.)", "originalType": "Creature — Elemental", "power": "4", "printings": ["KTK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2dbcf85d4c559ee5", "cardKingdomFoil": "https://mtgjson.com/links/947b261785166596", "cardmarket": "https://mtgjson.com/links/e10d8f69413ddc35", "tcgplayer": "https://mtgjson.com/links/36d1c0279960b9e2"}, "rarity": "common", "rulings": [{"date": "2014-09-20", "text": "The face-down spell has no mana cost and has a converted mana cost of 0. When you cast a face-down spell, put it on the stack face down so no other player knows what it is, and pay {3}. This is an alternative cost."}, {"date": "2014-09-20", "text": "Morph lets you cast a card face down by paying {3}, and lets you turn the face-down permanent face up any time you have priority by paying its morph cost."}, {"date": "2014-09-20", "text": "When the spell resolves, it enters the battlefield as a 2/2 creature with no name, mana cost, creature types, or abilities. It’s colorless and has a converted mana cost of 0. Other effects that apply to the creature can still grant it any of these characteristics."}, {"date": "2014-09-20", "text": "Any time you have priority, you may turn the face-down creature face up by revealing what its morph cost is and paying that cost. This is a special action. It doesn’t use the stack and can’t be responded to. Only a face-down permanent can be turned face up this way; a face-down spell cannot."}, {"date": "2014-09-20", "text": "Because the permanent is on the battlefield both before and after it’s turned face up, turning a permanent face up doesn’t cause any enters-the-battlefield abilities to trigger."}, {"date": "2014-09-20", "text": "A permanent that turns face up or face down changes characteristics but is otherwise the same permanent. Spells and abilities that were targeting that permanent, as well as Auras and Equipment that were attached to the permanent, aren’t affected."}, {"date": "2014-09-20", "text": "At any time, you can look at a face-down spell or permanent you control. You can’t look at face-down spells or permanents you don’t control unless an effect instructs you to do so."}, {"date": "2014-09-20", "text": "You must ensure that your face-down spells and permanents can easily be differentiated from each other. You’re not allowed to mix up the cards that represent them on the battlefield in order to confuse other players. The order they entered the battlefield should remain clear. Common methods for doing this include using markers or dice, or simply placing them in order on the battlefield."}, {"date": "2014-09-20", "text": "If a face-down permanent leaves the battlefield, you must reveal it. You must also reveal all face-down spells and permanents you control if you leave the game or if the game ends."}], "setCode": "KTK", "subtypes": ["Elemental"], "supertypes": [], "text": "Morph {4}{U} (You may cast this card face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.)", "toughness": "5", "type": "Creature — Elemental", "types": ["Creature"], "uuid": "0957f09e-86fd-5dbd-ba60-20915c704421", "watermark": "temur"}