{"artist": "Ralph Horsley", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 8295, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 181549, "name": "Tarnzauberfärbung", "text": "Verändere den Text eines Zauberspruchs oder einer bleibenden Karte deiner Wahl, indem du im Text alle Vorkommen eines Farbwortes mit einer anderen Farbe ersetzt.\nZurückverfolgen (Du kannst diese Karte aus deinem Friedhof spielen, indem du zusätzlich zu ihren anderen Kosten eine Länderkarte aus deiner Hand abwirfst.)", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 180649, "name": "Tintura ilusoria", "text": "Cambia el texto del hechizo o permanente objetivo reemplazando todas las referencias a un color por otro.\nDesandar. (Puedes jugar esta carta desde tu cementerio descartando una carta de tierra además de pagar sus otros costes.)", "type": "Instantáneo"}, {"language": "French", "multiverseId": 181729, "name": "Teintillusion", "text": "Changez le texte du sort ou du permanent ciblé en remplaçant toutes les occurrences d'un nom de couleur par un autre nom de couleur.\nPistage (Vous pouvez jouer cette carte depuis votre cimetière en vous défaussant d'une carte de terrain en plus de payer ses autres coûts.)", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 181369, "name": "Tintura Illusoria", "text": "Cambia il testo di una magia o di un permanente bersaglio sostituendo tutte le istanze di una parola colore con un'altra.\nRievocare (Puoi giocare questa carta dal tuo cimitero scartando una carta terra oltre a pagare gli altri suoi costi.)", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 181009, "name": "幻色染め", "text": "呪文１つかパーマネント１つを対象とする。それに書かれた色を表す言葉１種類をすべて別な色に置き換える。\n回顧 （あなたはこのカードを、それの他のコストの支払いに追加して土地カードを１枚捨てることで、あなたの墓地からプレイしてもよい。）", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 181909, "name": "Tingir com Glamir", "text": "Mude o texto da mágica ou permanente alvo trocando todas as referências a uma cor por outra cor.\nRetraçar (Você pode jogar este card de seu cemitério descartando um card de terreno, além de pagar seus outros custos.)", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 181189, "name": "Цветонаваждение", "text": "Измените текст целевого заклинания или перманента, заменив все упоминания одного цвета на другой.\nВозвращение (Вы можете разыграть эту карту из вашего кладбища, сбросив карту земли в дополнение к оплате других ее стоимостей.)", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 180829, "name": "幻法饰染", "text": "更改目标咒语或永久物的规则叙述文字，将其中一种颜色文字全部更改为另一种。\n追溯 （你可以从你的坟墓场使用此牌，但必须支付其所需费用，并额外弃掉一张地牌。）", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "125415", "cardKingdomId": "125209", "cardsphereId": "16927", "mcmId": "19483", "mcmMetaId": "9872", "mtgjsonV4Id": "8236bd8a-2977-59c3-b936-19ae309d50c0", "mtgoFoilId": "30107", "mtgoId": "30106", "multiverseId": "153439", "scryfallId": "829a0a1c-761f-4a7f-b59a-c889d995f446", "scryfallIllustrationId": "005042e0-eafb-4bfd-8969-362cff7533a2", "scryfallOracleId": "570a5e60-ed0f-4c14-8cc3-af819648030b", "tcgplayerProductId": "27123"}, "keywords": ["Retrace"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Glamerdye", "number": "21", "originalText": "Change the text of target spell or permanent by replacing all instances of one color word with another.\nRetrace (You may play this card from your graveyard by discarding a land card in addition to paying its other costs.)", "originalType": "Instant", "printings": ["EVE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/856bd6e5face186b", "cardKingdomFoil": "https://mtgjson.com/links/befe7abb284ca8ef", "cardmarket": "https://mtgjson.com/links/c53eba4cab2fdfc3", "tcgplayer": "https://mtgjson.com/links/c6d5afca6b14551b"}, "rarity": "rare", "rulings": [{"date": "2008-08-01", "text": "A retrace card cast from your graveyard follows the normal timing rules for its card type."}, {"date": "2008-08-01", "text": "Casting a card by using its retrace ability works just like casting any other spell, with two exceptions: You’re casting it from your graveyard rather than your hand, and you must discard a land card in addition to any other costs."}, {"date": "2008-08-01", "text": "When a retrace card you cast from your graveyard resolves, fails to resolve, or is countered, it’s put back into your graveyard. You may use the retrace ability to cast it again."}, {"date": "2008-08-01", "text": "If the active player casts a spell that has retrace, that player may cast that card again after it resolves, before another player can remove the card from the graveyard. The active player has priority after the spell resolves, so they can immediately cast a new spell. Since casting a card with retrace from the graveyard moves that card onto the stack, no one else would have the chance to affect it while it’s still in the graveyard."}, {"date": "2008-08-01", "text": "Glamerdye’s effect has no duration. It will last until the game ends or the affected spell or permanent leaves the relevant zone, with the following exception: If Glamerdye affects an artifact, creature, enchantment, or planeswalker spell, it will also affect the permanent that spell becomes when it resolves."}, {"date": "2008-08-01", "text": "You choose the two color words when Glamerdye resolves. You can’t change a word to the same word; you must choose a different word."}, {"date": "2008-08-01", "text": "Glamerdye affects each instance of the chosen word in the text box of the spell or permanent, as long as it’s being used as a color word. Glamerdye won’t change such words in card names, such as White Knight. It also won’t change mana symbols."}, {"date": "2008-08-01", "text": "Glamerdye can change color words preceded by “non.” For example, if you have it change “red” to “green,” it will also change “nonred” to “nongreen.”"}, {"date": "2008-08-01", "text": "Glamerdye changes only words actually printed on the spell or permanent (if it’s a card), words that are part of the spell or permanent’s original characteristics as stated by the effect that created it (if it’s a token or a copy of a spell), or words that were granted to the spell or permanent as part of a copy effect. It won’t change words that are granted to the spell or permanent by any other effects. For example, if an Aura grants a creature protection from blue, you can change that to protection from red by targeting the Aura, but not by targeting the creature. Glamerdye also can’t change what color was chosen for a permanent (such as Painter’s Servant) as it entered the battlefield."}, {"date": "2008-08-01", "text": "Glamerdye can’t affect the keyword fear."}], "setCode": "EVE", "subtypes": [], "supertypes": [], "text": "Change the text of target spell or permanent by replacing all instances of one color word with another.\nRetrace (You may cast this card from your graveyard by discarding a land card in addition to paying its other costs.)", "type": "Instant", "types": ["Instant"], "uuid": "ff7329b7-733a-533e-9c8e-78a0117ff8a8"}