{"artist": "Johan Grenier", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": [], "convertedManaCost": 0.0, "edhrecRank": 24311, "faceName": "Glasspool Shore", "finishes": ["nonfoil", "foil"], "foreignData": [], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardsphereId": "71322", "mcmId": "496610", "mcmMetaId": "317100", "mtgjsonV4Id": "add5fa4f-c750-535e-9344-79f02721c643", "scryfallId": "fee79733-4df7-4870-9e42-03407b5e1528", "scryfallIllustrationId": "28e4b12c-518a-4273-98f9-5e6dba201173", "scryfallOracleId": "c178953c-3888-4edd-9d0c-265bd82b1d24", "tcgplayerProductId": "222162"}, "isStarter": true, "language": "English", "layout": "modal_dfc", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaValue": 0.0, "name": "Glasspool Mimic // Glasspool Shore", "number": "328", "otherFaceIds": ["71caa444-42a9-57d1-8e3c-7c4dd2d957f2"], "printings": ["PRM", "PZNR", "ZNR"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardmarket": "https://mtgjson.com/links/18462a23f376c9f9", "tcgplayer": "https://mtgjson.com/links/f6b4ebb5b6f719ec"}, "rarity": "rare", "rulings": [{"date": "2020-09-25", "text": "Glasspool Mimic copies exactly what was printed on the original creature (unless that creature is copying something else or is a token; see below), except that it’s also a Shapeshifter Rogue. It doesn’t copy whether that creature is tapped or untapped, whether it has any counters on it or any Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, or so on. Most notably, if it copies a creature that’s not normally a creature, it won’t be a creature."}, {"date": "2020-09-25", "text": "If Glasspool Mimic isn’t a creature, most likely because it copied a creature that was only temporarily a creature, it won’t be a Shapeshifter Rogue, even if it becomes a creature later."}, {"date": "2020-09-25", "text": "If the copied creature has {X} in its mana cost, X is considered to be 0."}, {"date": "2020-09-25", "text": "If the chosen creature is copying something else (for example, if the chosen creature is another Glasspool Mimic), then Glasspool Mimic enters the battlefield as whatever the chosen creature copied."}, {"date": "2020-09-25", "text": "If another creature becomes a copy of Glasspool Mimic, that creature is also a Shapeshifter Rogue."}, {"date": "2020-09-25", "text": "If the chosen creature is a token, Glasspool Mimic copies the original characteristics of that token as stated by the effect that put the token onto the battlefield. Glasspool Mimic doesn’t become a token in this case."}, {"date": "2020-09-25", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when Glasspool Mimic enters the battlefield. Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities of the chosen creature will also work."}, {"date": "2020-09-25", "text": "If Glasspool Mimic somehow enters the battlefield at the same time as another creature, it can’t become a copy of that creature. You may choose only a creature that’s already on the battlefield."}, {"date": "2020-09-25", "text": "There is a single triangle icon in the top left corner of the front face. There is a double triangle icon in the top left corner of the back face."}, {"date": "2020-09-25", "text": "To determine whether it is legal to play a modal double-faced card, consider only the characteristics of the face you’re playing and ignore the other face’s characteristics."}, {"date": "2020-09-25", "text": "If an effect allows you to play a specific modal double-faced card, you may cast it as a spell or play it as a land, as determined by which face you choose to play. If an effect allows you to cast (rather than “play”) a specific modal double-faced card, you can’t play it as a land."}, {"date": "2020-09-25", "text": "If an effect allows you to play a land or cast a spell from among a group of cards, you may play or cast a modal double-faced card with any face that fits the criteria of that effect."}, {"date": "2020-09-25", "text": "The converted mana cost of a modal double-faced card is based on the characteristics of the face that’s being considered. On the stack and battlefield, consider whichever face is up. In all other zones, consider only the front face. This is different than how the converted mana cost of a transforming double-faced card is determined."}, {"date": "2020-09-25", "text": "A modal double-faced card can’t be transformed or be put onto the battlefield transformed. Ignore any instruction to transform a modal double-faced card or to put one onto the battlefield transformed."}, {"date": "2020-09-25", "text": "If an effect puts a double-faced card onto the battlefield, it enters with its front face up. If that front face can’t be put onto the battlefield, it doesn’t enter the battlefield."}, {"date": "2020-09-25", "text": "If an effect instructs a player to choose a card name, the name of either face may be chosen. If that effect or a linked ability refers to a spell with the chosen name being cast and/or a land with the chosen name being played, it considers only the chosen name, not the other face’s name."}, {"date": "2020-09-25", "text": "In the Commander variant, a double-faced card’s color identity is determined by the mana costs and mana symbols in the rules text of both faces combined. If either face has a color indicator or basic land type, those are also considered."}], "securityStamp": "oval", "setCode": "ZNR", "side": "b", "subtypes": [], "supertypes": [], "text": "Glasspool Shore enters the battlefield tapped.\n{T}: Add {U}.", "type": "Land", "types": ["Land"], "uuid": "3e09ab49-3a49-5ae8-8098-9903bfbf08df", "variations": ["5632d048-68aa-5867-aea0-d4b21284dc82"]}