{"artist": "Lius Lasahido", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 2984, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 461244, "name": "Gott-Verewigter Kefnet", "text": "Fliegend\nDu kannst die erste Karte, die du in jedem Zug ziehst, beim Ziehen vorzeigen. Immer wenn du auf diese Weise eine Spontanzauber- oder Hexereikarte vorzeigst, kopiere die Karte. Du kannst die Kopie wirken. Die Kopie kostet beim Wirken {2} weniger.\nWenn der Gott-Verewigte Kefnet stirbt oder aus dem Spiel ins Exil geschickt wird, kannst du ihn als dritte Karte von oben in die Bibliothek seines Besitzers legen.", "type": "Legendäre Kreatur — Zombie, Gott"}, {"language": "Spanish", "multiverseId": 461508, "name": "Kefnet, dios eterno", "text": "Vuela.\nPuedes mostrar la primera carta que robes cada turno en cuanto la robes. Siempre que muestres una carta de instantáneo o de conjuro de esta manera, copia esa carta y puedes lanzar la copia. Cuesta {2} menos lanzar esa copia.\nCuando Kefnet, dios eterno muera o vaya al exilio desde el campo de batalla, puedes ponerlo en la biblioteca de su propietario en tercer lugar desde la parte superior.", "type": "Criatura legendaria — Deidad zombie"}, {"language": "French", "multiverseId": 461772, "name": "Kefnet l'Éternel-dieu", "text": "Vol\nVous pouvez révéler la première carte que vous piochez à chaque tour au moment où vous la piochez. À chaque fois que vous révélez une carte d'éphémère ou de rituel de cette manière, copiez cette carte et vous pouvez lancer la copie. Cette copie coûte {2} de moins à lancer.\nQuand Kefnet l'Éternel-dieu meurt ou est mis en exil depuis le champ de bataille, vous pouvez le mettre dans la bibliothèque de son propriétaire en troisième position à partir du dessus.", "type": "Créature légendaire : zombie et dieu"}, {"language": "Italian", "multiverseId": 462036, "name": "Kefnet, Dio Eterno", "text": "Volare\nPuoi rivelare la prima carta che peschi ogni turno mentre la peschi. Ogniqualvolta riveli una carta istantaneo o stregoneria in questo modo, copia quella carta e puoi lanciare la copia. Quella copia costa {2} in meno per essere lanciata.\nQuando Kefnet, Dio Eterno muore o viene messo in esilio dal campo di battaglia, puoi metterlo nel grimorio del suo proprietario come terza carta.", "type": "Creatura Leggendaria — Dio Zombie"}, {"language": "Japanese", "multiverseId": 462300, "name": "永遠神ケフネト", "text": "飛行\n各ターン、あなたはあなたの最初のカードを引くに際し、それを公開してもよい。これによりあなたがインスタントやソーサリーであるカードを公開するたび、そのカードをコピーする。あなたはそのコピーを唱えてもよい。そのコピーを唱えるコストは{2}少なくなる。\n永遠神ケフネトが死亡するか戦場から追放領域に置かれたとき、あなたはこれをオーナーのライブラリーの一番上から３枚目に置いてもよい。", "type": "伝説のクリーチャー — ゾンビ・神"}, {"language": "Korean", "multiverseId": 462564, "name": "신 영생자 케프넷", "text": "비행\n당신은 매 턴마다 당신이 뽑는 첫 카드를 뽑는 것과 동시에 공개할 수 있다. 당신이 이런 식으로 순간마법 또는 집중마법 카드를 공개할 때마다, 그 카드를 복사하고 당신은 그 복사본을 발동할 수 있다. 그 복사본은 발동하는데 {2}가 덜 든다.\n신 영생자 케프넷이 죽거나 전장에서 추방 영역에 놓일 때, 당신은 신 영생자 케프넷을 소유자의 서고 맨 위에서 세 번째에 놓을 수 있다.", "type": "전설적 생물 — 좀비 신"}, {"language": "Portuguese (Brazil)", "multiverseId": 462828, "name": "Eterno-deus Kefnet", "text": "Voar\nVocê pode revelar o primeiro card que comprar em cada turno conforme o compra. Toda vez que você revelar um card de mágica instantânea ou feitiço desta forma, copie aquele card. Você pode conjurar a cópia. A cópia custa {2} a menos para ser conjurada.\nQuando Eterno-deus Kefnet morre ou é colocado no exílio vindo do campo de batalha, você pode colocá-lo no topo do grimório de seu dono na terceira posição.", "type": "Criatura Lendária — Zumbi Deus"}, {"language": "Russian", "multiverseId": 463092, "name": "Вековечный Бог Кефнет", "text": "Полет\nВы можете показывать первую карту, которую вы берете в каждом ходу, в момент ее взятия. Каждый раз, когда вы таким образом показываете карту мгновенного заклинания или волшебства, скопируйте ту карту, и вы можете разыграть копию. Разыгрывание той копии стоит на {2} меньше.\nКогда Вековечный Бог Кефнет умирает или попадает в изгнание с поля битвы, вы можете положить его в библиотеку его владельца третьим сверху.", "type": "Легендарное Существо — Зомби Бог"}, {"language": "Chinese Simplified", "multiverseId": 463356, "name": "永生煞神刻法涅", "text": "飞行\n你可以于你抓每回合第一张牌时展示之。每当你以此法展示一张瞬间或法术牌时，复制该牌，且你可以施放该复制品。该复制品减少{2}来施放。\n当永生煞神刻法涅死去或从战场进入放逐区时，你可以将它置于其拥有者牌库顶数来第三张的位置。", "type": "传奇生物 ～灵俑／神"}, {"language": "Chinese Traditional", "multiverseId": 463620, "name": "永生煞神刻法涅", "text": "飛行\n你可以於你抽每回合第一張牌時展示之。每當你以此法展示一張瞬間或巫術牌時，複製該牌，且你可以施放該複製品。該複製品減少{2}來施放。\n當永生煞神刻法涅死去或從戰場進入放逐區時，你可以將它置於其擁有者牌庫頂數來第三張的位置。", "type": "傳奇生物 ～殭屍／神"}], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "224527", "cardKingdomId": "224228", "cardsphereId": "59244", "mcmId": "372189", "mcmMetaId": "269531", "mtgArenaId": "69504", "mtgjsonV4Id": "de80058a-c1cd-57ff-b558-4373b54e8bae", "mtgoId": "71712", "multiverseId": "460980", "scryfallId": "5e14060f-9167-4e28-a053-77689e066e30", "scryfallIllustrationId": "b43beb49-4dd2-4cb4-b3c9-081ac9f11cc9", "scryfallOracleId": "41d11144-32fc-4e45-a8db-3edb9dc0ce80", "tcgplayerProductId": "188507"}, "keywords": ["Flying"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{U}", "manaValue": 4.0, "name": "God-Eternal Kefnet", "number": "53", "originalText": "Flying\nYou may reveal the first card you draw each turn as you draw it. Whenever you reveal an instant or sorcery card this way, copy that card and you may cast the copy. That copy costs {2} less to cast.\nWhen God-Eternal Kefnet dies or is put into exile from the battlefield, you may put it into its owner's library third from the top.", "originalType": "Legendary Creature — Zombie God", "power": "4", "printings": ["PS19", "PWAR", "WAR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1585eb1cc3ea8aab", "cardKingdomFoil": "https://mtgjson.com/links/2e656d40ca729f05", "cardmarket": "https://mtgjson.com/links/fb4f60243cf56843", "tcgplayer": "https://mtgjson.com/links/632d7c80862f33bd"}, "rarity": "mythic", "rulings": [{"date": "2019-05-03", "text": "It’s important to reveal the first card you draw each turn (or choose not to reveal it) before it is mixed with the other cards in your hand. You look at the card as you draw it before choosing whether to reveal it."}, {"date": "2019-05-03", "text": "You don’t have to reveal a drawn card if you don’t wish to copy it at that time."}, {"date": "2019-05-03", "text": "If you reveal a card this way, it remains revealed until Kefnet’s triggered ability finishes resolving."}, {"date": "2019-05-03", "text": "You can reveal and copy an instant or sorcery card this way on any turn, not just your own, if it’s the first card you’ve drawn that turn."}, {"date": "2019-05-03", "text": "Multiple card draws are always treated as a sequence of individual card draws. For example, if you haven’t drawn any cards yet during a turn and cast a spell that instructs you to draw three cards, you’ll draw them one at a time. Only the first card drawn this way may be revealed and copied with Kefnet’s ability."}, {"date": "2019-05-03", "text": "If an effect puts a card into your hand without using the word “draw,” the card wasn’t drawn."}, {"date": "2019-05-03", "text": "You can cast the copy only as Kefnet’s triggered ability resolves. If you don’t want to cast it at that time (or you can’t cast it, perhaps because there are no legal targets available), the copy ceases to exist. You can’t cast it later."}, {"date": "2019-05-03", "text": "You can cast the copy during the resolution of the triggered ability if it’s a sorcery, no matter whose turn it is or which phase it is."}, {"date": "2019-05-03", "text": "If the card leaves your hand before Kefnet’s triggered ability resolves, you’ll copy it using its last known information."}, {"date": "2019-05-03", "text": "The copy is created in and cast from your hand."}, {"date": "2019-05-03", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost you’re paying, add any cost increases, then apply any cost reductions (such as that of Kefnet’s ability). The converted mana cost of the spell remains unchanged, no matter what the total cost to cast it was."}, {"date": "2019-05-03", "text": "If you somehow control more than one God-Eternal Kefnet (perhaps because one is a Spark Double), you may reveal a card you draw for any number of their abilities. One at a time, each will copy the card if it’s an instant or sorcery, and you may cast each of them. Each copy resolves before you cast the next, and each copy’s cost is reduced by only {2}."}, {"date": "2019-05-03", "text": "If one of these Gods leaves the graveyard or exile while its last ability is on the stack, it will remain in its new zone, even if that zone is a graveyard or exile."}, {"date": "2019-05-03", "text": "If the God’s owner has two or fewer cards in their library, the God is put on the bottom of their library as its last ability resolves."}, {"date": "2019-05-03", "text": "If you control another player’s God when it dies, you decide whether to put that card into its owner’s library."}, {"date": "2019-05-03", "text": "If an effect exiles the God and immediately returns it to the battlefield, its last ability triggers but will have no effect. However, if an effect exiles it and would return it to the battlefield at a later time, the God’s ability may return that card its owner’s library first. If it does, the effect that exiled it won’t return it later."}, {"date": "2019-05-03", "text": "In a multiplayer game, if you put another player’s God onto the battlefield under your control, it will be exiled as you leave the game. If you were still the controller of that God, you would control its triggered ability but you have left the game; that ability won’t resolve and the card remains in exile. Similarly, if you lose the game at the same time that another player’s God that you put onto the battlefield is destroyed, it remains in its owner’s graveyard."}, {"date": "2019-05-03", "text": "If one of these Gods would die and it’s your commander in the Commander variant, you may put it into the command zone instead. If you save your commander this way, it doesn’t die and you won’t put it into your library. The same is true if it would be exiled."}], "securityStamp": "oval", "setCode": "WAR", "subtypes": ["Zombie", "God"], "supertypes": ["Legendary"], "text": "Flying\nYou may reveal the first card you draw each turn as you draw it. Whenever you reveal an instant or sorcery card this way, copy that card and you may cast the copy. That copy costs {2} less to cast.\nWhen God-Eternal Kefnet dies or is put into exile from the battlefield, you may put it into its owner's library third from the top.", "toughness": "5", "type": "Legendary Creature — Zombie God", "types": ["Creature"], "uuid": "14bde121-71a2-5ea9-8145-6022b329c24c"}