{"artist": "Lius Lasahido", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 5.0, "edhrecRank": 2249, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 461283, "name": "Gott-Verewigte Bontu", "text": "Bedrohlich\nWenn die Gott-Verewigte Bontu ins Spiel kommt, opfere eine beliebige Anzahl anderer bleibender Karten und ziehe dann entsprechend viele Karten.\nWenn die Gott-Verewigte Bontu stirbt oder aus dem Spiel ins Exil geschickt wird, kannst du sie als dritte Karte von oben in die Bibliothek ihres Besitzers legen.", "type": "Legendäre Kreatur — Zombie, Gott"}, {"language": "Spanish", "multiverseId": 461547, "name": "Bontu, diosa eterna", "text": "Amenaza.\nCuando Bontu, diosa eterna entre al campo de batalla, sacrifica cualquier cantidad de otros permanentes, luego roba esa misma cantidad de cartas.\nCuando Bontu, diosa eterna muera o vaya al exilio desde el campo de batalla, puedes ponerla en la biblioteca de su propietario en tercer lugar desde la parte superior.", "type": "Criatura legendaria — Deidad zombie"}, {"language": "French", "multiverseId": 461811, "name": "Bontu l'Éternelle-déesse", "text": "Menace\nQuand Bontu l'Éternelle-déesse arrive sur le champ de bataille, sacrifiez n'importe quel nombre d'autres permanents, puis piochez autant de cartes.\nQuand Bontu l'Éternelle-déesse meurt ou est mise en exil depuis le champ de bataille, vous pouvez la mettre dans la bibliothèque de son propriétaire en troisième position à partir du dessus.", "type": "Créature légendaire : zombie et dieu"}, {"language": "Italian", "multiverseId": 462075, "name": "Bontu, Dea Eterna", "text": "Minacciare\nQuando Bontu, Dea Eterna entra nel campo di battaglia, sacrifica un qualsiasi numero di altri permanenti, poi pesca altrettante carte.\nQuando Bontu, Dea Eterna muore o viene messa in esilio dal campo di battaglia, puoi metterla nel grimorio del suo proprietario come terza carta.", "type": "Creatura Leggendaria — Dio Zombie"}, {"language": "Japanese", "multiverseId": 462339, "name": "永遠神バントゥ", "text": "威迫\n永遠神バントゥが戦場に出たとき、他の望む数のパーマネントを生け贄に捧げ、その後それに等しい枚数のカードを引く。\n永遠神バントゥが死亡するか戦場から追放領域に置かれたとき、あなたはこれをオーナーのライブラリーの一番上から３枚目に置いてもよい。", "type": "伝説のクリーチャー — ゾンビ・神"}, {"language": "Korean", "multiverseId": 462603, "name": "신 영생자 본투", "text": "호전적\n신 영생자 본투가 전장에 들어올 때, 다른 지속물을 원하는 수만큼 희생한 후, 그만큼 카드를 뽑는다.\n신 영생자 본투가 죽거나 전장에서 추방 영역에 놓일 때, 당신은 신 영생자 본투를 소유자의 서고 맨 위에서 세 번째에 놓을 수 있다.", "type": "전설적 생물 — 좀비 신"}, {"language": "Portuguese (Brazil)", "multiverseId": 462867, "name": "Eterna-deusa Bontu", "text": "Ameaçar\nQuando Eterna-deusa Bontu entrar no campo de batalha, sacrifique qualquer número de outras permanentes e depois compre aquela quantidade de cards.\nQuando Eterna-deusa Bontu morre ou é colocada no exílio vinda do campo de batalha, você pode colocá-la no topo do grimório de seu dono na terceira posição.", "type": "Criatura Lendária — Zumbi Deus"}, {"language": "Russian", "multiverseId": 463131, "name": "Вековечная Богиня Бонту", "text": "Угроза\nКогда Вековечная Богиня Бонту выходит на поле битвы, пожертвуйте любое количество других перманентов, затем возьмите столько же карт.\nКогда Вековечная Богиня Бонту умирает или попадает в изгнание с поля битвы, вы можете положить ее в библиотеку ее владельца третьей сверху.", "type": "Легендарное Существо — Зомби Бог"}, {"language": "Chinese Simplified", "multiverseId": 463395, "name": "永生煞神芭图", "text": "威慑\n当永生煞神芭图进战场时，牺牲任意数量的其他永久物，然后抓等量的牌。\n当永生煞神芭图死去或从战场进入放逐区时，你可以将它置于其拥有者牌库顶数来第三张的位置。", "type": "传奇生物 ～灵俑／神"}, {"language": "Chinese Traditional", "multiverseId": 463659, "name": "永生煞神芭圖", "text": "威懾\n當永生煞神芭圖進戰場時，犧牲任意數量的其他永久物，然後抽等量的牌。\n當永生煞神芭圖死去或從戰場進入放逐區時，你可以將它置於其擁有者牌庫頂數來第三張的位置。", "type": "傳奇生物 ～殭屍／神"}], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "224521", "cardKingdomId": "224222", "cardsphereId": "59243", "mcmId": "372185", "mcmMetaId": "269527", "mtgArenaId": "69543", "mtgjsonV4Id": "ebd8514c-5838-5283-8cc9-2d7dabeee667", "mtgoId": "71790", "multiverseId": "461019", "scryfallId": "3714a135-e2b9-43a7-a2a2-fa5a2e0ac61a", "scryfallIllustrationId": "258204fa-a078-419a-a9e4-120a73ddc11f", "scryfallOracleId": "183891b0-b5ec-47f4-8d09-b9d3cfc4e7f1", "tcgplayerProductId": "188488"}, "keywords": ["Menace"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}{B}", "manaValue": 5.0, "name": "God-Eternal Bontu", "number": "92", "originalText": "Menace\nWhen God-Eternal Bontu enters the battlefield, sacrifice any number of other permanents, then draw that many cards.\nWhen God-Eternal Bontu dies or is put into exile from the battlefield, you may put it into its owner's library third from the top.", "originalType": "Legendary Creature — Zombie God", "power": "5", "printings": ["PS19", "PWAR", "WAR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/caaf8bf17db338c7", "cardKingdomFoil": "https://mtgjson.com/links/bcc661d70416eb77", "cardmarket": "https://mtgjson.com/links/bb242584ac215bfe", "tcgplayer": "https://mtgjson.com/links/b03449a38bc54db1"}, "rarity": "mythic", "rulings": [{"date": "2019-05-03", "text": "As Bontu’s first triggered ability resolves, you may choose to sacrifice zero other permanents."}, {"date": "2019-05-03", "text": "If any abilities trigger as you sacrifice other permanents, those abilities won’t be put onto the stack until after you’ve drawn cards."}, {"date": "2019-05-03", "text": "If a second God-Eternal Bontu enters the battlefield under your control, you’ll put one into your graveyard before you can sacrifice anything to the new Bontu’s triggered ability."}, {"date": "2019-05-03", "text": "If one of these Gods leaves the graveyard or exile while its last ability is on the stack, it will remain in its new zone, even if that zone is a graveyard or exile."}, {"date": "2019-05-03", "text": "If the God’s owner has two or fewer cards in their library, the God is put on the bottom of their library as its last ability resolves."}, {"date": "2019-05-03", "text": "If you control another player’s God when it dies, you decide whether to put that card into its owner’s library."}, {"date": "2019-05-03", "text": "If an effect exiles the God and immediately returns it to the battlefield, its last ability triggers but will have no effect. However, if an effect exiles it and would return it to the battlefield at a later time, the God’s ability may return that card its owner’s library first. If it does, the effect that exiled it won’t return it later."}, {"date": "2019-05-03", "text": "In a multiplayer game, if you put another player’s God onto the battlefield under your control, it will be exiled as you leave the game. If you were still the controller of that God, you would control its triggered ability but you have left the game; that ability won’t resolve and the card remains in exile. Similarly, if you lose the game at the same time that another player’s God that you put onto the battlefield is destroyed, it remains in its owner’s graveyard."}, {"date": "2019-05-03", "text": "If one of these Gods would die and it’s your commander in the Commander variant, you may put it into the command zone instead. If you save your commander this way, it doesn’t die and you won’t put it into your library. The same is true if it would be exiled."}], "securityStamp": "oval", "setCode": "WAR", "subtypes": ["Zombie", "God"], "supertypes": ["Legendary"], "text": "Menace\nWhen God-Eternal Bontu enters the battlefield, sacrifice any number of other permanents, then draw that many cards.\nWhen God-Eternal Bontu dies or is put into exile from the battlefield, you may put it into its owner's library third from the top.", "toughness": "6", "type": "Legendary Creature — Zombie God", "types": ["Creature"], "uuid": "7877d2ca-9220-5e0d-840e-68c6b5975b52"}