{"artist": "Daarken", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 1.0, "edhrecRank": 9307, "finishes": ["nonfoil", "foil"], "flavorText": "\"I am confident that all our enterprises can benefit from this little revolution.\"", "foreignData": [{"flavorText": "„Ich bin überzeugt, dass all unsere Unternehmungen von dieser kleinen Rebellion profitieren können.\"", "language": "German", "multiverseId": 424282, "name": "Gontis Machenschaften", "text": "Immer wenn du zum ersten Mal in einem Zug Lebenspunkte verlierst, erhältst du {E}. (Du erhältst eine Energiemarke. Schaden verursacht den Verlust von Lebenspunkten.)\nBezahle {E}{E}, opfere Gontis Machenschaften: Jeder Gegner verliert 3 Lebenspunkte. Du erhältst so viele Lebenspunkte dazu, wie auf diese Weise Lebenspunkte verloren wurden.", "type": "Verzauberung"}, {"flavorText": "\"Seguro que todos nuestros proyectos podrán beneficiarse de esta pequeña revolución\".", "language": "Spanish", "multiverseId": 425570, "name": "Maquinaciones de Gonti", "text": "Siempre que pierdas vidas por primera vez cada turno, obtienes {E}. (Obtienes un contador de energía. El daño causa pérdida de vidas.)\nPagar {E}{E}, sacrificar las Maquinaciones de Gonti: Cada oponente pierde 3 vidas. Ganas vidas igual a la cantidad de vidas perdidas de esta manera.", "type": "Encantamiento"}, {"flavorText": "« Il ne fait aucun doute que nos affaires peuvent tirer profit de cette petite révolution. »", "language": "French", "multiverseId": 424466, "name": "Machinations de Gonti", "text": "À chaque fois que vous perdez des points de vie pour la première fois à chaque tour, vous gagnez {E}. (Vous gagnez un marqueur « énergie ». Les blessures provoquent la perte de points de vie.)\nPayez {E}{E}, sacrifiez les Machinations de Gonti : Chaque adversaire perd 3 points de vie. Vous gagnez autant de points de vie que ceux perdus de cette manière.", "type": "Enchantement"}, {"flavorText": "\"Sono certo che questa piccola rivoluzione gioverà ai nostri affari.\"", "language": "Italian", "multiverseId": 424650, "name": "Macchinazioni di Gonti", "text": "Ogniqualvolta perdi punti vita per la prima volta in ogni turno, ottieni {E}. (Ottieni un segnalino energia. Il danno provoca la perdita di punti vita.)\nPaga {E}{E}, Sacrifica le Macchinazioni di Gonti: Ogni avversario perde 3 punti vita. Guadagni tanti punti vita quanti sono i punti vita persi in questo modo.", "type": "Incantesimo"}, {"flavorText": "「このちょっとした革命が我々の事業に利益をもたらすことを喜ばしく思う。」", "language": "Japanese", "multiverseId": 424834, "name": "ゴンティの策謀", "text": "あなたが各ターン最初にライフを失うたび、あなたは{E}を得る。（あなたはエネルギー・カウンターを１個得る。ダメージはライフを失わせる。）\n{E}{E}を支払う, ゴンティの策謀を生け贄に捧げる：各対戦相手はそれぞれ３点のライフを失う。あなたはこれにより失われたライフに等しい点数のライフを得る。", "type": "エンチャント"}, {"flavorText": "\"우리의 모든 사업이 이 작은 혁명으로부터 혜택을 받을 수 있다고 확신하오.\"", "language": "Korean", "multiverseId": 425018, "name": "곤티의 술책", "text": "매 턴 당신이 처음으로 생명점을 잃을 때마다, 당신은 {E}를 얻는다. (당신은 에너지 카운터 한 개를 얻는다. 피해는 생명점을 잃게 한다.)\n{E}{E}를 지불한다, 곤티의 술책을 희생한다: 각 상대는 생명 3점을 잃는다. 당신은 이렇게 잃은 생명점만큼 생명점을 얻는다.", "type": "부여마법"}, {"flavorText": "\"Tenho confiança de que todos os nossos empreendimentos podem se beneficiar dessa pequena revolução.\"", "language": "Portuguese (Brazil)", "multiverseId": 425202, "name": "Maquinações de Gonti", "text": "Toda vez que você perde pontos de vida pela primeira vez em cada turno, você recebe {E}. (Você recebe um marcador de energia. Dano causa perda de pontos de vida.)\nPague {E}{E}, Sacrifique Maquinações de Gonti: Cada oponente perde 3 pontos de vida. Você ganha uma quantidade de pontos de vida igual à quantidade de pontos de vida perdida dessa maneira.", "type": "Encantamento"}, {"flavorText": "«Я уверен, что эта небольшая революция пойдет только на пользу всем нашим предприятиям».", "language": "Russian", "multiverseId": 425386, "name": "Интриги Гонти", "text": "Каждый раз, когда вы теряете жизни первый раз в каждом ходу, вы получаете {E}. (Вы получаете один жетон энергии. Повреждения вызывают потерю жизней.)\nЗаплатите {E}{E}, пожертвуйте Интриги Гонти: каждый оппонент теряет 3 жизни. Вы получаете столько жизней, сколько их было потеряно таким образом.", "type": "Чары"}, {"flavorText": "「我坚信我们彼此的业务都能从这场小小的革命中获益。」", "language": "Chinese Simplified", "multiverseId": 423914, "name": "贡提的阴谋", "text": "每当你每回合第一次失去生命时，你得到{E}。（你得到一个能量指示物。伤害会导致失去生命。）\n支付{E}{E}，牺牲贡提的阴谋：每位对手各失去3点生命。你获得若干生命，其数量等同于以此法失去的生命总和。", "type": "结界"}, {"flavorText": "「我堅信我們彼此的業務都能從這場小小的革命中獲益。」", "language": "Chinese Traditional", "multiverseId": 424098, "name": "貢提的陰謀", "text": "每當你每回合第一次失去生命時，你得到{E}。（你得到一個能量指示物。傷害會導致失去生命）。\n支付{E}{E}，犧牲貢提的陰謀：每位對手各失去3點生命。你獲得若干生命，其數量等同於以此法失去的生命總和。", "type": "結界"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "210771", "cardKingdomId": "210587", "cardsphereId": "4198", "mcmId": "294877", "mcmMetaId": "224423", "mtgjsonV4Id": "2596b8fd-20d0-5d56-a918-b941afbb1e63", "mtgoFoilId": "62692", "mtgoId": "62691", "multiverseId": "423730", "scryfallId": "6c97f5a9-6e04-45c3-aa8d-dcf0fd81d5b9", "scryfallIllustrationId": "1c68854d-6a5d-4353-a21f-a35a2ea44669", "scryfallOracleId": "4e6238d8-bd6a-4952-a7dd-9c41a78a2cba", "tcgplayerProductId": "126486"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{B}", "manaValue": 1.0, "name": "Gonti's Machinations", "number": "63", "originalText": "Whenever you lose life for the first time each turn, you get {E}. (You get an energy counter. Damage causes loss of life.)\nPay {E}{E}, Sacrifice Gonti's Machinations: Each opponent loses 3 life. You gain life equal to the life lost this way.", "originalType": "Enchantment", "printings": ["AER"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/78ed0f6d6d64d5fb", "cardKingdomFoil": "https://mtgjson.com/links/75a26d3d478734a2", "cardmarket": "https://mtgjson.com/links/e2649d6f7954e91e", "tcgplayer": "https://mtgjson.com/links/b089d9d81ec909b2"}, "rarity": "uncommon", "rulings": [{"date": "2017-02-09", "text": "In a Two-Headed Giant game, Gonti’s Machinations’s second ability causes the opposing team to lose a total of 6 life."}, {"date": "2017-02-09", "text": "{E} is the energy symbol. It represents one energy counter."}, {"date": "2017-02-09", "text": "The triggered ability gives you at most one energy counter each turn, regardless of how much life you lost."}, {"date": "2017-02-09", "text": "In a Two-Headed Giant game, damage and life loss happen to individual players, and the result affects the team’s life total. Combat damage is assigned and dealt to specific players. If your teammate is dealt damage or otherwise loses life, Gonti’s Machinations doesn’t trigger, even though your life total went down."}, {"date": "2017-02-09", "text": "Energy counters are a kind of counter that a player may have. They’re not associated with specific permanents. (Other kinds of counters that players may have include poison and experience.)"}, {"date": "2017-02-09", "text": "Keep careful track of how many energy counters each player has. You may do so by keeping a running count on paper, by using a die, or by any other clear and mutually agreeable method."}, {"date": "2017-02-09", "text": "If an effect says you get one or more {E}, you get that many energy counters. To pay one or more {E}, you lose that many energy counters. Any effects that interact with counters a player gets, has, or loses can interact with energy counters."}, {"date": "2017-02-09", "text": "Energy counters aren’t mana. They don’t go away as steps, phases, and turns end, and effects that add mana “of any type” to your mana pool can’t give you energy counters."}, {"date": "2017-02-09", "text": "You can’t pay more energy counters than you have."}], "setCode": "AER", "subtypes": [], "supertypes": [], "text": "Whenever you lose life for the first time each turn, you get {E}. (You get an energy counter. Damage causes loss of life.)\nPay {E}{E}, Sacrifice Gonti's Machinations: Each opponent loses 3 life. You gain life equal to the life lost this way.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "ee7bc90f-d66e-5747-8141-1ed1176e5cf9"}