{"artist": "Daarken", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 635, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 496116, "name": "Gonti, Fürst der Opulenz", "text": "Todesberührung\nWenn Gonti, Fürst der Opulenz, ins Spiel kommt, schaue dir die obersten vier Karten der Bibliothek eines Gegners deiner Wahl an, schicke eine davon verdeckt ins Exil und lege dann den Rest in zufälliger Reihenfolge unter seine Bibliothek. Solange die Karte im Exil ist, kannst du sie anschauen und sie wirken, und um den Zauberspruch zu wirken, kannst du Mana ausgeben, als wäre es Mana eines beliebigen Typs.", "type": "Legendäre Kreatur — Äthergeborener, Räuber"}, {"language": "Spanish", "multiverseId": 496250, "name": "Gonti, señor de la opulencia", "text": "Toque mortal.\nCuando Gonti, señor de la opulencia entre al campo de batalla, mira las cuatro primeras cartas de la biblioteca del oponente objetivo y exilia una de ellas boca abajo. Luego, pon el resto en el fondo de esa biblioteca en un orden aleatorio. Mientras esa carta permanezca exiliada, puedes mirarla, lanzarla y usar maná como si fuera maná de cualquier tipo para lanzar ese hechizo.", "type": "Criatura legendaria — Bribón etergénito"}, {"language": "French", "multiverseId": 496384, "name": "Gonti, seigneur de l'opulence", "text": "Contact mortel\nQuand Gonti, seigneur de l'opulence arrive sur le champ de bataille, regardez les quatre cartes du dessus de la bibliothèque d'un adversaire ciblé, exilez l'une d'elles face cachée, puis mettez le reste au-dessous de cette bibliothèque dans un ordre aléatoire. Vous pouvez regarder cette carte et la lancer tant qu'elle reste exilée, et vous pouvez dépenser du mana comme s'il s'agissait de mana de n'importe quel type pour lancer ce sort.", "type": "Créature légendaire : éthérien et gredin"}, {"language": "Italian", "multiverseId": 496518, "name": "Gonti, Signore del Lusso", "text": "Tocco letale\nQuando Gonti, Signore del Lusso entra nel campo di battaglia, guarda le prime quattro carte del grimorio di un avversario bersaglio, esiliane una a faccia in giù, poi metti le altre in fondo a quel grimorio in ordine casuale. Puoi guardare e lanciare quella carta fintanto che rimane in esilio e puoi spendere mana come se fosse mana di qualsiasi tipo per lanciarla.", "type": "Creatura Leggendaria — Farabutto Eteride"}, {"language": "Japanese", "multiverseId": 496652, "name": "豪華の王、ゴンティ", "text": "接死\n豪華の王、ゴンティが戦場に出たとき、対戦相手１人を対象とする。そのプレイヤーのライブラリーの一番上からカードを４枚見て、そのうち１枚を裏向きに追放する。その後、残りをそのライブラリーの一番下に無作為の順番で置く。そのカードが追放された状態であり続けているかぎり、あなたはそれを見てもよく、あなたはその呪文を唱えるために任意のマナを望むタイプのマナであるかのように支払って唱えてもよい。", "type": "伝説のクリーチャー — 霊基体・ならず者"}, {"language": "Portuguese (Brazil)", "multiverseId": 496786, "name": "Gonti, Senhor da Opulência", "text": "Toque mortífero\nQuando Gonti, Senhor da Opulência, entrar no campo de batalha, olhe os quatro cards do topo do grimório do oponente alvo, exile um deles com a face voltada para baixo e, em seguida, coloque o restante no fundo daquele grimório em ordem aleatória. Você poderá olhá-lo e conjurá-lo enquanto ele permanecer exilado, e poderá gastar mana como se fosse de qualquer tipo para conjurar aquela mágica.", "type": "Criatura Lendária — Etergênito Ladino"}, {"language": "Russian", "multiverseId": 496920, "name": "Гонти, Владыка Роскоши", "text": "Смертельное касание\nКогда Гонти, Владыка Роскоши выходит на поле битвы, посмотрите четыре верхние карты библиотеки целевого оппонента, изгоните одну из них рубашкой вверх, затем положите остальные карты в низ той библиотеки в случайном порядке. Пока та карта остается в изгнании, вы можете смотреть ее, можете разыграть ее, если это карта заклинания, и можете тратить на разыгрывание того заклинания ману, как если бы это была мана любого типа.", "type": "Легендарное Существо — Эфирид Бродяга"}, {"language": "Chinese Simplified", "multiverseId": 497054, "name": "奢华领主贡提", "text": "死触\n当奢华领主贡提进战场时，检视目标对手牌库顶的四张牌，将其中一张牌面朝下地放逐，然后将其余的牌以随机顺序置于该牌库底。于该牌持续放逐的时段内，你可以检视并施放该牌，且你可以将法术力视同任意种类的法术力来支付施放该咒语的费用。", "type": "传奇生物 ～乙太种／浪客"}], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "237340", "cardsphereId": "71064", "mcmId": "504010", "mtgjsonV4Id": "e82daf91-e78d-5dea-9b69-86acdbbe83ac", "multiverseId": "495982", "scryfallId": "59356854-e84f-4cf6-92ca-e47a2108a8df", "scryfallIllustrationId": "1a52d6b3-8d42-44ed-b63c-25276f88e145", "scryfallOracleId": "d5be0ff6-39d9-4f9f-a028-e62dc38463f2", "tcgplayerProductId": "222528"}, "isReprint": true, "isStarter": true, "keywords": ["Deathtouch"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}{B}", "manaValue": 4.0, "name": "Gonti, Lord of Luxury", "number": "44", "originalText": "Deathtouch\nWhen Gonti, Lord of Luxury enters the battlefield, look at the top four cards of target opponent's library, exile one of them face down, then put the rest on the bottom of that library in a random order. You may look at and cast that card for as long as it remains exiled, and you may spend mana as though it were mana of any type to cast that spell.", "originalType": "Legendary Creature — Aetherborn Rogue", "power": "2", "printings": ["AFC", "CLB", "JMP", "KLD", "KLR", "MB1", "PKLD", "ZNC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/9af855f15e80e762", "tcgplayer": "https://mtgjson.com/links/ca2a6e032bea7250"}, "rarity": "rare", "rulings": [{"date": "2016-09-20", "text": "You may look at and cast that card (and spend mana as though it were mana of any type to do so) even if Gonti leaves the battlefield. If another player gains control of Gonti, that player can't look at or cast the card, and you still can."}, {"date": "2016-09-20", "text": "An effect that instructs you to “cast” a card doesn't allow you to play lands."}, {"date": "2016-09-20", "text": "You pay the costs for the exiled card if you cast it. You may pay alternative costs such as emerge rather than the card's mana cost."}, {"date": "2016-09-20", "text": "Gonti doesn't change when you can cast the exiled card. For example, if you exile a creature card without flash, you can cast it only during your main phase when the stack is empty."}, {"date": "2016-09-20", "text": "Casting the card causes it to leave exile. You can't cast it multiple times."}, {"date": "2016-09-20", "text": "If you leave the game, the card remains exiled face down indefinitely. No player may look at it."}], "securityStamp": "oval", "setCode": "ZNC", "subtypes": ["Aetherborn", "Rogue"], "supertypes": ["Legendary"], "text": "Deathtouch\nWhen Gonti, Lord of Luxury enters the battlefield, look at the top four cards of target opponent's library, exile one of them face down, then put the rest on the bottom of that library in a random order. You may look at and cast that card for as long as it remains exiled, and you may spend mana as though it were mana of any type to cast that spell.", "toughness": "3", "type": "Legendary Creature — Aetherborn Rogue", "types": ["Creature"], "uuid": "117db09a-01ba-5ab4-b791-88a61bf61f59"}