{"artist": "Johann Bodin", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 4.0, "edhrecRank": 7999, "finishes": ["nonfoil"], "foreignData": [], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "237988", "cardsphereId": "71630", "mcmId": "498110", "mcmMetaId": "262734", "mtgjsonV4Id": "cc6b3e0a-146d-5fbc-a5c7-284c55b1db94", "scryfallId": "9f265715-cd3d-4d76-b4a8-be0c6d731a9e", "scryfallIllustrationId": "13f4e404-334c-44f2-adc5-c03e92839f94", "scryfallOracleId": "a7195e9f-53fa-4fb5-b1f1-099c0a772090", "tcgplayerProductId": "222614"}, "isReprint": true, "keywords": ["Partner", "Partner with", "Vigilance"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{G}", "manaValue": 4.0, "name": "Gorm the Great", "number": "171", "power": "2", "printings": ["BBD", "PBBD", "PLIST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6fef82d5e8c34560", "cardmarket": "https://mtgjson.com/links/a3213ac4361defb0", "tcgplayer": "https://mtgjson.com/links/8a1e9b10d154c3e3"}, "rarity": "rare", "rulings": [{"date": "2018-06-08", "text": "Both commanders start in the command zone, and the remaining 98 cards of your deck are shuffled to become your library."}, {"date": "2018-06-08", "text": "If only one creature can block Gorm the Great, that creature does so."}, {"date": "2018-06-08", "text": "If a creature can’t block Gorm for any reason (such as being tapped), then it doesn’t block. If there’s a cost associated with having it block Gorm, the player isn’t forced to pay that cost, so it doesn’t have to block in that case either. If this means that no creatures block Gorm, Gorm isn’t blocked."}, {"date": "2018-06-08", "text": "“Partner with [name]” represents two abilities. The first is a triggered ability: “When this permanent enters the battlefield, target player may search their library for a card named [name], reveal it, put it into their hand, then shuffle their library.”"}, {"date": "2018-06-08", "text": "Note that the target player searches their library (which may be affected by effects such as that of Stranglehold) and that the card they find is revealed, even though these words aren’t included in the ability’s reminder text."}, {"date": "2018-06-08", "text": "The second ability represented by the “partner with [name]” keyword modifies the rules for deck construction in the Commander variant and has no function outside of that variant. If a legendary creature card with “partner with [name]” is designated as your commander, the named legendary creature card can also be designated as your commander. For more information on the Commander variant, please visit Wizards.com/Commander."}, {"date": "2018-06-08", "text": "If your Commander deck has two commanders, you can only include cards whose own color identities are also found in your commanders’ combined color identities. If Khorvath and Sylvia are your commanders, your deck may contain cards with red and/or white in their color identity, but not blue, black, or green."}, {"date": "2018-06-08", "text": "To have two commanders, both must have the partner ability (featured in the Magic: The Gathering—Commander™ (2016 Edition) set) or corresponding “partner with” abilities as the game begins. A creature with a “partner with” ability can’t partner with any creature other than its designated partner. Losing a partner ability during the game doesn’t cause either to cease to be your commander."}, {"date": "2018-06-08", "text": "Once the game begins, your two commanders are tracked separately. If you cast one, you won’t have to pay an additional {2} the first time you cast the other. A player loses the game after having been dealt 21 damage from one of them, not from both of them combined. Command Beacon’s effect puts one into your hand from the command zone, not both."}, {"date": "2018-06-08", "text": "An effect that checks whether you control your commander is satisfied if you control one or both of your two commanders."}, {"date": "2018-06-08", "text": "The triggered ability of the “partner with” keyword still triggers in a Commander game. If your other commander has somehow ended up in your library, you can find it. You can also target another player who might have that card in their library."}, {"date": "2018-06-08", "text": "Virtus’s last ability triggers and resolves after combat damage is dealt. For example, if Virtus deals 1 combat damage to a player with 10 life, combat damage will reduce that player’s life total to 9. Then its ability will cause the player to lose 5 life, leaving the player at 4."}, {"date": "2018-06-08", "text": "In a Two-Headed Giant game, a player’s life total is the same as their team’s life total."}], "securityStamp": "oval", "setCode": "PLIST", "subtypes": ["Giant", "Warrior"], "supertypes": ["Legendary"], "text": "Partner with Virtus the Veiled (When this creature enters the battlefield, target player may put Virtus into their hand from their library, then shuffle.)\nVigilance\nGorm the Great must be blocked if able, and Gorm must be blocked by two or more creatures if able.", "toughness": "7", "type": "Legendary Creature — Giant Warrior", "types": ["Creature"], "uuid": "aca7f683-1acc-55db-ae1e-b8eafae31b35"}