{"artist": "Michael Sutfin", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 7416, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 73337, "name": "Zügel ergreifen", "text": "Bestimme eines Du erhältst bis zum Ende des Zuges die Kontrolle über eine Kreatur deiner Wahl, und sie erhält Eile; oder opfere eine Kreatur, und Zügel ergreifen fügt einer Kreatur oder einem Spieler deiner Wahl Schadenspunkte in Höhe der Stärke dieser Kreatur zu.\nVerflechtung {2}{R} (Bestimme beides, falls du die Verflechtungskosten bezahlst.)", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 161975, "name": "Tomar las riendas", "text": "Elige uno: Ganas el control de la criatura objetivo hasta el final del turno y ésta gana la habilidad de prisa; o sacrifica una criatura y Tomar las riendas hace daño a la criatura o jugador objetivo igual a la fuerza de esa criatura.\nEntrelazar {2}{R}. (Si pagas el coste de entrelazar, juega ambas opciones.)", "type": "Instantáneo"}, {"language": "French", "multiverseId": 161597, "name": "Saisie des rênes", "text": "Choisissez l'un Jusqu'à la fin du tour, vous acquérez le contrôle de la créature ciblée et elle acquiert la célérité ; ou sacrifiez une créature, et la Saisie des rênes inflige ensuite un nombre de blessures égal à la force de cette créature à une cible, créature ou joueur.\nUnion {2}{R} (Choisissez les deux si vous payez le coût d'union.)", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 160066, "name": "Prendere le Redini", "text": "Scegli una delle opzioni seguenti Fino alla fine del turno, prendi il controllo di una creatura bersaglio ed essa guadagna rapidità; oppure sacrifica una creatura, dopodiché Prendere le Redini infligge un ammontare di danni pari alla forza di quella creatura a una creatura o a un giocatore bersaglio.\nIntrecciare {2}{R} (Scegli entrambe se paghi il costo di intrecciare.)", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 73690, "name": "手綱取り", "text": "以下の２つから１つを選ぶ。「クリーチャー１体を対象とする。ターン終了時まで、あなたはそれのコントロールを得るとともに、それは速攻を持つ。」「クリーチャー１体を生け贄に捧げる。クリーチャー１体かプレイヤー１人を対象とする。手綱取りはそれに、生け贄に捧げたクリーチャーのパワーに等しい点数のダメージを与える。」\n双呪 {2}{R} （双呪コストを支払った場合、両方を選ぶ。）", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 162291, "name": "Tomar as Rédeas", "text": "Escolha um Até o final do turno, você ganha o controle da criatura alvo e ela ganha ímpeto; ou, sacrifique uma criatura e depois Tomar as Rédeas causa uma quantidade de dano igual ao poder daquela criatura à criatura alvo ou ao jogador alvo.\nEntrelaçar {2}{R} (Escolha ambos se pagar o custo de entrelaçar.)", "type": "Mágica Instantânea"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "73094", "cardKingdomId": "72094", "cardsphereId": "30644", "mcmId": "95", "mcmMetaId": "2481", "mtgjsonV4Id": "cbc2d05b-0312-5458-ac97-f1c0f8d090b5", "mtgoFoilId": "19852", "mtgoId": "19851", "multiverseId": "49435", "scryfallId": "570fa211-e937-4ad7-bc72-60f8adc3203d", "scryfallIllustrationId": "d5e47a6f-5aa2-4396-8844-ae15b0bfee6a", "scryfallOracleId": "3ceda405-8175-416a-beda-9a95f5acc60c", "tcgplayerProductId": "11415"}, "keywords": ["Entwine"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}", "manaValue": 4.0, "name": "Grab the Reins", "number": "95", "originalText": "Choose one Until end of turn, you gain control of target creature and it gains haste; or sacrifice a creature, then Grab the Reins deals damage equal to that creature's power to target creature or player.\nEntwine {2}{R} (Choose both if you pay the entwine cost.)", "originalType": "Instant", "printings": ["C16", "MRD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ed0b3c628bd154a8", "cardKingdomFoil": "https://mtgjson.com/links/87bc7ff06f188ee9", "cardmarket": "https://mtgjson.com/links/82eb926ac6ac17f3", "tcgplayer": "https://mtgjson.com/links/dc2f9ddd546f3523"}, "rarity": "uncommon", "rulings": [{"date": "2004-12-01", "text": "If you pay the entwine cost, you can sacrifice the creature you gain control of with Grab the Reins."}, {"date": "2004-12-01", "text": "If you choose the “sacrifice a creature” mode, you choose the target of the damage on announcement, but don’t choose what to sacrifice until resolution. You must sacrifice a creature when Grab the Reins resolves, even if you don’t want to. If you don’t control any creatures at that time, Grab the Reins deals no damage."}, {"date": "2004-12-01", "text": "If you cast this with Entwine, you don’t get priority in the middle of resolution. You can’t steal something, do anything (like attack with it), and then sacrifice it."}], "setCode": "MRD", "subtypes": [], "supertypes": [], "text": "Choose one —\n• Until end of turn, you gain control of target creature and it gains haste.\n• Sacrifice a creature. Grab the Reins deals damage equal to that creature's power to any target.\nEntwine {2}{R} (Choose both if you pay the entwine cost.)", "type": "Instant", "types": ["Instant"], "uuid": "1686a5d1-ab63-53dc-a76a-1881e04df7db"}