{"artist": "Allen Williams", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 4.0, "edhrecRank": 1387, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2003", "hasFoil": false, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "58b243e0-eb65-5c65-8d30-d8aa1fac94ab", "mtgoFoilId": "40265", "mtgoId": "40264", "scryfallId": "f86a9d3f-43a8-4da3-9eed-353582986140", "scryfallIllustrationId": "7c112573-543e-4675-be33-7a56e83792eb", "scryfallOracleId": "f4350c4e-7e53-4401-b889-14bed27bee9c"}, "isOnlineOnly": true, "isReprint": true, "isStarter": true, "keywords": ["Equip"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}", "manaValue": 4.0, "name": "Grafted Exoskeleton", "number": "74", "printings": ["SOM", "TD2"], "purchaseUrls": {}, "rarity": "uncommon", "rulings": [{"date": "2011-01-01", "text": "A player who has ten or more poison counters loses the game. This is a state-based action."}, {"date": "2011-01-01", "text": "Infect’s effect applies to any damage, not just combat damage."}, {"date": "2011-01-01", "text": "The -1/-1 counters remain on the creature indefinitely. They’re not removed if the creature regenerates or the turn ends."}, {"date": "2011-01-01", "text": "Damage from a source with infect is damage in all respects. If the source with infect also has lifelink, damage dealt by that source also causes its controller to gain that much life. Damage from a source with infect can be prevented or redirected. Abilities that trigger on damage being dealt will trigger if a source with infect deals damage, if appropriate."}, {"date": "2011-01-01", "text": "If damage from a source with infect that would be dealt to a player is prevented, that player doesn’t get poison counters. If damage from a source with infect that would be dealt to a creature is prevented, that creature doesn’t get -1/-1 counters."}, {"date": "2011-01-01", "text": "Damage from a source with infect affects planeswalkers normally."}, {"date": "2011-01-01", "text": "In addition to the effect of its equip ability, Grafted Exoskeleton becomes unattached from the creature it’s equipping if a spell or ability (such as Fulgent Distraction) causes it to become unattached, if Grafted Exoskeleton leaves the battlefield, if the equipped creature ceases to be a creature, or if Grafted Exoskeleton ceases to be an Equipment. (It also becomes unattached if the equipped creature leaves the battlefield, but the triggered ability won’t do anything in that case.)"}, {"date": "2011-01-01", "text": "If Grafted Exoskeleton’s last ability triggers, but you don’t control the permanent it became unattached from at the time that ability resolves (perhaps because another player has somehow gained control of it), you won’t be able to sacrifice it."}], "setCode": "TD2", "subtypes": ["Equipment"], "supertypes": [], "text": "Equipped creature gets +2/+2 and has infect. (It deals damage to creatures in the form of -1/-1 counters and to players in the form of poison counters.)\nWhenever Grafted Exoskeleton becomes unattached from a permanent, sacrifice that permanent.\nEquip {2}", "type": "Artifact — Equipment", "types": ["Artifact"], "uuid": "722f1f71-2b00-5d31-8e79-73eda7d2286a", "watermark": "phyrexian"}