{"artist": "Lucas Graciano", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 7.0, "edhrecRank": 2286, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 355803, "name": "Verrat aus dem Jenseits", "text": "Immer wenn eine Kreatur stirbt, die du nicht kontrollierst, bringe sie zu Beginn des nächsten Endsegments mit einer zusätzlichen +1/+1-Marke unter deiner Kontrolle ins Spiel zurück. Diese Kreatur ist zusätzlich zu ihren anderen Farben und Typen ein schwarzer Zombie.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 365525, "name": "Traición sepulcral", "text": "Siempre que una criatura que no controles muera, regrésala al campo de batalla bajo tu control con un contador +1/+1 adicional al comienzo del próximo paso final. Esa criatura es un Zombie negro además de sus otros colores y tipos.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 356077, "name": "Trahison de la tombe", "text": "À chaque fois qu'une créature que vous ne contrôlez pas meurt, renvoyez-la sur le champ de bataille sous votre contrôle, avec un marqueur +1/+1 supplémentaire sur elle, au début de la prochaine étape de fin. Cette créature est un zombie noir en plus de ses autres couleurs et de ses autres types.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 356351, "name": "Tradimento del Sepolcro", "text": "Ogniqualvolta una creatura che non controlli muore, rimettila sul campo di battaglia sotto il tuo controllo con un segnalino +1/+1 addizionale all'inizio della prossima sottofase finale. Quella creatura è uno Zombie nero in aggiunta ai suoi altri tipi e colori.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 356625, "name": "墓所の裏切り", "text": "あなたがコントロールしていないクリーチャーが１体死亡するたび、次の終了ステップの開始時に、それを＋１/＋１カウンターが追加で１個置かれた状態であなたのコントロール下で戦場に戻す。そのクリーチャーは、他の色やタイプに加えて黒のゾンビでもある。", "type": "エンチャント"}, {"language": "Korean", "multiverseId": 357447, "name": "죽은 자의 배신", "text": "당신이 조종하지 않는 생물이 죽을 때마다, 다음 종료단 시작에 그 생물을 +1/+1 카운터 한 개를 추가로 가진 채로 당신의 조종 하에 전장으로 되돌린다. 그 생물은 자신의 다른 색과 유형에 더불어 흑색 좀비다.", "type": "부여마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 356899, "name": "Traição Tumular", "text": "Toda vez que uma criatura que você não controla morrer, devolva-a ao campo de batalha sob seu controle com um marcador +1/+1 adicional no início da próxima etapa final. Aquela criatura é um Zumbi preto além de suas outras cores e tipos.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 355255, "name": "Могильное Предательство", "text": "Каждый раз, когда существо не под вашим контролем умирает, верните его на поле битвы под вашим контролем с дополнительным жетоном +1/+1 на нем в начале следующего заключительного шага. То существо является черным Зомби в дополнение к своим другим цветам и типам.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 357173, "name": "坟场叛行", "text": "每当一个不由你操控的生物死去，在下一个结束步骤开始时，将它在你的操控下返回战场，且其上额外有一个+1/+1指示物。该生物额外具有黑色此颜色与「灵俑」此类别。", "type": "结界"}, {"language": "Chinese Traditional", "multiverseId": 355529, "name": "墳場叛行", "text": "每當一個不由你操控的生物死去，在下一個結束步驟開始時，將它在你的操控下返回戰場，且其上額外有一個+1/+1指示物。該生物額外具有黑色此顏色與「殭屍」此類別。", "type": "結界"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "188532", "cardKingdomId": "188246", "cardsphereId": "38700", "mcmId": "258433", "mcmMetaId": "206557", "mtgjsonV4Id": "53663a47-9ac3-57b2-b21b-2ba8834e2647", "mtgoFoilId": "46744", "mtgoId": "46743", "multiverseId": "270960", "scryfallId": "47b38c68-8e72-4afc-bb5e-0b40880fdda9", "scryfallIllustrationId": "4260ee8b-faf8-4ffb-9d32-60092239a2d2", "scryfallOracleId": "892c8fd1-9553-4ced-84ec-9fc35c314c76", "tcgplayerProductId": "66570"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{5}{B}{B}", "manaValue": 7.0, "name": "Grave Betrayal", "number": "67", "originalText": "Whenever a creature you don't control dies, return it to the battlefield under your control with an additional +1/+1 counter on it at the beginning of the next end step. That creature is a black Zombie in addition to its other colors and types.", "originalType": "Enchantment", "printings": ["RTR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/84d11be502996603", "cardKingdomFoil": "https://mtgjson.com/links/483cc5d134325bf6", "cardmarket": "https://mtgjson.com/links/d4072b5e450b6809", "tcgplayer": "https://mtgjson.com/links/91a8016447345b07"}, "rarity": "rare", "rulings": [{"date": "2012-10-01", "text": "Grave Betrayal doesn’t overwrite any previous colors or types. Rather, it adds another color and another creature type."}, {"date": "2012-10-01", "text": "If the creature is normally colorless, it will simply be black. It won’t be both black and colorless."}, {"date": "2012-10-01", "text": "If a creature you don’t control dies during the end step, that creature won’t return to the battlefield until the beginning of the next end step."}, {"date": "2012-10-01", "text": "Each creature you don’t control that dies causes a delayed triggered ability to trigger at the beginning of the next end step. If there are multiple such abilities, you can put them on the stack in any order. The creatures will return to the battlefield one at a time as each ability resolves. The last ability you put on the stack will be the first one to resolve."}, {"date": "2012-10-01", "text": "If the creature card leaves the graveyard before the delayed triggered ability resolves, it won’t return to the battlefield. This is also true if the card leaves the graveyard and returns to the graveyard before that ability resolves."}, {"date": "2012-10-01", "text": "The phrase “with an additional +1/+1 counter on it” means that the creature enters the battlefield with one more +1/+1 counter than it would normally enter the battlefield with. It doesn’t keep any counters it had on it when it died."}, {"date": "2012-10-01", "text": "In a multiplayer game, if more than one player controls a Grave Betrayal and a creature controlled by none of those players dies, each Grave Betrayal will create a delayed triggered ability at the beginning of the next end step. The first such ability to resolve will return the creature. Usually, this will be one controlled by the player furthest from the active player in turn order."}], "setCode": "RTR", "subtypes": [], "supertypes": [], "text": "Whenever a creature you don't control dies, return it to the battlefield under your control with an additional +1/+1 counter on it at the beginning of the next end step. That creature is a black Zombie in addition to its other colors and types.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "ab2e7086-04c8-53f6-8ba6-1b85a4fef606"}