{"artist": "YW Tang", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 7.0, "edhrecRank": 8016, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 531569, "name": "Düsteres Unterfangen", "text": "Würfle zwei W10 und suche dir ein Ergebnis aus. Bringe eine Kreaturenkarte aus deinem Friedhof mit so vielen +1/+1-Marken ins Spiel zurück, wie dem ausgesuchten Ergebnis entspricht. Dann verliert jeder Gegner X Lebenspunkte und du erhältst X Lebenspunkte dazu, wobei X gleich dem anderen Ergebnis ist.", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 531625, "name": "Reto peligroso", "text": "Tira 2d10 y elige un resultado. Regresa una carta de criatura de tu cementerio al campo de batalla con una cantidad de contadores +1/+1 sobre ella igual a ese resultado. Luego cada oponente pierde X vidas y tú ganas X vidas, donde X es el otro resultado.", "type": "Instantáneo"}, {"language": "French", "multiverseId": 531681, "name": "Manœuvre sépulcrale", "text": "Lancez deux d10 et choisissez un résultat. Renvoyez sur le champ de bataille, avec un nombre de marqueurs +1/+1 égal à ce résultat sur elle, une carte de créature depuis votre cimetière. Puis chaque adversaire perd X points de vie et vous gagnez X points de vie, X étant l'autre résultat.", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 531737, "name": "Impresa Sepolta", "text": "Tira due d10 e scegli un risultato. Rimetti sul campo di battaglia dal tuo cimitero una carta creatura con un numero di segnalini +1/+1 pari a quel risultato. Poi ogni avversario perde X punti vita e tu guadagni X punti vita, dove X è l'altro risultato.", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 531793, "name": "悲惨な挑戦", "text": "d10を２回振り、出目１つを選ぶ。あなたの墓地にあるクリーチャー・カード１枚を、その出目に等しい数の＋１/＋１カウンターが置かれた状態で戦場に戻す。その後、各対戦相手はそれぞれＸ点のライフを失い、あなたはＸ点のライフを得る。Ｘはもう１つの出目に等しい。", "type": "インスタント"}], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "249346", "cardsphereId": "80243", "mcmId": "572646", "mtgjsonV4Id": "2fc4010f-57f5-5de6-8909-dcfd58dc2791", "multiverseId": "531513", "scryfallId": "5a6b3500-45e7-4e8b-addc-e5c4914b6f1b", "scryfallIllustrationId": "a1794acd-4c34-43a5-9176-de71f3eeabba", "scryfallOracleId": "917dc5a0-071d-4658-ab58-29ac841260f7", "tcgplayerProductId": "244229"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{5}{B}{B}", "manaValue": 7.0, "name": "Grave Endeavor", "number": "293", "originalText": "Roll two d10 and choose one result. Return a creature card from your graveyard to the battlefield with a number of +1/+1 counters on it equal to that result. Then each opponent loses X life and you gain X life, where X is the other result.", "originalType": "Instant", "printings": ["AFC"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/b86e157f9d26912a", "tcgplayer": "https://mtgjson.com/links/2f216e051138db4e"}, "rarity": "rare", "rulings": [{"date": "2021-07-23", "text": "Dice are identified by the number of faces each one has. For example, a d20 is a twenty-sided die."}, {"date": "2021-07-23", "text": "Dice used must have equally likely outcomes and the roll must be fair. Although physical dice are recommended, digital substitutes are allowed, provided they have the same number of equally likely outcomes as specified in the original roll instruction."}, {"date": "2021-07-23", "text": "An ability that tells you to roll a die will also specify what to do with the result of that roll. Most often, this is in the form of a “results table” in the card text."}, {"date": "2021-07-23", "text": "The instruction to roll a die and the effect that occurs because of the result are all part of the same ability. Players do not get the chance to respond to the ability after knowing the result of the roll."}, {"date": "2021-07-23", "text": "An effect that says “choose a target, then roll a d20” or similar still uses the normal process of putting an ability on the stack and resolving it. Choosing targets is part of putting the ability on the stack and rolling the d20 happens later, as the ability resolves."}, {"date": "2021-07-23", "text": "Some effects may modify the result of a die roll. This may be part of the instruction to roll a die or it may come from other cards. Anything that references the “result” of a die roll is looking for the result after these modifications. Anything that is looking for the “natural result” is looking for the number shown on the face of the die before these modifications."}, {"date": "2021-07-23", "text": "Some abilities, like that of Pixie Guide and Barbarian Class, replace rolling a die with rolling extra dice and ignoring the lowest roll. The ignored rolls are not considered for the effect that instructed you to roll a die, and do not cause abilities to trigger. For all intents and purposes, once you determine which dice count, any extra dice were never rolled."}, {"date": "2021-07-23", "text": "Some effects instruct you to roll again. This uses the same number and type of dice as the original roll, and that roll will use the same set of possible outcomes."}, {"date": "2021-07-23", "text": "While playing Planechase, rolling the planar die will cause any ability that triggers whenever a player rolls one or more dice to trigger. However, any effect that refers to a numerical result will ignore the rolling of the planar die."}, {"date": "2021-07-23", "text": "Tournament events have more specific rules regarding dice and die-rolling. For more information, please see the most recent version of the Magic Tournament Rules at https://wpn.wizards.com/en/document/magic-gathering-tournament-rules."}], "securityStamp": "oval", "setCode": "AFC", "subtypes": [], "supertypes": [], "text": "Roll two d10 and choose one result. Return a creature card from your graveyard to the battlefield with a number of +1/+1 counters on it equal to that result. Then each opponent loses X life and you gain X life, where X is the other result.", "type": "Instant", "types": ["Instant"], "uuid": "257a8f20-09b3-586f-8609-96804121bef2", "variations": ["f1b60057-8687-5f57-adc2-747e3c223f6b"]}