{"artist": "Dave Kendall", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "U"], "colors": ["B", "U"], "convertedManaCost": 5.0, "edhrecRank": 22833, "finishes": ["nonfoil", "foil"], "flavorText": "\"Their sharp scales would make good armor, if they'd just stay dead.\"\n—Taeryn, cinder armorkeep", "foreignData": [{"flavorText": "„Ihre scharfen Schuppen gäben eine gute Rüstung ab — wenn sie bloß tot bleiben würden.\" —Taeryn, Rüstmeister der Rußwesen", "language": "German", "multiverseId": 174641, "name": "Schotterkiemen-Axtkämpfer", "text": "Beharrlichkeit (Wenn diese Kreatur aus dem Spiel auf einen Friedhof gelegt wird und keine -1/-1-Marke auf ihr lag, bringe sie mit einer -1/-1-Marke unter der Kontrolle ihres Besitzers ins Spiel zurück.)", "type": "Kreatur — Meervolk, Soldat"}, {"flavorText": "\"Sus escamas afiladas servirían muy bien para armaduras, si tan solo se quedaran muertos.\" —Taeryn, armero ceniciento", "language": "Spanish", "multiverseId": 172835, "name": "Escuálido hacha de Branquia Arenosa", "text": "Persistir. (Cuando esta criatura vaya a un cementerio desde el juego, si no tenía contadores -1/-1 sobre ella, regrésala al juego bajo el control de su propietario con un contador -1/-1.)", "type": "Criatura — Soldado tritón"}, {"flavorText": "« Leurs écailles tranchantes seraient parfaites pour une armure, s'ils voulaient bien mourir. » —Taeryn, armurier scoriacé", "language": "French", "multiverseId": 173437, "name": "Fauchesquale d'Ouisablon", "text": "Persistance (Quand cette créature est mise dans un cimetière depuis le jeu, si elle n'avait pas de marqueurs -1/-1 sur elle, renvoyez-la en jeu sous le contrôle de son propriétaire avec un marqueur -1/-1 sur elle.)", "type": "Créature : ondin et soldat"}, {"flavorText": "\"Le loro scaglie affilate potrebbero diventare ottime armature, se solo restassero morte.\" —Taeryn, armaiolo cinereo", "language": "Italian", "multiverseId": 173738, "name": "Asciasqualo della Branchiaghiaiosa", "text": "Persistere (Quando questa creatura viene messa in un cimitero dal gioco, se non aveva segnalini -1/-1, rimettila in gioco sotto il controllo del suo proprietario con un segnalino -1/-1.)", "type": "Creatura — Soldato Tritone"}, {"flavorText": "「やつらの鋭い鱗ならいい鎧ができるだろう。やつらが死んでてくれるんならな。」 ――燃えがらの鎧直し、テーリン", "language": "Japanese", "multiverseId": 174039, "name": "砂利エラの斧鮫", "text": "頑強 （このクリーチャーが場からいずれかの墓地に置かれたとき、それの上に－１/－１カウンターが置かれていなかった場合、それを－１/－１カウンターが１個置かれた状態でオーナーのコントロール下で場に戻す。）", "type": "クリーチャー — マーフォーク･兵士"}, {"flavorText": "\"Suas escamas afiadas dariam uma boa armadura, se permanecessem mortas.\" — Taeryn, armeiro cinzeríneo", "language": "Portuguese (Brazil)", "multiverseId": 172233, "name": "Tubarão-Machado Petreobrânquio", "text": "Persistir (Quando esta criatura for colocada num cemitério vinda do jogo, se ela não tiver nenhum marcador -1/-1, devolva-a para o jogo sob o controle de seu dono com um marcador -1/-1.)", "type": "Criatura — Tritão Soldado"}, {"flavorText": "«Из их острой чешуи вышли бы отличные доспехи, если бы только они не пытались восстать из мертвых». — Тайрин, кователь доспехов из племени золовиков", "language": "Russian", "multiverseId": 172534, "name": "Камнежаберный Хищник", "text": "Упорство (Когда это существо попадает из игры на кладбище, если на нем не было жетонов -1/-1, верните его в игру под контролем его владельца с одним жетоном -1/-1 на нем.)", "type": "Существо — Мерфолк Солдат"}, {"flavorText": "「他们的锋利鳞片可以作成好铠甲，前提是他们真得乖乖死掉。」 ～烬身铠匠铁霖", "language": "Chinese Simplified", "multiverseId": 173136, "name": "砂鳃斧人鱼", "text": "留存 （当此生物从场上置入坟墓场时，若其上没有-1/-1指示物，则将它在其拥有者的操控下返回场上，且其上有一个-1/-1指示物。）", "type": "生物～人鱼／士兵"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "124882", "cardKingdomId": "124596", "cardsphereId": "41203", "mcmId": "19178", "mcmMetaId": "9727", "mtgjsonV4Id": "6104da4c-1a00-570f-ba88-134850afe5e9", "mtgoFoilId": "29312", "mtgoId": "29311", "multiverseId": "141935", "scryfallId": "5efc174a-f710-4602-aace-c2165473f6c2", "scryfallIllustrationId": "23c2a4aa-57fe-403b-afa3-34e93e118a87", "scryfallOracleId": "2141b48d-5a04-40dd-a76b-457ac06b56c2", "tcgplayerProductId": "18652"}, "keywords": ["Persist"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U/B}", "manaValue": 5.0, "name": "Gravelgill Axeshark", "number": "164", "originalText": "Persist (When this creature is put into a graveyard from play, if it had no -1/-1 counters on it, return it to play under its owner's control with a -1/-1 counter on it.)", "originalType": "Creature - Merfolk Soldier", "power": "3", "printings": ["SHM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/210da25c63ca80c9", "cardKingdomFoil": "https://mtgjson.com/links/ce71274a1985d55c", "cardmarket": "https://mtgjson.com/links/8211ddadedbd9d80", "tcgplayer": "https://mtgjson.com/links/4c44457259af78c2"}, "rarity": "common", "rulings": [{"date": "2013-06-07", "text": "If a creature with persist stops being a creature, persist will still work."}, {"date": "2013-06-07", "text": "The persist ability triggers when the permanent is put into a graveyard. Its last known information (that is, how the creature last existed on the battlefield) is used to determine whether it had a -1/-1 counter on it."}, {"date": "2013-06-07", "text": "If a permanent has multiple instances of persist, they’ll each trigger separately, but the redundant instances will have no effect. If one instance returns the card to the battlefield, the next to resolve will do nothing."}, {"date": "2013-06-07", "text": "If a token with no -1/-1 counters on it has persist, the ability will trigger when the token is put into the graveyard. However, the token will cease to exist and can’t return to the battlefield."}, {"date": "2013-06-07", "text": "When a permanent with persist returns to the battlefield, it’s a new object with no memory of or connection to its previous existence."}, {"date": "2013-06-07", "text": "If multiple creatures with persist are put into the graveyard at the same time (due to combat damage or a spell that destroys all creatures, for example), the active player (the player whose turn it is) puts all of their persist triggers on the stack in any order, then each other player in turn order does the same. The last trigger put on the stack is the first one that resolves. That means that in a two-player game, the nonactive player’s persist creatures will return to the battlefield first, then the active player’s persist creatures do the same. The creatures return to the battlefield one at a time."}, {"date": "2013-06-07", "text": "If a creature with persist that has +1/+1 counters on it receives enough -1/-1 counters to cause it to be destroyed by lethal damage or put into its owner’s graveyard for having 0 or less toughness, persist won’t trigger and the card won’t return to the battlefield. That’s because persist checks the creature’s existence just before it leaves the battlefield, and it still has all those counters on it at that point."}], "setCode": "SHM", "subtypes": ["Merfolk", "Soldier"], "supertypes": [], "text": "Persist (When this creature dies, if it had no -1/-1 counters on it, return it to the battlefield under its owner's control with a -1/-1 counter on it.)", "toughness": "3", "type": "Creature — Merfolk Soldier", "types": ["Creature"], "uuid": "9d517048-6d92-51b7-b2ed-a45649d06303"}