{"artist": "Igor Kieryluk", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 3.0, "edhrecRank": 6111, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 567273, "name": "Grüner Schlick", "text": "Aufblitzen\nWenn der Grüne Schlick ins Spiel kommt, neutralisiere eine aktivierte oder ausgelöste Fähigkeit deiner Wahl, deren Quelle ein Artefakt oder eine Verzauberung ist. Falls auf diese Weise die Fähigkeit einer bleibenden Karte neutralisiert wird, zerstöre die bleibende Karte.\nVorherbestimmung {G} (Während deines Zuges kannst du {2} bezahlen und diese Karte aus deiner Hand verdeckt ins Exil schicken. Wirke sie in einem späteren Zug für ihre Vorherbestimmungskosten.)", "type": "Kreatur — Schlammwesen"}, {"language": "Spanish", "multiverseId": 567301, "name": "Limo verde", "text": "Destello.\nCuando el Limo verde entre al campo de batalla, contrarresta la habilidad activada o disparada objetivo de una fuente artefacto o encantamiento. Si una habilidad de un permanente es contrarrestada de esta manera, destruye ese permanente.\nProfetizar {G}. (Durante tu turno, puedes pagar {2} y exiliar esta carta de tu mano boca abajo. Puedes lanzarla en un turno posterior pagando su coste de profetizar.)", "type": "Criatura — Cieno"}, {"language": "French", "multiverseId": 567329, "name": "Limon vert", "text": "Flash\nQuand le Limon vert arrive sur le champ de bataille, contrecarrez une capacité activée ou déclenchée ciblée d'une source artefact ou enchantement. Si la capacité d'un permanent est contrecarrée de cette manière, détruisez ce permanent.\nPrédiction {G} (Pendant votre tour, vous pouvez payer {2} et exiler cette carte depuis votre main face cachée. Lancez-la pendant un autre tour pour son coût de prédiction.)", "type": "Créature : limon"}, {"language": "Italian", "multiverseId": 567357, "name": "Fanghiglia Verde", "text": "Lampo\nQuando la Fanghiglia Verde entra nel campo di battaglia, neutralizza un'abilità attivata o innescata bersaglio da una fonte artefatto o incantesimo. Se viene neutralizzata in questo modo l'abilità di un permanente, distruggi quel permanente.\nPredire {G} (Durante il tuo turno, puoi pagare {2} ed esiliare questa carta dalla tua mano a faccia in giù. Lanciala in un turno successivo per il suo costo di predire.)", "type": "Creatura — Melma"}, {"language": "Japanese", "multiverseId": 567385, "name": "グリーン・スライム", "text": "瞬速\nグリーン・スライムが戦場に出たとき、発生源がアーティファクトやエンチャントであり起動型や誘発型である能力１つを対象とする。それを打ち消す。これによりパーマネントの能力が打ち消されたなら、そのパーマネントを破壊する。\n予顕{G}（あなたのターンの間、あなたは{2}を支払って、あなたの手札にあるこのカードを裏向きに追放してもよい。後のターンに、これの予顕コストでこれを唱えてもよい。）", "type": "クリーチャー — ウーズ"}, {"language": "Portuguese (Brazil)", "multiverseId": 567413, "name": "Limo Verde", "text": "Lampejo\nQuando Limo Verde entrar no campo de batalha, anule a habilidade alvo ativada ou desencadeada de uma fonte artefato ou encantamento. Se uma habilidade de uma permanente for anulada dessa forma, destrua aquela permanente.\nProfetizar {G} (Durante o seu turno, você pode pagar {2} e exilar este card de sua mão voltado para baixo. Conjure-o em um turno posterior pagando seu custo de profetizar.)", "type": "Criatura — Lodo"}, {"language": "Russian", "multiverseId": 567441, "name": "Зеленая Слизь", "text": "Миг\nКогда Зеленая Слизь выходит на поле битвы, отмените целевую активируемую или срабатывающую способность, источником которой является артефакт или чары. Если таким образом отменяется способность перманента, уничтожьте тот перманент.\nПророчество {G} (Во время вашего хода вы можете заплатить {2} и изгнать эту карту из вашей руки рубашкой вверх. Разыграйте ее во время одного из последующих ходов за ее стоимость Пророчества.)", "type": "Существо — Тина"}, {"language": "Chinese Simplified", "multiverseId": 567469, "name": "绿史莱姆", "text": "闪现\n当绿史莱姆进战场时，反击目标来源为神器或结界的起动式或触发式异能。如果以此法反击了某永久物的异能，则消灭该永久物。\n预示{G}（在你的回合中，你可以支付{2}并从你手上牌面朝下地放逐此牌。过了该回合后，便可利用其预示费用来施放之。）", "type": "生物 ～流浆"}, {"language": "Chinese Traditional", "multiverseId": 567497, "name": "綠史萊姆", "text": "閃現\n當綠史萊姆進戰場時，反擊目標來源為神器或結界的起動式或觸發式異能。如果以此法反擊了某永久物的異能，則消滅該永久物。\n預示{G}（在你的回合中，你可以支付{2}並從你手上牌面朝下地放逐此牌。過了該回合後，便可利用其預示費用來施放之。）", "type": "生物 ～流漿"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "262031", "mcmId": "661380", "mtgjsonV4Id": "0cccfcbf-5ae1-574c-9d42-1ba01ff1c0b2", "mtgoId": "101456", "multiverseId": "567245", "scryfallId": "b1beaaae-9406-4beb-8e74-d278822434c7", "scryfallIllustrationId": "cc3754f2-0374-4f0f-80b3-70bdd3f82451", "scryfallOracleId": "0ec5a688-a884-410c-adee-ab784789d6e8", "tcgplayerProductId": "273656"}, "keywords": ["Flash", "Foretell"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}", "manaValue": 3.0, "name": "Green Slime", "number": "680", "originalText": "Flash\nWhen Green Slime enters the battlefield, counter target activated or triggered ability from an artifact or enchantment source. If a permanent's ability is countered this way, destroy that permanent.\nForetell {G} (During your turn, you may pay {2} and exile this card from your hand face down. Cast it on a later turn for its foretell cost.)", "originalType": "Creature — Ooze", "power": "2", "printings": ["CLB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/4170371ae91f24c3", "tcgplayer": "https://mtgjson.com/links/aa2f35fb271f6fad"}, "rarity": "rare", "rulings": [{"date": "2022-06-10", "text": "Activated abilities contain a colon. They're generally written “[Cost]: [Effect].” Some keywords are activated abilities and will have colons in their reminder text."}, {"date": "2022-06-10", "text": "Triggered abilities use the word “when,” “whenever,” or “at.” They're often written as “[Trigger condition], [effect].”"}, {"date": "2022-06-10", "text": "Mana abilities don't use the stack and can't be responded to, so they cannot be countered this way."}, {"date": "2022-06-10", "text": "Because exiling a card with foretell from your hand is a special action, you can do so any time you have priority during your turn, including in response to spells and abilities. Once you announce you're taking the action, no other player can respond by trying to remove the card from your hand."}, {"date": "2022-06-10", "text": "Casting a foretold card from exile follows the timing rules for that card. If you foretell Green Slime (or an instant card), you can cast it as soon as the next player's turn. In most cases, if you foretell a card that isn't an instant (or doesn't have flash), you'll have to wait until your next turn to cast it."}, {"date": "2022-06-10", "text": "If you're casting a foretold card from exile for its foretell cost, you can't choose to cast it for any other alternative costs. You can, however, pay additional costs, such as kicker costs. If the card has any mandatory additional costs, those must be paid to cast the spell."}], "securityStamp": "oval", "setCode": "CLB", "subtypes": ["Ooze"], "supertypes": [], "text": "Flash\nWhen Green Slime enters the battlefield, counter target activated or triggered ability from an artifact or enchantment source. If a permanent's ability is countered this way, destroy that permanent.\nForetell {G} (During your turn, you may pay {2} and exile this card from your hand face down. Cast it on a later turn for its foretell cost.)", "toughness": "2", "type": "Creature — Ooze", "types": ["Creature"], "uuid": "ace028e6-85de-56c0-a767-bc9e976794b1", "variations": ["0fe67e17-2e14-5bfe-b88b-7aa96b11b69b"], "watermark": "foretell"}