{"artist": "David Astruga", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 5616, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 567259, "name": "Grell-Philosoph", "text": "Abnorme Tüftelei — Wenn der Grell-Philosoph ins Spiel kommt und zu Beginn deines Versorgungssegments erhält jeder Schrecken, den du kontrollierst, bis zum Ende des Zuges alle aktivierten Fähigkeiten eines Artefakts deiner Wahl, das ein Gegner kontrolliert. Du kannst blaues Mana ausgeben, als wäre es Mana einer beliebigen Farbe, um jene Fähigkeiten zu aktivieren.", "type": "Kreatur — Schrecken, Zauberer"}, {"language": "Spanish", "multiverseId": 567287, "name": "Filósofo grell", "text": "Retoque aberrante — Cuando el Filósofo grell entre al campo de batalla y al comienzo de tu mantenimiento, cada Horror que controlas gana todas las habilidades activadas del artefacto objetivo que controla un oponente hasta el final del turno. Puedes usar maná azul como si fuera maná de cualquier color para activar esas habilidades.", "type": "Criatura — Hechicero horror"}, {"language": "French", "multiverseId": 567315, "name": "Philosophe grell", "text": "Bricolage aberrant — Quand le Philosophe grell arrive sur le champ de bataille et au début de votre entretien, chaque horreur que vous contrôlez acquiert toutes les capacités activées d'un artefact ciblé qu'un adversaire contrôle jusqu'à la fin du tour. Vous pouvez dépenser du mana bleu comme si c'était du mana de n'importe quelle couleur pour activer ces capacités.", "type": "Créature : horreur et sorcier"}, {"language": "Italian", "multiverseId": 567343, "name": "Grell Filosofo", "text": "Esperimento Aberrante — Quando il Grell Filosofo entra nel campo di battaglia e all'inizio del tuo mantenimento, ogni Orrore che controlli ha tutte le abilità attivate di un artefatto bersaglio controllato da un avversario fino alla fine del turno. Puoi spendere mana blu come se fosse mana di qualsiasi colore per attivare quelle abilità.", "type": "Creatura — Mago Orrore"}, {"language": "Japanese", "multiverseId": 567371, "name": "グレルの哲人", "text": "異常な修繕 — あなたのアップキープの開始時に、またはグレルの哲人が戦場に出たとき、対戦相手がコントロールしているアーティファクト１つを対象とする。ターン終了時まで、あなたがコントロールしているすべてのホラーは、それの持つすべての起動型能力を得る。あなたはそれらの能力を起動するために青マナを望む色のマナであるかのように支払ってもよい。", "type": "クリーチャー — ホラー・ウィザード"}, {"language": "Portuguese (Brazil)", "multiverseId": 567399, "name": "Filósofo Grell", "text": "Engenhocagem aberrante — Quando Filósofo Grell entra no campo de batalha e no início de sua manutenção, até o final do turno cada Horror que você controla ganha todas as habilidades ativadas do artefato alvo que um oponente controla. Você pode gastar mana azul como se fosse de qualquer cor para ativar aquelas habilidades.", "type": "Criatura — Horror Mago"}, {"language": "Russian", "multiverseId": 567427, "name": "Грелл-Философ", "text": "Аберрантная механика — Когда Грелл-Философ выходит на поле битвы и в начале вашего шага поддержки, каждый Ужас под вашим контролем получает все активируемые способности целевого артефакта под контролем оппонента до конца хода. Вы можете тратить синюю ману на активацию тех способностей, как если бы это была мана любого цвета.", "type": "Существо — Ужас Чародей"}, {"language": "Chinese Simplified", "multiverseId": 567455, "name": "曲心触须怪", "text": "畸变工艺～当曲心触须怪进战场和在你的维持开始时，选择目标由对手操控的神器。直到回合结束，每个由你操控的惊惧兽均获得该神器之所有起动式异能。你可以将蓝色法术力视同任意颜色的法术力来支付起动这些异能的费用。", "type": "生物 ～惊惧兽／法术师"}, {"language": "Chinese Traditional", "multiverseId": 567483, "name": "曲心觸鬚怪", "text": "畸變工藝～當曲心觸鬚怪進戰場和在你的維持開始時，選擇目標由對手操控的神器。直到回合結束，每個由你操控的驚懼獸均獲得該神器之所有起動式異能。你可以將藍色魔法力視同任意顏色的魔法力來支付起動這些異能的費用。", "type": "生物 ～驚懼獸／魔法師"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "261889", "mcmId": "661292", "mtgjsonV4Id": "3268e367-f53f-53f0-a660-eb9519dadb03", "multiverseId": "567231", "scryfallId": "e18bb373-a0bb-4e3c-b7db-83f747820fcd", "scryfallIllustrationId": "44ae4111-95be-4a11-ad28-9c9725561495", "scryfallOracleId": "d5dc00cb-1510-4ce9-8dd9-0722f65d34b4", "tcgplayerProductId": "273876"}, "keywords": ["Aberrant Tinkering"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}", "manaValue": 3.0, "name": "Grell Philosopher", "number": "666", "originalText": "Aberrant Tinkering — When Grell Philosopher enters the battlefield and at the beginning of your upkeep, each Horror you control gains all activated abilities of target artifact an opponent controls until end of turn. You may spend blue mana as though it were mana of any color to activate those abilities.", "originalType": "Creature — Horror Wizard", "power": "1", "printings": ["CLB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/5cd1986538e5f222", "tcgplayer": "https://mtgjson.com/links/a32deb577a095317"}, "rarity": "rare", "rulings": [{"date": "2022-06-10", "text": "Grell Philosopher causes Horrors to gain only activated abilities. They don't gain keyword abilities (unless those keyword abilities are activated), triggered abilities, or static abilities."}, {"date": "2022-06-10", "text": "The granted abilities effectively use “this permanent” rather than “[that card's name],” so you treat the abilities as if they were printed on the creature that gained the ability. For example, say the artifact was Universal Solvent, which has the ability “{7}, {T}, Sacrifice Universal Solvent: Destroy target permanent.” If Grell Philosopher gained that ability, you'd treat it as though it said “{7}, {T}, Sacrifice Grell Philosopher: Destroy target permanent.”"}, {"date": "2022-06-10", "text": "Activated abilities contain a colon. They're generally written “[Cost]: [Effect].” Some keywords are activated abilities and will have colons in their reminder text."}], "securityStamp": "oval", "setCode": "CLB", "subtypes": ["Horror", "Wizard"], "supertypes": [], "text": "Aberrant Tinkering — When Grell Philosopher enters the battlefield and at the beginning of your upkeep, each Horror you control gains all activated abilities of target artifact an opponent controls until end of turn. You may spend blue mana as though it were mana of any color to activate those abilities.", "toughness": "4", "type": "Creature — Horror Wizard", "types": ["Creature"], "uuid": "4bf61d4f-dde5-542b-aab8-b2b9517d7f47", "variations": ["4946fb87-fbfd-5fce-82a1-ac3c7da74d82"]}