{"artist": "Svetlin Velinov", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 2694, "finishes": ["nonfoil", "foil"], "flavorText": "\"You burn. I'll pillage.\"", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "17c5766d-8e63-5135-83fb-d94158b24775", "mtgoId": "62273", "scryfallId": "619fc399-d45d-431f-8ce4-ba9db2a2e39c", "scryfallIllustrationId": "aa613f69-b5c4-44db-94c6-97ce0d203619", "scryfallOracleId": "80788290-1569-4c7f-b263-b4da7b31a9d1"}, "isOnlineOnly": true, "isReprint": true, "isStarter": true, "keywords": ["Goad"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{R}{R}", "manaValue": 2.0, "name": "Grenzo, Havoc Raiser", "number": "29", "power": "2", "printings": ["CN2", "PZ2"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2016-08-23", "text": "The card exiled by the second mode is exiled face up."}, {"date": "2016-08-23", "text": "If you exile a land card this way, you can’t play it."}, {"date": "2016-08-23", "text": "Casting the exiled card follows the normal rules for casting that card. You must pay its costs, and you must follow all applicable timing rules. For example, if you exile a creature card this way, you must wait until your main phase to cast it."}, {"date": "2016-08-23", "text": "If you don’t cast the card, it will remain in exile."}, {"date": "2016-08-23", "text": "If, during a player’s declare attackers step, a creature that player controls that’s been goaded is tapped, is affected by a spell or ability that says it can’t attack, or hasn’t been under that player’s control continuously since the turn began (and doesn’t have haste), then it doesn’t attack. If there’s a cost associated with having a creature attack a player, its controller isn’t forced to pay that cost, so it doesn’t have to attack in that case either."}, {"date": "2016-08-23", "text": "If the creature doesn’t meet any of the above exceptions and can attack, it must attack a player other than the controller of the spell or ability that goaded it if able. It the creature can’t attack any of those players but could otherwise attack, it must attack an opposing planeswalker (controlled by any opponent) or the player that goaded it."}, {"date": "2016-08-23", "text": "Being goaded isn’t an ability the creature has. Once it’s been goaded, it must attack as detailed above even if it loses all abilities."}, {"date": "2016-08-23", "text": "Attacking with a goaded creature doesn’t cause it to stop being goaded. If there is an additional combat phase that turn, or if another player gains control of it before it stops being goaded, it must attack again if able."}, {"date": "2016-08-23", "text": "If a creature you control has been goaded by multiple opponents, it must attack one of your opponents that hasn’t goaded it, as that fulfills the maximum number of goad requirements. If a creature you control has been goaded by each of your opponents, you choose which opponent it attacks."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": ["Goblin", "Rogue"], "supertypes": ["Legendary"], "text": "Whenever a creature you control deals combat damage to a player, choose one —\n• Goad target creature that player controls.\n• Exile the top card of that player's library. Until end of turn, you may cast that card and you may spend mana as though it were mana of any color to cast that spell.", "toughness": "2", "type": "Legendary Creature — Goblin Rogue", "types": ["Creature"], "uuid": "c9b81e2f-88e6-5542-b314-bf6241e3aa34"}