{"artist": "Donato Giancola", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 4.0, "edhrecRank": 13707, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 131302, "name": "Grinsendes Totem", "text": "{2}, {T}, opfere das Grinsende Totem: Durchsuche die Bibliothek eines Gegners deiner Wahl nach einer Karte und entferne sie ganz aus dem Spiel. Dieser Spieler mischt dann seine Bibliothek. Bis zu Beginn deines nächsten Versorgungssegments kannst du diese Karte spielen. Falls du sie zu Beginn deines nächsten Versorgungssegments noch nicht gespielt hast, lege sie auf den Friedhof ihres Besitzers.", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 131907, "name": "Tótem burlón", "text": "{2}, {T}, sacrificar el Tótem burlón: Busca en la biblioteca del oponente objetivo una carta y remuévela del juego. Luego ese jugador baraja su biblioteca. Hasta el comienzo de tu próximo mantenimiento, puedes jugar esa carta. Al comienzo de tu próximo mantenimiento, si no la jugaste, ponla en el cementerio de su propietario.", "type": "Artefacto"}, {"language": "French", "multiverseId": 131181, "name": "Totem grimaçant", "text": "{2}, {T}, sacrifiez le Totem grimaçant : Cherchez une carte dans la bibliothèque de l'adversaire ciblé et retirez-la de la partie. Ce joueur mélange ensuite sa bibliothèque. Jusqu'au début de votre prochain entretien, vous pouvez jouer cette carte. Au début de votre prochain entretien, si vous ne l'avez pas jouée, mettez-la dans le cimetière de son propriétaire.", "type": "Artefact"}, {"language": "Italian", "multiverseId": 131423, "name": "Totem Ghignante", "text": "{2}, {T}, Sacrifica il Totem Ghignante: Passa in rassegna il grimorio di un avversario bersaglio per una carta e rimuovila dal gioco. Poi quel giocatore rimescola il proprio grimorio. Fino all'inizio del tuo prossimo mantenimento, puoi giocare quella carta. All'inizio del tuo prossimo mantenimento, se non l'hai ancora giocata, mettila nel cimitero del proprietario.", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 131544, "name": "にやにや笑いのトーテム像", "text": "{2}, {T}, にやにや笑いのトーテム像を生け贄に捧げる：対戦相手１人を対象とする。そのプレイヤーのライブラリーからカードを１枚探し、それをゲームから取り除く。 その後、そのプレイヤーは自分のライブラリーを切り直す。 あなたの次のアップキープの開始時まで、あなたはそのカードをプレイしてもよい。 あなたの次のアップキープの開始時に、あなたがそれをプレイしていない場合、それをオーナーの墓地に置く。", "type": "アーティファクト"}, {"language": "Portuguese (Brazil)", "multiverseId": 131665, "name": "Totem Sorridente", "text": "{2}, {T}, Sacrifique Totem Sorridente: Procure no grimório do oponente alvo por um card e remova-o de jogo. Depois, aquele jogador embaralha seu próprio grimório. Até o início de sua próxima manutenção, você poderá jogar aquele card. No início de sua próxima manutenção, se ainda não tiver jogado aquele card, coloque-o no cemitério de seu dono.", "type": "Artefato"}, {"language": "Russian", "multiverseId": 131786, "name": "Ухмыляющийся Тотем", "text": "{2}, {T}, Пожертвуйте Ухмыляющийся Тотем: Поищите карту в библиотеке целевого оппонента и удалите эту карту из игры. Затем этот игрок тасует свою библиотеку. Вы можете играть эту карту до начала вашего следуещего шага поддержки. Если вы не сыграли ее, то в начале вашего следуещего шага поддержки положите ее на кладбище владельца.", "type": "Артефакт"}, {"language": "Chinese Simplified", "multiverseId": 131060, "name": "微笑图腾像", "text": "{2}，{T}，牺牲微笑图腾像：从目标对手的牌库中搜寻一张牌，并将它移出对战。 然后该牌手将他的牌库洗牌。 直到你下个维持开始，你可以使用该牌。 在你下个维持开始时，若你尚未使用它，则将它置入其拥有者的坟墓场。", "type": "神器"}], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "121788", "cardKingdomId": "121091", "cardsphereId": "44374", "mcmId": "14103", "mtgjsonV4Id": "03d4560d-ae6b-5ef8-9438-979d02402449", "mtgoFoilId": "26074", "mtgoId": "26073", "multiverseId": "109708", "scryfallId": "1d8c8ecc-7637-424a-bae2-ed3b8678f97d", "scryfallIllustrationId": "7787e84e-42d7-4500-b27c-9602ea3417bc", "scryfallOracleId": "fa798a3d-7797-4795-b251-a45f0429d169", "tcgplayerProductId": "14602"}, "isReprint": true, "isTimeshifted": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{4}", "manaValue": 4.0, "name": "Grinning Totem", "number": "110", "originalText": "{2}, {T}, Sacrifice Grinning Totem: Search target opponent's library for a card and remove it from the game. Then that player shuffles his or her library. Until the beginning of your next upkeep, you may play that card. At the beginning of your next upkeep, if you haven't played it, put it into its owner's graveyard.", "originalType": "Artifact", "printings": ["6ED", "MIR", "TSB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/3bee92ec19f1cd94", "cardKingdomFoil": "https://mtgjson.com/links/d269c1e5636732c4", "tcgplayer": "https://mtgjson.com/links/acc4c70c45733f2f"}, "rarity": "special", "rulings": [{"date": "2006-09-25", "text": "You may choose to find any kind of card, including a land. You must exile a card (unless the opponent’s library is empty); you can’t fail to find anything."}, {"date": "2006-09-25", "text": "“Until the beginning of your next upkeep” means the effect wears off as soon as your next upkeep starts. Your last chance to play the card is usually the End step of the player who immediately precedes you."}, {"date": "2006-09-25", "text": "The exiled card is played using the normal rules for timing and priority for its card type, as well as any other applicable restrictions. You’ll have to pay its mana cost. The only thing that’s different is you’re casting it from the Exile zone."}], "setCode": "TSB", "subtypes": [], "supertypes": [], "text": "{2}, {T}, Sacrifice Grinning Totem: Search target opponent's library for a card and exile it. Then that player shuffles. Until the beginning of your next upkeep, you may play that card. At the beginning of your next upkeep, if you haven't played it, put it into its owner's graveyard.", "type": "Artifact", "types": ["Artifact"], "uuid": "e3a61f46-9385-56a0-a1fb-a853a153888a"}