{"artist": "Dominik Mayer", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 1.0, "edhrecRank": 15925, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 555544, "name": "Grausiges Siegel", "text": "Todesopfer 1 (Sowie du diesen Zauberspruch wirkst, kannst du eine Kreatur mit Stärke 1 oder mehr opfern. Wenn du dies tust, kopiere diesen Zauberspruch. Du kannst ein neues Ziel für die Kopie bestimmen.)\nBestimme eine Kreatur oder einen Planeswalker deiner Wahl. Falls ihr bzw. ihm in diesem Zug Nicht-Kampfschaden zugefügt wurde, fügt das Grausige Siegel ihr bzw. ihm 3 Schadenspunkte zu und du erhältst 3 Lebenspunkte dazu. Anderenfalls fügt das Grausige Siegel ihr bzw. ihm 1 Schadenspunkt zu und du erhältst 1 Lebenspunkt dazu.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 555805, "name": "Sello macabro", "text": "Victimizar 1. (Al lanzar este hechizo, puedes sacrificar una criatura con fuerza de 1 o más. Cuando lo hagas, copia este hechizo y puedes elegir un nuevo objetivo para la copia.)\nElige la criatura o planeswalker objetivo. Si recibió daño que no sea de combate este turno, el Sello macabro le hace 3 puntos de daño y tú ganas 3 vidas. De lo contrario, el Sello macabro le hace 1 punto de daño y tú ganas 1 vida.", "type": "Conjuro"}, {"language": "French", "multiverseId": 556066, "name": "Sinistre sigille", "text": "Victime 1 (Au moment où vous lancez ce sort, vous pouvez sacrifier une créature de force supérieure ou égale à 1. Quand vous faites ainsi, copiez ce sort et vous pouvez choisir une nouvelle cible pour cette copie.)\nChoisissez une cible, créature ou planeswalker. Si elle a subi des blessures non-combat ce tour-ci, le Sinistre sigille lui inflige 3 blessures et vous gagnez 3 points de vie. Sinon, le Sinistre sigille lui inflige 1 blessure et vous gagnez 1 point de vie.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 556327, "name": "Sigillo Raccapricciante", "text": "Danno collaterale 1 (Mentre lanci questa magia, puoi sacrificare una creatura con forza pari o superiore a 1. Quando lo fai, copia questa magia e puoi scegliere un nuovo bersaglio per la copia.)\nScegli una creatura o un planeswalker bersaglio. Se al permanente scelto è stato inflitto danno non da combattimento in questo turno, il Sigillo Raccapricciante gli infligge 3 danni e tu guadagni 3 punti vita. Altrimenti, il Sigillo Raccapricciante gli infligge 1 danno e tu guadagni 1 punto vita.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 556588, "name": "忌まわしい印章", "text": "犠牲１（あなたがこの呪文を唱えるに際し、あなたはパワーが１以上であるクリーチャー１体を生け贄に捧げてもよい。そうしたとき、この呪文をコピーし、あなたはそのコピーの新しい対象を選んでもよい。）\nクリーチャーやプレインズウォーカーのうち１体を対象とする。それがこのターンに戦闘ダメージでないダメージを受けていたなら、忌まわしい印章はそれに３点のダメージを与え、あなたは３点のライフを得る。そうでないなら、忌まわしい印章はそれに１点のダメージを与え、あなたは１点のライフを得る。", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 556849, "name": "소름끼치는 인장", "text": "사상자 1 (이 주문을 발동하면서, 당신은 공격력이 1 이상인 생물 한 개를 희생할 수 있다. 그렇게 할 때, 이 주문을 복사하고 당신은 복사본의 목표를 새로 정할 수 있다.)\n생물 또는 플레인즈워커를 목표로 정한다. 그 목표가 이 턴에 비전투피해를 입었다면, 소름끼치는 인장은 그 목표에게 피해 3점을 입히고 당신은 생명 3점을 얻는다. 그렇지 않다면, 소름끼치는 인장은 피해 1점을 입히고 당신은 생명 1점을 얻는다.", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 557110, "name": "Insígnia Macabra", "text": "Baixa 1 (Conforme você conjura esta mágica, você pode sacrificar uma criatura com poder igual ou superior a 1. Quando fizer isso, copie esta mágica e você pode escolher um novo alvo para a cópia.)\nEscolha a criatura ou o planeswalker alvo. Se aquela permanente sofreu dano não de combate neste turno, Insígnia Macabra causa 3 pontos de dano a ela e você ganha 3 pontos de vida. Caso contrário, Insígnia Macabra causa 1 ponto de dano a ela e você ganha 1 ponto de vida.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 557371, "name": "Зловещий Знак", "text": "Потери 1 (При разыгрывании этого заклинания вы можете пожертвовать существо с силой 1 или больше. Когда вы это делаете, скопируйте это заклинание, и вы можете выбрать новую цель для той копии.)\nВыберите целевое существо или planeswalker'а. Если в этом ходу ему были нанесены небоевые повреждения, Зловещий Знак наносит ему 3 повреждения, а вы получаете 3 жизни. В противном случае Зловещий Знак наносит ему 1 повреждение, а вы получаете 1 жизнь.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 557632, "name": "恐怖印记", "text": "催命1（于你施放此咒语时，你可以牺牲一个力量等于或大于1的生物。当你如此作时，复制此咒语，且你可以为该复制品选择新的目标。）\n选择目标生物或鹏洛客。如果它本回合中受过非战斗伤害，则恐怖印记对它造成3点伤害且你获得3点生命。若否，则恐怖印记对它造成1点伤害且你获得1点生命。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 557893, "name": "恐怖印記", "text": "催命1（於你施放此咒語時，你可以犧牲一個力量等於或大於1的生物。當你如此作時，複製此咒語，且你可以為該複製品選擇新的目標。）\n選擇目標生物或鵬洛客。如果它本回合中受過非戰鬥傷害，則恐怖印記對它造成3點傷害且你獲得3點生命。若否，則恐怖印記對它造成1點傷害且你獲得1點生命。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "258959", "cardKingdomId": "258546", "cardsphereId": "86488", "mcmId": "651632", "mcmMetaId": "406605", "mtgArenaId": "80233", "mtgjsonV4Id": "1422d1c9-e3ce-5980-9f1d-40f0ab3fca56", "mtgoId": "98383", "multiverseId": "555283", "scryfallId": "6322e12d-b932-4ca1-a51d-e2a928140cc7", "scryfallIllustrationId": "66b1bfa1-9e35-4f47-83c6-710ae7837e9b", "scryfallOracleId": "b9d9d118-a073-4e73-90fe-026462d1d895", "tcgplayerProductId": "268670"}, "keywords": ["Casualty"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{B}", "manaValue": 1.0, "name": "Grisly Sigil", "number": "82", "originalText": "Casualty 1 (As you cast this spell, you may sacrifice a creature with power 1 or greater. When you do, copy this spell and you may choose a new target for the copy.)\nChoose target creature or planeswalker. If it was dealt noncombat damage this turn, Grisly Sigil deals 3 damage to it and you gain 3 life. Otherwise, Grisly Sigil deals 1 damage to it and you gain 1 life.", "originalType": "Sorcery", "printings": ["SNC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6677e17359067316", "cardKingdomFoil": "https://mtgjson.com/links/0f913b8d45222a2e", "cardmarket": "https://mtgjson.com/links/4a4c2cb7c9eac080", "tcgplayer": "https://mtgjson.com/links/0f3bcc894378c156"}, "rarity": "uncommon", "rulings": [{"date": "2022-04-29", "text": "If you cast Grisly Sigil targeting a creature or planeswalker that hasn't been dealt noncombat damage this turn, choose to pay its casualty cost, and choose not to change the target, the copy will deal 1 damage and you will gain 1 life. Then, the original spell will resolve. It will deal 3 damage, and you will gain 3 life."}, {"date": "2022-04-29", "text": "Casualty N means “As an additional cost to cast this spell, you may sacrifice a creature with power N or greater.” and “When you cast this spell, if a casualty cost was paid for it, copy it. If the spell has any targets, you may choose new targets for the copy.”"}, {"date": "2022-04-29", "text": "You may sacrifice only one creature to pay a spell's casualty cost, and you copy the spell only once."}, {"date": "2022-04-29", "text": "If you pay the casualty cost of a spell, the copy will resolve before the original spell."}, {"date": "2022-04-29", "text": "The copy of the spell is created on the stack, so it's not “cast.” Abilities that trigger when a player casts a spell won't trigger."}], "setCode": "SNC", "subtypes": [], "supertypes": [], "text": "Casualty 1 (As you cast this spell, you may sacrifice a creature with power 1 or greater. When you do, copy this spell and you may choose a new target for the copy.)\nChoose target creature or planeswalker. If it was dealt noncombat damage this turn, Grisly Sigil deals 3 damage to it and you gain 3 life. Otherwise, Grisly Sigil deals 1 damage to it and you gain 1 life.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "c7f3792e-5197-5bd2-9c93-133f0aabb9ab", "watermark": "maestros"}