{"artist": "Victor Adame Minguez", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B", "G"], "colors": ["B", "G"], "convertedManaCost": 3.0, "edhrecRank": 2445, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "0a762e82-079b-5210-a086-d7f494d14f88", "mtgoId": "91327", "scryfallId": "5970985d-670b-44f0-9f68-1cb013eea14a", "scryfallIllustrationId": "0e352086-52de-44d3-a58a-5ae0559a8e14", "scryfallOracleId": "0efb0d7e-dea0-4817-a243-15066e9ef333"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Mill"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "vintage": "Legal"}, "loyalty": "3", "manaCost": "{1}{B}{G}", "manaValue": 3.0, "name": "Grist, the Hunger Tide", "number": "91327", "originalReleaseDate": "2021-06-18", "printings": ["MH2", "PMH2", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-06-18", "text": "Grist, the Hunger Tide can be your commander as its first ability works before the game begins during deck construction."}, {"date": "2021-06-18", "text": "Anywhere but on the battlefield, Grist is a Legendary Planeswalker Creature — Grist Insect. Once it enters the battlefield, it is no longer a creature and is just a planeswalker. Anything that could search for or affect a creature or planeswalker card in zones other than the battlefield could affect Grist. For example, you could put it onto the battlefield with Chord of Calling, it could be countered by Essence Scatter (but not by Negate), and opponents couldn't make you discard it with Duress."}, {"date": "2021-06-18", "text": "If Grist is no longer on the battlefield as its first loyalty ability resolves, you will still create a 1/1 black and green Insect creature token and mill a card. If an Insect card is milled this way, you won't be able to put a loyalty counter on Grist, but you will still repeat the process. More mill for the Grist, as it were."}, {"date": "2021-06-18", "text": "Grist's second loyalty ability doesn't require a target. If you choose to sacrifice a creature as it resolves, the reflexive triggered ability triggers and you'll choose a target creature or planeswalker to destroy. This will happen even if Grist isn't on the battlefield when the loyalty ability resolves."}, {"date": "2021-06-18", "text": "Count the number of creature cards in your graveyard as the third loyalty ability resolves to determine how much life each opponent loses. If Grist is in your graveyard at this time, it'll be a creature card and will contribute to the count."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Grist"], "supertypes": ["Legendary"], "text": "As long as Grist, the Hunger Tide isn't on the battlefield, it's a 1/1 Insect creature in addition to its other types.\n[+1]: Create a 1/1 black and green Insect creature token, then mill a card. If an Insect card was milled this way, put a loyalty counter on Grist and repeat this process.\n[−2]: You may sacrifice a creature. When you do, destroy target creature or planeswalker.\n[−5]: Each opponent loses life equal to the number of creature cards in your graveyard.", "type": "Legendary Planeswalker — Grist", "types": ["Planeswalker"], "uuid": "aadfc69e-0c98-5739-aecf-f475ba993d50"}