{"artist": "Nils Hamm", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210259", "mcmId": "294428", "mtgjsonV4Id": "98a2d49f-9a3c-5705-b3d7-173d2775d7e5", "multiverseId": "423614", "scryfallId": "ecbe3339-2cd1-45e2-bac1-8ea995238c30", "scryfallIllustrationId": "ba050b27-e034-412b-934a-9d0ce27ad515", "scryfallOracleId": "1aaa60e4-47a8-4255-8a09-5f00922ccf6d", "tcgplayerProductId": "125591"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Grixis", "number": "33", "originalText": "Blue, black, and/or red creature cards in your graveyard have unearth. The unearth cost is equal to the card's mana cost. (Pay the card's mana cost: Return it to the battlefield. The creature gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.)\nWhenever you roll {Chaos}, put target creature card from a graveyard onto the battlefield under your control.", "originalType": "Plane — Alara", "printings": ["OHOP", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/4f816794195a1ebe", "tcgplayer": "https://mtgjson.com/links/b75c52d1fda62a9b"}, "rarity": "common", "rulings": [{"date": "2009-10-01", "text": "A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"}, {"date": "2009-10-01", "text": "A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."}, {"date": "2009-10-01", "text": "The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."}, {"date": "2009-10-01", "text": "If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}, {"date": "2009-10-01", "text": "Despite the appearance of the reminder text, the unearth abilities that Grixis grants are activated abilities of each individual blue, black, and/or red creature card in a graveyard. They’re not activated abilities of Grixis."}, {"date": "2009-10-01", "text": "A card’s mana cost includes its color."}, {"date": "2009-10-01", "text": "Grixis may cause a creature card in a graveyard to have multiple unearth abilities. Its owner may activate any one of those abilities."}, {"date": "2009-10-01", "text": "If you activate a creature card’s unearth ability but that card is removed from your graveyard before the ability resolves, that unearth ability will resolve and do nothing."}, {"date": "2009-10-01", "text": "Activating a creature card’s unearth ability isn’t the same as casting the creature card. The unearth ability is put on the stack, but the creature card is not. Spells and abilities that interact with activated abilities (such as Stifle) will interact with unearth, but spells and abilities that interact with spells (such as Essence Scatter) will not."}, {"date": "2009-10-01", "text": "At the beginning of the end step, a creature returned to the battlefield with unearth is exiled. This is a delayed triggered ability, and it can be countered by effects such as Stifle or Voidslime that counter triggered abilities. If the ability is countered, the creature will stay on the battlefield and the ability won’t trigger again. However, the replacement effect will still exile the creature if it would eventually leave the battlefield."}, {"date": "2009-10-01", "text": "Unearth grants haste to the creature that’s returned to the battlefield. However, neither of the exile abilities is granted to that creature. If that creature loses all its abilities, it will still be exiled at the beginning of the end step, and if it would leave the battlefield, it is still exiled instead."}, {"date": "2009-10-01", "text": "If a creature returned to the battlefield with unearth would leave the battlefield for any reason, it’s exiled instead — unless the spell or ability that’s causing the creature to leave the battlefield is actually trying to exile it! In that case, it succeeds at exiling it. If it later returns the creature card to the battlefield (as Oblivion Ring or Flickerwisp might, for example), the creature card will return to the battlefield as a new permanent with no relation to its previous existence. The unearth effect will no longer apply to it."}, {"date": "2009-10-01", "text": "Unlike the unearth ability, the chaos ability returns a creature card from a graveyard to the battlefield indefinitely."}], "setCode": "OPCA", "subtypes": ["Alara"], "supertypes": [], "text": "Blue, black, and/or red creature cards in your graveyard have unearth. The unearth cost is equal to the card's mana cost. (Pay the card's mana cost: Return it to the battlefield. The creature gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.)\nWhenever you roll {CHAOS}, put target creature card from a graveyard onto the battlefield under your control.", "type": "Plane — Alara", "types": ["Plane"], "uuid": "b16364f1-72b5-5752-9b68-aff85e02a94c"}