{"artist": "Scott M. Fischer", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 6.0, "edhrecRank": 11908, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "bd2ef5b6-bf87-510a-befd-9bcf2aa64a1c", "mtgoId": "89988", "scryfallId": "14f75702-6bb9-4edb-9b25-7f7eb21ea3ca", "scryfallIllustrationId": "fd66fead-8e7a-46ee-bc34-d1ce3f999788", "scryfallOracleId": "c7748659-0206-448f-8567-83565cb0b51a"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{W}{W}", "manaValue": 6.0, "name": "Guardian Archon", "number": "89988", "originalReleaseDate": "2021-05-01", "power": "5", "printings": ["C21", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-04-16", "text": "In a two-player game, the chosen player won’t be much of a secret."}, {"date": "2021-04-16", "text": "There are several ways to secretly choose an opponent. Perhaps the most popular way is to write the chosen player’s name on a piece of paper that is kept with Guardian Archon."}, {"date": "2021-04-16", "text": "If you control more than one Guardian Archon, you may choose a different opponent for each one. Be careful to keep track of which opponent is chosen for each Guardian Archon."}, {"date": "2021-04-16", "text": "If Guardian Archon leaves the battlefield and returns, it’s considered a new object. You may choose a new opponent and you may activate its last ability again."}, {"date": "2021-04-16", "text": "If you didn’t choose an opponent as Guardian Archon entered the battlefield, you can’t pay the cost to activate the last ability. This will usually happen because you gained control of another player’s Guardian Archon or because a creature already on the battlefield became a copy of Guardian Archon."}, {"date": "2021-04-16", "text": "Protection from a player means all of the following: (1) Neither you nor the target permanent can be the target of spells or abilities controlled by the chosen player. (2) Neither you nor the target permanent can be enchanted or equipped by any Auras or Equipment controlled by the chosen players. (Okay, Fortifications too, if the target permanent is a land.) (3) If the target permanent is a creature, it can’t be blocked by creatures controlled by the chosen player. (4) All damage that would be dealt to you or the target permanent by sources controlled by the chosen player is prevented. The same is true for sources owned by the chosen player that don’t have controllers."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Archon"], "supertypes": [], "text": "Flying\nAs Guardian Archon enters the battlefield, secretly choose an opponent.\nReveal the player you chose: You and target permanent you control each gain protection from the chosen player until end of turn. Activate only once.", "toughness": "5", "type": "Creature — Archon", "types": ["Creature"], "uuid": "51d10211-97bb-5f8e-9b99-cb6c9506de7f"}