{"artist": "Wayne Reynolds", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 7829, "finishes": ["etched"], "foreignData": [], "frameEffects": ["legendary", "inverted"], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": false, "identifiers": {"cardKingdomEtchedId": "261048", "cardsphereId": "89671", "mcmId": "660012", "mcmMetaId": "408531", "mtgjsonV4Id": "807f661a-3aec-5091-b46b-ddfaf5576abf", "scryfallId": "163a7729-b115-46dd-afb4-7a5df89c3ed1", "scryfallIllustrationId": "b5a52d1a-9c2c-4492-bd31-ac2875136a41", "scryfallOracleId": "60e7130a-d321-4e50-93a4-999013c76054", "tcgplayerEtchedProductId": "272952"}, "isStarter": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "paupercommander": "Restricted", "vintage": "Legal"}, "manaCost": "{2}{R}", "manaValue": 3.0, "name": "Gut, True Soul Zealot", "number": "506", "power": "2", "printings": ["CLB"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdomEtched": "https://mtgjson.com/links/894a8812130603eb", "cardmarket": "https://mtgjson.com/links/cb87035401af0f54", "tcgplayerEtched": "https://mtgjson.com/links/f66823ea7f3203a5"}, "rarity": "uncommon", "rulings": [{"date": "2022-06-10", "text": "You choose the player or planeswalker the Skeleton is attacking."}, {"date": "2022-06-10", "text": "Gut doesn't have to be among the attacking creatures."}, {"date": "2022-06-10", "text": "Although the Skeleton is an attacking creature, it was never declared as an attacking creature. This means that abilities that trigger whenever a creature attacks won't trigger when it enters the battlefield attacking."}, {"date": "2022-06-10", "text": "Any effects that say the Skeleton can't attack (such as that of Propaganda) affect only the declaration of attackers. They won't stop the Skeleton from entering the battlefield attacking."}, {"date": "2022-06-10", "text": "If Gut somehow becomes an artifact, you may sacrifice it to its own ability."}, {"date": "2022-06-10", "text": "Halsin, Emerald Archdruid's activated ability overwrites any previous effects that set the creature's base power and toughness to specific values. Any power- or toughness-setting effects that start to apply after Halsin's ability resolves will overwrite this effect."}, {"date": "2022-06-10", "text": "Effects that modify a creature's power and/or toughness, such as the one created by Titanic Growth, will apply to the creature no matter when they started to take effect. The same is true for any counters that change its power and/or toughness and effects that switch power and toughness."}, {"date": "2022-06-10", "text": "Choose a Background is a variant of the partner ability. You may have two commanders if one of them is a legendary creature with the choose a background ability and the other is a legendary Background enchantment. Backgrounds and cards with choose a Background do not interact with cards which have any other partner ability."}, {"date": "2022-06-10", "text": "If your Commander deck has two commanders, you can include only cards whose own color identities are also found in your commanders’ combined color identities."}, {"date": "2022-06-10", "text": "Both commanders start in the command zone, and the remaining 98 cards (or 58 cards in a Commander Draft game) of your deck are shuffled to become your library."}, {"date": "2022-06-10", "text": "If your commander loses the choose a Background ability or stops being a Background during the game, as appropriate, it is still your commander."}, {"date": "2022-06-10", "text": "Once the game begins, your two commanders are tracked separately. If you cast one, you won’t have to pay an additional {2} the first time you cast the other. A player loses the game after having been dealt 21 combat damage from any one of them, not from both of them combined (although your Background won’t usually be a creature anyway)."}, {"date": "2022-06-10", "text": "If something refers to your commander while you have two commanders, it refers to one of them of your choice. If you are instructed to perform an action on your commander (e.g. put it from the command zone into your hand due to Command Beacon), you choose one of your commanders at the time the effect happens."}, {"date": "2022-06-10", "text": "An effect that checks whether you control your commander is satisfied if you control one or both of your two commanders."}, {"date": "2022-06-10", "text": "You can choose two commanders that are the same color or colors."}, {"date": "2022-06-10", "text": "If a card refers to a commander creature you own, a Background won't usually be counted or included for that effect. If another spell or ability causes your Background to become a creature, however, it will be included. Any effect that refers to your commander or a commander you own or control without specifying creature will apply to a Background that is your commander, as appropriate."}, {"date": "2022-06-10", "text": "If you control a Background that grants an ability to commander creatures you own, and you own more than one commander creature, each of them will have that ability."}], "setCode": "CLB", "subtypes": ["Goblin", "Shaman"], "supertypes": ["Legendary"], "text": "Whenever you attack, you may sacrifice another creature or an artifact. If you do, create a 4/1 black Skeleton creature token with menace that's tapped and attacking. (It can't be blocked except by two or more creatures.)\nChoose a Background (You can have a Background as a second commander.)", "toughness": "2", "type": "Legendary Creature — Goblin Shaman", "types": ["Creature"], "uuid": "23e80ec1-4dfc-5fa9-a730-ce27a1e701d1", "variations": ["063508e0-d066-54cf-bed2-683a6d214bdd", "07e3082c-07ca-5e55-b6c6-319a4b3f20ee"]}