{"artist": "Scott Altmann", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "G"], "colors": ["B", "G"], "convertedManaCost": 3.0, "edhrecRank": 19733, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 181651, "name": "Vettel-Heckenhexe", "text": "Wenn die Vettel-Heckenhexe ins Spiel kommt und falls du zwei oder mehr Sümpfe kontrollierst, kannst du einen Spieler deiner Wahl eine Karte aus der Hand abwerfen lassen.\nWenn die Vettel-Heckenhexe ins Spiel kommt und falls du zwei oder mehr Wälder kontrollierst, kannst du eine Karte deiner Wahl aus deinem Friedhof oben auf deine Bibliothek legen.", "type": "Kreatur — Vettel, Schamane"}, {"language": "Spanish", "multiverseId": 180751, "name": "Maga errante saga", "text": "Cuando la Maga errante saga entre en juego, si controlas dos o más pantanos, puedes hacer que el jugador objetivo descarte una carta.\nCuando la Maga errante saga entre en juego, si controlas dos o más bosques, puedes poner la carta objetivo de tu cementerio en la parte superior de tu biblioteca.", "type": "Criatura — Chamán saga"}, {"language": "French", "multiverseId": 181831, "name": "Mage des haies mégère", "text": "Quand le Mage des haies mégère arrive en jeu, si vous contrôlez au moins deux marais, vous pouvez faire que le joueur ciblé se défausse d'une carte.\nQuand le Mage des haies mégère arrive en jeu, si vous contrôlez au moins deux forêts, vous pouvez mettre la carte ciblée de votre cimetière au-dessus de votre bibliothèque.", "type": "Créature : mégère et shamane"}, {"language": "Italian", "multiverseId": 181471, "name": "Strega Maga Ambulante", "text": "Quando la Strega Maga Ambulante entra in gioco, se controlli due o più Paludi, puoi fare scartare una carta a un giocatore bersaglio.\nQuando la Strega Maga Ambulante entra in gioco, se controlli due o più Foreste, puoi mettere una carta bersaglio dal tuo cimitero in cima al tuo grimorio.", "type": "Creatura — Sciamano Strega"}, {"language": "Japanese", "multiverseId": 181111, "name": "ハッグの垣魔道士", "text": "ハッグの垣魔道士が場に出たとき、あなたが沼を２つ以上コントロールしている場合、プレイヤー１人を対象とする。あなたは「そのプレイヤーはカードを１枚捨てる。」を選んでもよい。\nハッグの垣魔道士が場に出たとき、あなたが森を２つ以上コントロールしている場合、あなたの墓地にあるカードを１枚対象とする。あなたはそれをあなたのライブラリーの一番上に置いてもよい。", "type": "クリーチャー — ハッグ・シャーマン"}, {"language": "Portuguese (Brazil)", "multiverseId": 182011, "name": "Maga Rural Bruxa", "text": "Quando Maga Rural Bruxa entra em jogo, se você controla dois ou mais Pântanos, você pode fazer com que o jogador alvo descarte um card.\nQuando Maga Rural Bruxa entra em jogo, se você controla duas ou mais Florestas, você pode colocar o card alvo em seu cemitério no topo de seu grimório.", "type": "Criatura — Bruxa Xamã"}, {"language": "Russian", "multiverseId": 181291, "name": "Карга-Самоучка", "text": "Когда Карга-Самоучка входит в игру, если под вашим контролем есть два или более Болота, вы можете заставить целевого игрока сбросить карту.\nКогда Карга-Самоучка входит в игру, если под вашим контролем есть два или более Леса, вы можете положить находящуюся на вашем кладбище целевую карту на верх вашей библиотеки.", "type": "Существо — Кагра Шаман"}, {"language": "Chinese Simplified", "multiverseId": 180931, "name": "设障巫婆", "text": "当设障巫婆进场时，若你操控两个或更多沼泽，你可以令目标牌手弃一张牌。\n当设障巫婆进场时，若你操控两个或更多树林，你可以将目标牌从你的坟墓场置于你的牌库顶。", "type": "生物～巫婆／祭师"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "125418", "cardKingdomId": "125212", "cardsphereId": "16939", "mcmId": "19585", "mcmMetaId": "9973", "mtgjsonV4Id": "38e433ba-80a3-5029-9c9c-d55133c8a2ca", "mtgoFoilId": "30233", "mtgoId": "30232", "multiverseId": "157980", "scryfallId": "1d461d67-8554-4b55-8f01-909a54d23117", "scryfallIllustrationId": "2b5ff106-43a2-4319-8265-29b4d53ac5ac", "scryfallOracleId": "364e8bd6-52e5-4397-8d2a-10c4706e5a45", "tcgplayerProductId": "27128"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B/G}", "manaValue": 3.0, "name": "Hag Hedge-Mage", "number": "123", "originalText": "When Hag Hedge-Mage comes into play, if you control two or more Swamps, you may have target player discard a card.\nWhen Hag Hedge-Mage comes into play, if you control two or more Forests, you may put target card in your graveyard on top of your library.", "originalType": "Creature - Hag Shaman", "power": "2", "printings": ["EVE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/985bbfa6c68113a3", "cardKingdomFoil": "https://mtgjson.com/links/15edaca59b4c72ac", "cardmarket": "https://mtgjson.com/links/99f420a534d431dd", "tcgplayer": "https://mtgjson.com/links/e11f7651915864a9"}, "rarity": "uncommon", "rulings": [{"date": "2008-08-01", "text": "Each of the triggered abilities has an “intervening ‘if’ clause.” That means (1) the ability won’t trigger at all unless you control two or more lands of the appropriate land type when the Hedge-Mage enters the battlefield, and (2) the ability will do nothing if you don’t control two or more lands of the appropriate land type by the time it resolves."}, {"date": "2008-08-01", "text": "Both abilities trigger at the same time. You can put them on the stack in any order."}, {"date": "2008-08-01", "text": "Each of the triggered abilities look at your lands individually. This means that if you only control two dual-lands of the appropriate types, both of the abilities will trigger."}, {"date": "2008-08-01", "text": "Both abilities are optional; you choose whether to use them when they resolve. If an ability has a target, you must choose a target even if you don’t plan to use the ability."}], "setCode": "EVE", "subtypes": ["Hag", "Shaman"], "supertypes": [], "text": "When Hag Hedge-Mage enters the battlefield, if you control two or more Swamps, you may have target player discard a card.\nWhen Hag Hedge-Mage enters the battlefield, if you control two or more Forests, you may put target card from your graveyard on top of your library.", "toughness": "2", "type": "Creature — Hag Shaman", "types": ["Creature"], "uuid": "06cc030b-9ce9-5c21-a449-6b2b317b6c58"}