{"artist": "Milivoj Ćeran", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 2.0, "edhrecRank": 1647, "faceName": "Sword of the Realms", "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "547f619c-65a8-56e5-a801-519ac85242be", "mtgoId": "88202", "scryfallId": "fb1fbad0-94c8-4411-bd53-a8d27679a53a", "scryfallIllustrationId": "7445f9cb-8e82-44b9-98c4-a82c3b2aacd6", "scryfallOracleId": "acfc3e07-757f-4ccf-a65e-bee07ce87f40"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Equip"], "language": "English", "layout": "modal_dfc", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}", "manaValue": 2.0, "name": "Halvar, God of Battle // Sword of the Realms", "number": "88202", "originalReleaseDate": "2021-02-28", "otherFaceIds": ["0d05b28a-5d8e-52e6-831a-bb87a1999b8d"], "printings": ["KHM", "PKHM", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2021-02-05", "text": "There is a single triangle icon in the top left corner of the front face. There is a double triangle icon in the top left corner of the back face."}, {"date": "2021-02-05", "text": "To determine whether it is legal to play a modal double-faced card, consider only the characteristics of the face you’re playing and ignore the other face’s characteristics."}, {"date": "2021-02-05", "text": "If an effect allows you to play a specific modal double-faced card, you may cast it as a spell or play it as a land, as determined by which face you choose to play. If an effect allows you to cast (rather than “play”) a specific modal double-faced card, you can’t play it as a land."}, {"date": "2021-02-05", "text": "If an effect allows you to play a land or cast a spell from among a group of cards, you may play or cast a modal double-faced card with any face that fits the criteria of that effect."}, {"date": "2021-02-05", "text": "The converted mana cost of a modal double-faced card is based on the characteristics of the face that’s being considered. On the stack and battlefield, consider whichever face is up. In all other zones, consider only the front face. This is different than how the converted mana cost of a transforming double-faced card is determined."}, {"date": "2021-02-05", "text": "A modal double-faced card can’t be transformed or be put onto the battlefield transformed. Ignore any instruction to transform a modal double-faced card or to put one onto the battlefield transformed."}, {"date": "2021-02-05", "text": "If an effect puts a double-faced card onto the battlefield, it enters with its front face up. If that front face can’t be put onto the battlefield, it doesn’t enter the battlefield."}, {"date": "2021-02-05", "text": "If an effect instructs a player to choose a card name, the name of either face may be chosen. If that effect or a linked ability refers to a spell with the chosen name being cast and/or a land with the chosen name being played, it considers only the chosen name, not the other face’s name."}, {"date": "2021-02-05", "text": "In the Commander variant, a double-faced card’s color identity is determined by the mana costs and mana symbols in the rules text of both faces combined. If either face has a color indicator or basic land type, those are also considered."}, {"date": "2021-02-05", "text": "A creature you control is enchanted or equipped if there’s an Aura or an Equipment attached to it. You don’t have to control that Aura or Equipment."}, {"date": "2021-02-05", "text": "Similarly, you don’t have to control the Aura or Equipment that you choose as a target of Halvar’s triggered ability, but it must be attached to a creature you control."}, {"date": "2021-02-05", "text": "If either target of the triggered ability is an illegal target as the ability resolves, the ability won’t do anything. If both targets are illegal, the ability won’t resolve. If the Aura or Equipment is already attached to the target creature, nothing happens."}, {"date": "2021-02-05", "text": "If the creature equipped by Sword of the Realms dies but leaves the graveyard before the triggered ability resolves, it won’t be returned to its owner’s hand. It will just stay wherever it went."}, {"date": "2021-02-05", "text": "If Sword of the Realms is attached to a token creature that dies, the Sword’s triggered ability will trigger, but the token will cease to exist after going to the graveyard. It won’t be returned to its owner’s hand."}], "securityStamp": "oval", "setCode": "PRM", "side": "b", "subtypes": ["Equipment"], "supertypes": ["Legendary"], "text": "Equipped creature gets +2/+0 and has vigilance.\nWhenever equipped creature dies, return it to its owner's hand.\nEquip {1}{W}", "type": "Legendary Artifact — Equipment", "types": ["Artifact"], "uuid": "dc2bd4ab-e53c-5713-a399-785838147d1a"}