{"artist": "Ryan Pancoast", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B", "G"], "colors": ["B", "G"], "convertedManaCost": 4.0, "edhrecRank": 6658, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "241534", "cardsphereId": "74341", "mcmId": "535842", "mtgjsonV4Id": "357c1ba8-addc-5c5c-88af-33e1aa085476", "scryfallId": "838f4cde-c428-44ed-b7e8-e330e228a304", "scryfallIllustrationId": "0b0cfb08-9f86-4504-8235-8fd1ca1d472a", "scryfallOracleId": "d0cc7e79-69dc-4f9d-9eed-1848f8ddb1be", "tcgplayerProductId": "231612"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Mill"], "language": "English", "layout": "saga", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}{G}", "manaValue": 4.0, "name": "Harald Unites the Elves", "number": "213s", "printings": ["KHM", "PKHM"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/6ac7e959ecbc8a67", "tcgplayer": "https://mtgjson.com/links/7db9a98a451fe426"}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "For the chapter I ability, the Elf or Tyvar card you put onto the battlefield can be one of the cards you just milled, or it may be one that was already in your graveyard."}, {"date": "2021-02-05", "text": "Only Elves you control as the chapter II ability resolves will get a +1/+1 counter. Elves that come under your control later in the turn will not."}, {"date": "2021-02-05", "text": "Conversely, the triggered ability created by the chapter III ability will trigger whenever any Elf you control attacks that turn, even if you didn’t control that Elf as the chapter III ability resolved."}, {"date": "2021-02-05", "text": "The triggered ability created by the chapter III ability resolves before blockers are declared. It may remove opposing creatures before they have the chance to block."}, {"date": "2021-02-05", "text": "As a Saga enters the battlefield, its controller puts a lore counter on it. As your precombat main phase begins (immediately after your draw step), you put another lore counter on each Saga you control. Putting a lore counter on a Saga in either of these ways doesn’t use the stack."}, {"date": "2021-02-05", "text": "Each symbol on the left of a Saga’s text box represents a chapter ability. A chapter ability is a triggered ability that triggers when a lore counter that is put on the Saga causes the number of lore counters on the Saga to become equal to or greater than the ability’s chapter number. Chapter abilities are put onto the stack and may be responded to."}, {"date": "2021-02-05", "text": "A chapter ability doesn’t trigger if a lore counter is put on a Saga that already had a number of lore counters greater than or equal to that chapter’s number. For example, the third lore counter put on a Saga causes the chapter III ability to trigger, but chapters I and II won’t trigger again."}, {"date": "2021-02-05", "text": "Once a chapter ability has triggered, the ability on the stack won’t be affected if the Saga gains or loses counters, or if it leaves the battlefield."}, {"date": "2021-02-05", "text": "If multiple chapter abilities trigger at the same time, their controller puts them on the stack in any order. If any of them require targets, those targets are chosen as you put the abilities on the stack, before any of those abilities resolve."}, {"date": "2021-02-05", "text": "Removing lore counters won’t cause a previous chapter ability to trigger. If lore counters are removed from a Saga, the appropriate chapter abilities will trigger again when the Saga receives more lore counters."}, {"date": "2021-02-05", "text": "Once the number of lore counters on a Saga is greater than or equal to the greatest number among its chapter abilities, the Saga’s controller sacrifices it as soon as its chapter ability has left the stack, most likely by resolving or being countered. This state-based action doesn’t use the stack."}], "securityStamp": "oval", "setCode": "PKHM", "subtypes": ["Saga"], "supertypes": [], "text": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI — Mill three cards. You may put an Elf or Tyvar card from your graveyard onto the battlefield.\nII — Put a +1/+1 counter on each Elf you control.\nIII — Whenever an Elf you control attacks this turn, target creature an opponent controls gets -1/-1 until end of turn.", "type": "Enchantment — Saga", "types": ["Enchantment"], "uuid": "93a9a62c-90f8-57ae-a006-0de3d5e5e70d", "variations": ["0bea4217-f82f-509c-bd73-97496482010b"]}