{"artist": "Steve Prescott", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "borderless", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "215619", "cardKingdomId": "215317", "cardsphereId": "52696", "mcmId": "313528", "mcmMetaId": "235126", "mtgjsonV4Id": "1d58c12e-f63a-5c5c-8edc-f22544a8d0d4", "multiverseId": "439576", "scryfallId": "30dc6c38-18e7-44b1-91d0-dfa1acdb4106", "scryfallIllustrationId": "aae98d03-03e0-4ace-bbe3-ac813c627201", "scryfallOracleId": "7802dd26-b9fe-4b5f-bcab-f46ca92f64c9", "tcgplayerProductId": "152366"}, "isFunny": true, "keywords": ["Assemble"], "language": "English", "layout": "normal", "legalities": {}, "manaValue": 0.0, "name": "Hard Hat Area", "number": "187", "originalText": "Whenever you crank Hard Hat Area, roll two six-sided dice. Hard Hat Area assembles a number of Contraptions equal to the difference between those results. (To assemble a Contraption, put the top card of your Contraption deck face up onto one of your sprockets.)", "originalType": "Artifact — Contraption", "printings": ["UST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/cb404e9fbce821ec", "cardKingdomFoil": "https://mtgjson.com/links/5db2a6eb26ab7186", "cardmarket": "https://mtgjson.com/links/19012480363b1932", "tcgplayer": "https://mtgjson.com/links/6bafd1ae557abb0c"}, "rarity": "mythic", "rulings": [{"date": "2018-01-19", "text": "Contraptions are artifacts. Anything that interacts with artifacts will interact with Contraptions."}, {"date": "2018-01-19", "text": "Contraptions aren’t put into your main deck. They go into a separate deck called the Contraption deck."}, {"date": "2018-01-19", "text": "In Constructed formats, a Contraption deck must have at least fifteen different Contraption cards and no more than one of each."}, {"date": "2018-01-19", "text": "In Limited formats, a Contraption deck may include any number of Contraption cards in your card pool. You don’t have to include every Contraption card you draft or open in sealed deck. In those formats, your Contraption deck may include duplicates."}, {"date": "2018-01-19", "text": "In silver-bordered games using Contraptions, you have three sprockets, illustrated on the back of Contraption cards. At the start of the game, put a CRANK! counter on sprocket 3."}, {"date": "2018-01-19", "text": "While Contraptions you control are on the battlefield, the Contraption deck is not, even if you are using it to signify the three sprockets."}, {"date": "2018-01-19", "text": "If you or a permanent you control are instructed to assemble a Contraption, reveal the top card of your Contraption deck. Put it onto the battlefield on one of the three sprockets."}, {"date": "2018-01-19", "text": "At the beginning of your upkeep, if you control any Contraptions, move the CRANK! counter to the next sprocket. You may then crank any number of Contraptions on that sprocket, causing their abilities to trigger. Cranking a Contraption is always optional."}, {"date": "2018-01-19", "text": "If you crank multiple Contraptions, their abilities can be put onto the stack in any order. The ability put onto the stack will resolve first."}, {"date": "2018-01-19", "text": "If a Contraption would leave the battlefield and go to any zone other than exile, it instead goes to the scrapyard, the Contraption deck’s version of the graveyard. Things that affect the graveyard do not affect the scrapyard. You can exile Contraptions just fine."}, {"date": "2018-01-19", "text": "If you or a permanent you control assembles a Contraption and your Contraption deck is empty, nothing happens. You don’t lose the game."}, {"date": "2018-01-19", "text": "Any Contraption that’s on the battlefield and wasn’t assembled immediately heads to the scrapyard. However, if it’s a not an actual Contraption card (like Copy Artifact isn’t), it goes to your graveyard as normal. Non-Contraption cards can’t be in the scrapyard."}], "securityStamp": "oval", "setCode": "UST", "subtypes": ["Contraption"], "supertypes": [], "text": "Whenever you crank Hard Hat Area, roll two six-sided dice. Hard Hat Area assembles a number of Contraptions equal to the difference between those results. (To assemble a Contraption, put the top card of your Contraption deck face up onto one of your sprockets.)", "type": "Artifact — Contraption", "types": ["Artifact"], "uuid": "860d6591-3593-5636-b00e-532627c0670b", "watermark": "goblinexplosioneers"}