{"artist": "Dan Scott", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 1.0, "edhrecRank": 20836, "finishes": ["nonfoil", "foil"], "flavorText": "Even when fate is already written, there's always time to change the names.", "foreignData": [{"flavorText": "Selbst wenn das Schicksal schon feststeht, bleibt immer noch Zeit, die Namen darin zu ändern.", "language": "German", "multiverseId": 199569, "name": "Schicksalspfad", "text": "Die nächsten 2 Schadenspunkte, die in diesem Zug eine Schadensquelle, die du bestimmst, dir oder einer bleibenden Karte, die du kontrollierst, zufügen würde, werden stattdessen einer Kreatur oder einem Spieler deiner Wahl zugefügt.", "type": "Spontanzauber"}, {"flavorText": "Aún cuando el destino ya está escrito, siempre hay tiempo de cambiar los nombres.", "language": "Spanish", "multiverseId": 200565, "name": "En peligro", "text": "Los siguientes 2 puntos de daño que una fuente de tu elección fuera a hacerte a ti o a un permanente que controles este turno, en vez de eso, se le hacen a la criatura o jugador objetivo.", "type": "Instantáneo"}, {"flavorText": "Même quand le destin est déjà écrit, il y a toujours moyen de changer les noms.", "language": "French", "multiverseId": 199320, "name": "Mise en danger", "text": "Les prochaines 2 blessures qu'une source de votre choix devrait infliger ce tour-ci, à vous ou à un permanent que vous contrôlez, sont infligées à une cible, créature ou joueur, à la place.", "type": "Éphémère"}, {"flavorText": "Anche quando il fato è già stato scritto, c'è sempre tempo per cambiare i nomi.", "language": "Italian", "multiverseId": 200316, "name": "In Pericolo", "text": "I prossimi 2 danni che una fonte a tua scelta infliggerebbe a te o a un permanente che controlli in questo turno vengono invece inflitti a una creatura o a un giocatore bersaglio.", "type": "Istantaneo"}, {"flavorText": "運命が決まっているとしても、その担当を変える機会は常にある。", "language": "Japanese", "multiverseId": 199818, "name": "危害のあり方", "text": "クリーチャー１体かプレイヤー１人を対象とする。このターン、あなたが選んだ発生源１つが、次にあなたかあなたがコントロールするいずれかのパーマネントに与える２点のダメージは、代わりにそれに与えられる。", "type": "インスタント"}, {"flavorText": "Mesmo quando o destino já está escrito, há sempre tempo de mudar os nomes.", "language": "Portuguese (Brazil)", "multiverseId": 199071, "name": "Caminho do Perigo", "text": "Os próximos 2 pontos de dano que seriam causados por uma fonte de sua escolha a você ou a uma permanente sob seu controle neste turno em vez disso serão causados à criatura ou jogador alvo.", "type": "Mágica Instantânea"}, {"flavorText": "Даже когда судьба уже начертана, в ней всегда можно заменить имена.", "language": "Russian", "multiverseId": 200067, "name": "Путь Беды", "text": "Следующие 2 повреждения, которые выбранный вами источник должен нанести вам или перманенту под вашим контролем в этом ходу, наносятся целевому существу или игроку вместо этого.", "type": "Мгновенное заклинание"}, {"flavorText": "虽说命运天注定，但总会来得及更改上面的名字。", "language": "Chinese Simplified", "multiverseId": 200814, "name": "险境", "text": "选择一个来源。于本回合中，此来源接下来将对你或由你操控的任一永久物造成的2点伤害，改为对目标生物或牌手造成之。", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "127373", "cardKingdomId": "127131", "cardsphereId": "25919", "mcmId": "21060", "mcmMetaId": "10572", "mtgjsonV4Id": "139c9f27-0bc7-50d0-bcc7-4b5acaa95b79", "mtgoFoilId": "32598", "mtgoId": "32597", "multiverseId": "190166", "scryfallId": "d7e8a22d-a94e-4dfa-86a3-edb80a03d82a", "scryfallIllustrationId": "975381ef-bd84-42c2-9434-5865b75da4ba", "scryfallOracleId": "4c34a882-3786-4d3c-9ca4-04fa85d5e51b", "tcgplayerProductId": "32630"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{W}", "manaValue": 1.0, "name": "Harm's Way", "number": "14", "originalText": "The next 2 damage that a source of your choice would deal to you or a permanent you control this turn is dealt to target creature or player instead.", "originalType": "Instant", "printings": ["DDG", "M10"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/43769264d2eddb41", "cardKingdomFoil": "https://mtgjson.com/links/09392ada8f8ce6b8", "cardmarket": "https://mtgjson.com/links/e421a46582c9f430", "tcgplayer": "https://mtgjson.com/links/975aff73e7ad489d"}, "rarity": "uncommon", "rulings": [{"date": "2009-10-01", "text": "As you cast Harm’s Way, you target that the redirected damage will be dealt to. As Harm’s Way resolves, you choose a source of damage. You never choose the original recipient of the damage; Harm’s Way will apply to whatever the chosen source tries to deal damage to, as long as it’s you or a permanent you control."}, {"date": "2009-10-01", "text": "If the chosen source would deal just 1 damage to you or a permanent you control, Harm’s Way’s effect will redirect that damage and still have a “shield” left for another 1 damage from that source later in the turn."}, {"date": "2009-10-01", "text": "If the chosen source would simultaneously deal damage to multiple permanents you control (like Pyroclasm could) or to you and at least one permanent you control (like Earthquake could), Harm’s Way will redirect just 2 of that damage. It won’t redirect the next 2 damage that would be dealt to each recipient. You choose which 2 damage is redirected. If you like, you can choose to redirect 1 damage that would be dealt by the chosen source to each of two different recipients."}, {"date": "2009-10-01", "text": "After Harm’s Way resolves, it no longer checks to see if the target is a legal target. However, if that permanent or player can’t be dealt damage at the time the chosen source would deal damage (perhaps because the creature is no longer on the battlefield or is no longer a creature, or because the player is no longer in the game), the damage can’t be redirected. It’s dealt to the original recipient."}, {"date": "2009-10-01", "text": "Harm’s Way has no effect on damage that’s already been dealt."}], "setCode": "M10", "subtypes": [], "supertypes": [], "text": "The next 2 damage that a source of your choice would deal to you and/or permanents you control this turn is dealt to any target instead.", "type": "Instant", "types": ["Instant"], "uuid": "e39554d8-a4ae-5a62-8ef5-18a62bac9024"}