{"artist": "Raymond Swanland", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 10189, "finishes": ["nonfoil", "foil"], "flavorText": "\"There is no place like a rooftop laboratory in a lightning storm. It's where genius strikes.\"\n—Renna, Selhoff alchemist", "foreignData": [{"flavorText": "„Es gibt keinen besseren Ort als ein Dachlaboratorium während eines Gewittersturms. Dort hat man wahre Geistesblitze.\" —Renna, Sehlhof-Alchemistin", "language": "German", "multiverseId": 410907, "name": "Gezügelter Sturm", "text": "Immer wenn du einen Spontanzauber oder eine Hexerei aus deiner Hand wirkst, kannst du eine Karte deiner Wahl mit dem gleichen Namen wie jener Zauberspruch aus deinem Friedhof wirken. (Du bezahlst immer noch seine Kosten.)", "type": "Verzauberung"}, {"flavorText": "\"Ningún lugar puede compararse a un laboratorio en una azotea durante una tormenta eléctrica. Ahí es donde tienen lugar los golpes de genialidad.\" —Renna, alquimista de Selhoff", "language": "Spanish", "multiverseId": 413217, "name": "Domeñar la tormenta", "text": "Siempre que lances un hechizo de instantáneo o de conjuro de tu mano, puedes lanzar la carta objetivo con el mismo nombre que ese hechizo de tu cementerio. (Sigues pagando sus costes.)", "type": "Encantamiento"}, {"flavorText": "« Rien ne vaut un laboratoire sur un toit pendant un orage. C'est là que frappent les éclairs de génie. » —Renna, alchimiste de Selhoff", "language": "French", "multiverseId": 411237, "name": "Maîtriser la tempête", "text": "À chaque fois que vous lancez un sort d'éphémère ou de rituel depuis votre main, vous pouvez lancer une carte ciblée ayant le même nom que ce sort depuis votre cimetière. (Vous payez toujours ses coûts.)", "type": "Enchantement"}, {"flavorText": "\"Durante una tempesta di fulmini, non c'è posto migliore di un laboratorio su un tetto per farsi venire un colpo di genio.\" —Rhenna, alchimista di Selhoff", "language": "Italian", "multiverseId": 411567, "name": "Imbrigliare la Tempesta", "text": "Ogniqualvolta lanci una magia istantaneo o stregoneria dalla tua mano, puoi lanciare una carta bersaglio con lo stesso nome di quella magia dal tuo cimitero. (Paghi comunque i suoi costi.)", "type": "Incantesimo"}, {"flavorText": "「屋根の上の研究所ほど嵐の夜にいい場所はない。そこに天才が現れるのよ。」 ――セルホフの錬金術師、レナ", "language": "Japanese", "multiverseId": 411897, "name": "嵐の活用", "text": "あなたがあなたの手札からインスタント・呪文１つかソーサリー・呪文１つを唱えるたび、あなたの墓地からその呪文と同じ名前を持つカード１枚を対象とする。あなたはそれを唱えてもよい。（そのコストは支払う必要がある。）", "type": "エンチャント"}, {"flavorText": "\"벼락폭풍이 치는 날에는 지붕 실험실만한 장소가 없어. 천재적인 발상이 떠오르거든.\" —셀호프 연금술사 레나", "language": "Korean", "multiverseId": 412227, "name": "폭풍우 소환", "text": "당신이 손에서 순간마법이나 집중마법 주문을 발동할 때마다, 당신의 무덤에 있는 카드 중 그 주문과 이름이 같은 카드를 목표로 정한다. 당신은 그 카드를 발동할 수 있다. (여전히 발동 비용은 지불해야 한다.)", "type": "부여마법"}, {"flavorText": "\"Não há lugar como o telhado de um laboratório em uma tempestade de raios. É onde lampeja a genialidade.\" — Renna, alquimista de Selhoff", "language": "Portuguese (Brazil)", "multiverseId": 412557, "name": "Comandar a Tempestade", "text": "Toda vez que você conjura uma mágica instantânea ou feitiço de sua mão, você pode conjurar o card alvo com o mesmo nome daquela mágica do seu cemitério. (Você ainda paga seus custos.)", "type": "Encantamento"}, {"flavorText": "«Когда на улице буря и сверкают молнии, нет места лучше, чем лаборатория на крыше. Именно там тебя может поразить гениальное озарение». — Ренна, алхимик из Селхоффа", "language": "Russian", "multiverseId": 412887, "name": "Укрощение Бури", "text": "Каждый раз, когда вы разыгрываете мгновенное заклинание или заклинание волшебства из вашей руки, вы можете разыграть целевую карту с тем же именем, что у того заклинания, из вашего кладбища. (Вы должны оплатить ее стоимости.)", "type": "Чары"}, {"flavorText": "「没什么比雷电交加的屋顶实验室更好的地方了。那才是天才显威之处。」 ～塞贺炼金术士蕾娜", "language": "Chinese Simplified", "multiverseId": 410247, "name": "掌驭风暴", "text": "每当你从你手上施放瞬间或法术咒语时，你可以从你的坟墓场施放目标与该咒语同名的牌。（你依旧要支付其费用。）", "type": "结界"}, {"flavorText": "「沒什麼比雷電交加的屋頂實驗室更好的地方了。那才是天才顯威之處。」 ～塞賀鍊金術士蕾娜", "language": "Chinese Traditional", "multiverseId": 410577, "name": "掌馭風暴", "text": "每當你從你手上施放瞬間或巫術咒語時，你可以從你的墳墓場施放目標與該咒語同名的牌。（你依舊要支付其費用。）", "type": "結界"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "206094", "cardKingdomId": "205631", "cardsphereId": "41851", "mcmId": "288969", "mcmMetaId": "222173", "mtgjsonV4Id": "04c1adf2-77b6-5da2-977a-083d8ebbd917", "mtgoFoilId": "59995", "mtgoId": "59994", "multiverseId": "409917", "scryfallId": "5294d359-c599-40ed-9e06-2a3cc8624d6a", "scryfallIllustrationId": "ec4251ab-8f99-4fc7-8a2c-e113d962ae9a", "scryfallOracleId": "38eaf0ea-8cdd-45f4-bfb9-0f8d0fcf863a", "tcgplayerProductId": "115893"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}", "manaValue": 3.0, "name": "Harness the Storm", "number": "163", "originalText": "Whenever you cast an instant or sorcery spell from your hand, you may cast target card with the same name as that spell from your graveyard. (You still pay its costs.)", "originalType": "Enchantment", "printings": ["PSOI", "SOI"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1f4311ad1224c72a", "cardKingdomFoil": "https://mtgjson.com/links/c3d44d9c7aebad74", "cardmarket": "https://mtgjson.com/links/a559f6e27831c6ca", "tcgplayer": "https://mtgjson.com/links/b3084c80a746d1a0"}, "rarity": "rare", "rulings": [{"date": "2016-04-08", "text": "You must choose a target for Harness the Storm’s ability (if one exists) immediately after you’ve cast an instant or sorcery spell. There’s no way for that spell to be countered and then targeted by Harness the Storm once it’s in the graveyard."}, {"date": "2016-04-08", "text": "You choose whether to cast the targeted card as the ability resolves. You can’t wait to cast it later, and there’s no way for your opponents to set up a situation where you have to cast the card but don’t want to."}, {"date": "2016-04-08", "text": "If the spell you cast from your hand is countered in response to Harness the Storm’s triggered ability, you can still cast the target card while the ability is resolving."}, {"date": "2016-04-08", "text": "Because you’re paying the spell’s costs, you can pay alternative costs, such as awaken costs and surge costs from the Battle for Zendikar block. You can also pay additional costs, such as kicker costs. If the card has a mandatory additional cost, like Lightning Axe, you must pay it to cast the card."}, {"date": "2016-04-08", "text": "The spell you cast from your graveyard can target the spell you cast from your hand."}, {"date": "2016-04-08", "text": "The spell you cast from your graveyard resolves before the spell you cast from your hand. It’s put into your graveyard as it resolves."}], "securityStamp": "oval", "setCode": "SOI", "subtypes": [], "supertypes": [], "text": "Whenever you cast an instant or sorcery spell from your hand, you may cast target card with the same name as that spell from your graveyard. (You still pay its costs.)", "type": "Enchantment", "types": ["Enchantment"], "uuid": "0fdc0846-595b-577c-be09-d037d570ed25"}