{"artist": "Victor Adame Minguez", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 6.0, "edhrecRank": 13694, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "213439", "cardsphereId": "50520", "mcmId": "298987", "mtgjsonV4Id": "27ce388d-a5ae-572e-9c32-2641fe54f987", "scryfallId": "193a4aad-4c31-42dc-9a6e-c86df8e262a6", "scryfallIllustrationId": "5cca91e9-341a-4fc0-97a7-5a7cf91f8a8f", "scryfallOracleId": "af4d3489-6bba-4538-928c-50c9a7073813", "tcgplayerProductId": "137139"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{R}{R}", "manaValue": 6.0, "name": "Hazoret's Undying Fury", "number": "96s", "printings": ["HOU", "PHOU"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/9a5d3c20660875e6", "tcgplayer": "https://mtgjson.com/links/f9b0857ddc37ca78"}, "rarity": "rare", "rulings": [{"date": "2017-07-14", "text": "Each individual spell you cast this way must have converted mana cost 5 or less. Their total converted mana cost could be greater."}, {"date": "2017-07-14", "text": "No player may take any actions between the time you shuffle your library and the time you exile the top four cards."}, {"date": "2017-07-14", "text": "If you cast a card “without paying its mana cost,” you can’t choose to cast it for any alternative costs, such as emerge costs. You can, however, pay additional costs. If the card has any mandatory additional costs, such as that of Tormenting Voice, you must pay those to cast the card."}, {"date": "2017-07-14", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2017-07-14", "text": "If any abilities trigger as you cast any of those cards, they won’t be put on the stack until after you’re done casting them. They’ll resolve before any of those spells."}, {"date": "2017-07-14", "text": "If you cast any of those cards, you do so as part of the resolution of Hazoret’s Undying Fury. You can’t wait to cast them later in the turn."}, {"date": "2017-07-14", "text": "If a spell you cast this way targets another spell, it may target a spell you cast earlier during the resolution of Hazoret’s Undying Fury. It may target Hazoret’s Undying Fury as well, but Hazoret’s Undying Fury will be put into your graveyard soon afterwards and the spell’s target will become illegal."}, {"date": "2017-07-14", "text": "No lands that you control will untap during your next untap step, even lands that aren’t tapped as this spell resolves. This includes lands that enter the battlefield after this spell resolves."}, {"date": "2017-07-14", "text": "If more than one spell says that lands you control don’t untap during your next untap step, the effects will all wear off during that untap step. You’ll untap lands you control during your untap step after that one."}], "securityStamp": "oval", "setCode": "PHOU", "subtypes": [], "supertypes": [], "text": "Shuffle your library, then exile the top four cards. You may cast any number of spells with mana value 5 or less from among them without paying their mana costs. Lands you control don't untap during your next untap step.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "a7294cc9-fead-5d1d-80dc-c87f9da3b3ba"}