{"artist": "Scott Murphy", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 10346, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "212353", "cardsphereId": "49463", "mcmId": "297643", "mtgjsonV4Id": "bc2ae70a-c03a-5cb0-92ac-7759a002c54a", "scryfallId": "a4acf2a5-729d-4d80-8e0f-bd6e6de7527f", "scryfallIllustrationId": "c62af634-d55b-4131-a9cd-0301ef68529d", "scryfallOracleId": "253bec96-108c-4880-9c04-8bc99ceafa64", "tcgplayerProductId": "130647"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Embalm"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}{R}", "manaValue": 4.0, "name": "Heart-Piercer Manticore", "number": "138s", "power": "4", "printings": ["AKH", "C19", "PAKH"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/84be389aea5070b0", "tcgplayer": "https://mtgjson.com/links/f7c386af154fa055"}, "rarity": "rare", "rulings": [{"date": "2017-04-18", "text": "Heart-Piercer Manticore features a new style of triggered ability. When it enters the battlefield, its triggered ability goes on the stack without a target. While that ability is resolving, you may sacrifice a creature. If you do, a second ability triggers and you pick a target that will be dealt damage. This is different from other abilities that say “If you do . . .” in that players may cast spells and activate abilities before a creature is sacrificed and then again after the creature is sacrificed but before damage is dealt."}, {"date": "2017-04-18", "text": "Heart-Piercer Manticore’s damage-dealing ability triggers only when you sacrifice a creature as a result of the instruction of its triggered ability. It won’t trigger if you sacrifice a creature for any other reason."}, {"date": "2017-04-18", "text": "For each card with embalm, a corresponding game play supplement token can be found in some Amonkhet booster packs. These supplements are not required to play with cards with embalm; you can use the same items to represent an embalmed token as you would any other token."}, {"date": "2017-04-18", "text": "The sacrificed creature’s last known existence on the battlefield is checked to determine its power."}, {"date": "2017-04-18", "text": "The token is a Zombie in addition to its other types and is white instead of its other colors. It has no mana cost, and thus its converted mana cost is 0. These are copiable values of the token that other effects may copy."}, {"date": "2017-04-18", "text": "If the card copied by the token had any “when [this permanent] enters the battlefield” abilities, then the token also has those abilities and will trigger them when it’s created. Similarly, any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities that the token has copied will also work."}, {"date": "2017-04-18", "text": "The token copies exactly what was printed on the original card and nothing else. It doesn’t copy any information about the object the card was before it was put into your graveyard."}, {"date": "2017-04-18", "text": "You can’t sacrifice multiple creatures to deal damage multiple times."}, {"date": "2017-07-14", "text": "If a spell or ability puts a creature card with embalm into your graveyard during your main phase, you’ll have priority immediately after that spell or ability resolves. You can activate the creature card’s embalm ability before any player can exile it with an effect, such as that of Crook of Condemnation, if it’s legal for you to do so."}, {"date": "2017-07-14", "text": "Once you’ve activated an embalm ability, the card is immediately exiled. Opponents can’t try to stop the ability by exiling the card with an effect such as that of Crook of Condemnatnion."}], "securityStamp": "oval", "setCode": "PAKH", "subtypes": ["Manticore"], "supertypes": [], "text": "When Heart-Piercer Manticore enters the battlefield, you may sacrifice another creature. When you do, Heart-Piercer Manticore deals damage equal to that creature's power to any target.\nEmbalm {5}{R} ({5}{R}, Exile this card from your graveyard: Create a token that's a copy of it, except it's a white Zombie Manticore with no mana cost. Embalm only as a sorcery.)", "toughness": "3", "type": "Creature — Manticore", "types": ["Creature"], "uuid": "78e66c9b-22f0-57a0-be1f-089cae5e79b6"}