{"artist": "Scott Chou", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 15673, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 217304, "name": "Polyederfeld-Puristen", "text": "Stufe aufsteigen {2}{W} ({2}{W}: Lege eine Stufenmarke auf diese Karte. Spiele Stufe aufsteigen wie eine Hexerei.)\nSTUFE 1-4\n1/4\nFalls eine Quelle dir oder einer Kreatur, die du kontrollierst, Schaden zufügen würde, verhindere 1 dieser Schadenspunkte.\nSTUFE 5+\n2/5\nFalls eine Quelle dir oder einer Kreatur, die du kontrollierst, Schaden zufügen würde, verhindere 2 dieser Schadenspunkte.", "type": "Kreatur — Mensch, Kleriker"}, {"language": "Spanish", "multiverseId": 217056, "name": "Puristas del campo de edros", "text": "Subir de nivel {2}{W}. ({2}{W}: Pon un contador de nivel sobre esto. Sube de nivel sólo como un conjuro.)\nNIVEL 1-4\n1/4\nSi una fuente fuera a hacerte daño a ti o a una criatura que controles, prevén 1 punto de ese daño.\nNIVEL 5+\n2/5\nSi una fuente fuera a hacerte daño a ti o a una criatura que controles, prevén 2 puntos de ese daño.", "type": "Criatura — Clérigo humano"}, {"language": "French", "multiverseId": 215568, "name": "Puristes du champ d'hèdrons", "text": "Montée de niveau {2}{W} ({2}{W} : Mettez un marqueur « niveau » sur cette créature. Ne montez de niveau que lorsque vous pourriez lancer un rituel.)\nNIVEAU 1-4\n1/4\nSi une source devait infliger des blessures à vous ou à une créature que vous contrôlez, prévenez 1 de ces blessures.\nNIVEAU 5+\n2/5\nSi une source devait infliger des blessures à vous ou à une créature que vous contrôlez, prévenez 2 de ces blessures.", "type": "Créature : humain et clerc"}, {"language": "Italian", "multiverseId": 216312, "name": "Puristi del Campo di Edri", "text": "Aumentare di livello {2}{W} ({2}{W}: Metti un segnalino livello su questa creatura. Aumenta di livello solo quando potresti lanciare una stregoneria.)\nLIVELLO 1-4\n1/4\nSe una fonte sta per infliggere danni a te o a una creatura che controlli, previeni 1 di quei danni.\nLIVELLO 5+\n2/5\nSe una fonte sta per infliggere danni a te o a una creatura che controlli, previeni 2 di quei danni.", "type": "Creatura — Chierico Umano"}, {"language": "Japanese", "multiverseId": 216560, "name": "面晶体原の浄化者", "text": "Lvアップ {2}{W} ({2}{W}：この上にLvカウンターを１個置く。 Lvアップはソーサリーとしてのみ行う。）\nLv 1-4\n1/4\nいずれかの発生源があなたかあなたがコントロールするクリーチャーにダメージを与える場合、そのダメージを１点軽減する。\nLv 5+\n2/5\nいずれかの発生源があなたかあなたがコントロールするクリーチャーにダメージを与える場合、そのダメージを２点軽減する。", "type": "クリーチャー — 人間・クレリック"}, {"language": "Portuguese (Brazil)", "multiverseId": 216808, "name": "Puristas do Campo de Edro", "text": "Subir de nível {2}{W} ({2}{W}: Coloque um marcador de nível nesta criatura. Suba de nível somente quando puder jogar um feitiço.)\nNÍVEL 1-4\n1/4\nSe uma fonte for causar dano a você ou a uma criatura que você controla, previna 1 ponto daquele dano.\nNÍVEL 5+\n2/5\nSe uma fonte for causar dano a você ou a uma criatura que você controla, previna 2 pontos daquele dano.", "type": "Criatura — Humano Clérigo"}, {"language": "Russian", "multiverseId": 215816, "name": "Пуристы Эдровых Полей", "text": "Повышение уровня {2}{W} ({2}{W}: положите один жетон уровня на это существо. Повышайте уровень только как волшебство.)\nУРОВЕНЬ 1-4\n1/4\nЕсли источник должен нанести повреждения вам или существу под вашим контролем, предотвратите 1 из этих повреждений.\nУРОВЕНЬ 5+\n2/5\nЕсли источник должен нанести повреждения вам или существу под вашим контролем, предотвратите 2 из этих повреждений.", "type": "Существо — Человек Священник"}, {"language": "Chinese Simplified", "multiverseId": 216064, "name": "晶石原净化师", "text": "升级{2}{W} （{2}{W}：在其上放置一个等级指示物。 升级的时机视同法术。）\n等级1-4\n1/4\n如果任一来源将对你或由你操控的任一生物造成伤害，则防止此伤害中的1点。\n等级5+\n2/5\n如果任一来源将对你或由你操控的任一生物造成伤害，则防止此伤害中的2点。", "type": "生物～人类／僧侣"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "130997", "cardKingdomId": "130756", "cardsphereId": "39549", "mcmId": "22611", "mcmMetaId": "11289", "mtgjsonV4Id": "1a702d7a-5f55-50b7-b289-2c1d58a56c9a", "mtgoFoilId": "36357", "mtgoId": "36356", "multiverseId": "193421", "scryfallId": "c48e9f90-4b13-4281-943c-126be4ff1ce0", "scryfallIllustrationId": "0d0e4f2b-c450-41b3-8bc6-415f72eb3711", "scryfallOracleId": "ecc3e2ac-6534-4350-92f4-2c1f578d854e", "tcgplayerProductId": "34719"}, "keywords": ["Level Up"], "language": "English", "layout": "leveler", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}", "manaValue": 3.0, "name": "Hedron-Field Purists", "number": "25", "originalText": "Level up {2}{W} ({2}{W}: Put a level counter on this. Level up only as a sorcery.)\nLEVEL 1-4\n1/4\nIf a source would deal damage to you or a creature you control, prevent 1 of that damage.\nLEVEL 5+\n2/5\nIf a source would deal damage to you or a creature you control, prevent 2 of that damage.", "originalType": "Creature — Human Cleric", "power": "0", "printings": ["ROE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2a390e9a4366c57e", "cardKingdomFoil": "https://mtgjson.com/links/6133daef7e54a10c", "cardmarket": "https://mtgjson.com/links/eb923266794b5159", "tcgplayer": "https://mtgjson.com/links/4d0db88766475695"}, "rarity": "rare", "rulings": [{"date": "2010-06-15", "text": "The abilities a leveler grants to itself don’t overwrite any other abilities it may have. In particular, they don’t overwrite the creature’s level up ability; it always has that."}, {"date": "2010-06-15", "text": "Effects that set a leveler’s power or toughness to a specific value, including the effects from a level symbol’s ability, apply in timestamp order. The timestamp of each level symbol’s ability is the same as the timestamp of the leveler itself, regardless of when the most recent level counter was put on it."}, {"date": "2010-06-15", "text": "Effects that modify a leveler’s power or toughness, such as the effects of Giant Growth or Glorious Anthem, will apply to it no matter when they started to take effect. The same is true for counters that change the creature’s power or toughness (such as +1/+1 counters) and effects that switch its power and toughness."}, {"date": "2010-06-15", "text": "If another creature becomes a copy of a leveler, all of the leveler’s printed abilities — including those represented by level symbols — are copied. The current characteristics of the leveler, and the number of level counters on it, are not. The abilities, power, and toughness of the copy will be determined based on how many level counters are on the copy."}, {"date": "2010-06-15", "text": "A creature’s level is based on how many level counters it has on it, not how many times its level up ability has been activated or has resolved. If a leveler gets level counters due to some other effect (such as Clockspinning) or loses level counters for some reason (such as Vampire Hexmage), its level is changed accordingly."}, {"date": "2010-06-15", "text": "The prevention effects prevent 1 or 2 damage, as applicable, from each source (regardless of who controls it) each time that source would deal damage to you or a creature you control. They prevent damage of any kind, not just combat damage."}, {"date": "2010-06-15", "text": "Remember that Hedron-Field Purists never has both of these prevention effects at the same time."}, {"date": "2010-06-15", "text": "If a source would deal damage to multiple applicable recipients, the prevention effects apply to each of those recipients separately. For example, if Hedron-Field Purists is level 1 and you cast Earthquake (“Earthquake deals X damage to each creature without flying and each player”) with X equal to 3, that Earthquake will deal 2 damage to you, 2 damage to each creature without flying you control, 3 damage to each other player, and 3 damage to each creature without flying other players control."}, {"date": "2010-06-15", "text": "The prevention effects don’t affect damage dealt directly to a planeswalker you control."}, {"date": "2010-06-15", "text": "The effects from multiple Hedron-Field Purists are cumulative."}], "setCode": "ROE", "subtypes": ["Human", "Cleric"], "supertypes": [], "text": "Level up {2}{W} ({2}{W}: Put a level counter on this. Level up only as a sorcery.)\nLEVEL 1-4\n1/4\nIf a source would deal damage to you or a creature you control, prevent 1 of that damage.\nLEVEL 5+\n2/5\nIf a source would deal damage to you or a creature you control, prevent 2 of that damage.", "toughness": "3", "type": "Creature — Human Cleric", "types": ["Creature"], "uuid": "080da8f4-975c-5298-aba8-ae17babfd401"}