{"artist": "Jason A. Engle", "availability": ["arena", "mtgo", "paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 857, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameEffects": ["nyxtouched", "showcase", "legendary", "fullart"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "231309", "cardKingdomId": "230792", "cardsphereId": "65617", "mcmId": "430379", "mcmMetaId": "290899", "mtgArenaId": "73752", "mtgjsonV4Id": "4d404c14-83f4-5af3-add8-c44ac2b788cc", "scryfallId": "e11cf760-da35-41f2-8cf5-a5141103eeb3", "scryfallIllustrationId": "6e935860-7052-435f-81d5-fdd7c5e894f3", "scryfallOracleId": "63e596a2-9126-4af6-8782-c38687d664ad", "tcgplayerProductId": "206693"}, "isFullArt": true, "isStarter": true, "keywords": ["Indestructible"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}", "manaValue": 3.0, "name": "Heliod, Sun-Crowned", "number": "259", "power": "5", "printings": ["PRM", "PTHB", "SLD", "THB"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/f043963cf10572b2", "cardKingdomFoil": "https://mtgjson.com/links/88a553212422d06d", "cardmarket": "https://mtgjson.com/links/2afdcc3d672f1fc7", "tcgplayer": "https://mtgjson.com/links/66b95c269c23facb"}, "rarity": "mythic", "rulings": [{"date": "2020-01-24", "text": "If a God stops being a creature, it loses the type creature and the creature type God. It continues to be a legendary enchantment."}, {"date": "2020-01-24", "text": "The abilities of Gods function as long as they’re on the battlefield, regardless of whether they’re creatures."}, {"date": "2020-01-24", "text": "If a God is attacking or blocking and it stops being a creature, it will be removed from combat. It won’t rejoin combat if it resumes being a creature later during that combat."}, {"date": "2020-01-24", "text": "Counters put on a God remain on it while it’s not a creature, even if they have no effect."}, {"date": "2020-01-24", "text": "If an effect causes a God to lose all abilities, its ability that causes it to stop being a creature still applies if appropriate."}, {"date": "2020-01-24", "text": "Heliod’s triggered ability triggers just once for each life-gaining event, whether it’s 1 life from Daxos, Blessed by the Sun or 3 life from Cling to Dust. If you gain an amount of life “for each” of something or “equal to the number” of something, that life is gained as one event and Heliod’s ability triggers only once."}, {"date": "2020-01-24", "text": "If a creature is dealt lethal damage at the same time that you gain life, it can’t receive a counter from Heliod’s ability in time to save it."}, {"date": "2020-01-24", "text": "Each creature with lifelink dealing combat damage causes a separate life-gaining event. For example, if two creatures you control with lifelink deal combat damage at the same time, Heliod’s ability will trigger twice. However, if a single creature you control with lifelink deals combat damage to multiple creatures, players, and/or planeswalkers at the same time (perhaps because it has trample or was blocked by more than one creature), the ability will trigger only once."}, {"date": "2020-01-24", "text": "Heliod can be the target of its own triggered ability."}, {"date": "2020-01-24", "text": "A noncreature enchantment with a +1/+1 counter on it will be unaffected by that counter until it becomes a creature, at which time it will get +1/+1 for that counter."}, {"date": "2020-01-24", "text": "Multiple instances of lifelink on the same creature are redundant."}, {"date": "2020-01-24", "text": "In a Two-Headed Giant game, life gained by your teammate won’t cause the ability to trigger, even though it caused your team’s life total to increase."}, {"date": "2020-01-24", "text": "Colorless and generic mana symbols ({C}, {0}, {1}, {2}, {X}, and so on) in mana costs of permanents you control don’t count toward your devotion to any color."}, {"date": "2020-01-24", "text": "Mana symbols in the text boxes of permanents you control don’t count toward your devotion to any color."}, {"date": "2020-01-24", "text": "Hybrid mana symbols, monocolored hybrid mana symbols, and Phyrexian mana symbols do count toward your devotion to their color(s)."}, {"date": "2020-01-24", "text": "If an activated ability or triggered ability has an effect that depends on your devotion to a color, you count the number of mana symbols of that color among the mana costs of permanents you control as the ability resolves. The permanent with that ability will be counted if it’s still on the battlefield at that time."}, {"date": "2020-01-24", "text": "If you put an Aura on an opponent’s permanent, you still control the Aura, and mana symbols in its mana cost count towards your devotion."}, {"date": "2020-01-24", "text": "The type-changing ability that can make a God not be a creature functions only on the battlefield. It’s always a creature card in other zones, regardless of your devotion to its color. It’s always a creature spell while it’s on the stack."}, {"date": "2020-01-24", "text": "As a God enters the battlefield, your devotion to its color will determine whether any replacement effects that affect creatures entering the battlefield apply to that God. Because replacement effects are considered before the God is on the battlefield, the mana symbols in its mana cost won’t be counted when determining this."}, {"date": "2020-01-24", "text": "When a God enters the battlefield, your devotion to its color (including the mana symbols in the mana cost of the God itself) will determine if a creature entered the battlefield or not for abilities that trigger whenever a creature enters the battlefield."}], "securityStamp": "oval", "setCode": "THB", "subtypes": ["God"], "supertypes": ["Legendary"], "text": "Indestructible\nAs long as your devotion to white is less than five, Heliod isn't a creature.\nWhenever you gain life, put a +1/+1 counter on target creature or enchantment you control.\n{1}{W}: Another target creature gains lifelink until end of turn.", "toughness": "5", "type": "Legendary Enchantment Creature — God", "types": ["Enchantment", "Creature"], "uuid": "a8aabe56-13b2-584f-8def-28617d525c8f", "variations": ["3d745060-ab05-541d-9677-7fd7aff1b64d"]}