{"artist": "Greg Staples", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 6.0, "edhrecRank": 8510, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 217453, "name": "Höllenformender Dämon", "text": "Fliegend\nImmer wenn der Höllenformende Dämon einem Spieler Kampfschaden zufügt, opfere alle anderen bleibenden Karten, die du kontrollierst, und wirf alle Karten aus deiner Hand ab. Schicke die obersten sechs Karten deiner Bibliothek ins Exil. Du kannst eine beliebige Anzahl der Karten, die auf diese Weise ins Exil geschickt wurden und die kein Land sind, wirken, ohne ihre Manakosten zu bezahlen.", "type": "Kreatur — Dämon"}, {"language": "Spanish", "multiverseId": 217205, "name": "Demonio tallador infernal", "text": "Vuela.\nSiempre que el Demonio tallador infernal haga daño de combate a un jugador, sacrifica todos los otros permanentes que controlas y descarta tu mano. Exilia las primeras seis cartas de tu biblioteca. Puedes lanzar cualquier cantidad de cartas que no sean tierra exiliadas de esta manera sin pagar sus costes de maná.", "type": "Criatura — Demonio"}, {"language": "French", "multiverseId": 215717, "name": "Démon sculptenfer", "text": "Vol\nÀ chaque fois que le Démon sculptenfer inflige des blessures de combat à un joueur, sacrifiez tous les autres permanents que vous contrôlez et défaussez-vous de votre main. Exilez les six cartes du dessus de votre bibliothèque. Vous pouvez lancer n'importe quel nombre de cartes non-terrain exilées de cette manière sans payer leurs coûts de mana.", "type": "Créature : démon"}, {"language": "Italian", "multiverseId": 216461, "name": "Demone Tagliainferno", "text": "Volare\nOgniqualvolta il Demone Tagliainferno infligge danno da combattimento a un giocatore, sacrifica tutti gli altri permanenti che controlli e scarta la tua mano. Esilia le prime sei carte del tuo grimorio. Puoi lanciare un qualsiasi numero di carte non terra esiliate in questo modo senza pagare i loro costi di mana.", "type": "Creatura — Demone"}, {"language": "Japanese", "multiverseId": 216709, "name": "地獄彫りの悪魔", "text": "飛行\n地獄彫りの悪魔がいずれかのプレイヤーに戦闘ダメージを与えるたび、あなたがコントロールする他の全てのパーマネントを生け贄に捧げ、あなたの手札を捨てる。 あなたのライブラリーの一番上から６枚のカードを追放する。 あなたはこれにより追放された土地でないカードを、望む枚数それらのマナ・コストを支払うことなく唱えてもよい。", "type": "クリーチャー — デーモン"}, {"language": "Portuguese (Brazil)", "multiverseId": 216957, "name": "Demônio Escultor do Inferno", "text": "Voar\nToda vez que Demônio Escultor do Inferno causar dano de combate a um jogador, sacrifique todas as outras permanentes que você controla e descarte a sua mão. Exile os seis primeiros cards do topo de seu grimório. Você pode conjurar um número qualquer de cards que não sejam terrenos exilados dessa maneira sem pagar seus custos de mana.", "type": "Criatura — Demônio"}, {"language": "Russian", "multiverseId": 215965, "name": "Демон, Реставратор Ада", "text": "Полет\nКаждый раз когда Демон, Реставратор Ада наносит боевые повреждения игроку, пожертвуйте все другие перманенты под вашим контролем и сбросьте вашу руку. Изгоните шесть верхних карт вашей библиотеки. Вы можете разыграть любое количество не являющихся землями карт, изгнанных таким образом, без уплаты их мана-стоимости.", "type": "Существо — Демон"}, {"language": "Chinese Simplified", "multiverseId": 216213, "name": "狱雕恶魔", "text": "飞行\n每当狱雕恶魔对牌手造成战斗伤害时，牺牲所有由你操控的其他永久物并弃掉你的手牌。 放逐你牌库顶的六张牌。 你可以施放任意数量以此法放逐的非地牌，且不需支付其法术力费用。", "type": "生物～恶魔"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "130939", "cardKingdomId": "130690", "cardsphereId": "39551", "mcmId": "22418", "mcmMetaId": "11145", "mtgjsonV4Id": "8951866b-1bfd-5170-bf78-67f3d3ce64a0", "mtgoFoilId": "36483", "mtgoId": "36482", "multiverseId": "193656", "scryfallId": "984a037b-63c0-497d-b3b1-15726ef11a60", "scryfallIllustrationId": "623ef8bc-4841-4fc3-a6a9-80464c1e7693", "scryfallOracleId": "90514aa5-84b6-4be7-b6d0-b05529c97140", "tcgplayerProductId": "34807"}, "keywords": ["Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}{B}{B}", "manaValue": 6.0, "name": "Hellcarver Demon", "number": "113", "originalText": "Flying\nWhenever Hellcarver Demon deals combat damage to a player, sacrifice all other permanents you control and discard your hand. Exile the top six cards of your library. You may cast any number of nonland cards exiled this way without paying their mana costs.", "originalType": "Creature — Demon", "power": "6", "printings": ["ROE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6cff8ed34f47a7e3", "cardKingdomFoil": "https://mtgjson.com/links/a3c7fc47925e2fc6", "cardmarket": "https://mtgjson.com/links/0c7db123fa5934fa", "tcgplayer": "https://mtgjson.com/links/7bd5a4014382f0cc"}, "rarity": "mythic", "rulings": [{"date": "2010-06-15", "text": "The triggered ability is mandatory. All the permanents you control, including all lands, will be sacrificed."}, {"date": "2010-06-15", "text": "The cards from your library are exiled face up."}, {"date": "2010-06-15", "text": "You cast nonland cards from exile as part of the resolution of Hellcarver Demon’s ability. You may cast those cards in any order. Timing restrictions based on the card’s type (such as creature or sorcery) are ignored. Other restrictions are not (such as “Cast [this card] only before the combat damage step”). You cast all of the cards you like, putting them onto the stack, then Hellcarver Demon’s ability finishes resolving. The spells you cast this way will then resolve as normal, one at a time, in the opposite order that they were put on the stack."}, {"date": "2010-06-15", "text": "If you cast a card “without paying its mana cost,” you can’t pay any alternative costs. On the other hand, if the card has optional additional costs (such as kicker or multikicker), you may pay those when you cast the card. If the card has mandatory additional costs (such as Momentous Fall does), you must pay those when you cast the card."}, {"date": "2010-06-15", "text": "Any cards you can’t cast (because they’re lands or they have no legal targets, perhaps) or choose not to cast simply remain exiled."}, {"date": "2010-06-15", "text": "If you control two Hellcarver Demons that deal combat damage to a player at the same time, each Demon’s ability triggers. When the first one resolves, you’ll sacrifice all permanents except that Hellcarver Demon (meaning you’ll sacrifice the other one). Then you’ll exile six cards from your library and may cast nonland cards exiled that way. After those spells resolve, the other Demon’s ability resolves. You’ll sacrifice all permanents you now control (including the first Demon and any permanents put on the battlefield as a result of the spells you just cast), exile six more cards from your library, and cast any number of them."}], "setCode": "ROE", "subtypes": ["Demon"], "supertypes": [], "text": "Flying\nWhenever Hellcarver Demon deals combat damage to a player, sacrifice all other permanents you control and discard your hand. Exile the top six cards of your library. You may cast any number of spells from among cards exiled this way without paying their mana costs.", "toughness": "6", "type": "Creature — Demon", "types": ["Creature"], "uuid": "afd18131-6d0a-55da-ba45-c88c7534562c"}