{"artist": "Steve Argyle", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 6.0, "edhrecRank": 5876, "finishes": ["nonfoil", "foil"], "flavorText": "\"All consciousness is one, separated only by a thin veil of the physical.\"\n—Jace Beleren", "foreignData": [{"flavorText": "„Alles Bewusstsein hängt zusammen und wird nur von einem dünnen Schleier des Körperlichen voneinander getrennt.\" —Jace Beleren", "language": "German", "multiverseId": 199609, "name": "Schwarmhirn", "text": "Immer wenn ein Spieler einen Spontanzauber oder eine Hexerei wirkt, kopiert jeder andere Spieler diesen Zauberspruch. Jeder dieser Spieler kann neue Ziele für seine Kopie bestimmen.", "type": "Verzauberung"}, {"flavorText": "\"Toda conciencia es una, separada sólo por un fino velo de lo físico.\" —Jace Beleren", "language": "Spanish", "multiverseId": 200605, "name": "Mente de colmena", "text": "Siempre que un jugador lance un hechizo instantáneo o de conjuro, cada otro jugador copia ese hechizo. Cada uno de esos jugadores puede elegir nuevos objetivos para su copia.", "type": "Encantamiento"}, {"flavorText": "« Toute conscience ne fait qu'un, uniquement séparée des autres par le voile diaphane du physique. » —Jace Beleren", "language": "French", "multiverseId": 199360, "name": "Conscience collective", "text": "À chaque fois qu'un joueur lance un sort d'éphémère ou de rituel, chaque autre joueur copie ce sort. Chacun de ces joueurs peut choisir de nouvelles cibles pour sa copie.", "type": "Enchantement"}, {"flavorText": "\"La coscienza è unica, separata solo da un sottile velo di fisicità.\" —Jace Beleren", "language": "Italian", "multiverseId": 200356, "name": "Mente Collettiva", "text": "Ogniqualvolta un giocatore lancia una magia istantaneo o stregoneria, ogni altro giocatore copia quella magia. Ognuno di quei giocatori può scegliere nuovi bersagli per la propria copia.", "type": "Incantesimo"}, {"flavorText": "「全ての意識は一つであり、肉体という薄い布一枚しか隔てられていない。」 ――ジェイス・ベレレン", "language": "Japanese", "multiverseId": 199858, "name": "集団意識", "text": "いずれかのプレイヤーがインスタント呪文かソーサリー呪文を１つ唱えるたび、他の各プレイヤーはその呪文をコピーする。 その各プレイヤーは、自分のコピーの新しい対象を選んでもよい。", "type": "エンチャント"}, {"flavorText": "\"Todas as consciências estão em comunhão, sendo separadas apenas pelo fino véu que é o mundo físico.\" —Jace Beleren", "language": "Portuguese (Brazil)", "multiverseId": 199111, "name": "Mente Aglomerada", "text": "Toda vez que um jogador conjura uma mágica instantânea ou feitiço, todos os outros jogadores copiam esta mágica. Cada um desses jogadores pode escolher novos alvos para sua cópia.", "type": "Encantamento"}, {"flavorText": "«Все сознание едино, его разделяют лишь тонкие перегородки материальной формы». — Джейс Белерен", "language": "Russian", "multiverseId": 200107, "name": "Разум Улья", "text": "Каждый раз, когда игрок разыгрывает мгновенное заклинание или заклинание волшебства, все остальные игроки копируют то заклинание. Каждый из тех игроков может выбрать новые цели для своей копии.", "type": "Чары"}, {"flavorText": "「所有意识都属于一体，中间只隔着物质的薄纱。」 ～杰斯贝连", "language": "Chinese Simplified", "multiverseId": 200854, "name": "集体心智", "text": "每当任一牌手施放瞬间或法术咒语，所有其它牌手均复制该咒语。 这些牌手可以为自己的复制品选择新目标。", "type": "结界"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "127361", "cardKingdomId": "127116", "cardsphereId": "25923", "mcmId": "21100", "mcmMetaId": "10597", "mtgjsonV4Id": "0e975275-119c-5af9-aa46-e068b7939d01", "mtgoFoilId": "32810", "mtgoId": "32809", "multiverseId": "190556", "scryfallId": "88d50518-5cfc-45de-a125-acabf97b8743", "scryfallIllustrationId": "ebff5652-9aef-4c29-9b07-c700440bcd35", "scryfallOracleId": "f97e405d-4c24-4d4d-9e19-e349c073113c", "tcgplayerProductId": "32632"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{5}{U}", "manaValue": 6.0, "name": "Hive Mind", "number": "54", "originalText": "Whenever a player casts an instant or sorcery spell, each other player copies that spell. Each of those players may choose new targets for his or her copy.", "originalType": "Enchantment", "printings": ["M10"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/843e6bb31974a0a0", "cardKingdomFoil": "https://mtgjson.com/links/48ed9c5e3668e18f", "cardmarket": "https://mtgjson.com/links/79ef605bc197c7a1", "tcgplayer": "https://mtgjson.com/links/b285339eb4cdcf29"}, "rarity": "rare", "rulings": [{"date": "2009-10-01", "text": "Hive Mind’s effect is mandatory. Each other player must copy the spell whether they want to or not."}, {"date": "2009-10-01", "text": "Hive Mind will copy any instant or sorcery spell, not just one with targets."}, {"date": "2009-10-01", "text": "If a player casts an instant or sorcery spell, Hive Mind’s ability triggers and is put on the stack on top of that spell. Hive Mind’s ability will resolve first. When it does, it creates a number of copies of that spell equal to the number of players in the game minus one. First the player whose turn it is (or, if that’s the player who cast the original spell, the player to that player’s left) puts their copy on the stack, choosing new targets for it if they like. Then each other player in turn order does the same. The last copy put on the stack will be the first one that resolves. (Note that the very last thing to happen is that the original spell resolves.)"}, {"date": "2009-10-01", "text": "The copies that Hive Mind’s ability creates are created on the stack, so they’re not “cast.” Abilities that trigger when a player casts a spell (like Hive Mind’s ability itself) won’t trigger."}, {"date": "2009-10-01", "text": "Each copy will have the same targets as the spell it’s copying unless its controller chooses new ones. That player may change any number of the targets, including all of them or none of them. If, for one of the targets, the player can’t choose a new legal target, then it remains unchanged (even if the current target is illegal)."}, {"date": "2009-10-01", "text": "If the spell that’s copied is modal (that is, it says “Choose one —” or the like), the copy will have the same mode. A player can’t choose a different one."}, {"date": "2009-10-01", "text": "If the spell that’s copied has an X whose value was determined as it was cast (like Earthquake does), the copy has the same value of X."}, {"date": "2009-10-01", "text": "A copy’s controller can’t choose to pay any additional costs for the copy. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too."}, {"date": "2009-10-01", "text": "If a copy says that it affects “you,” it affects the controller of the copy, not the controller of the original spell. Similarly, if a copy says that it affects an “opponent,” it affects an opponent of the copy’s controller, not an opponent of the original spell’s controller."}], "setCode": "M10", "subtypes": [], "supertypes": [], "text": "Whenever a player casts an instant or sorcery spell, each other player copies that spell. Each of those players may choose new targets for their copy.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "67e9cf41-d028-5def-aedc-92cbf39fb986"}