{"artist": "Pete Venters", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 15896, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 154567, "name": "Gier des Hamsterers", "text": "Du verlierst 2 Lebenspunke und ziehst zwei Karten, dann befehdest du dich mit einem Gegner. Falls du die Fehde gewinnst, wiederholst du diesen Vorgang. (Jeder Spieler in einer Fehde deckt die oberste Karte seiner Bibliothek auf und legt diese Karte dann auf oder unter seine Bibliothek. Ein Spieler gewinnt die Fehde, wenn seine Karte die höheren umgewandelten Manakosten hat.)", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 156684, "name": "Avaricia del acaparador", "text": "Pierdes 2 vidas y robas dos cartas, luego enfréntate con un oponente. Si ganas, repite este proceso. (Cada jugador enfrentado muestra la primera carta de su biblioteca, luego pone esa carta en la parte superior o inferior. Gana el jugador cuya carta tenga el mayor coste de maná convertido.)", "type": "Conjuro"}, {"language": "French", "multiverseId": 155480, "name": "Avidité de l'entasseur", "text": "Vous perdez 2 points de vie et vous piochez deux cartes, puis vous confrontez un adversaire. Si vous gagnez, répétez ce processus. (Chaque joueur impliqué dans la confrontation révèle la carte du dessus de sa bibliothèque et met ensuite cette carte au-dessus ou au-dessous de celle-ci. Un joueur gagne si sa carte a un coût converti de mana plus élevé.)", "type": "Rituel"}, {"language": "Italian", "multiverseId": 155781, "name": "Avarizia dell'Accaparratore", "text": "Perdi 2 punti vita e pesca due carte, poi scontrati con un avversario. Se vinci, ripeti questo procedimento. (Ogni giocatore che si scontra rivela la prima carta del suo grimorio, poi la mette in cima o in fondo. Un giocatore vince se la sua carta aveva un costo di mana convertito maggiore.)", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 156082, "name": "貯め込み屋の欲", "text": "あなたは２点のライフを失い、カードを２枚引き、いずれかの対戦相手と激突を行う。 あなたが勝った場合、この手順を繰り返す。 （激突を行う各プレイヤーは、自分のライブラリーの一番上のカードを公開し、そのカードを一番上か一番下に置く。 自分のカードの点数で見たマナ・コストの方が大きいプレイヤーが勝つ。）", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 156985, "name": "Avidez de Acumulador", "text": "Você perde 2 pontos de vida e compra dois cards, e então confronta um oponente. Se você vencer, repita esse processo. (Cada jogador confrontante revela o card do topo de seu próprio grimório, e então coloca aquele card no topo ou no fundo deste. Vence o jogador que tiver o card com o maior custo de mana convertido.)", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 156383, "name": "Алчность Скряги", "text": "Вы теряете 2 жизни и берете две карты, затем столкнитесь с оппонентом. Если вы выиграли, повторите этот процесс. (Каждый сталкивающийся игрок показывает верхнюю карту своей библиотеки, затем кладет ту карту на верх или в низ своей библиотеки. Выигрывает тот игрок, чья карта имела большую конвертированную мана-стоимость.)", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 154868, "name": "藏宝贪欲", "text": "你失去2点生命并抓两张牌，然后与一位对手比点。 若你赢，则重复此流程。 （参与比点的牌手各展示其牌库顶牌，然后将该牌置于牌库顶部或底部。 所展示的牌之总法术力费用比较高的牌手赢得比点。）", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "124056", "cardKingdomId": "123619", "cardsphereId": "25365", "mcmId": "17858", "mcmMetaId": "9229", "mtgjsonV4Id": "9ba2a6ae-7348-59bb-9a68-e103fba6a46f", "mtgoFoilId": "28686", "mtgoId": "28685", "multiverseId": "146160", "scryfallId": "9666a328-cc51-4be1-abef-06bbe41dd866", "scryfallIllustrationId": "e9ccd423-2eef-419d-9e29-5042abe825f8", "scryfallOracleId": "60040023-7bf0-42e0-ab30-46a730675564", "tcgplayerProductId": "15524"}, "keywords": ["Clash"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}", "manaValue": 4.0, "name": "Hoarder's Greed", "number": "117", "originalText": "You lose 2 life and draw two cards, then clash with an opponent. If you win, repeat this process. (Each clashing player reveals the top card of his or her library, then puts that card on the top or bottom. A player wins if his or her card had a higher converted mana cost.)", "originalType": "Sorcery", "printings": ["LRW"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/21c758ca8eb8565c", "cardKingdomFoil": "https://mtgjson.com/links/15cb1d6a27e64968", "cardmarket": "https://mtgjson.com/links/6f6cf217508c8a9c", "tcgplayer": "https://mtgjson.com/links/a9a6a1942d6ddd14"}, "rarity": "uncommon", "rulings": [{"date": "2007-10-01", "text": "The effect will automatically repeat itself until its controller doesn’t win the clash. There’s no other way to stop it."}], "setCode": "LRW", "subtypes": [], "supertypes": [], "text": "You lose 2 life and draw two cards, then clash with an opponent. If you win, repeat this process. (Each clashing player reveals the top card of their library, then puts that card on the top or bottom. A player wins if their card had a higher mana value.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "327e27d3-0880-58f4-a29f-90f0c5acd34e"}