{"artist": "Vincent Proce", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "G"], "colors": ["B", "G"], "convertedManaCost": 7.0, "edhrecRank": 6774, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 464405, "name": "Hogaak, erwachte Nekropolis", "text": "Du kannst kein Mana bezahlen, um diesen Zauberspruch zu wirken.\nEinberufen, Wühlen (Mit jeder Kreatur, die du tappst, während du diesen Zauberspruch wirkst, bezahlst du für {1} oder ein Mana der Farbe jener Kreatur. Mit jeder Karte, die du aus deinem Friedhof ins Exil schickst, bezahlst du {1}.)\nDu kannst Hogaak, erwachte Nekropolis, aus deinem Friedhof wirken.\nVerursacht Trampelschaden", "type": "Legendäre Kreatur — Avatar"}, {"language": "Spanish", "multiverseId": 464659, "name": "Hogaak, necrópolis resurgida", "text": "No puedes usar maná para lanzar este hechizo.\nConvocar, excavar. (Cada criatura que gires al lanzar este hechizo cuenta como un pago de {1} o de un maná del color de esa criatura. Cada carta que exilies de tu cementerio cuenta como un pago de {1}.)\nPuedes lanzar a Hogaak, necrópolis resurgida desde tu cementerio.\nArrolla.", "type": "Criatura legendaria — Avatar"}, {"language": "French", "multiverseId": 464913, "name": "Hogaak, nécropole transcendée", "text": "Vous ne pouvez pas dépenser de mana pour lancer ce sort.\nConvocation, fouille (Chaque créature que vous engagez en lançant ce sort réduit son coût de {1} ou d'un mana de la couleur de cette créature. Chaque carte que vous exilez depuis votre cimetière paie {1}.)\nVous pouvez lancer Hogaak, nécropole transcendée depuis votre cimetière.\nPiétinement", "type": "Créature légendaire : avatar"}, {"language": "Italian", "multiverseId": 465167, "name": "Hogaak, Necropoli Risvegliata", "text": "Non puoi spendere mana per lanciare questa magia.\nConvocazione, esumare (Ogni creatura che TAPpi mentre lanci questa magia corrisponde al pagamento di {1} o di un mana del colore di quella creatura. Ogni carta che esili dal tuo cimitero corrisponde al pagamento di {1}.)\nPuoi lanciare Hogaak, Necropoli Risvegliata dal tuo cimitero.\nTravolgere", "type": "Creatura Leggendaria — Avatar"}, {"language": "Japanese", "multiverseId": 465421, "name": "甦る死滅都市、ホガーク", "text": "あなたは、この呪文を唱えるためにマナを支払うことはできない。\n召集、探査（この呪文を唱える段階で、あなたがタップした各クリーチャーは、それぞれ{1}かそのクリーチャーの色のマナ１点を支払う。あなたがあなたの墓地から追放した各カードは、それぞれ{1}を支払う。）\nあなたはあなたの墓地から甦る死滅都市、ホガークを唱えてもよい。\nトランプル", "type": "伝説のクリーチャー — アバター"}, {"language": "Korean", "multiverseId": 465675, "name": "부활한 네크로폴리스, 호가크", "text": "당신은 이 주문을 발동하기 위해 마나를 사용할 수 없다.\n집합, 파헤치기 (이 주문을 발동하는 동안 탭하는 각 생물은 이 주문의 비용 중 {1} 또는 그 생물의 색 마나 한 개를 지불한다. 당신이 당신의 무덤에서 추방하는 각 카드는 {1}을 지불한다.)\n당신은 부활한 네크로폴리스, 호가크를 당신의 무덤에서 발동할 수 있다.\n돌진", "type": "전설적 생물 — 화신"}, {"language": "Portuguese (Brazil)", "multiverseId": 465929, "name": "Hogaak, Necrópole Erguida", "text": "Você não pode gastar mana para conjurar esta mágica.\nConvocar, esquadrinhar (Cada criatura que você vira ao conjurar esta mágica paga por {1} ou um mana da cor daquela criatura. Cada card que você exila de seu cemitério paga por {1}.)\nVocê pode conjurar Hogaak, Necrópole Erguida, de seu cemitério.\nAtropelar", "type": "Criatura Lendária — Avatar"}, {"language": "Russian", "multiverseId": 466183, "name": "Хогаак, Восставший Некрополь", "text": "Вы не можете тратить ману на разыгрывание этого заклинания.\nСозыв, Выкапывание (Каждое существо, которое вы поворачиваете при разыгрывании этого заклинания, считается оплатой {1} или одной маны цвета того существа. Каждая карта, которую вы изгоняете из вашего кладбища, считается оплатой {1}.)\nВы можете разыгрывать Хогаак, Восставший Некрополь из вашего кладбища.\nПробивной удар", "type": "Легендарное Существо — Аватара"}, {"language": "Chinese Simplified", "multiverseId": 466437, "name": "醒转古陵寝霍佳葛", "text": "你不能用法术力来施放此咒语。\n召集，掘穴（于施放此咒语时，你每横置一个生物，就能为此咒语支付{1}或一点该生物颜色之法术力，且每从你坟墓场中放逐一张牌，也能支付{1}。）\n你可以从你的坟墓场中施放醒转古陵寝霍佳葛。\n践踏", "type": "传奇生物 ～圣者"}, {"language": "Chinese Traditional", "multiverseId": 466691, "name": "醒轉古陵寢霍佳葛", "text": "你不能用魔法力來施放此咒語。\n召集，掘穴（於施放此咒語時，你每橫置一個生物，就能為此咒語支付{1}或一點該生物顏色之魔法力，且每從你墳墓場中放逐一張牌，也能支付{1}。）\n你可以從你的墳墓場中施放醒轉古陵寢霍佳葛。\n踐踏", "type": "傳奇生物 ～聖者"}], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "225326", "cardKingdomId": "225050", "cardsphereId": "59982", "mcmId": "375378", "mcmMetaId": "271449", "mtgjsonV4Id": "625b7094-2598-5c21-b623-493946714299", "mtgoId": "72776", "multiverseId": "464151", "scryfallId": "0049e68d-0caf-474f-9523-dad343f1250a", "scryfallIllustrationId": "66448607-cac0-4f25-b1f1-0023d19c03f3", "scryfallOracleId": "97acd977-164d-49d5-b3a1-72e0d75c9016", "tcgplayerProductId": "191348"}, "keywords": ["Convoke", "Delve", "Trample"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Banned", "vintage": "Legal"}, "manaCost": "{5}{B/G}{B/G}", "manaValue": 7.0, "name": "Hogaak, Arisen Necropolis", "number": "202", "originalText": "You can't spend mana to cast this spell.\nConvoke, delve (Each creature you tap while casting this spell pays for {1} or one mana of that creature's color. Each card you exile from your graveyard pays for {1}.)\nYou may cast Hogaak, Arisen Necropolis from your graveyard.\nTrample", "originalType": "Legendary Creature — Avatar", "power": "8", "printings": ["MH1"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7f2b6fa6615ee458", "cardKingdomFoil": "https://mtgjson.com/links/0266922a34d9d212", "cardmarket": "https://mtgjson.com/links/d6a60e698664e159", "tcgplayer": "https://mtgjson.com/links/6639dc0f99996bc1"}, "rarity": "rare", "rulings": [{"date": "2021-03-19", "text": "You can tap any untapped creature you control to convoke a spell, even one you haven’t controlled continuously since the beginning of your most recent turn."}, {"date": "2021-03-19", "text": "When calculating a spell’s total cost, include any alternative costs, additional costs, or anything else that increases or reduces the cost to cast the spell. Convoke applies after the total cost is calculated. Convoke doesn’t change a spell’s mana cost or mana value."}, {"date": "2021-03-19", "text": "If a creature you control has a mana ability with {T} in the cost, activating that ability while casting a spell with convoke will result in the creature being tapped before you pay the spell’s costs. You won’t be able to tap it again for convoke. Similarly, if you sacrifice a creature to activate a mana ability while casting a spell with convoke, that creature won’t be on the battlefield when you pay the spell’s costs, so you won’t be able to tap it for convoke."}, {"date": "2021-03-19", "text": "Delve doesn’t change a spell’s mana cost or mana value. For example, Treasure Cruise’s mana value is 8 even if you exiled three cards to cast it."}, {"date": "2021-03-19", "text": "You can exile cards to pay only for generic mana, and you can’t exile more cards than the generic mana requirement of a spell with delve. For example, you can’t exile more than seven cards from your graveyard to cast Treasure Cruise unless an effect has increased its cost."}, {"date": "2021-03-19", "text": "Because delve isn’t an alternative cost, it can be used in conjunction with alternative costs, such as flashback. It can also be used to pay for additional costs that include generic mana."}], "securityStamp": "oval", "setCode": "MH1", "subtypes": ["Avatar"], "supertypes": ["Legendary"], "text": "You can't spend mana to cast this spell.\nConvoke, delve (Each creature you tap while casting this spell pays for {1} or one mana of that creature's color. Each card you exile from your graveyard pays for {1}.)\nYou may cast Hogaak, Arisen Necropolis from your graveyard.\nTrample", "toughness": "8", "type": "Legendary Creature — Avatar", "types": ["Creature"], "uuid": "6157b0c4-d9da-58ef-b828-fadaa2e7aeae"}