{"artist": "Nikola Matkovic", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 1.0, "edhrecRank": 9107, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "266240", "cardsphereId": "94143", "mtgjsonV4Id": "3d2af362-463a-535f-9030-66f29bb792e0", "scryfallId": "0666bb2e-bd40-4487-953f-8eece37ad0df", "scryfallIllustrationId": "ea7ef2d0-0bb5-4190-a9a0-cca6f521b063", "scryfallOracleId": "cc965557-f69e-4689-8791-d3618e4ffbfa", "tcgplayerProductId": "285865"}, "isAlternative": true, "keywords": ["Endless Swarm", "Ravenous"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{X}{G}", "manaValue": 1.0, "name": "Hormagaunt Horde", "number": "93★", "power": "1", "printings": ["40K"], "promoTypes": ["surgefoil"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/c6f985a166ba56c2", "tcgplayer": "https://mtgjson.com/links/20b027d81724993c"}, "rarity": "rare", "rulings": [{"date": "2022-10-07", "text": "The Endless Swarm ability triggers only if Hormagaunt Horde is in your graveyard at the moment the land enters the battlefield."}, {"date": "2022-10-07", "text": "Players can respond to the triggered ability, but once it starts resolving and you decide whether to pay {2}{G}, it’s too late for anyone to respond."}, {"date": "2022-10-07", "text": "The Endless Swarm ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability puts a land onto the battlefield under your control."}, {"date": "2022-10-07", "text": "A creature with ravenous gets its counters as it enters the battlefield. It doesn’t enter the battlefield first and then get its counters. Any triggered ability that looks for a creature with a certain power or toughness entering the battlefield will see the counters when it checks to see if it should trigger."}, {"date": "2022-10-07", "text": "The triggered ability that checks to see if X is 5 or greater refers to the value of X that was chosen as the spell was cast, which may be different from the number of counters it entered with if there are replacement effects involved. This is also true for any other ability that it has which refers to X and triggers when it enters the battlefield."}, {"date": "2022-10-07", "text": "If another permanent enters the battlefield as a copy of a creature with Ravenous, it will not enter with any counters from the ravenous ability."}, {"date": "2022-10-07", "text": "If a permanent spell with ravenous is copied, the copy will have the same value for X, and the token permanent that the spell becomes as it enters the battlefield will enter with X counters."}], "securityStamp": "triangle", "setCode": "40K", "subtypes": ["Tyranid"], "supertypes": [], "text": "Ravenous (This creature enters the battlefield with X +1/+1 counters on it. If X is 5 or more, draw a card when it enters.)\nEndless Swarm — Whenever a land enters the battlefield under your control, you may pay {2}{G}. If you do, return Hormagaunt Horde from your graveyard to your hand.", "toughness": "1", "type": "Creature — Tyranid", "types": ["Creature"], "uuid": "35f56400-5995-5eaf-a74e-ad5d7ee5f68a", "variations": ["efc28424-a380-540e-9bfd-2f4f7f9c5227"]}