{"artist": "Eric Velhagen", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 8.0, "edhrecRank": 17796, "finishes": ["nonfoil", "foil"], "flavorText": "\"The Selesnya are gathering armies. Do you still believe they aren't preparing for war?\"\n—Teysa, to Isperia", "foreignData": [{"flavorText": "„Die Selesnija sammeln ihre Truppen. Glaubst du immer noch, dass sie sich nicht auf einen Krieg vorbereiten?\" —Teysa zu Isperia", "language": "German", "multiverseId": 355864, "name": "Gesang der Hörnerruferin", "text": "Bringe einen 4/4 grünen Nashorn-Kreaturenspielstein ins Spiel, der Trampelschaden verursacht, und führe dann Bevölkern durch. (Bringe einen Spielstein ins Spiel, der eine Kopie eines Kreaturenspielsteins ist, den du kontrollierst.)", "type": "Hexerei"}, {"flavorText": "\"Los selesnya están reuniendo ejércitos. ¿Todavía crees que no están preparándose para la guerra?\" —Teysa, a Isperia", "language": "Spanish", "multiverseId": 365586, "name": "Canto del llamacuernos", "text": "Pon en el campo de batalla una ficha de criatura Rinoceronte verde 4/4 con la habilidad de arrollar, luego repuebla. (Pon en el campo de batalla una ficha que es una copia de una ficha de criatura que controlas.)", "type": "Conjuro"}, {"flavorText": "« Les Selesnya rassemblent leurs armées. Croyez-vous encore qu'ils ne préparent pas la guerre ? » —Teysa, à Isperia", "language": "French", "multiverseId": 356138, "name": "Chant du meneur de corne", "text": "Mettez sur le champ de bataille un jeton de créature 4/4 verte Rhinocéros avec le piétinement, puis peuplez. (Mettez sur le champ de bataille un jeton qui est une copie d'un jeton de créature que vous contrôlez.)", "type": "Rituel"}, {"flavorText": "\"I Selesnya stanno radunando eserciti. Credi ancora che non si stiano preparando alla guerra?\" —Teysa, a Isperia", "language": "Italian", "multiverseId": 356412, "name": "Canto dell'Evocacorno", "text": "Metti sul campo di battaglia una pedina creatura Rinoceronte 4/4 verde con travolgere, poi popola. (Metti sul campo di battaglia una pedina che è una copia di una pedina creatura che controlli.)", "type": "Stregoneria"}, {"flavorText": "「セレズニア議事会は軍隊を招集しています。それでもまだ彼らが戦争を企てているわけではないと信じるのですか？」 ――テイサからイスペリアへ", "language": "Japanese", "multiverseId": 356686, "name": "角呼びの詠唱", "text": "トランプルを持つ緑の４/４のサイ・クリーチャー・トークンを１体戦場に出し、居住を行う。（あなたがコントロールするクリーチャー・トークン１体のコピーであるトークンを１体戦場に出す。）", "type": "ソーサリー"}, {"flavorText": "\"셀레스냐 길드가 군대를 모으고 있다. 당신은 아직도 그들이 전쟁을 준비하는 것이 아니라고 믿는가?\" —테이사, 이스페리아에게", "language": "Korean", "multiverseId": 357508, "name": "뿔나팔 구호", "text": "돌진 능력을 가진 4/4 녹색 코뿔소 생물 토큰 한 개를 전장에 놓은 후, 소집한다. (당신이 조종하는 어느 생물 토큰의 복사본인 토큰 한 개를 전장에 놓는다.)", "type": "집중마법"}, {"flavorText": "\"Os Selesnya estão reunindo exércitos. Você ainda acha que eles não estão se preparando para a guerra?\" — Teysa, a Isperia", "language": "Portuguese (Brazil)", "multiverseId": 356960, "name": "Cântico do Invocador de Chifres", "text": "Coloque no campo de batalha uma ficha de criatura verde 4/4 do tipo Rinoceronte com atropelar e, depois, povoe. (Coloque no campo de batalha uma ficha que seja uma cópia de uma ficha de criatura que você controla.)", "type": "Feitiço"}, {"flavorText": "«Селезнийцы собирают армию. Ты все еще не веришь, что они готовятся к войне?» — Тейса, обращаясь к Исперии", "language": "Russian", "multiverseId": 355316, "name": "Напев Призывательницы Носорогов", "text": "Положите на поле битвы одну фишку существа 4/4 зеленый Носорог с Пробивным ударом, затем используйте Заселение. (Положите на поле битвы одну фишку, являющуюся копией фишки существа под вашим контролем.)", "type": "Волшебство"}, {"flavorText": "「瑟雷尼亚正在召集军队。你还是认为他们尚未备战吗？」 ～泰莎告诉伊佩利", "language": "Chinese Simplified", "multiverseId": 357234, "name": "唤角师吟颂", "text": "将一个4/4绿色，具践踏异能的犀牛衍生生物放进战场，然后殖民。（将一个衍生物放进战场，此衍生物为由你操控的某衍生生物之复制品。）", "type": "法术"}, {"flavorText": "「瑟雷尼亞正在召集軍隊。妳還是認為他們尚未備戰嗎？」 ～泰莎告訴依佩利", "language": "Chinese Traditional", "multiverseId": 355590, "name": "喚角師吟頌", "text": "將一個4/4綠色，具踐踏異能的犀牛衍生生物放進戰場，然後殖民。（將一個衍生物放進戰場，此衍生物為由你操控的某衍生生物之複製品。）", "type": "巫術"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "188593", "cardKingdomId": "188307", "cardsphereId": "38722", "mcmId": "258475", "mcmMetaId": "206596", "mtgjsonV4Id": "84b3f922-9850-5d49-8919-6bfd2caaa1d5", "mtgoFoilId": "46630", "mtgoId": "46629", "multiverseId": "253536", "scryfallId": "7b8d33ed-9ca2-41d1-ba35-fdeb5b88ad44", "scryfallIllustrationId": "69e68ec1-360d-4073-acf1-21bde0a3694d", "scryfallOracleId": "8c069834-ed89-4298-989b-e67036d56196", "tcgplayerProductId": "66572"}, "keywords": ["Populate"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{7}{G}", "manaValue": 8.0, "name": "Horncaller's Chant", "number": "128", "originalText": "Put a 4/4 green Rhino creature token with trample onto the battlefield, then populate. (Put a token onto the battlefield that's a copy of a creature token you control.)", "originalType": "Sorcery", "printings": ["RTR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/c6cd6e6c058d0dcb", "cardKingdomFoil": "https://mtgjson.com/links/bab4bc26a75fea7b", "cardmarket": "https://mtgjson.com/links/1992487af2717319", "tcgplayer": "https://mtgjson.com/links/3a3839c530d2bc76"}, "rarity": "common", "rulings": [{"date": "2013-04-15", "text": "You can choose any creature token you control for populate. If a spell or ability puts a token onto the battlefield under your control and then instructs you to populate (as Coursers’ Accord does), you may choose to copy the token you just created, or you may choose to copy another creature token you control."}, {"date": "2013-04-15", "text": "If you choose to copy a creature token that’s a copy of another creature, the new creature token will copy the characteristics of whatever the original token is copying."}, {"date": "2013-04-15", "text": "The new creature token copies the characteristics of the original token as stated by the effect that put the original token onto the battlefield."}, {"date": "2013-04-15", "text": "The new token doesn’t copy whether the original token is tapped or untapped, whether it has any counters on it or Auras and Equipment attached to it, or any noncopy effects that have changed its power, toughness, color, and so on."}, {"date": "2013-04-15", "text": "Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities of the new token will work."}, {"date": "2013-04-15", "text": "If you control no creature tokens when you populate, nothing will happen."}], "setCode": "RTR", "subtypes": [], "supertypes": [], "text": "Create a 4/4 green Rhino creature token with trample, then populate. (Create a token that's a copy of a creature token you control.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "92c0ae74-e970-5124-870c-c17f45c101ba", "watermark": "selesnya"}