{"artist": "Wayne Reynolds", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "U"], "colors": ["B", "U"], "convertedManaCost": 4.0, "edhrecRank": 1295, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 435678, "name": "Geiselnehmerin", "text": "Wenn die Geiselnehmerin ins Spiel kommt, schicke ein Artefakt oder eine Kreatur deiner Wahl ins Exil, bis die Geiselnehmerin das Spiel verlässt. Du kannst jene Karte wirken, solange sie im Exil ist, und um sie zu wirken kannst du Mana ausgeben, als wäre es Mana eines beliebigen Typs.", "type": "Kreatur — Mensch, Pirat"}, {"language": "Spanish", "multiverseId": 437771, "name": "Secuestradora", "text": "Cuando la Secuestradora entre al campo de batalla, exilia la criatura o artefacto objetivo hasta que la Secuestradora deje el campo de batalla. Puedes lanzar esa carta mientras permanezca exiliada, y puedes gastar maná como si fuera maná de cualquier tipo para lanzar ese hechizo.", "type": "Criatura — Pirata humano"}, {"language": "French", "multiverseId": 435977, "name": "Preneuse d'otage", "text": "Quand la Preneuse d'otage arrive sur le champ de bataille, exilez un artefact ciblé ou une créature ciblée jusqu'à ce que la Preneuse d'otage quitte le champ de bataille. Vous pouvez lancer cette carte tant qu'elle reste exilée, et vous pouvez dépenser du mana comme s'il s'agissait de mana de n'importe quel type pour lancer ce sort.", "type": "Créature : humain et pirate"}, {"language": "Italian", "multiverseId": 436276, "name": "Sequestratrice di Ostaggi", "text": "Quando la Sequestratrice di Ostaggi entra nel campo di battaglia, esilia un artefatto o una creatura bersaglio finché la Sequestratrice di Ostaggi non lascia il campo di battaglia. Puoi lanciare quella carta fintanto che rimane esiliata e puoi spendere mana come se fosse mana di qualsiasi tipo per lanciarla.", "type": "Creatura — Pirata Umano"}, {"language": "Japanese", "multiverseId": 436575, "name": "人質取り", "text": "人質取りが戦場に出たとき、アーティファクト１つかクリーチャー１体を対象とし、人質取りが戦場を離れるまでそれを追放する。そのカードが追放され続けているかぎり、あなたはそのカードを唱えてもよい。あなたは、その呪文を唱えるために、任意のマナを望むタイプのマナであるかのように支払ってもよい。", "type": "クリーチャー — 人間・海賊"}, {"language": "Korean", "multiverseId": 436874, "name": "인질범", "text": "인질범이 전장에 들어올 때, 마법물체나 생물을 목표로 정한다. 인질범이 전장을 떠날 때까지 그 목표를 추방한다. 그 카드가 추방된 상태로 남아 있는 한 당신은 그 카드를 발동할 수 있으며, 그 주문의 발동비용을 지불하기 위한 마나는 당신이 원하는 유형의 마나인 것처럼 사용할 수 있다.", "type": "생물 — 인간 해적"}, {"language": "Portuguese (Brazil)", "multiverseId": 437173, "name": "Tomadora de Reféns", "text": "Quando Tomadora de Reféns entrar no campo de batalha, exile o artefato ou criatura alvo até que Tomadora de Reféns deixe o campo de batalha. Você pode conjurar aquele card enquanto ele permanecer exilado, e pode gastar mana como se fosse de qualquer tipo para conjurar aquela mágica.", "type": "Criatura — Humano Pirata"}, {"language": "Russian", "multiverseId": 437472, "name": "Захватчица Заложников", "text": "Когда Захватчица Заложников выходит на поле битвы, изгоните целевой артефакт или существо до тех пор, пока Захватчица Заложников не покинет поле битвы. Вы можете разыграть ту карту, пока она остается в изгнании, и вы можете тратить ману на разыгрывание того заклинания, как если бы это была мана любого типа.", "type": "Существо — Человек Пират"}, {"language": "Chinese Simplified", "multiverseId": 438070, "name": "人质挟匪", "text": "当人质挟匪进战场时，放逐目标神器或生物，直到人质挟匪离开战场为止。于该牌持续被放逐期间，你可以施放之，且你可以将法术力视同任意种类的法术力来支付施放该咒语的费用。", "type": "生物 ～人类／海盗"}, {"language": "Chinese Traditional", "multiverseId": 438369, "name": "人質挾匪", "text": "當人質挾匪進戰場時，放逐目標神器或生物，直到人質挾匪離開戰場為止。於該牌持續被放逐期間，你可以施放之，且你可以將魔法力視同任意種類的魔法力來支付施放該咒語的費用。", "type": "生物 ～人類／海盜"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "214227", "cardKingdomId": "213920", "cardsphereId": "51344", "mcmId": "301227", "mcmMetaId": "226782", "mtgArenaId": "66415", "mtgjsonV4Id": "3135f89e-1c6b-5ac6-b95b-c5fae8e225ce", "mtgoFoilId": "65467", "mtgoId": "65466", "multiverseId": "435379", "scryfallId": "e8dc67a0-05d9-463e-9794-30a7e951c240", "scryfallIllustrationId": "c9229ae3-fe8c-4c31-952b-9ebf48342e61", "scryfallOracleId": "c5c2d209-e3ef-4b0d-85f5-e7402dcf09eb", "tcgplayerProductId": "142031"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{B}", "manaValue": 4.0, "name": "Hostage Taker", "number": "223", "originalText": "When Hostage Taker enters the battlefield, exile target artifact or creature until Hostage Taker leaves the battlefield. You may cast that card for as long as it remains exiled, and you may spend mana as though it were mana of any type to cast that spell.", "originalType": "Creature — Human Pirate", "power": "2", "printings": ["2X2", "AFC", "PRM", "PXLN", "XLN"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/4534717a6ea4ce43", "cardKingdomFoil": "https://mtgjson.com/links/e10ebd520b24377f", "cardmarket": "https://mtgjson.com/links/bd3bdb78f8c4b0b7", "tcgplayer": "https://mtgjson.com/links/1d58f09de09407dd"}, "rarity": "rare", "rulings": [{"date": "2017-09-29", "text": "Hostage Taker has received errata to prevent it from targeting itself. The correct Oracle wording appears above."}, {"date": "2017-09-29", "text": "If Hostage Taker leaves the battlefield before its triggered ability resolves, the target permanent won't be exiled."}, {"date": "2017-09-29", "text": "Auras attached to the exiled permanent will be put into their owners' graveyards. Any Equipment will become unattached and remain on the battlefield. Any counters on the exiled permanent will cease to exist."}, {"date": "2017-09-29", "text": "If a token is exiled this way, it will cease to exist and won't return to the battlefield. You can't cast it."}, {"date": "2017-09-29", "text": "Once you begin to cast the exiled card, it's considered a new object. You'll control that spell and the permanent that spell becomes even if Hostage Taker leaves the battlefield."}, {"date": "2017-09-29", "text": "If it's still in exile, the exiled card returns to the battlefield immediately after Hostage Taker leaves the battlefield. Nothing happens between the two events, including state-based actions."}, {"date": "2017-09-29", "text": "In a multiplayer game, if Hostage Taker's owner leaves the game while the card is still exiled and another player owns that card, the exiled card will return to the battlefield under its owner's control. Because the one-shot effect that returns the card isn't an ability that goes on the stack, it won't cease to exist along with the leaving player's spells and abilities on the stack."}, {"date": "2017-09-29", "text": "In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. If you leave the game, any spell or permanent cards you control from Hostage Taker's ability are exiled."}], "securityStamp": "oval", "setCode": "XLN", "subtypes": ["Human", "Pirate"], "supertypes": [], "text": "When Hostage Taker enters the battlefield, exile another target creature or artifact until Hostage Taker leaves the battlefield. You may cast that card for as long as it remains exiled, and you may spend mana as though it were mana of any type to cast that spell.", "toughness": "3", "type": "Creature — Human Pirate", "types": ["Creature"], "uuid": "3bc83f75-d0e0-5ddd-b568-899ab9c0b5f7"}