{"artist": "Slawomir Maniak", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 7341, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 387368, "name": "Schlachtruf der Horde", "text": "Wenn du deinen nächsten Spontanzauber oder deine nächste Hexerei in diesem Zug wirkst, kopiere den entsprechenden Zauberspruch. Du kannst neue Ziele für die Kopie bestimmen.\nÜberfall — Falls du in diesem Zug mit mindestens einer Kreatur angegriffen hast, wenn du deinen nächsten Spontanzauber oder deine nächste Hexerei in diesem Zug wirkst, kopiere den entsprechenden Zauberspruch ein weiteres Mal. Du kannst neue Ziele für die Kopie bestimmen.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 389251, "name": "Alarido de la horda", "text": "Cuando lances tu próximo hechizo de instantáneo o de conjuro este turno, copia ese hechizo. Puedes elegir nuevos objetivos para la copia.\nIncursión — Si atacaste con una criatura este turno, cuando lances tu próximo hechizo de instantáneo o de conjuro este turno, copia ese hechizo una vez adicional. Puedes elegir nuevos objetivos para la copia.", "type": "Conjuro"}, {"language": "French", "multiverseId": 387637, "name": "Hurlement de la horde", "text": "Quand vous lancez votre prochain sort d'éphémère ou de rituel ce tour-ci, copiez ce sort. Vous pouvez choisir de nouvelles cibles pour cette copie.\nSaccage — Si vous avez attaqué avec une créature ce tour-ci, quand vous lancez votre prochain sort d'éphémère ou de rituel ce tour-ci, copiez ce sort une fois de plus. Vous pouvez choisir de nouvelles cibles pour cette copie.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 387906, "name": "Ululato dell'Orda", "text": "Quando lanci la tua prossima magia istantaneo o stregoneria in questo turno, copiala. Puoi scegliere nuovi bersagli per la copia.\nIncursione — Se hai attaccato con una creatura in questo turno, quando lanci la tua prossima magia istantaneo o stregoneria in questo turno, copiala una volta in più. Puoi scegliere nuovi bersagli per la copia.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 388175, "name": "軍族の雄叫び", "text": "このターンにあなたが次にインスタント・呪文かソーサリー・呪文を唱えたとき、その呪文をコピーする。あなたはそのコピーの新しい対象を選んでもよい。\n強襲 ― このターンにあなたがクリーチャーで攻撃していたなら、このターンにあなたが次にインスタント・呪文かソーサリー・呪文を唱えたとき、その呪文を追加でコピーする。あなたはそのコピーの新しい対象を選んでもよい。", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 388444, "name": "부족의 포효", "text": "이 턴에 다음으로 당신이 순간마법이나 집중마법 주문을 발동할 때, 그 주문을 복사한다. 당신은 그 복사본의 목표를 새로 정할 수 있다.\n습격 — 당신이 이 턴에 생물로 공격했다면, 이 턴에 다음으로 당신이 순간마법이나 집중마법 주문을 발동할 때, 그 주문을 한 번 더 복사한다. 당신은 그 복사본의 목표를 새로 정할 수 있다.", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 388713, "name": "Uivo da Horda", "text": "Quando você conjurar sua próxima mágica instantânea ou feitiço neste turno, copie aquela mágica. Você pode escolher novos alvos para a cópia.\nRaide — Se você atacou com uma criatura neste turno, ao conjurar sua próxima mágica instantânea ou feitiço neste turno, copie aquela mágica uma vez adicional. Você pode escolher novos alvos para a cópia.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 388982, "name": "Вой Орды", "text": "Когда вы будете разыгрывать ваше следующее мгновенное заклинание или заклинание волшебства в этом ходу, скопируйте то заклинание. Вы можете выбрать новые цели для той копии.\nНабег — Если в этом ходу вы атаковали существом, то когда вы будете разыгрывать ваше следующее мгновенное заклинание или заклинание волшебства в этом ходу, скопируйте то заклинание еще один раз. Вы можете выбрать новые цели для той копии.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 386830, "name": "部落怒嚎", "text": "本回合中，当你施放你的下一个瞬间或法术咒语时，复制该咒语。你可以为该复制品选择新的目标。\n突击～如果你于本回合中曾以生物攻击，则本回合中，当你施放下一个瞬间或法术咒语时，再将该咒语复制一次。你可以为该复制品选择新的目标。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 387099, "name": "部落怒嚎", "text": "本回合中，當你施放你的下一個瞬間或巫術咒語時，複製該咒語。你可以為該複製品選擇新的目標。\n突擊～如果你於本回合中曾以生物攻擊，則本回合中，當你施放下一個瞬間或巫術咒語時，再將該咒語複製一次。你可以為該複製品選擇新的目標。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "196205", "cardKingdomId": "195641", "cardsphereId": "23514", "mcmId": "269149", "mcmMetaId": "210194", "mtgjsonV4Id": "a2976038-c863-5d92-a0ad-72bd342f5c05", "mtgoFoilId": "54373", "mtgoId": "54372", "multiverseId": "386561", "scryfallId": "5db4baf3-f0dc-4b27-8323-a76764332590", "scryfallIllustrationId": "4edc6f15-a722-4b90-b3e9-ce9e980185fd", "scryfallOracleId": "76d9c310-9d06-43e8-87a9-fb03318a6cb8", "tcgplayerProductId": "92842"}, "keywords": ["Raid"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}", "manaValue": 3.0, "name": "Howl of the Horde", "number": "112", "originalText": "When you cast your next instant or sorcery spell this turn, copy that spell. You may choose new targets for the copy.\nRaid — If you attacked with a creature this turn, when you cast your next instant or sorcery spell this turn, copy that spell an additional time. You may choose new targets for the copy.", "originalType": "Sorcery", "printings": ["KTK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/f83e8333ee5fb941", "cardKingdomFoil": "https://mtgjson.com/links/9b083cc9a8be51f8", "cardmarket": "https://mtgjson.com/links/49c9b58f9b2ef674", "tcgplayer": "https://mtgjson.com/links/28a7163701919676"}, "rarity": "rare", "rulings": [{"date": "2014-09-20", "text": "When either ability resolves, it creates a copy of the instant or sorcery spell. You control each copy. Each copy is created on the stack, so it’s not “cast.” Abilities that trigger when a player casts a spell won’t trigger. The copy or copies will then resolve like normal spells, after players get a chance to cast spells and activate abilities."}, {"date": "2014-09-20", "text": "Each copy will have the same targets as the spell it’s copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can’t choose a new legal target, then it remains unchanged (even if the current target is illegal). You can choose different targets for each copy."}, {"date": "2014-09-20", "text": "Howl of the Horde creates a delayed triggered ability that triggers when you cast your next instant or sorcery spell that turn. The raid ability creates a second, identical delayed triggered ability. Each of these will create a single copy of the next instant or sorcery spell you cast during that turn. If you don’t cast another instant or sorcery spell during that turn, both delayed triggered abilities will cease to exist."}, {"date": "2014-09-20", "text": "If the spell being copied has an X whose value was determined as it was cast (like Crater’s Claws has), each copy will have the same value of X."}, {"date": "2014-09-20", "text": "If the spell being copied is modal (that is, it says “Choose one —” or the like), each copy will have the same mode. You can’t choose a different one."}, {"date": "2014-09-20", "text": "The delayed triggered abilities will copy any instant or sorcery spell, not just one with targets."}, {"date": "2018-01-19", "text": "Raid abilities care only that you attacked with a creature. It doesn’t matter how many creatures you attacked with, or which opponent or planeswalker controlled by an opponent those creatures attacked."}, {"date": "2018-01-19", "text": "Raid abilities evaluate the entire turn to see if you attacked with a creature. That creature doesn’t have to still be on the battlefield. Similarly, the player or planeswalker it attacked doesn’t have to still be in the game or on the battlefield, respectively."}], "securityStamp": "oval", "setCode": "KTK", "subtypes": [], "supertypes": [], "text": "When you cast your next instant or sorcery spell this turn, copy that spell. You may choose new targets for the copy.\nRaid — If you attacked this turn, when you cast your next instant or sorcery spell this turn, copy that spell an additional time. You may choose new targets for the copy.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "fa149d64-0700-525c-85a9-9c4d55567f9b", "watermark": "mardu"}