{"artist": "Phil Foglio", "availability": ["mtgo"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 6753, "finishes": ["nonfoil", "foil"], "flavorText": "\"One cannot cleanse the wounds of failure.\"\n—Karn, silver golem", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "4e53831f-f9b1-5b83-bd2e-edb90ea7c8eb", "mtgoFoilId": "56659", "mtgoId": "56658", "multiverseId": "397614", "scryfallId": "55ad6a45-a840-45ba-89ad-066e20e983f3", "scryfallIllustrationId": "4aed7244-448e-45ab-a0f8-129943fdb8c6", "scryfallOracleId": "ed7bdb3e-5c51-4547-9266-76a791e0b2b0"}, "isOnlineOnly": true, "isReprint": true, "isReserved": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Banned", "legacy": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}{W}", "manaValue": 4.0, "name": "Humility", "number": "16", "originalText": "All creatures lose all abilities and have base power and toughness 1/1.", "originalType": "Enchantment", "printings": ["TMP", "TPR"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2006-02-01", "text": "With a Humility and two Opalescences on the battlefield, if Humility has the latest timestamp, then all creatures are 1/1 with no abilities. If the timestamp order is Opalescence, Humility, Opalescence, the second Opalescence is 1/1, and the Humility and first Opalescence are 4/4. If Humility has the earliest timestamp, then everything is 4/4."}, {"date": "2007-02-01", "text": "Removes all creature abilities. This includes mana abilities. Animated lands will also lose the ability to tap for mana."}, {"date": "2009-10-01", "text": "This is the current interaction between Humility and Opalescence: The type-changing effect applies at layer 4, but the rest happens in the applicable layers. The rest of it will apply even if the permanent loses its ability before it’s finished applying. So if Opalescence, Humility, and Worship are on the battlefield and Opalescence entered the battlefield before Humility, the following is true: Layer 4: Humility and Worship each become creatures that are still enchantments. (Opalescence). Layer 6: Humility and Worship each lose their abilities. (Humility) Layer 7b: Humility becomes 4/4 and Worship becomes 4/4. (Opalescence). Humility becomes 1/1 and Worship becomes 1/1 (Humility). But if Humility entered the battlefield before Opalescence, the following is true: Layer 4: Humility and Worship each become creatures that are still enchantments (Opalescence). Layer 6: Humility and Worship each lose their abilities (Humility). Layer 7b: Humility becomes 1/1 and Worship becomes 1/1 (Humility). Humility becomes 4/4 and Worship becomes 4/4 (Opalescence)."}, {"date": "2009-10-01", "text": "You apply power/toughness changing effects in a series of sublayers in the following order: (a) effects from characteristic-defining abilities; (b) effects that set power and/or toughness to a specific number or value; (c) effects that modify power and/or toughness but don’t set power and/or toughness to a specific number or value; (d) changes from counters; (e) effects that switch a creature’s power and toughness. This card’s effect is always applied in (b), which means that effects applied in sublayer (c), (d), or (e) will not be overwritten; they will be applied to the new value."}], "securityStamp": "oval", "setCode": "TPR", "subtypes": [], "supertypes": [], "text": "All creatures lose all abilities and have base power and toughness 1/1.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "057b1f66-6fc8-5f86-bd94-8aa2fab59e20"}