{"artist": "Bastien L. Deharme", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 2.0, "edhrecRank": 1443, "finishes": ["foil"], "flavorText": "\"Let's begin this conversation again, and this time you will only listen.\"", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "228104", "cardsphereId": "62448", "mcmId": "403359", "mtgjsonV4Id": "c8fb3ddf-e896-52fd-b3f1-41b083b42878", "scryfallId": "e3fab4f3-35da-43a6-98e0-8259acc5b817", "scryfallIllustrationId": "15a249f8-6551-42e9-8ea9-ef5393250231", "scryfallOracleId": "3d21f710-6bbc-41ae-a8e5-02debe3e02bd", "tcgplayerProductId": "199878"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Flying", "Lifelink"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}", "manaValue": 2.0, "name": "Hushbringer", "number": "18s", "power": "1", "printings": ["ELD", "PELD"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/48c2094977b20f71", "tcgplayer": "https://mtgjson.com/links/57d5d64cc86093a4"}, "rarity": "rare", "rulings": [{"date": "2019-10-04", "text": "Hushbringer affects a creature's own triggered abilities as well as other triggered abilities that trigger when that creature enters the battlefield or dies. Such triggered abilities start with “when” or “whenever.”"}, {"date": "2019-10-04", "text": "Replacement effects are unaffected by Hushbringer's ability. For example, a creature that enters the battlefield with one +1/+1 counter on it will still receive a +1/+1 counter, and Leyline of the Void will still exile creatures that would die."}, {"date": "2019-10-04", "text": "Abilities that apply “as [this creature] enters the battlefield,” such as choosing a color with Diamond Knight, are unaffected."}, {"date": "2019-10-04", "text": "The trigger event doesn't have to specifically refer to “creatures.” In these cases, the trigger event may also refer to something being “put into a graveyard from the battlefield.” For example, an ability that triggers “whenever an artifact is put into a graveyard from the battlefield” won't trigger if an artifact creature dies while Hushbringer is on the battlefield."}, {"date": "2019-10-04", "text": "A creature entering the battlefield or dying at the same time as Hushbringer (including Hushbringer itself entering or dying) won't cause abilities to trigger."}, {"date": "2019-10-04", "text": "An ability that triggers on an event that causes a creature to die will still trigger. For example, an ability that triggers “whenever you sacrifice a creature” still triggers."}, {"date": "2019-10-04", "text": "An ability that triggers on a card leaving a zone (such as that of Syr Konrad, the Grim) won't trigger if that card is leaving its previous zone because it's entering the battlefield as a creature."}, {"date": "2019-10-04", "text": "Look at each permanent as it exists on the battlefield, taking into account continuous effects that apply to it after entering or before dying, to determine whether any triggered abilities will be stopped from triggering. For example, if a land that has become a creature dies, an ability that triggers when it dies doesn't trigger."}, {"date": "2019-10-04", "text": "An ability that triggers when a creature “leaves the battlefield” won't trigger if that creature leaves the battlefield by dying."}, {"date": "2019-10-04", "text": "An ability that triggers when a card is put into a graveyard “from anywhere” may still trigger even if a creature dies. It will trigger if the ability is of a dying creature that triggers only when that creature is put into a graveyard from anywhere, if Hushbringer is the card being put into a graveyard, or if Hushbringer leaves the battlefield at the same time as the dying creature."}], "securityStamp": "oval", "setCode": "PELD", "subtypes": ["Faerie"], "supertypes": [], "text": "Flying, lifelink\nCreatures entering the battlefield or dying don't cause abilities to trigger.", "toughness": "2", "type": "Creature — Faerie", "types": ["Creature"], "uuid": "039f260a-391a-5311-aebc-9928d5fc558e", "variations": ["828b327c-c77c-5987-8da4-478c3fea7045"]}