{"artist": "Chris Cold", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 12.0, "edhrecRank": 4121, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "108759fb-b1f4-5d9a-9302-1a3ed3c8d852", "mtgoId": "88248", "scryfallId": "3d6cd96f-0106-45db-8e7d-67f053d16e39", "scryfallIllustrationId": "1bbfdef8-c57f-44c6-8087-b98027f92506", "scryfallOracleId": "01590ff3-34fa-47aa-b5da-f0b8c1b031c6"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{10}{U}{U}", "manaValue": 12.0, "name": "Icebreaker Kraken", "number": "88248", "originalReleaseDate": "2021-02-28", "power": "8", "printings": ["KHM", "PKHM", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost you’re paying, add any cost increases, then apply any cost reductions (such as that of Icebreaker Kraken). The converted mana cost of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2021-02-05", "text": "Icebreaker Kraken’s enters-the-battlefield ability won’t tap any artifacts or creatures."}, {"date": "2021-02-05", "text": "No artifacts or creatures controlled by the player affected by Icebreaker Kraken’s enters-the-battlefield ability will untap during that player’s next untap step, even if they were untapped as the ability resolved or that player didn’t control them at that time."}, {"date": "2021-02-05", "text": "Once you announce that you’re activating the last ability, no player may take actions until the ability has been paid for. Notably, opponents can’t try to stop you from activating it by removing your snow lands."}, {"date": "2021-02-05", "text": "Snow is a supertype, not a card type. It has no rules meaning or function by itself, but spells and abilities may refer to it."}, {"date": "2021-02-05", "text": "The {S} symbol is a generic mana symbol. It represents a cost that can be paid by one mana that was produced by a snow source. That mana can be any color or colorless."}, {"date": "2021-02-05", "text": "Snow isn’t a type of mana. If an effect says you may spend mana as though it were any type, you can’t pay for {S} using mana that wasn’t produced by a snow source."}, {"date": "2021-02-05", "text": "Some cards have additional effects for each {S} spent to cast them. You can cast these spells even if you don’t spend any snow mana to cast them; their additional effects simply won’t do anything."}, {"date": "2021-02-05", "text": "The Kaldheim set doesn’t have any cards with mana costs that include {S}, but some previous sets do. If an effect says such a spell costs {1} less to cast, that reduction doesn’t apply to any {S} costs. This is also true for activated abilities that include {S} in their activation costs and effects that reduce those costs."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Kraken"], "supertypes": ["Snow"], "text": "This spell costs {1} less to cast for each snow land you control.\nWhen Icebreaker Kraken enters the battlefield, artifacts and creatures target opponent controls don't untap during that player's next untap step.\nReturn three snow lands you control to their owner's hand: Return Icebreaker Kraken to its owner's hand.", "toughness": "8", "type": "Snow Creature — Kraken", "types": ["Creature"], "uuid": "739db8c1-cc2f-50aa-8596-e19ecb83e5c8"}