{"artist": "Dan Frazier", "availability": ["mtgo"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 4.0, "edhrecRank": 17045, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "1b955202-a0f7-5d04-8b52-fd8757ee936d", "mtgoFoilId": "38853", "mtgoId": "38852", "multiverseId": "202494", "scryfallId": "5fad0f0f-b302-4f97-9cbb-a66dbfc57bae", "scryfallIllustrationId": "bec1d374-8c46-49e5-87d0-c9f1967d23ae", "scryfallOracleId": "2b7e4e70-53b1-4d4f-bdcc-56c2e15f367a"}, "isOnlineOnly": true, "isReprint": true, "isReserved": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "penny": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{4}", "manaValue": 4.0, "name": "Ice Cauldron", "number": "206", "originalText": "{X}, {T}: Put a charge counter on Ice Cauldron and exile a nonland card from your hand. You may cast that card for as long as it remains exiled. Note the type and amount of mana spent to pay this activation cost. Activate this ability only if there are no charge counters on Ice Cauldron.\n{T}, Remove a charge counter from Ice Cauldron: Add Ice Cauldron's last noted type and amount of mana to your mana pool. Spend this mana only to cast the last card exiled with Ice Cauldron.", "originalType": "Artifact", "printings": ["ICE", "ME4"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "Produces mana of the last type used to put a counter on itself, not via any other charge counters."}, {"date": "2004-10-04", "text": "The Cauldron counts only mana spent on it. It doesn’t see the value of X, so isn’t affected by cost reductions. Thus, if you spent {C}{C}{R}{R} on X, you get {C}{C}{R}{R} later even if X was 6."}, {"date": "2004-10-04", "text": "Cards which are not actually in your hand can’t be exiled by the Ice Cauldron."}, {"date": "2004-10-04", "text": "If multiple cards are exiled by the Cauldron, the mana can only be used for the card that was exiled by the Cauldron when the most recent charge counter was put there."}, {"date": "2004-10-04", "text": "The mana put in the Cauldron can only be used to cast the given spell, but you can add additional mana to a spell. This means you can pay part of the cost on one turn and the rest of it on the next turn."}, {"date": "2004-10-04", "text": "You do not have to use any mana from the Cauldron when casting the spell if you don’t want to. You don’t even have to tap the Cauldron and draw the mana, you can just cast the spell using mana from somewhere else."}, {"date": "2004-10-04", "text": "If multiple cards are exiled by the Cauldron, any one of them can be cast."}, {"date": "2004-10-04", "text": "If the ability to exile a card with the Cauldron is countered, you do not lose the card since it is exiled during resolution."}, {"date": "2004-10-04", "text": "It is possible to have more than one card exiled by the Cauldron. You can tap the Cauldron to remove the charge counter and whatever mana is on it but leave the card there. Later, you can tap it and put in mana and a charge counter to add another card."}, {"date": "2004-10-04", "text": "X can be zero. This places a zero mana counter on the Cauldron."}, {"date": "2004-10-04", "text": "You can only cast the spell when you could legally cast it normally. So no casting a sorcery on your opponent’s turn."}, {"date": "2004-10-04", "text": "The mana can be used to pay for additional costs to cast the spell."}, {"date": "2004-10-04", "text": "If the Cauldron leaves the battlefield, you can still cast any cards it exiled as though they were in your hand. You just no longer have access to the mana you charged the Cauldron with."}, {"date": "2004-10-04", "text": "Tapping the Cauldron for the mana is a mana ability."}], "setCode": "ME4", "subtypes": [], "supertypes": [], "text": "{X}, {T}: You may exile a nonland card from your hand. You may cast that card for as long as it remains exiled. Put a charge counter on Ice Cauldron and note the type and amount of mana spent to pay this activation cost. Activate only if there are no charge counters on Ice Cauldron.\n{T}, Remove a charge counter from Ice Cauldron: Add Ice Cauldron's last noted type and amount of mana. Spend this mana only to cast the last card exiled with Ice Cauldron.", "type": "Artifact", "types": ["Artifact"], "uuid": "924d1a9b-3204-5fda-b181-0dbbdecaef17"}