{"artist": "Slawomir Maniak", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G", "U"], "colors": ["G", "U"], "convertedManaCost": 2.0, "edhrecRank": 6075, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 387369, "name": "Frostfeder-Avior", "text": "Fliegend\nMorph {1}{G}{U} (Du kannst diese Karte verdeckt für {3} als eine 2/2 Kreatur wirken. Decke sie zu einem beliebigen Zeitpunkt für ihre Morph-Kosten auf.)\nWenn der Frostfeder-Avior aufgedeckt wird, kannst du eine andere Kreatur deiner Wahl auf die Hand ihres Besitzers zurückbringen.", "type": "Kreatur — Vogel, Schamane"}, {"language": "Spanish", "multiverseId": 389252, "name": "Aven plumagélida", "text": "Vuela.\nMetamorfosis {1}{G}{U}. (Puedes lanzar esta carta boca abajo como una criatura 2/2 pagando {3}. Ponla boca arriba en cualquier momento pagando su coste de metamorfosis.)\nCuando el Aven plumagélida se ponga boca arriba, puedes regresar otra criatura objetivo a la mano de su propietario.", "type": "Criatura — Chamán ave"}, {"language": "French", "multiverseId": 387638, "name": "Avemain plumeglace", "text": "Vol\nMue {1}{G}{U} (Vous pouvez lancer cette carte face cachée comme une créature 2/2 pour {3}. Retournez-la à tout moment pour son coût de mue.)\nQuand l'Avemain plumeglace est retourné face visible, vous pouvez renvoyer une autre créature ciblée dans la main de son propriétaire.", "type": "Créature : oiseau et shamane"}, {"language": "Italian", "multiverseId": 387907, "name": "Aviano Piuma Gelata", "text": "Volare\nMetamorfosi {1}{G}{U} (Puoi lanciare questa carta a faccia in giù come una creatura 2/2 pagando {3}. Girala a faccia in su in qualsiasi momento pagando il suo costo di metamorfosi.)\nQuando l'Aviano Piuma Gelata viene girato a faccia in su, puoi far tornare un'altra creatura bersaglio in mano al suo proprietario.", "type": "Creatura — Sciamano Uccello"}, {"language": "Japanese", "multiverseId": 388176, "name": "氷羽のエイヴン", "text": "飛行\n変異{1}{G}{U}（あなたはこのカードを、{3}で２/２クリーチャーとして裏向きに唱えてもよい。これの変異コストで、これをいつでも表向きにしてよい。）\n氷羽のエイヴンが表向きになったとき、他のクリーチャー１体を対象とする。あなたはそれをオーナーの手札に戻してもよい。", "type": "クリーチャー — 鳥・シャーマン"}, {"language": "Korean", "multiverseId": 388445, "name": "얼음깃털 에이븐", "text": "비행\n변이 {1}{G}{U} (당신은 {3}을 지불해서 이 카드를 뒷면 상태의 2/2 생물로 발동할 수 있다. 언제든지 변이 비용을 지불하고 앞면이 보이도록 뒤집을 수 있다.)\n얼음깃털 에이븐이 앞면으로 뒤집히면, 다른 생물을 목표로 정한다. 당신은 그 생물을 소유자의 손으로 되돌릴 수 있다.", "type": "생물 — 조류 주술사"}, {"language": "Portuguese (Brazil)", "multiverseId": 388714, "name": "Aviano Pena Gélida", "text": "Voar\nMetamorfose {1}{G}{U} (Você pode conjurar este card com a face voltada para baixo como uma criatura 2/2 por {3}. Volte sua face para cima a qualquer momento pagando seu custo de metamorfose.)\nQuando Aviano Pena Gélida for voltado para cima, você pode devolver outra criatura alvo para a mão de seu dono.", "type": "Criatura — Ave Xamã"}, {"language": "Russian", "multiverseId": 388983, "name": "Снежнокрылый Авен", "text": "Полет\nОборотень {1}{G}{U} (Вы можете разыграть эту карту рубашкой вверх как существо 2/2 за {3}. Переверните ее рубашкой вниз в любой момент за ее стоимость Оборотня.)\nКогда Снежнокрылый Авен переворачивается рубашкой вниз, вы можете вернуть другое целевое существо в руку его владельца.", "type": "Существо — Птица Шаман"}, {"language": "Chinese Simplified", "multiverseId": 386831, "name": "冰羽艾文", "text": "飞行\n变身{1}{G}{U}（你可牌面朝下地施放此牌并支付{3}，将其当成2/2生物。可随时支付其变身费用使其翻回正面。）\n当冰羽艾文翻回正面时，你可以将另一个目标生物移回其拥有者手上。", "type": "生物～鸟／祭师"}, {"language": "Chinese Traditional", "multiverseId": 387100, "name": "冰羽艾文", "text": "飛行\n變身{1}{G}{U}（你可牌面朝下地施放此牌並支付{3}，將其當成2/2生物。可隨時支付其變身費用使其翻回正面。）\n當冰羽艾文翻回正面時，你可以將另一個目標生物移回其擁有者手上。", "type": "生物～鳥／祭師"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "196213", "cardKingdomId": "195649", "cardsphereId": "23516", "mcmId": "269187", "mcmMetaId": "210210", "mtgjsonV4Id": "0de53337-db93-5cca-8dc0-7d201b8533aa", "mtgoFoilId": "54151", "mtgoId": "54150", "multiverseId": "386562", "scryfallId": "ecdee089-8e89-4c99-9390-e8f4c189cffb", "scryfallIllustrationId": "5a379f24-c808-4d3d-9839-11d0d6734cd6", "scryfallOracleId": "9fb901db-1ff7-4a8d-8233-fe7e3dee7fd1", "tcgplayerProductId": "92808"}, "keywords": ["Flying", "Morph"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{G}{U}", "manaValue": 2.0, "name": "Icefeather Aven", "number": "178", "originalText": "Flying\nMorph {1}{G}{U} (You may cast this card face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.)\nWhen Icefeather Aven is turned face up, you may return another target creature to its owner's hand.", "originalType": "Creature — Bird Shaman", "power": "2", "printings": ["C19", "KTK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/58c2feb71fa8776c", "cardKingdomFoil": "https://mtgjson.com/links/04a19baf62806c1b", "cardmarket": "https://mtgjson.com/links/fc8a3bb5d6047c13", "tcgplayer": "https://mtgjson.com/links/dbabf9e390011d36"}, "rarity": "uncommon", "rulings": [{"date": "2014-09-20", "text": "If you control the only other creatures when Icefeather Aven is turned face up, you must target one of them. You choose whether that creature is returned to its owner’s hand as the ability resolves."}, {"date": "2014-09-20", "text": "Morph lets you cast a card face down by paying {3}, and lets you turn the face-down permanent face up any time you have priority by paying its morph cost."}, {"date": "2014-09-20", "text": "The face-down spell has no mana cost and has a converted mana cost of 0. When you cast a face-down spell, put it on the stack face down so no other player knows what it is, and pay {3}. This is an alternative cost."}, {"date": "2014-09-20", "text": "When the spell resolves, it enters the battlefield as a 2/2 creature with no name, mana cost, creature types, or abilities. It’s colorless and has a converted mana cost of 0. Other effects that apply to the creature can still grant it any of these characteristics."}, {"date": "2014-09-20", "text": "Any time you have priority, you may turn the face-down creature face up by revealing what its morph cost is and paying that cost. This is a special action. It doesn’t use the stack and can’t be responded to. Only a face-down permanent can be turned face up this way; a face-down spell cannot."}, {"date": "2014-09-20", "text": "Because the permanent is on the battlefield both before and after it’s turned face up, turning a permanent face up doesn’t cause any enters-the-battlefield abilities to trigger."}, {"date": "2014-09-20", "text": "A permanent that turns face up or face down changes characteristics but is otherwise the same permanent. Spells and abilities that were targeting that permanent, as well as Auras and Equipment that were attached to the permanent, aren’t affected."}, {"date": "2014-09-20", "text": "At any time, you can look at a face-down spell or permanent you control. You can’t look at face-down spells or permanents you don’t control unless an effect instructs you to do so."}, {"date": "2014-09-20", "text": "You must ensure that your face-down spells and permanents can easily be differentiated from each other. You’re not allowed to mix up the cards that represent them on the battlefield in order to confuse other players. The order they entered the battlefield should remain clear. Common methods for doing this include using markers or dice, or simply placing them in order on the battlefield."}, {"date": "2014-09-20", "text": "If a face-down permanent leaves the battlefield, you must reveal it. You must also reveal all face-down spells and permanents you control if you leave the game or if the game ends."}], "setCode": "KTK", "subtypes": ["Bird", "Shaman"], "supertypes": [], "text": "Flying\nMorph {1}{G}{U} (You may cast this card face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.)\nWhen Icefeather Aven is turned face up, you may return another target creature to its owner's hand.", "toughness": "2", "type": "Creature — Bird Shaman", "types": ["Creature"], "uuid": "79ec3cee-14ca-5bd9-88f2-a131eb78ef81", "watermark": "temur"}