{"artist": "Dan Scott", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 4440, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"mtgjsonV4Id": "b9b37d15-f9d2-50e6-a359-6bd90cd0922b", "mtgoId": "61559", "scryfallId": "979df9e3-84cb-45c2-8f9c-2af9fc80a968", "scryfallIllustrationId": "b111f6fc-e5d1-4c5e-8898-dac252bdc453", "scryfallOracleId": "a200daec-983c-4ea6-ae98-1c963b50fbb1"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{U}", "manaValue": 4.0, "name": "Identity Thief", "number": "61559", "originalReleaseDate": "2016-10-01", "power": "0", "printings": ["EMN", "NCC", "PEMN", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2016-07-13", "text": "If the targeted creature has an ability that triggers when it attacks, it'll be too late for it to trigger once Identity Thief has that ability. The same is true if another object has an ability that triggers when a creature with certain characteristics attacks and Identity Thief doesn't have those characteristics until after it becomes a copy."}, {"date": "2016-07-13", "text": "Identity Thief copies the printed values of the targeted creature, plus any copy effects that have been applied to that creature. It won't copy other effects that have changed the targeted creature's power, toughness, types, color, or so on. It also won't copy counters on the targeted creature."}, {"date": "2016-07-13", "text": "If the targeted creature is a double-faced or melded permanent, Identity Thief copies the face shown. Because Identity Thief is not a double-faced card or meld card, it won't be able to transform or meld. If it copies a melded permanent or the back face of a double-faced card, its mana value will be 0. Exiled double-faced cards and exiled meld cards will return with their front faces up."}, {"date": "2016-07-13", "text": "If the targeted creature is itself copying a permanent, Identity Thief will become whatever it's copying, as modified by that copy effect. For example, if you target a Hamlet Captain that has become a copy of Permeating Mass, Identity Thief will become a Permeating Mass."}, {"date": "2016-07-13", "text": "This effect can cause Identity Thief to stop being a creature. For example, if you target an animated Gideon Jura (a planeswalker with a loyalty ability that turns him into a creature), only the printed wording will be copied; the “becomes a creature” effect won't. Identity Thief will become a noncreature Gideon with no loyalty, be removed from combat, and then be put into its owner's graveyard."}, {"date": "2016-07-13", "text": "This effect can cause Identity Thief to become a copy of a creature that can't normally attack, such as Lupine Prototype or a creature with defender. In these cases, it remains attacking."}, {"date": "2016-07-13", "text": "Noncopy effects that have already applied to Identity Thief will continue to apply to it. For example, if Woodcutter's Grit gave Identity Thief +3/+3 and hexproof earlier in the turn, Identity Thief will still have those bonuses after copying a creature."}, {"date": "2016-07-13", "text": "Identity Thief will still be a copy of the creature during the next end step when the exiled card returns. If it has an ability that triggers at the beginning of the end step, that ability will trigger for Identity Thief and not for the returned creature."}, {"date": "2016-07-13", "text": "Auras attached to the exiled creature will be put into their owners' graveyards. Any Equipment will become unattached and remain on the battlefield. Any counters on the exiled permanent will cease to exist."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Shapeshifter"], "supertypes": [], "text": "Whenever Identity Thief attacks, you may exile another target nontoken creature. If you do, Identity Thief becomes a copy of that creature until end of turn. Return the exiled card to the battlefield under its owner's control at the beginning of the next end step.", "toughness": "3", "type": "Creature — Shapeshifter", "types": ["Creature"], "uuid": "e3940556-33e3-54fa-8eff-a21c2a2dca1c"}