{"artist": "Justin Sweet", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 5.0, "edhrecRank": 7423, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 132971, "name": "Brennende Erinnerungen", "text": "Ein Spieler deiner Wahl zeigt eine zufällig bestimmte Karte aus seiner Hand offen vor. Brennende Erinnerungen fügen diesem Spieler Schadenspunkte in Höhe der umgewandelten Manakosten dieser Karte zu.\nSturm (Wenn du diesen Zauberspruch spielst, kopiere ihn einmal für jeden Zauberspruch, der in diesem Zug bereits gespielt wurde. Du kannst neue Ziele für die Kopien bestimmen.)", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 134476, "name": "Encender los recuerdos", "text": "El oponente objetivo muestra una carta al azar de su mano. Encender los recuerdos hace daño a ese jugador igual al coste de maná convertido de esa carta.\nTormenta (Cuando juegues este hechizo, cópialo por cada hechizo jugado antes que él en este turno. Puedes elegir nuevos objetivos para las copias.)", "type": "Conjuro"}, {"language": "French", "multiverseId": 132670, "name": "Embrasement des souvenirs", "text": "Le joueur ciblé révèle au hasard une carte de sa main. L'Embrasement des souvenirs inflige à ce joueur un nombre de blessures égal au coût converti de mana de cette carte.\nDéluge (Quand vous jouez ce sort, copiez-le pour chaque sort joué avant lui ce tour-ci. Vous pouvez choisir de nouvelles cibles pour ces copies.)", "type": "Rituel"}, {"language": "Italian", "multiverseId": 133272, "name": "Infiammare i Ricordi", "text": "Un giocatore bersaglio rivela una carta a caso dalla propria mano. Infiammare i Ricordi infligge a quel giocatore un ammontare di danni pari al costo di mana convertito di quella carta.\nTempesta (Quando giochi questa magia, copiala per ogni magia giocata prima in questo turno. Puoi scegliere nuovi bersagli per le copie.)", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 133573, "name": "記憶の点火", "text": "プレイヤー１人を対象とする。そのプレイヤーは手札からカードを１枚無作為に選んで公開する。 記憶の点火はそのプレイヤーに、そのカードの点数で見たマナ・コストに等しい点数のダメージを与える。\nストーム （あなたがこの呪文をプレイしたとき、それを、このターンそれより前にプレイされていた呪文の総数に等しい回数だけコピーする。 あなたはそのコピーの新しい対象を選んでもよい。）", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 133874, "name": "Inflamar Memórias", "text": "O jogador alvo revela um card da própria mão aleatoriamente. Inflamar Memórias causa dano àquele jogador igual ao custo de mana convertido daquele card.\nRajada (Quando você jogar esta mágica, faça uma cópia dela para cada mágica jogada antes dela neste turno. Você pode escolher novos alvos para a cópia.)", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 134175, "name": "Поджог Воспоминаний", "text": "Целевой игрок показывает случайную карту из своей руки. Поджог Воспоминаний наносят этому игроку повреждения, равные конвертированной мана-стоимости этой карты.\nШторм (Когда вы играете это заклинание, скопируйте его за каждое сыгранное в этом ходу заклинание. Вы можете выбрать новые цели для этих копий.)", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 132369, "name": "燃起回忆", "text": "目标牌手从其手上随机展示一张牌。 燃起回忆对该牌手造成伤害，其数量等同于该牌的总法术力费用。\n风暴（当你使用此咒语时，本回合于它之前每使用过一个咒语，便将此咒语复制一次。） 你可以为每个复制品选择新的目标。）", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "121571", "cardKingdomId": "121281", "cardsphereId": "44404", "mcmId": "13874", "mcmMetaId": "8417", "mtgjsonV4Id": "26b9b825-d170-5a4a-a24b-6522bb50e142", "mtgoFoilId": "25544", "mtgoId": "25543", "multiverseId": "109756", "scryfallId": "2f7b7831-27a1-4c0a-8ed1-6dddf2754d65", "scryfallIllustrationId": "a2d87f15-befe-4ac8-afca-019179d67bff", "scryfallOracleId": "5f186092-0f87-4a0f-ac45-fff5359c93ae", "tcgplayerProductId": "14264"}, "keywords": ["Storm"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{R}", "manaValue": 5.0, "name": "Ignite Memories", "number": "164", "originalText": "Target player reveals a card at random from his or her hand. Ignite Memories deals damage to that player equal to that card's converted mana cost.\nStorm (When you play this spell, copy it for each spell played before it this turn. You may choose new targets for the copies.)", "originalType": "Sorcery", "printings": ["TSP"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d8f6b10f8aadf5cd", "cardKingdomFoil": "https://mtgjson.com/links/197d5656b077be63", "cardmarket": "https://mtgjson.com/links/d3c09d830f7be569", "tcgplayer": "https://mtgjson.com/links/53ba03f464f10f07"}, "rarity": "uncommon", "rulings": [{"date": "2013-06-07", "text": "The copies are put directly onto the stack. They aren’t cast and won’t be counted by other spells with storm cast later in the turn."}, {"date": "2013-06-07", "text": "Spells cast from zones other than a player’s hand and spells that were countered are counted by the storm ability."}, {"date": "2013-06-07", "text": "A copy of a spell can be countered like any other spell, but it must be countered individually. Countering a spell with storm won’t affect the copies."}, {"date": "2013-06-07", "text": "The triggered ability that creates the copies can itself be countered by anything that can counter a triggered ability. If it is countered, no copies will be put onto the stack."}, {"date": "2013-06-07", "text": "You may choose new targets for any of the copies. You can choose differently for each copy."}], "setCode": "TSP", "subtypes": [], "supertypes": [], "text": "Target player reveals a card at random from their hand. Ignite Memories deals damage to that player equal to that card's mana value.\nStorm (When you cast this spell, copy it for each spell cast before it this turn. You may choose new targets for the copies.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "eca01659-a70a-5a9c-84c0-7fa69cccf4c1"}