{"artist": "Alex Konstad", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 1600, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "271583", "mcmId": "687105", "mcmMetaId": "278697", "mtgjsonV4Id": "b36ccf94-bf30-5bfe-b223-7127fdab60ef", "scryfallId": "272a9a89-6318-487a-b6f6-cc4ccd744f54", "scryfallIllustrationId": "a13e59d7-deba-45e3-b6ab-a92e634d2988", "scryfallOracleId": "915aa871-4c5e-4799-9a07-d7b855df4e7a", "tcgplayerProductId": "455682"}, "isReprint": true, "keywords": ["Flashback"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}", "manaValue": 4.0, "name": "Ignite the Future", "number": "555", "printings": ["AFC", "C19", "CLB", "J22"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/9b5b8c2caf43b742", "cardmarket": "https://mtgjson.com/links/3845ee4d9e15ba16", "tcgplayer": "https://mtgjson.com/links/a14583ae414d3fcc"}, "rarity": "rare", "rulings": [{"date": "2019-08-23", "text": "Ignite the Future doesn't change when you can play the exiled cards. For example, if you exile a sorcery card, you can cast it only during your main phase when the stack is empty. If you exile a land card, you can play it only during your main phase and only if you have an available land play remaining."}, {"date": "2019-08-23", "text": "If you cast Ignite the Future from a zone other than a graveyard, you must pay the mana cost or an alternative cost for each spell cast this way. If you cast Ignite the Future from a graveyard, you may choose to cast each spell for its mana cost, an alternative cost, or without paying its mana cost."}, {"date": "2019-08-23", "text": "If a spell has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2019-08-23", "text": "If you cast a card “without paying its mana cost,” you can't choose to cast it for any alternative costs and not pay that cost. You can, however, pay additional costs. If the card has any mandatory additional costs, such as that of Momentous Fall, you must pay those to cast the card."}, {"date": "2019-08-23", "text": "If you don't play some or all of the exiled cards, those cards remain in exile."}, {"date": "2021-03-19", "text": "If a card with flashback is put into your graveyard during your turn, you can cast it if it's legal to do so before any other player can take any actions."}, {"date": "2021-03-19", "text": "“Flashback [cost]” means “You may cast this card from your graveyard by paying [cost] rather than paying its mana cost” and “If the flashback cost was paid, exile this card instead of putting it anywhere else any time it would leave the stack.”"}, {"date": "2021-03-19", "text": "You must still follow any timing restrictions and permissions, including those based on the card's type. For instance, you can cast a sorcery using flashback only when you could normally cast a sorcery."}, {"date": "2021-03-19", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a flashback cost) you're paying, add any cost increases, then apply any cost reductions. The mana value of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2021-03-19", "text": "A spell cast using flashback will always be exiled afterward, whether it resolves, is countered, or leaves the stack in some other way."}, {"date": "2021-03-19", "text": "You can cast a spell using flashback even if it was somehow put into your graveyard without having been cast."}], "securityStamp": "oval", "setCode": "J22", "subtypes": [], "supertypes": [], "text": "Exile the top three cards of your library. Until the end of your next turn, you may play those cards. If this spell was cast from a graveyard, you may play cards this way without paying their mana costs.\nFlashback {7}{R} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "b2bac41a-babc-5a22-b8de-133ee724cdda"}