{"artist": "Ralph Horsley", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "flavorText": "\"Heroes innovate. Villains duplicate.\"", "foreignData": [], "frameVersion": "2003", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "131261", "mcmId": "240595", "mtgjsonV4Id": "3bf23483-5bea-58ed-9fc1-a17b4a413781", "multiverseId": "212587", "scryfallId": "8132c357-a770-4bbc-a074-772af3732110", "scryfallIllustrationId": "d4b72873-eca9-4602-8b15-c85efb4707ba", "scryfallOracleId": "278f7c4e-77b4-427e-8925-511bcd7852cf", "tcgplayerProductId": "37154"}, "isOversized": true, "isStarter": true, "language": "English", "layout": "scheme", "legalities": {}, "manaValue": 0.0, "name": "Ignite the Cloneforge!", "number": "19★", "originalText": "When you set this scheme in motion, put a token onto the battlefield that's a copy of target permanent an opponent controls.", "originalType": "Scheme", "printings": ["OARC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/14854fc605416011", "tcgplayer": "https://mtgjson.com/links/e39f7be18103e506"}, "rarity": "common", "rulings": [{"date": "2010-06-15", "text": "You can target any permanent an opponent controls, not just a creature."}, {"date": "2010-06-15", "text": "The token that’s put onto the battlefield copies exactly what’s printed on the targeted permanent (unless that permanent is copying something else or it’s a token; see below). It doesn’t copy whether that permanent is tapped or untapped, whether it has any counters on it or Auras attached to it, or whether it’s been affected by any noncopy effects that changed its power, toughness, types, color, or so on."}, {"date": "2010-06-15", "text": "If the targeted permanent is copying something else when the ability resolves (for example, if it’s a Clone), then the token enters the battlefield as a copy of whatever that permanent is copying."}, {"date": "2010-06-15", "text": "If the targeted permanent is a token, the new token copies the characteristics of the original token as stated by the effect that put it onto the battlefield."}, {"date": "2010-06-15", "text": "If the targeted permanent has {X} in its mana cost (such as Protean Hydra), X is considered to be zero."}, {"date": "2010-06-15", "text": "Any enters-the-battlefield abilities of the targeted permanent will trigger when the token is put onto the battlefield. Any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities of that permanent will also work."}, {"date": "2010-06-15", "text": "If the targeted permanent leaves the battlefield before the ability resolves, the ability doesn’t resolve. You don’t get a token."}, {"date": "2010-06-15", "text": "If the targeted permanent is an Aura, you choose a legal permanent, player, or other card for the token to enchant as it enters the battlefield. A permanent you choose must be able to be enchanted by the token. (For example, if the Aura it’s copying is red and has “enchant creature,” the permanent must be a creature, and it can’t have protection from red.) Since the token Aura wasn’t cast as a spell, it doesn’t target what it will enchant; you may choose something that has shroud, for example. As the ability resolves, no player can respond between the time you choose what the token will enchant and the time it enters the battlefield. If you can’t choose something for the token to enchant, it enters the battlefield unattached, then is put into your graveyard as a state-based action."}], "setCode": "OARC", "subtypes": [], "supertypes": [], "text": "When you set this scheme in motion, create a token that's a copy of target permanent an opponent controls.", "type": "Scheme", "types": ["Scheme"], "uuid": "f00041b9-516f-50d0-9245-d64644021638"}