{"artist": "Chuck Lukacs", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2003", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "131262", "mcmId": "240594", "mtgjsonV4Id": "48d5cced-418a-55b9-81ce-bb552e37130d", "multiverseId": "212597", "scryfallId": "1f17ac75-8e49-42a3-8a31-2e2d5f65316e", "scryfallIllustrationId": "30de4ad2-174b-4f57-8fc9-b73d738afad8", "scryfallOracleId": "cce855c0-9632-4338-ace6-fcdfba564b0f", "tcgplayerProductId": "37153"}, "isOversized": true, "isStarter": true, "language": "English", "layout": "scheme", "legalities": {}, "manaValue": 0.0, "name": "I Know All, I See All", "number": "18★", "originalText": "(An ongoing scheme remains face up until it's abandoned.)\nUntap all permanents you control during each opponent's untap step.\nAt the beginning of each end step, if three or more cards were put into your graveyard this turn from anywhere, abandon this scheme.", "originalType": "Ongoing Scheme", "printings": ["OARC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/b2b1c9ebbd6b7072", "tcgplayer": "https://mtgjson.com/links/b753eb7ad602760c"}, "rarity": "common", "rulings": [{"date": "2010-06-15", "text": "As an opponent’s untap step begins, if you control this face-up scheme card, all your permanents untap during that untap step. You have no choice about what untaps. Those permanents untap at the same time as the active players’ permanents."}, {"date": "2010-06-15", "text": "Since your opponents take a shared team turn, they all have the same untap step. Your permanents untap just once during that step, no matter how many opponents you have."}, {"date": "2010-06-15", "text": "During an opponent’s untap step, effects that would otherwise cause your permanents to stay tapped don’t apply because they apply only during *your* untap step. For example, if you control a Deep-Slumber Titan (a creature that says “Deep-Slumber Titan doesn’t untap during your untap step”), you untap Deep-Slumber Titan during each opponent’s untap step."}, {"date": "2010-06-15", "text": "Controlling more than one face-up I Know All, I See All card is redundant. You can’t untap your permanents more than once in a single untap step."}, {"date": "2010-06-15", "text": "The last ability won’t trigger at all unless, as an end step starts, three or more cards have already been put into your graveyard that turn. Those cards don’t still need to be in your graveyard at that time."}, {"date": "2010-06-15", "text": "The last ability of this scheme counts the number of cards put into your graveyard over the course of the entire turn, even if it wasn’t face up the whole time. Specifically, during the turn you set this scheme in motion, its last ability will count cards that were put into your graveyard during your upkeep or draw step."}, {"date": "2010-06-15", "text": "The last ability doesn’t count tokens that were put into your graveyard from the battlefield, because they’re not cards. The same is true for copies of spells that were put into your graveyard when they resolved or were countered."}], "setCode": "OARC", "subtypes": [], "supertypes": ["Ongoing"], "text": "(An ongoing scheme remains face up until it's abandoned.)\nUntap all permanents you control during each opponent's untap step.\nAt the beginning of each end step, if three or more cards were put into your graveyard this turn from anywhere, abandon this scheme.", "type": "Ongoing Scheme", "types": ["Scheme"], "uuid": "2293f7f8-3524-58aa-8e52-e6a5f5f488cc"}