{"artist": "David Astruga", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 5948, "faceConvertedManaCost": 2.0, "faceManaValue": 2.0, "faceName": "Plant Tadpoles", "finishes": ["foil"], "flavorText": "\"Your mind belongs to the Emperor now.\"", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardsphereId": "88225", "mcmId": "662150", "mtgjsonV4Id": "d463b653-9261-58dd-8adc-becb13214e3c", "scryfallId": "02b5d22a-e928-42a0-a688-8994fcd358b0", "scryfallIllustrationId": "f0ea83ef-82e9-4470-a18b-8aabce50e6ba", "scryfallOracleId": "299ffd3a-29cf-4667-b191-dd30d09f799c", "tcgplayerProductId": "274455"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "adventure", "legalities": {"alchemy": "Legal", "commander": "Legal", "duel": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{X}{U}{U}", "manaValue": 5.0, "name": "Illithid Harvester // Plant Tadpoles", "number": "76s", "otherFaceIds": ["5613a02e-f8bf-5bc2-86b0-849aeca7c5b9"], "printings": ["CLB", "HBG", "PCLB"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {"tcgplayer": "https://mtgjson.com/links/295ef43d77135681"}, "rarity": "rare", "rulings": [{"date": "2022-06-10", "text": "Once the permanents are face down, no player may mix them up on the battlefield or otherwise try to hide or disguise which card is which."}, {"date": "2022-06-10", "text": "Players may look at face-down permanents they control at any time."}, {"date": "2022-06-10", "text": "Illithid Harvester's triggered ability can't turn double-faced cards face down."}, {"date": "2022-06-10", "text": "If a face-down permanent leaves the battlefield, its owner must reveal it to all players."}, {"date": "2022-06-10", "text": "If a creature enters the battlefield as a copy of a face-down creature or if a token is created that's a copy of one, that copy has the same characteristics as the face-down creature (in this case, a 2/2 Horror creature with no other characteristics), even though the copy is face up."}, {"date": "2022-06-10", "text": "The Commander Legends: Battle for Baldur's Gate set includes no way to turn these cards face up. If an effect from cards outside of this set does turn one face up, the effect causing it to be a 2/2 Horror creature ends."}, {"date": "2022-06-10", "text": "An adventurer card is a permanent card in every zone except the stack, as well as while on the stack if not cast as an Adventure. Ignore its alternative characteristics in those cases. For example, while it’s in your graveyard, Altar of Bhaal is an artifact card whose mana value is 2."}, {"date": "2022-06-10", "text": "When casting a spell as an Adventure, use the alternative characteristics and ignore all of the card’s normal characteristics. The spell’s color, mana cost, mana value, and so on are determined by only those alternative characteristics. If the spell leaves the stack, it immediately resumes using its normal characteristics."}, {"date": "2022-06-10", "text": "If you cast an adventurer card as an Adventure, use only its alternative characteristics to determine whether it’s legal to cast that spell."}, {"date": "2022-06-10", "text": "If a spell is cast as an Adventure, its controller exiles it instead of putting it into its owner’s graveyard as it resolves. For as long as it remains exiled, that player may cast it as a permanent spell. If an Adventure spell leaves the stack in any way other than resolving (most likely by being countered or by failing to resolve because its targets have all become illegal), that card won’t be exiled and the spell’s controller won’t be able to cast it as a permanent later."}, {"date": "2022-06-10", "text": "If an adventurer card ends up in exile for any other reason than by exiling itself while resolving, it won’t give you permission to cast it as a permanent spell."}, {"date": "2022-06-10", "text": "You must still follow any relevant timing rules for the permanent spell you cast from exile. Normally, you’ll be able to cast it only during your main phase while the stack is empty."}, {"date": "2022-06-10", "text": "If an effect copies an Adventure spell, that copy is exiled as it resolves. It ceases to exist as a state-based action; it’s not possible to cast the copy from exile."}, {"date": "2022-06-10", "text": "An effect may refer to a card, spell, or permanent that “has an Adventure.” This refers to a card, spell, or permanent that has an adventurer card’s set of alternative characteristics, even if they’re not being used and even if that card was never cast as an Adventure."}, {"date": "2022-06-10", "text": "If an object becomes a copy of an object that has an Adventure, the copy also has an Adventure. If it changes zones, it will either cease to exist (if it’s a token) or cease to be a copy (if it’s a nontoken permanent), and so you won’t be able to cast it as an Adventure."}, {"date": "2022-06-10", "text": "If an effect instructs you to choose a card name, you may choose the alternative Adventure name. Consider only the alternative characteristics to determine whether that is an appropriate name to choose."}, {"date": "2022-06-10", "text": "Casting a card as an Adventure isn’t casting it for an alternative cost. Effects that allow you to cast a spell for an alternative cost or without paying its mana cost may allow you to apply those to the Adventure."}], "securityStamp": "oval", "setCode": "PCLB", "side": "b", "subtypes": ["Adventure"], "supertypes": [], "text": "Tap X target creatures. They don't untap during their controllers' next untap steps. (Then exile this card. You may cast the creature later from exile.)", "type": "Sorcery — Adventure", "types": ["Sorcery"], "uuid": "6fcf64c6-c3d0-5aff-b5c5-917b4e3ea775"}