{"artist": "Amy Weber", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 2.0, "edhrecRank": 19224, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "1997", "hasFoil": false, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "35fef26a-239d-58bd-b854-7bcef6b5b6d0", "mtgoFoilId": "33123", "mtgoId": "33122", "scryfallId": "7244e5ed-e0a9-4624-a09e-f34a7b37f839", "scryfallIllustrationId": "3a98e8c0-60a2-488e-9acf-7429af62e40e", "scryfallOracleId": "05ac866d-0405-4d25-986a-c10fcfc097e6"}, "isOnlineOnly": true, "isReprint": true, "isReserved": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}", "manaValue": 2.0, "name": "Illusionary Mask", "number": "A114", "printings": ["2ED", "30A", "CED", "CEI", "LEA", "LEB", "ME3", "TD0"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "The creature’s “enters the battlefield” abilities (and any other abilities relating to the creature entering the battlefield) do not trigger when it turns face up."}, {"date": "2004-10-04", "text": "Only the controller of the face down creature can look at it."}, {"date": "2004-10-04", "text": "The creature enters the battlefield face down, so none of its “enters the battlefield” abilities will trigger or have any effect. Also none of its “As this enters the battlefield” abilities apply."}, {"date": "2009-10-01", "text": "Illusionary Mask’s ability will continue to apply to creatures cast face down with it, even if Illusionary Mask has left the battlefield."}, {"date": "2009-10-01", "text": "While the creature card is face down, it’s a 2/2 creature with no name, mana cost, color, creature type, abilities, or expansion symbol. Since it has no mana cost, its converted mana cost is 0."}, {"date": "2009-10-01", "text": "You may look at a face-down spell or permanent you control at any time."}, {"date": "2009-10-01", "text": "You can turn a face-down permanent face up if it would have morph while face up. This applies to creatures you cast face down as a result of Illusionary Mask’s effect. The rest of Illusionary Mask’s effect applies to it as well."}, {"date": "2009-10-01", "text": "If you use the ability to cast a creature card face down, you must keep track of the amount and types of mana you spent on {X}. If that creature spell is moved from the stack to anywhere other than the battlefield, the resulting creature leaves the battlefield, or the game ends, the face-down card is revealed. If its mana cost couldn’t be paid by some amount of, or all of, the mana you spent on {X}, all applicable penalties for casting a card illegally are assessed."}, {"date": "2009-10-01", "text": "You actually cast the card face-down, much as when playing a spell with Morph. It can be responded to and countered."}, {"date": "2009-10-01", "text": "The effect that turns it face-up is a replacement effect. It doesn’t use the stack and can’t be responded to."}, {"date": "2009-10-01", "text": "You may not turn a face-down spell face up. You may not turn a face-down permanent face up unless it would have morph while face up or an effect specifically allows you to turn it face up. Illusionary Mask’s ability has you turn a face-down creature face up if it would assign damage, deal damage, be dealt damage, or become tapped, but not for any other reason. For example, if you use Illusionary Mask’s ability to cast a black creature face down, you can’t turn it face up just because it’s being targeted by Terror."}, {"date": "2009-10-01", "text": "Both the amount and types of mana you spend on {X} are taken into account while you’re choosing a creature card from your hand. For example, if you spent {U}{U} on {X}, you can choose a creature card with mana cost {U}{U}, {1}{U}, {2}, or {W/U}{W/U}, among other possibilities, but not one that costs {2}{U} or one that costs {G}."}], "setCode": "TD0", "subtypes": [], "supertypes": [], "text": "{X}: You may choose a creature card in your hand whose mana cost could be paid by some amount of, or all of, the mana you spent on {X}. If you do, you may cast that card face down as a 2/2 creature spell without paying its mana cost. If the creature that spell becomes as it resolves has not been turned face up and would assign or deal damage, be dealt damage, or become tapped, instead it's turned face up and assigns or deals damage, is dealt damage, or becomes tapped. Activate only as a sorcery.", "type": "Artifact", "types": ["Artifact"], "uuid": "08f0ff6d-af93-5b00-9100-0a97bc88b565"}