{"artist": "Raymond Swanland", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210260", "mcmId": "294433", "mtgjsonV4Id": "73bf727a-96fa-5fc9-8b8f-86ee01d0628c", "multiverseId": "423619", "scryfallId": "d44a959c-7a04-4342-8827-882349f786fc", "scryfallIllustrationId": "c2632990-5b8a-4fe9-8029-da56e27fae0a", "scryfallOracleId": "ece3b5ed-3c07-4586-bf99-72bc1aa6ccef", "tcgplayerProductId": "125593"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Immersturm", "number": "38", "originalText": "Whenever a creature enters the battlefield, that creature's controller may have it deal damage equal to its power to target creature or player of his or her choice.\nWhenever you roll {Chaos}, exile target creature, then return it to the battlefield under its owner's control.", "originalType": "Plane — Valla", "printings": ["OHOP", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ad3d9e1cb8f44bb5", "tcgplayer": "https://mtgjson.com/links/a81254376224c238"}, "rarity": "common", "rulings": [{"date": "2009-10-01", "text": "A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"}, {"date": "2009-10-01", "text": "A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."}, {"date": "2009-10-01", "text": "The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."}, {"date": "2009-10-01", "text": "If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}, {"date": "2009-10-01", "text": "If a creature controlled by a player other than the planar controller enters the battlefield, the planar controller (not the creature’s controller) controls Immersturm’s triggered ability. That means that if multiple creatures enter the battlefield at the same time, that player controls all of Immersturm’s triggered abilities and may put them on the stack in whichever order they like. The last one put on the stack is the first one to resolve."}, {"date": "2009-10-01", "text": "When the chaos ability resolves, the targeted creature is exiled, then immediately returned to the battlefield as a new permanent with no relation to its previous existence."}, {"date": "2009-10-01", "text": "Any “as [this permanent] enters the battlefield” choices for the card returned by the chaos ability are made by that card’s owner, not its old controller or the controller of the chaos ability."}, {"date": "2009-10-01", "text": "A token that has left the battlefield can’t come back onto the battlefield. If the chaos ability exiles a token, that token remains in exile until state-based actions are checked, then it ceases to exist."}], "setCode": "OPCA", "subtypes": ["Valla"], "supertypes": [], "text": "Whenever a creature enters the battlefield, that creature's controller may have it deal damage equal to its power to any target of their choice.\nWhenever you roll {CHAOS}, exile target creature, then return it to the battlefield under its owner's control.", "type": "Plane — Valla", "types": ["Plane"], "uuid": "43d2ce27-1dd8-5810-8909-3679b955afab"}