{"artist": "Jakub Kasper", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 1.0, "edhrecRank": 6797, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 531552, "name": "Unbewegliches Zepter", "text": "Du kannst bestimmen, das Unbewegliche Zepter während deines Enttappsegments nicht zu enttappen.\nImmer wenn das Unbewegliche Zepter enttappt wird, wage dich ins Gewölbe.\n{3}{W}, {T}: Solange das Unbewegliche Zepter getappt bleibt, verliert eine andere bleibende Karte deiner Wahl alle Fähigkeiten und kann nicht angreifen oder blocken.", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 531608, "name": "Vara inamovible", "text": "Puedes elegir no enderezar la Vara inamovible durante tu paso de enderezar.\nSiempre que la Vara inamovible se enderece, adéntrate en la mazmorra.\n{3}{W}, {T}: Mientras la Vara inamovible permanezca girada, otro permanente objetivo pierde todas las habilidades y no puede atacar ni bloquear.", "type": "Artefacto"}, {"language": "French", "multiverseId": 531664, "name": "Sceptre inamovible", "text": "Vous pouvez choisir de ne pas dégager le Sceptre inamovible pendant votre étape de dégagement.\nÀ chaque fois que le Sceptre inamovible devient dégagé, aventurez-vous dans le donjon.\n{3}{W}, {T} : Tant que le Sceptre inamovible reste engagé, un autre permanent ciblé perd toutes ses capacités et ne peut ni attaquer ni bloquer.", "type": "Artefact"}, {"language": "Italian", "multiverseId": 531720, "name": "Verga Inamovibile", "text": "Puoi scegliere di non STAPpare la Verga Inamovibile durante il tuo STAP.\nOgniqualvolta la Verga Inamovibile viene STAPpata, esplora il dungeon.\n{3}{W}, {T}: Fintanto che la Verga Inamovibile rimane TAPpata, un altro permanente bersaglio perde tutte le abilità e non può attaccare o bloccare.", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 531776, "name": "イムーヴァブル・ロッド", "text": "あなたは、あなたのアンタップ・ステップにイムーヴァブル・ロッドをアンタップしないことを選んでもよい。\nイムーヴァブル・ロッドがアンタップ状態になるたび、ダンジョン探索をする。\n{3}{W}, {T}：これ以外のパーマネント１つを対象とする。イムーヴァブル・ロッドがタップ状態であり続けているかぎり、それはすべての能力を失い、それでは攻撃もブロックもできない。", "type": "アーティファクト"}], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "249330", "cardsphereId": "80219", "mcmId": "572629", "mtgjsonV4Id": "adaf656d-77cc-598d-be4d-af05932a036d", "multiverseId": "531496", "scryfallId": "4f93e1d3-2bcc-439b-9f8f-0e977f311b4e", "scryfallIllustrationId": "c4d3f5cd-11a1-4c4c-97cf-59cec8aa118e", "scryfallOracleId": "ec664e13-b7c4-4ca3-80d6-55a564d97937", "tcgplayerProductId": "244210"}, "keywords": ["Venture into the dungeon"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{W}", "manaValue": 1.0, "name": "Immovable Rod", "number": "276", "originalText": "You may choose not to untap Immovable Rod during your untap step.\nWhenever Immovable Rod becomes untapped, venture into the dungeon.\n{3}{W}, {T}: For as long as Immovable Rod remains tapped, another target permanent loses all abilities and can't attack or block.", "originalType": "Artifact", "printings": ["AFC"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7617ece0321c97e0", "tcgplayer": "https://mtgjson.com/links/4aaf585603d4458f"}, "rarity": "rare", "rulings": [{"date": "2021-07-23", "text": "Some abilities still work even if they have been removed. Specifically, static abilities that change an object's types or change an object's colors will still apply even if those abilities are lost."}, {"date": "2021-07-23", "text": "If a creature has a characteristic-defining ability that sets its power and/or toughness loses that ability, the power and/or toughness (as appropriate) become 0."}, {"date": "2021-07-23", "text": "If you target an Aura with Immovable Rod's last ability, it will lose its enchant ability and be put into its owner's graveyard because it can't legally enchant anything. An Equipment that loses its abilities loses its equip ability, so you won't be able to move it that way, but it will stay attached to the creature it's equipping, if any."}, {"date": "2021-07-23", "text": "To venture into the dungeon, a player moves their venture marker into the next room of the dungeon they are currently in. If they aren't currently in a dungeon, that player instead chooses a dungeon card from outside the game, puts it into the command zone, and moves their venture marker onto the first room."}, {"date": "2021-07-23", "text": "Moving into a dungeon room will cause its room ability to trigger."}, {"date": "2021-07-23", "text": "Once you resolve the last room ability of a dungeon, that dungeon is now completed and is removed from the game."}, {"date": "2021-07-23", "text": "A player may only have one dungeon in the command zone at a time."}, {"date": "2021-07-23", "text": "The player venturing into the dungeon chooses which dungeon they will venture into. They may choose a dungeon that they have already completed this game."}, {"date": "2021-07-23", "text": "Dungeon cards are not part of a player's deck or sideboard. In both constructed and limited formats, players can use any dungeon card when they venture into the dungeon."}, {"date": "2021-07-23", "text": "You can only move forward (well, downward) in a dungeon, never backwards or sideways."}, {"date": "2021-07-23", "text": "Dungeons are removed from the game as a state-based action."}, {"date": "2021-07-23", "text": "If you somehow venture into the dungeon while a room's ability is on the stack, you will continue on in the dungeon. If you're already in the last room, complete that dungeon and start a new one."}, {"date": "2021-07-23", "text": "Choosing the dungeon or room to venture into is part of resolving the venture into the dungeon keyword action. Once that choice is made, players may not respond until after the appropriate room ability has triggered."}], "securityStamp": "oval", "setCode": "AFC", "subtypes": [], "supertypes": [], "text": "You may choose not to untap Immovable Rod during your untap step.\nWhenever Immovable Rod becomes untapped, venture into the dungeon.\n{3}{W}, {T}: For as long as Immovable Rod remains tapped, another target permanent loses all abilities and can't attack or block.", "type": "Artifact", "types": ["Artifact"], "uuid": "f11a6235-16c4-536d-a304-3f838cf2a6d7", "variations": ["cb4852ad-b03c-5b03-9847-0712e2e33329"]}