{"artist": "Ekaterina Burmak", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G", "U"], "colors": ["G", "U"], "convertedManaCost": 5.0, "edhrecRank": 2203, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "a5c88e2a-8404-5a16-8976-cec4a73d40a4", "mtgoId": "86278", "scryfallId": "8bcaf2a8-7291-4ea6-9869-de03c4d98946", "scryfallIllustrationId": "66ae3a4e-0a6f-4863-ba9d-1755fad5886b", "scryfallOracleId": "eca32dcd-6845-433e-a631-ed1f0ee78f25"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Cascade"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "paupercommander": "Restricted", "vintage": "Legal"}, "manaCost": "{3}{G}{U}", "manaValue": 5.0, "name": "Imoti, Celebrant of Bounty", "number": "86278", "originalReleaseDate": "2020-12-15", "power": "3", "printings": ["CMR", "PRM"], "purchaseUrls": {}, "rarity": "uncommon", "rulings": [{"date": "2020-11-10", "text": "Once you announce that you’re casting a spell, players can’t take action until you’ve finished casting it. Causing Imoti, Celebrant of Bounty to leave the battlefield after a spell with converted mana cost 6 or greater has been cast won’t stop that spell’s cascade ability from resolving."}, {"date": "2020-11-10", "text": "In some unusual situations, you may lose control of Imoti during the process of casting a spell with converted mana cost 6 or greater. In those situations, that spell won’t have cascade."}, {"date": "2020-11-10", "text": "For spells with {X} in their mana costs, use the value chosen for X to determine the spell’s converted mana cost."}, {"date": "2020-11-10", "text": "The cascade ability triggers when you cast the spell, meaning that it resolves before that spell. If you cast the card exiled by the cascade ability, that spell will go on the stack above the spell with cascade."}, {"date": "2020-11-10", "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."}, {"date": "2020-11-10", "text": "Countering the spell with cascade has no effect on the cascade ability."}, {"date": "2020-11-10", "text": "You exile the cards face up. All players will be able to see them."}, {"date": "2020-11-10", "text": "You don’t have to cast the last card exiled by a cascade ability. If you choose to do so, you’re casting it as a spell. This means that it can be countered, and appropriate abilities trigger (such as if that spell also has cascade)."}, {"date": "2020-11-10", "text": "If you cast a spell “without paying its mana cost,” you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those to cast the spell."}, {"date": "2020-11-10", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2020-11-10", "text": "The converted mana cost of a spell with cascade is determined only by its mana cost, no matter what the total cost to cast the spell was."}], "setCode": "PRM", "subtypes": ["Naga", "Druid"], "supertypes": ["Legendary"], "text": "Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)\nSpells you cast with mana value 6 or greater have cascade.", "toughness": "1", "type": "Legendary Creature — Naga Druid", "types": ["Creature"], "uuid": "56f752dd-d340-51a8-8429-3481abf2c213"}