{"artist": "Christopher Moeller", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 5.0, "edhrecRank": 19276, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 144918, "name": "Kaiserliche Maske", "text": "Wenn die Kaiserliche Maske ins Spiel kommt und kein Spielstein ist, bringt jeder deiner Teamkollegen einen Spielstein ins Spiel, der eine Kopie der Kaiserlichen Maske ist.\n Du kannst nicht das Ziel von Zaubersprüchen oder Fähigkeiten sein, die deine Gegner kontrollieren.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 145242, "name": "Máscara imperial", "text": "Cuando la Máscara imperial entre en juego, si no es una ficha, cada uno de tus compañeros de equipo pone en juego una ficha que es una copia de la Máscara imperial.\u2028No puedes ser objetivo de hechizos o habilidades que controlen tus oponentes.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 145323, "name": "Masque impérial", "text": "Quand le Masque impérial arrive en jeu, si ce n'est pas un jeton, chacun de vos équipiers met en jeu un jeton qui est une copie du Masque impérial.\nVous ne pouvez pas être la cible de sorts ou de capacités que vos adversaires contrôlent.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 144837, "name": "Maschera Imperiale", "text": "Quando la Maschera Imperiale entra in gioco, se non è una pedina, ognuno dei tuoi compagni di squadra mette in gioco una pedina che è una copia della Maschera Imperiale.\nNon puoi essere bersaglio di magie o abilità controllate dai tuoi avversari.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 145404, "name": "皇帝の仮面", "text": "皇帝の仮面が場に出たとき、それがトークンでない場合、あなたの各チームメイトはそれぞれ皇帝の仮面のコピーであるトークンを１つ場に出す。\n あなたはあなたの対戦相手がコントロールする呪文や能力の対象にならない。", "type": "エンチャント"}, {"language": "Portuguese (Brazil)", "multiverseId": 145080, "name": "Máscara Imperial", "text": "Quando Máscara Imperial entra em jogo, se não for uma ficha, cada um dos integrantes do seu time coloca uma ficha em jogo que seja uma cópia de Máscara Imperial.\nVocê não pode ser alvo de mágicas ou habilidades controladas por seu oponente.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 144999, "name": "Имперская Маска", "text": "Когда Имперская Маска входит в игру, и если это не фишка, каждый из ваших напарников кладёт в игру фишку, являющуюся копией Имперской Маски.\nВы не можете стать целью заклинаний или способностей, контролируемых вашими оппонентами.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 145161, "name": "皇家面具", "text": "当皇家面具进场时，若它并非衍生物，则你的每位队友将一个衍生物放置进场，且该衍生物为皇家面具的复制。\n你不能成为由对手操控之咒语或异能的目标。", "type": "结界"}], "frameVersion": "future", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "122540", "cardKingdomId": "122360", "cardsphereId": "18676", "mcmId": "15015", "mcmMetaId": "8944", "mtgjsonV4Id": "850528bc-f265-59cc-8f0c-5f2ebbb21f59", "mtgoFoilId": "26931", "mtgoId": "26930", "multiverseId": "136201", "scryfallId": "bb02f692-80a9-4740-afde-cb4792d24774", "scryfallIllustrationId": "e49b0b77-1670-42dc-88f9-deb9aa1cfc4a", "scryfallOracleId": "e4c92768-00a1-450f-8fca-81b28b353bb6", "tcgplayerProductId": "14909"}, "isTimeshifted": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{W}", "manaValue": 5.0, "name": "Imperial Mask", "number": "23", "originalText": "When Imperial Mask comes into play, if it's not a token, each of your teammates puts a token into play that's a copy of Imperial Mask.\nYou can't be the target of spells or abilities your opponents control.", "originalType": "Enchantment", "printings": ["FUT"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/142f74a5dafddf2e", "cardKingdomFoil": "https://mtgjson.com/links/03d33b4eb0841304", "cardmarket": "https://mtgjson.com/links/82c4c8a96122f0bf", "tcgplayer": "https://mtgjson.com/links/20e48b96d06388a1"}, "rarity": "rare", "rulings": [{"date": "2007-05-01", "text": "This card creates tokens that enter the battlefield as enchantments, not creatures."}, {"date": "2007-05-01", "text": "Only teammates within the range of influence of Imperial Mask’s controller will get a token. Imperial Mask’s controller doesn’t get a token; that player just gets the Imperial Mask."}, {"date": "2007-05-01", "text": "Each Imperial Mask permanent is independent and affects only its controller and the opponents of its controller."}, {"date": "2007-05-01", "text": "If Imperial Mask has left the battlefield by the time the triggered ability resolves, the tokens will still enter the battlefield as copies of Imperial Mask."}, {"date": "2007-05-01", "text": "If Imperial Mask becomes a copy of something else after the ability triggers but before it resolves, the tokens will enter the battlefield as copies of whatever the ex-Imperial Mask is now. If Imperial Mask became a copy of something else and then left the battlefield, the tokens will enter the battlefield as copies of whatever it was copying when it last existed on the battlefield."}], "setCode": "FUT", "subtypes": [], "supertypes": [], "text": "When Imperial Mask enters the battlefield, if it's not a token, each of your teammates creates a token that's a copy of Imperial Mask.\nYou have hexproof. (You can't be the target of spells or abilities your opponents control.)", "type": "Enchantment", "types": ["Enchantment"], "uuid": "4f2d0431-aa3d-5fd9-b8da-e05a17943e77"}