{"artist": "Jakub Kasper", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 1.0, "edhrecRank": 1040, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 498066, "name": "Impulsiver Langfinger", "text": "Wenn der Impulsive Langfinger stirbt, erzeuge einen Schatz-Spielstein. (Er ist ein Artefakt mit „{T}, opfere dieses Artefakt: Erzeuge ein Mana einer beliebigen Farbe.\")\nZugabe {3}{R} ({3}{R}, schicke diese Karte aus deinem Friedhof ins Exil: Erzeuge für jeden Gegner eine Spielstein-Kopie, die ihn in diesem Zug angreift, falls möglich. Die Spielsteine erhalten Eile. Opfere sie zu Beginn des nächsten Endsegments. Aktiviere Zugabe wie eine Hexerei.)", "type": "Kreatur — Goblin, Pirat"}, {"language": "Spanish", "multiverseId": 498427, "name": "Ladronzuelo impulsivo", "text": "Cuando el Ladronzuelo impulsivo muera, crea una ficha de Tesoro. (Es un artefacto con \"{T}, sacrificar este artefacto: Agrega un maná de cualquier color\".)\nReplicar {3}{R}. ({3}{R}, exiliar esta carta de tu cementerio: Por cada oponente, crea una ficha que es una copia que ataca a ese oponente este turno, si puede. Ganan la habilidad de prisa. Sacrifícalas al comienzo del próximo paso final. Activa esta habilidad solo como un conjuro.)", "type": "Criatura — Pirata trasgo"}, {"language": "French", "multiverseId": 498788, "name": "Chapardeur impulsif", "text": "Quand le Chapardeur impulsif meurt, créez un jeton Trésor. (C'est un artefact avec « {T}, sacrifiez cet artefact : Ajoutez un mana de la couleur de votre choix. »)\nEncore {3}{R} ({3}{R}, exilez cette carte de votre cimetière : Pour chaque adversaire, créez une copie jeton qui attaque cet adversaire ce tour-ci si possible. Elle acquiert la célérité. Sacrifiez-la au début de la prochaine étape de fin. N'activez que lorsque vous pourriez lancer un rituel.)", "type": "Créature : gobelin et pirate"}, {"language": "Italian", "multiverseId": 499149, "name": "Ladruncolo Impulsivo", "text": "Quando il Ladruncolo Impulsivo muore, crea una pedina Tesoro. (È un artefatto con: \"{T}, Sacrifica questo artefatto: Aggiungi un mana di un qualsiasi colore\".)\nBis {3}{R} ({3}{R}, Esilia questa carta dal tuo cimitero: Per ogni avversario, crea una pedina che è una sua copia e che attacca quell'avversario in questo turno, se può farlo. Queste pedine hanno rapidità. Sacrificale all'inizio della prossima sottofase finale. Attiva solo quando potresti lanciare una stregoneria.)", "type": "Creatura — Pirata Goblin"}, {"language": "Japanese", "multiverseId": 499510, "name": "衝動的なこそ泥", "text": "衝動的なこそ泥が死亡したとき、宝物・トークンを１つ生成する。（それは、「{T}, このアーティファクトを生け贄に捧げる：好きな色１色のマナ１点を加える。」を持つアーティファクトである。）\n再演{3}{R}（{3}{R}, あなたの墓地からこのカードを追放する：各対戦相手につきそれぞれ、このカードのコピーであり、このターン可能ならそのプレイヤーを攻撃するトークンを１体生成する。それらは速攻を得る。次の終了ステップの開始時に、それらを生け贄に捧げる。この能力はソーサリーとしてのみ起動できる。）", "type": "クリーチャー — ゴブリン・海賊"}, {"language": "Portuguese (Brazil)", "multiverseId": 499871, "name": "Gatuno Impulsivo", "text": "Quando Gatuno Impulsivo morrer, crie uma ficha de Tesouro. (Ela é um artefato com \"{T}, sacrifique este artefato: Adicione um mana de qualquer cor\".)\nBis {3}{R} ({3}{R}, exile este card de seu cemitério: Para cada oponente, crie uma ficha que é uma cópia que ataca aquele oponente neste turno se estiver apta. Elas ganham ímpeto. Sacrifique-as no início da próxima etapa final. Ative somente como um feitiço.)", "type": "Criatura — Goblin Pirata"}, {"language": "Chinese Simplified", "multiverseId": 500232, "name": "冲动小偷", "text": "当冲动小偷死去时，派出一个珍宝衍生物。（珍宝衍生物是具有「{T}，牺牲此神器：加一点任意颜色的法术力」的神器。）\n返场{3}{R}（{3}{R}，从你的坟墓场放逐此牌：为每位对手各进行以下流程～派出一个衍生复制品，且其本回合若能攻击该对手，便须如此作。它们获得敏捷异能。在下一个结束步骤开始时，将它们牺牲。起动的时机视同法术。）", "type": "生物 ～鬼怪／海盗"}, {"language": "Chinese Traditional", "multiverseId": 500593, "name": "衝動小偷", "text": "當衝動小偷死去時，派出一個珍寶衍生物。（珍寶衍生物是具有「{T}，犧牲此神器：加一點任意顏色的魔法力」的神器。）\n返場{3}{R}（{3}{R}，從你的墳墓場放逐此牌：為每位對手各進行以下流程～派出一個衍生複製品，且其本回合若能攻擊該對手，便須如此作。它們獲得敏捷異能。在下一個結束步驟開始時，將它們犧牲。起動的時機視同巫術。）", "type": "生物 ～鬼怪／海盜"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "239706", "cardKingdomId": "239315", "cardsphereId": "72169", "mcmId": "514060", "mcmMetaId": "323360", "mtgjsonV4Id": "6aa510a3-28d7-5ab2-851b-f44e969442d1", "mtgoId": "85152", "multiverseId": "497705", "scryfallId": "55ba9bea-5549-45cf-896c-501a1c81fd5a", "scryfallIllustrationId": "eae41c1a-b438-4dba-90a4-f9b62c7b226b", "scryfallOracleId": "7d9fc9e7-d80b-49c3-871c-ed25b3059ae8", "tcgplayerProductId": "227184"}, "keywords": ["Encore"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "pauper": "Legal", "paupercommander": "Legal", "vintage": "Legal"}, "manaCost": "{R}", "manaValue": 1.0, "name": "Impulsive Pilferer", "number": "185", "originalText": "When Impulsive Pilferer dies, create a Treasure token. (It's an artifact with \"{T}, Sacrifice this artifact: Add one mana of any color.\")\nEncore {3}{R} ({3}{R}, Exile this card from your graveyard: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)", "originalType": "Creature — Goblin Pirate", "power": "1", "printings": ["CMR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2f87ef0b1f848981", "cardKingdomFoil": "https://mtgjson.com/links/09c16cfb98f8291a", "cardmarket": "https://mtgjson.com/links/791b333ffeb248f8", "tcgplayer": "https://mtgjson.com/links/32137b8f62e047c3"}, "rarity": "common", "rulings": [{"date": "2020-11-10", "text": "Exiling the card with encore is a cost to activate the ability. Once you announce that you’re activating it, no player may take actions until you’ve finished. They can’t try to remove the card from your graveyard to stop you from paying the cost."}, {"date": "2020-11-10", "text": "Opponents who have left the game aren’t counted when determining how many tokens to create."}, {"date": "2020-11-10", "text": "The tokens copy only what’s on the original card. Effects that modified that creature when it was previously on the battlefield won’t be copied."}, {"date": "2020-11-10", "text": "Each token must attack the appropriate player if able."}, {"date": "2020-11-10", "text": "If one of the tokens can’t attack for any reason (such as being tapped), then it doesn’t attack. If there’s a cost associated with having it attack, you aren’t forced to pay that cost, so it doesn’t have to attack in that case either."}, {"date": "2020-11-10", "text": "If an effect stops a token from attacking a specific player, that token can attack any player or planeswalker, or not attack at all. If the effect stops the token from attacking a specific player unless a cost is paid, you don’t have to pay that cost unless you want to attack that player."}, {"date": "2020-11-10", "text": "If one of the tokens somehow is under another player’s control as the delayed triggered ability resolves, you can’t sacrifice that token. It remains on the battlefield indefinitely, even if you regain control of it later."}], "setCode": "CMR", "subtypes": ["Goblin", "Pirate"], "supertypes": [], "text": "When Impulsive Pilferer dies, create a Treasure token. (It's an artifact with \"{T}, Sacrifice this artifact: Add one mana of any color.\")\nEncore {3}{R} ({3}{R}, Exile this card from your graveyard: For each opponent, create a token copy that attacks that opponent this turn if able. They gain haste. Sacrifice them at the beginning of the next end step. Activate only as a sorcery.)", "toughness": "1", "type": "Creature — Goblin Pirate", "types": ["Creature"], "uuid": "a67ec8aa-00a5-5f54-aca7-3b3ec4e8ad1e"}