{"artist": "Justin Sweet", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 6.0, "edhrecRank": 12055, "finishes": ["nonfoil", "foil"], "flavorText": "Iname rejoices in the dawn of a new life, but soon becomes jealous of the simple joys denied him by his station. So the cycle begins anew.", "foreignData": [{"flavorText": "Iname erfreut sich am Erwachen von neuem Leben, aber wird schon bald auf die kleinen Freuden, die ihm durch seinen Zustand verwehrt sind, neidisch. So beginnt der Kreislauf von neuem.", "language": "German", "multiverseId": 85895, "name": "Iname, Lebensaspekt", "text": "Wenn Iname, Lebensaspekt aus dem Spiel auf einen Friedhof gelegt wird, kannst du Iname, Lebensaspekt ganz aus dem Spiel entfernen. Falls du dies tust, bringe eine beliebige Anzahl an Geist-Karten deiner Wahl aus deinem Friedhof auf deine Hand zurück.", "type": "Legendäre Kreatur - Geist"}, {"flavorText": "Iname disfruta el nacimiento de una nueva vida, pero pronto cela de esos pequeños placeres que le son negados por su condición. Y así el ciclo empieza de nuevo.", "language": "Spanish", "multiverseId": 87123, "name": "Iname, aspecto de la vida", "text": "Cuando Iname, aspecto de la vida vaya a un cementerio desde el juego, puedes remover del juego a Iname, aspecto de la vida. Si lo haces, regresa cualquier cantidad de cartas de Espíritu de tu cementerio a tu mano.", "type": "Criatura legendaria - Espíritu"}, {"flavorText": "Iname se réjouit de l'aube d'une nouvelle vie, mais devient rapidement jaloux des joies simples qui lui sont refusées. Et ainsi, le cycle recommence.", "language": "French", "multiverseId": 85588, "name": "Iname, aspect de la Vie", "text": "Quand Iname, aspect de la Vie est mis dans un cimetière depuis le jeu, vous pouvez retirer Iname, aspect de la Vie de la partie. Si vous faites ainsi, renvoyez n'importe quel nombre de cartes d'esprit ciblées depuis votre cimetière dans votre main.", "type": "Créature légendaire : esprit"}, {"flavorText": "Iname gioisce allo sbocciare di una nuova vita, ma subito dopo diviene invidioso delle semplici gioie che gli sono negate a causa della sua natura. E così il ciclo ricomincia da capo.", "language": "Italian", "multiverseId": 86202, "name": "Iname, Manifestazione della Vita", "text": "Quando Iname, Manifestazione della Vita viene messo in un cimitero dal gioco, puoi rimuoverlo dal gioco. Se lo fai, riprendi in mano un qualsiasi numero di carte Spirito bersaglio dal tuo cimitero.", "type": "Creatura Leggendaria - Spirito"}, {"flavorText": "否命は新たな生命の夜明けに喜びの笑みを浮かべるが、それもすぐさま単純な喜びに対する嫉妬に打ち消される。かくして新たな流転が始まるのだ。", "language": "Japanese", "multiverseId": 86509, "name": "生相の否命", "text": "生相の否命が場からいずれかの墓地に置かれたとき、あなたは生相の否命をゲームから取り除いてもよい。そうした場合、あなたの墓地にある望む数のスピリット・カードを対象とし、それらをあなたの手札に戻す。", "type": "伝説のクリーチャー — スピリット"}, {"flavorText": "Iname festeja na aurora de uma vida nova, mas logo se torna invejoso dos simples prazeres a ele negados por sua posição. E assim o ciclo se inicia mais uma vez.", "language": "Portuguese (Brazil)", "multiverseId": 86816, "name": "Iname, Face da Vida", "text": "Quando Iname, Face da Vida for colocado num cemitério vindo de jogo, você pode remover Iname, Face da Vida de jogo. Se o fizer, devolva um número qualquer de cards de Espírito de seu cemitério para sua mão.", "type": "Criatura Lendária - Espírito"}, {"flavorText": "否命因生命绽放而欢欣；紧接着又因无从经历，而忌妒起此等单纯喜悦。另一轮回于是展开。", "language": "Chinese Simplified", "multiverseId": 85281, "name": "否命生相", "text": "当否命生相从场上进入坟墓场时，你可以将否命生相移出对战。若你如此作，将任意数量的目标精怪牌从你的坟墓场移回你手上。", "type": "传奇生物～精怪"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "112155", "cardKingdomId": "111856", "cardsphereId": "7960", "mcmId": "12055", "mcmMetaId": "7026", "mtgjsonV4Id": "a0970289-15b7-51ec-9b4e-3d266babf079", "mtgoFoilId": "21250", "mtgoId": "21249", "multiverseId": "80282", "scryfallId": "be027e3c-8891-46f0-bca7-d28a94ca281a", "scryfallIllustrationId": "9d1d92ec-b467-4bbf-8ef3-c4d18a32339c", "scryfallOracleId": "cb806239-32bf-4850-be65-239444c347a5", "tcgplayerProductId": "12036"}, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{G}{G}", "manaValue": 6.0, "name": "Iname, Life Aspect", "number": "215", "originalText": "When Iname, Life Aspect is put into a graveyard from play, you may remove Iname, Life Aspect from the game. If you do, return any number of target Spirit cards from your graveyard to your hand.", "originalType": "Legendary Creature - Spirit", "power": "4", "printings": ["CHK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/e2eb2d17e43e87f9", "cardKingdomFoil": "https://mtgjson.com/links/1a30b7df9a1632f9", "cardmarket": "https://mtgjson.com/links/126552c6dc3735ad", "tcgplayer": "https://mtgjson.com/links/5543173e111b571e"}, "rarity": "rare", "rulings": [{"date": "2004-12-01", "text": "The targets of Iname, Life Aspect’s ability are chosen when the ability is put onto the stack, but you don’t choose whether to exile Iname, Life Aspect until the ability resolves."}, {"date": "2004-12-01", "text": "You may target Iname, Life Aspect. However, this doesn’t do anything since the card will no longer be in your graveyard when the creature cards are returned to your hand."}, {"date": "2004-12-01", "text": "You can exile the card even if you choose no targets."}, {"date": "2013-04-15", "text": "In a Commander game, you may send Iname to the Command Zone instead of exiling it during the resolution of its ability. If you do, its ability still works. Iname’s ability only requires that you attempted to exile it, not that it actually gets to the exile zone. This is similar to how destroying a creature (with, for example, Rest in Peace) doesn’t necessarily ensure that creature will end up in the graveyard; it just so happens that the action of exiling something and the exile zone both use the same word: “exile”."}], "setCode": "CHK", "subtypes": ["Spirit"], "supertypes": ["Legendary"], "text": "When Iname, Life Aspect dies, you may exile it. If you do, return any number of target Spirit cards from your graveyard to your hand.", "toughness": "4", "type": "Legendary Creature — Spirit", "types": ["Creature"], "uuid": "62a1c11c-3b51-5f23-a42f-58e2632b7ce7"}