{"artist": "Stephen Tappin", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "G"], "colors": ["B", "G"], "convertedManaCost": 12.0, "edhrecRank": 13926, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 105273, "name": "Iname als Eines", "text": "Wenn Iname als Eines ins Spiel kommt und falls du ihn aus deiner Hand ausgespielt hast, kannst du deine Bibliothek nach einer Geist-Karte durchsuchen, sie ins Spiel bringen und dann deine Bibliothek mischen.\nWenn Iname als Eines aus dem Spiel auf einen Friedhof gelegt wird, kannst du ihn ganz aus dem Spiel entfernen. Falls du dies tust, bringe eine Geist-Karte deiner Wahl aus deinem Friedhof ins Spiel zurück.", "type": "Legendäre Kreatur - Geist"}, {"language": "Spanish", "multiverseId": 105933, "name": "Iname unificado", "text": "Cuando Iname unificado entre en juego, si lo jugaste de tu mano, puedes buscar en tu biblioteca una carta de Espíritu, ponerla en juego, luego barajar tu biblioteca.\nCuando Iname unificado vaya a un cementerio desde el juego, puedes removerlo del juego. Si lo haces, regresa la carta de Espíritu objetivo de tu cementerio al juego.", "type": "Criatura legendaria - Espíritu"}, {"language": "French", "multiverseId": 105108, "name": "Iname unifié", "text": "Quand Iname unifié arrive en jeu, si vous l'avez joué depuis votre main, vous pouvez chercher dans votre bibliothèque une carte d'esprit, la mettre en jeu, puis mélanger votre bibliothèque.\nQuand Iname unifié est mis dans un cimetière depuis le jeu, vous pouvez le retirer de la partie. Si vous faites ainsi, renvoyez en jeu la carte d'esprit ciblée de votre cimetière.", "type": "Créature légendaire : esprit"}, {"language": "Italian", "multiverseId": 105438, "name": "Iname Come Unico", "text": "Quando Come Unico entra in gioco, se lo hai giocato dalla tua mano, puoi passare in rassegna il tuo grimorio, scegliere una carta Spirito, metterla in gioco, poi rimescolare il tuo grimorio.\nQuando Iname Come Unico viene messo in un cimitero dal gioco, puoi rimuoverlo dal gioco. Se lo fai, rimetti in gioco una carta Spirito bersaglio dal tuo cimitero.", "type": "Creatura Leggendaria - Spirito"}, {"language": "Japanese", "multiverseId": 105603, "name": "一なる否命", "text": "一なる否命が場に出たとき、あなたがそれを手札からプレイしている場合、あなたは「自分のライブラリーからスピリット・カードを１枚探して場に出し、その後あなたのライブラリーを切り直す」ことを行ってもよい。\n一なる否命が場からいずれかの墓地に置かれたとき、あなたの墓地にあるスピリット・カード１枚を対象とする。あなたは一なる否命をゲームから取り除いてもよい。 そうした場合、そのスピリット・カードを場に戻す。", "type": "伝説のクリーチャー — スピリット"}, {"language": "Portuguese (Brazil)", "multiverseId": 105768, "name": "Iname como Uma", "text": "Quando Iname como Uma entra em jogo, se a jogou de sua mão, você pode procurar em seu grimório por um card de Espírito, colocá-lo em jogo, e depois embaralhe seu grimório.\nQuando Iname como Uma é colocada num cemitério vinda de jogo, você pode removê-la de jogo. Se o fizer, devolva o card alvo de Espírito de seu cemitério para o jogo.", "type": "Criatura Lendária - Espírito"}, {"language": "Chinese Simplified", "multiverseId": 104943, "name": "否命合一", "text": "当否命合一进场时，若你从手上使用之，则你可以从你牌库中搜寻一张精怪牌，将其放置进场，然后将你的牌库洗牌。\n当否命合一从场上置入坟墓场时，你可以将它移出对战。 若你如此作，则将目标精怪牌从你的坟墓场移回场上。", "type": "传奇生物～精怪"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "117393", "cardKingdomId": "117062", "cardsphereId": "40003", "mcmId": "12683", "mcmMetaId": "7274", "mtgjsonV4Id": "09fb0993-5e68-5256-b969-f234a751a01c", "mtgoFoilId": "22099", "mtgoId": "22098", "multiverseId": "74618", "scryfallId": "4e13f122-0dfe-42f3-9815-9ae1a29fca99", "scryfallIllustrationId": "5629b060-7b50-4e2f-b08b-6986c1f756e8", "scryfallOracleId": "865e569b-6999-4a03-ad02-4bfd595d5820", "tcgplayerProductId": "12455"}, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{8}{B}{B}{G}{G}", "manaValue": 12.0, "name": "Iname as One", "number": "151", "originalText": "When Iname as One comes into play, if you played it from your hand, you may search your library for a Spirit card, put it into play, then shuffle your library.\nWhen Iname as One is put into a graveyard from play, you may remove it from the game. If you do, return target Spirit card from your graveyard to play.", "originalType": "Legendary Creature - Spirit", "power": "8", "printings": ["SOK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d2b85ef14c15348f", "cardKingdomFoil": "https://mtgjson.com/links/0e74800c1fda2c56", "cardmarket": "https://mtgjson.com/links/f127be5f92d0f8e4", "tcgplayer": "https://mtgjson.com/links/6e1e4c1d924e1715"}, "rarity": "rare", "rulings": [{"date": "2005-06-01", "text": "Effects that put Iname onto the battlefield don’t cause its enters-the-battlefield ability to trigger."}, {"date": "2005-06-01", "text": "Iname can target itself with the graveyard-triggered ability, but it will be exiled and the ability won’t be able to return Iname."}, {"date": "2005-06-01", "text": "You aren’t required to exile Iname. If you don’t, the target Spirit card isn’t returned to the battlefield."}, {"date": "2013-04-15", "text": "In a Commander game, you may send Iname to the Command Zone instead of exiling it during the resolution of its ability. If you do, its ability still works. Iname’s ability only requires that you attempted to exile it, not that it actually gets to the exile zone. This is similar to how destroying a creature (with, for example, Rest in Peace) doesn’t necessarily ensure that creature will end up in the graveyard; it just so happens that the action of exiling something and the exile zone both use the same word: “exile”."}, {"date": "2013-07-01", "text": "In a Commander game where this card is your commander, casting it from the Command zone does not count as casting it from your hand."}, {"date": "2013-09-20", "text": "If a creature (such as Clone) enters the battlefield as a copy of this creature, the copy’s “enters-the-battlefield” ability will still trigger as long as you cast that creature spell from your hand."}], "setCode": "SOK", "subtypes": ["Spirit"], "supertypes": ["Legendary"], "text": "When Iname as One enters the battlefield, if you cast it from your hand, you may search your library for a Spirit permanent card, put it onto the battlefield, then shuffle.\nWhen Iname as One dies, you may exile it. If you do, return target Spirit permanent card from your graveyard to the battlefield.", "toughness": "8", "type": "Legendary Creature — Spirit", "types": ["Creature"], "uuid": "190237cd-da91-5ab4-8964-4bdb227b2a3c"}