{"artist": "Volkan Baǵa", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 5.0, "edhrecRank": 5473, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 337054, "name": "Zunehmender Ehrgeiz", "text": "Durchsuche deine Bibliothek nach einer Karte und nimm diese Karte auf deine Hand. Falls der Zunehmende Ehrgeiz aus einen Friedhof gewirkt wurde, durchsuche stattdessen deine Bibliothek nach zwei Karten und nimm diese auf deine Hand. Mische danach deine Bibliothek.\nRückblende {7}{B} (Du kannst diese Karte aus deinem Friedhof für ihre Rückblendekosten wirken. Schicke sie danach ins Exil.)", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 337225, "name": "Aumentar la ambición", "text": "Busca una carta de tu biblioteca y pon esa carta en tu mano. Si Aumentar la ambición fue lanzado desde un cementerio, en vez de eso, busca dos cartas en tu biblioteca y pon esas cartas en tu mano. Luego baraja tu biblioteca.\nRetrospectiva {7}{B}. (Puedes lanzar esta carta desde tu cementerio pagando su coste de retrospectiva. Luego exíliala.)", "type": "Conjuro"}, {"language": "French", "multiverseId": 336712, "name": "Ambition grandissante", "text": "Cherchez une carte dans votre bibliothèque et mettez cette carte dans votre main. Si l'Ambition grandissante a été lancée depuis un cimetière, à la place, cherchez deux cartes dans votre bibliothèque et mettez-les dans votre main. Mélangez ensuite votre bibliothèque.\nFlashback {7}{B} (Vous pouvez lancer cette carte depuis votre cimetière pour son coût de flashback. Exilez-la ensuite.)", "type": "Rituel"}, {"language": "Italian", "multiverseId": 337396, "name": "Ambizione Crescente", "text": "Passa in rassegna il tuo grimorio per una carta e aggiungi quella carta alla tua mano. Se l'Ambizione Crescente è stata lanciata da un cimitero, passi invece in rassegna il tuo grimorio per due carte e le aggiungi alla tua mano. Poi rimescola il tuo grimorio.\nFlashback {7}{B} (Puoi lanciare questa carta dal tuo cimitero pagando il suo costo di flashback. Poi esiliala.)", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 337567, "name": "高まる野心", "text": "あなたのライブラリーからカードを１枚探し、そのカードをあなたの手札に加える。高まる野心があなたの墓地から唱えられた場合、代わりにあなたのライブラリーからカードを２枚探し、それらのカードをあなたの手札に加える。その後あなたのライブラリーを切り直す。\nフラッシュバック {7}{B} （あなたはフラッシュバック・コストで、このカードをあなたの墓地からプレイしてもよい。その後、それを追放する。）", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 336199, "name": "커져가는 야망", "text": "당신의 서고에서 원하는 카드 한 장을 찾아 당신의 손으로 가져간다. 만약 커져가는 야망을 무덤에서 발동했다면, 대신에 당신의 서고에서 원하는 카드 두 장을 찾아 당신의 손으로 가져간다. 그러고 나서 당신의 서고를 섞는다.\n회상 {7}{B} (당신은 이 카드의 회상 비용을 지불해 이 카드를 당신의 무덤에서 발동할 수 있다. 그 후, 이 카드를 추방한다.)", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 336541, "name": "Ambição Crescente", "text": "Procure um card em seu grimório e coloque aquele card em sua mão. Se Ambição Crescente tiver sido conjurado de um cemitério, em vez disso, procure dois cards em seu grimório e coloque-os em sua mão. Depois, embaralhe seu grimório.\nRecapitular {7}{B} (Você pode conjurar este card de seu cemitério pagando seu custo de recapitular. Depois, exile-o.)", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 336883, "name": "Растущее Честолюбие", "text": "Найдите в вашей библиотеке карту и положите ту карту в вашу руку. Если Растущее Честолюбие было разыграно из кладбища, вместо этого найдите в вашей библиотеке две карты и положите те карты в вашу руку. Затем перетасуйте вашу библиотеку.\nВоспоминание {7}{B} (Вы можете разыграть эту карту из вашего кладбища за ее стоимость Воспоминания. Затем изгоните ее.)", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 336028, "name": "野心渐增", "text": "从你的牌库中搜寻一张牌并置于你手上。如果野心渐增是从坟墓场施放，则改为从你的牌库中搜寻两张牌并置于你手上。然后将你的牌库洗牌。\n返照{7}{B} （你可以从你的坟墓场施放此牌，并支付其返照费用，然后将它放逐。）", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 336370, "name": "野心漸增", "text": "從你的牌庫中搜尋一張牌並置於你手上。如果野心漸增是從墳墓場施放，則改為從你的牌庫中搜尋兩張牌並置於你手上。然後將你的牌庫洗牌。\n返照{7}{B}（你可以從你的墳墓場施放此牌，並支付其返照費用。然後將它放逐。）", "type": "巫術"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "186562", "cardKingdomId": "186389", "cardsphereId": "12339", "mcmId": "252583", "mcmMetaId": "204847", "mtgjsonV4Id": "b6053496-ac45-5579-9365-8af405a8c4b0", "mtgoFoilId": "43390", "mtgoId": "43389", "multiverseId": "262833", "scryfallId": "c8f508dc-7c7d-47e8-a4ef-0e8fd99cbd74", "scryfallIllustrationId": "2a0ecff6-efcb-4dfc-96cd-55726c22d1e9", "scryfallOracleId": "09027657-bc9a-4702-88c1-e5b3534ad188", "tcgplayerProductId": "57815"}, "keywords": ["Flashback"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{B}", "manaValue": 5.0, "name": "Increasing Ambition", "number": "69", "originalText": "Search your library for a card and put that card into your hand. If Increasing Ambition was cast from a graveyard, instead search your library for two cards and put those cards into your hand. Then shuffle your library.\nFlashback {7}{B} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", "originalType": "Sorcery", "printings": ["DKA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/291aaf65935a90ab", "cardKingdomFoil": "https://mtgjson.com/links/0851cdbcbc966fbc", "cardmarket": "https://mtgjson.com/links/c467b7ead8ffdf28", "tcgplayer": "https://mtgjson.com/links/a2b7b2b62e9c00f7"}, "rarity": "rare", "rulings": [], "setCode": "DKA", "subtypes": [], "supertypes": [], "text": "Search your library for a card and put that card into your hand. If this spell was cast from a graveyard, instead search your library for two cards and put those cards into your hand. Then shuffle.\nFlashback {7}{B} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "4100b2d5-e735-57a9-9b1a-741e4c146928"}