{"artist": "Daniel Ljunggren", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 5.0, "edhrecRank": 1890, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 337087, "name": "Zunehmende Hingabe", "text": "Bringe fünf 1/1 weiße Mensch-Kreaturenspielsteine ins Spiel. Falls die Zunehmende Hingabe aus einem Friedhof gewirkt wurde, bringe stattdessen zehn dieser Spielsteine ins Spiel.\nRückblende {7}{B} (Du kannst diese Karte aus deinem Friedhof für ihre Rückblendekosten wirken. Schicke sie danach ins Exil.)", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 337258, "name": "Aumentar la devoción", "text": "Pon en el campo de batalla cinco fichas de criatura Humano blancas 1/1. Si Aumentar la devoción fue lanzado desde un cementerio, en vez de eso, pon en el campo de batalla diez de esas fichas.\nRetrospectiva {7}{W}{W}. (Puedes lanzar esta carta desde tu cementerio pagando su coste de retrospectiva. Luego exíliala.)", "type": "Conjuro"}, {"language": "French", "multiverseId": 336745, "name": "Dévotion grandissante", "text": "Mettez sur le champ de bataille cinq jetons de créature 1/1 blanche Humain. Si la Dévotion grandissante a été lancée depuis un cimetière, mettez sur le champ de bataille dix de ces jetons à la place.\nFlashback {7}{W}{W} (Vous pouvez lancer cette carte depuis votre cimetière pour son coût de flashback. Exilez-la ensuite.)", "type": "Rituel"}, {"language": "Italian", "multiverseId": 337429, "name": "Devozione Crescente", "text": "Metti sul campo di battaglia cinque pedine creatura Umano 1/1 bianche. Se la Devozione Crescente è stata lanciata da un cimitero, metti invece sul campo di battaglia dieci di quelle pedine.\nFlashback {7}{W}{W} (Puoi lanciare questa carta dal tuo cimitero pagando il suo costo di flashback. Poi esiliala.)", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 337600, "name": "高まる献身", "text": "白の１/１の人間・クリーチャー・トークンを５体戦場に出す。高まる献身が墓地から唱えられた場合、代わりにそれらのトークンを10体戦場に出す。フラッシュバック {7}{W}{W} （あなたはフラッシュバック・コストで、このカードをあなたの墓地からプレイしてもよい。その後、それを追放する。）", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 336232, "name": "커져가는 헌신", "text": "1/1 백색 인간 생물 토큰 다섯을 전장에 놓는다. 만약 커져가는 헌신을 무덤에서 발동했다면, 대신에 그런 토큰 열 개를 전장에 놓는다.\n회상 {7}{B} (당신은 이 카드의 회상 비용을 지불해 이 카드를 당신의 무덤에서 발동할 수 있다. 그 후, 이 카드를 추방한다.)", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 336574, "name": "Devoção Crescente", "text": "Coloque no campo de batalha cinco fichas de criatura brancas 1/1 do tipo Humano. Se Devoção Crescente tiver sido conjurada de um cemitério, em vez disso, coloque dez dessas fichas no campo de batalha.\nRecapitular {7}{W}{W} (Você pode conjurar este card de seu cemitério pagando seu custo de recapitular. Depois, exile-o.)", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 336916, "name": "Растущая Преданность", "text": "Положите на поле битвы пять фишек существа 1/1 белый Человек. Если Растущая Преданность была разыграна из кладбища, положите на поле битвы десять таких фишек вместо этого.\nВоспоминание {7}{W}{W} (Вы можете разыграть эту карту из вашего кладбища за ее стоимость Воспоминания. Затем изгоните ее.)", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 336061, "name": "奉献渐增", "text": "将五个1/1白色人类衍生生物放进战场。如果奉献渐增是从坟墓场施放，则改为将十个这类衍生物放进战场。\n返照{7}{W}{W} （你可以从你的坟墓场施放此牌，并支付其返照费用，然后将它放逐。）", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 336403, "name": "奉獻漸增", "text": "將五個1/1白色人類衍生生物放進戰場。如果奉獻漸增是從墳墓場施放，則改為將十個這類衍生物放進戰場。\n返照{7}{W}{W}（你可以從你的墳墓場施放此牌，並支付其返照費用。然後將它放逐。）", "type": "巫術"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "186463", "cardKingdomId": "186280", "cardsphereId": "12343", "mcmId": "252470", "mcmMetaId": "204742", "mtgjsonV4Id": "29a05b72-3beb-5bc3-8a63-abe582f590fa", "mtgoFoilId": "43454", "mtgoId": "43453", "multiverseId": "262870", "scryfallId": "87b5de81-65a6-4a74-8a71-767b92e89e91", "scryfallIllustrationId": "caa883cd-c721-4b7e-b53a-04048b8d9e95", "scryfallOracleId": "7a5ff4d4-27b7-47d4-ba88-970c63c4e3fb", "tcgplayerProductId": "57609"}, "keywords": ["Flashback"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}{W}", "manaValue": 5.0, "name": "Increasing Devotion", "number": "11", "originalText": "Put five 1/1 white Human creature tokens onto the battlefield. If Increasing Devotion was cast from a graveyard, put ten of those tokens onto the battlefield instead.\nFlashback {7}{W}{W} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", "originalType": "Sorcery", "printings": ["C19", "C20", "DDQ", "DKA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d868ffeee8392b8f", "cardKingdomFoil": "https://mtgjson.com/links/95087b8ade8ec577", "cardmarket": "https://mtgjson.com/links/02cdca0efaf32fb9", "tcgplayer": "https://mtgjson.com/links/b9a78d35d3bd8fa0"}, "rarity": "rare", "rulings": [{"date": "2021-03-19", "text": "“Flashback [cost]” means “You may cast this card from your graveyard by paying [cost] rather than paying its mana cost” and “If the flashback cost was paid, exile this card instead of putting it anywhere else any time it would leave the stack.”"}, {"date": "2021-03-19", "text": "You must still follow any timing restrictions and permissions, including those based on the card’s type. For instance, you can cast a sorcery using flashback only when you could normally cast a sorcery."}, {"date": "2021-03-19", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a flashback cost) you’re paying, add any cost increases, then apply any cost reductions. The mana value of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2021-03-19", "text": "A spell cast using flashback will always be exiled afterward, whether it resolves, is countered, or leaves the stack in some other way."}, {"date": "2021-03-19", "text": "You can cast a spell using flashback even if it was somehow put into your graveyard without having been cast."}, {"date": "2021-03-19", "text": "If a card with flashback is put into your graveyard during your turn, you can cast it if it’s legal to do so before any other player can take any actions."}], "setCode": "DKA", "subtypes": [], "supertypes": [], "text": "Create five 1/1 white Human creature tokens. If this spell was cast from a graveyard, create ten of those tokens instead.\nFlashback {7}{W}{W} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "4b491bf9-4f79-52cb-b26d-ced5942e1a6d"}