{"artist": "Chris Rallis", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 12409, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 439900, "name": "Herbeigeführte Amnesie", "text": "Wenn die Herbeigeführte Amnesie ins Spiel kommt, schickt ein Spieler deiner Wahl alle Karten auf seiner Hand verdeckt ins Exil und zieht dann entsprechend viele Karten.\nWenn die Herbeigeführte Amnesie aus dem Spiel auf einen Friedhof gelegt wird, bringe die ins Exil geschickten Karten auf die Hand ihres Besitzers zurück.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 440103, "name": "Amnesia inducida", "text": "Cuando la Amnesia inducida entre al campo de batalla, el jugador objetivo exilia todas las cartas de su mano boca abajo, luego roba esa misma cantidad de cartas.\nCuando la Amnesia inducida vaya a un cementerio desde el campo de batalla, regresa las cartas exiliadas a la mano de su propietario.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 440306, "name": "Amnésie induite", "text": "Quand l'Amnésie induite arrive sur le champ de bataille, le joueur ciblé exile toutes les cartes de sa main face cachée, puis pioche autant de cartes.\nQuand l'Amnésie induite est mise dans un cimetière depuis le champ de bataille, renvoyez les cartes exilées dans la main de leur propriétaire.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 440509, "name": "Amnesia Indotta", "text": "Quando l'Amnesia Indotta entra nel campo di battaglia, un giocatore bersaglio esilia tutte le carte dalla sua mano a faccia in giù, poi pesca altrettante carte.\nQuando l'Amnesia Indotta viene messa in un cimitero dal campo di battaglia, fai tornare le carte esiliate in mano al loro proprietario.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 440712, "name": "誘導記憶喪失", "text": "誘導記憶喪失が戦場に出たとき、プレイヤー１人を対象とする。そのプレイヤーは、自分の手札のカードをすべて裏向きに追放し、その後その枚数に等しい枚数のカードを引く。\n誘導記憶喪失が戦場から墓地に置かれたとき、それらの追放されたカードをオーナーの手札に戻す。", "type": "エンチャント"}, {"language": "Korean", "multiverseId": 440915, "name": "유도된 기억상실", "text": "유도된 기억상실이 전장에 들어올 때, 플레이어를 목표로 정한다. 그 플레이어는 자신의 손에 있는 카드들을 뒷면 상태로 모두 추방한 후, 그만큼의 카드를 뽑는다.\n유도된 기억상실이 전장에서 무덤에 들어갈 때, 추방되었던 카드들을 소유자의 손으로 되돌린다.", "type": "부여마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 441118, "name": "Amnésia Induzida", "text": "Quando Amnésia Induzida entra no campo de batalha, o jogador alvo exila todos os cards da própria mão com a face voltada para baixo e, em seguida, compra aquela quantidade de cards.\nQuando Amnésia Induzida for colocada em um cemitério a partir do campo de batalha, devolva os cards exilados para a mão de seu dono.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 441321, "name": "Наведенная Амнезия", "text": "Когда Наведенная Амнезия выходит на поле битвы, целевой игрок изгоняет все карты из своей руки рубашкой вверх, затем берет столько же карт.\nКогда Наведенная Амнезия попадает с поля битвы на кладбище, верните изгнанные карты в руку их владельца.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 441524, "name": "引发失忆", "text": "当引发失忆进战场时，目标牌手牌面朝下地放逐其手牌，然后抓等量的牌。\n当引发失忆从战场进入坟墓场时，将所放逐的牌移回其拥有者手上。", "type": "结界"}, {"language": "Chinese Traditional", "multiverseId": 441727, "name": "引發失憶", "text": "當引發失憶進戰場時，目標玩家牌面朝下地放逐其手牌，然後抽等量的牌。\n當引發失憶從戰場進入墳墓場時，將所放逐的牌移回其擁有者手上。", "type": "結界"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "216309", "cardKingdomId": "216027", "cardsphereId": "53113", "mcmId": "315306", "mcmMetaId": "236111", "mtgArenaId": "66697", "mtgjsonV4Id": "fab9a5ec-ac1f-57c4-8532-d2514cc80e7b", "mtgoId": "66533", "multiverseId": "439697", "scryfallId": "a4ee56f1-9f08-459f-8517-0fe7bc645fa3", "scryfallIllustrationId": "017f6b6a-5fca-4762-babb-456b164ae5e6", "scryfallOracleId": "6f01c124-0518-428c-9efe-7f3741f3c109", "tcgplayerProductId": "155637"}, "isStorySpotlight": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}", "manaValue": 3.0, "name": "Induced Amnesia", "number": "40", "originalText": "When Induced Amnesia enters the battlefield, target player exiles all cards from his or her hand face down, then draws that many cards.\nWhen Induced Amnesia is put into a graveyard from the battlefield, return the exiled cards to their owner's hand.", "originalType": "Enchantment", "printings": ["PRIX", "RIX"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/feb29d2a6b4e3127", "cardKingdomFoil": "https://mtgjson.com/links/0a624d31fc3b154e", "cardmarket": "https://mtgjson.com/links/73bda318fa3245da", "tcgplayer": "https://mtgjson.com/links/596beabae73d0707"}, "rarity": "rare", "rulings": [{"date": "2018-01-19", "text": "No player may look at the exiled cards."}, {"date": "2018-01-19", "text": "If Induced Amnesia leaves the battlefield but isn’t put into a graveyard, the exiled cards are lost forever. They won’t be returned if another Induced Amnesia is put into a graveyard, even if that Induced Amnesia is represented by the same card."}, {"date": "2018-01-19", "text": "If Induced Amnesia leaves the battlefield before its first ability resolves, its second ability will trigger (if appropriate) and do nothing. Then its first ability will resolve, and the exiled cards will be exiled indefinitely."}, {"date": "2018-01-19", "text": "There are many important moments in the story, but the most crucial—called “story spotlights”—are shown on cards. These cards have the Planeswalker symbol in their text box; this symbol has no effect on gameplay. You can read more about these events in the official Magic fiction at http://www.mtgstory.com."}], "securityStamp": "oval", "setCode": "RIX", "subtypes": [], "supertypes": [], "text": "When Induced Amnesia enters the battlefield, target player exiles all cards from their hand face down, then draws that many cards.\nWhen Induced Amnesia is put into a graveyard from the battlefield, return the exiled cards to their owner's hand.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "56d5d9db-e138-5d6f-b367-1f77d0cde8da", "watermark": "planeswalker"}