{"artist": "Nils Hamm", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 3.0, "edhrecRank": 8932, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 410963, "name": "Unaufhaltsamer Glibber", "text": "Delirium — Immer wenn der Unaufhaltsame Glibber angreift und falls dein Friedhof vier oder mehr unterschiedliche Kartentypen enthält, bringe einen 3/3 grünen Schlammwesen-Kreaturenspielstein getappt und angreifend ins Spiel.", "type": "Kreatur — Schlammwesen"}, {"language": "Spanish", "multiverseId": 413273, "name": "Masa inexorable", "text": "Delirio — Siempre que la Masa inexorable ataque, si entre las cartas de tu cementerio hay cuatro o más tipos de cartas, pon en el campo de batalla una ficha de criatura Cieno verde 3/3 girada y atacando.", "type": "Criatura — Cieno"}, {"language": "French", "multiverseId": 411293, "name": "Masse inexorable", "text": "Délire — À chaque fois que la Masse inexorable attaque, s'il y a au moins quatre types de carte parmi les cartes de votre cimetière, mettez sur le champ de bataille un jeton de créature 3/3 verte Limon, engagé et attaquant.", "type": "Créature : limon"}, {"language": "Italian", "multiverseId": 411623, "name": "Massa Inesorabile", "text": "Delirio — Ogniqualvolta la Massa Inesorabile attacca, se ci sono quattro o più tipi di carta tra le carte nel tuo cimitero, metti sul campo di battaglia una pedina creatura Melma 3/3 verde TAPpata e attaccante.", "type": "Creatura — Melma"}, {"language": "Japanese", "multiverseId": 411953, "name": "容赦無い泥塊", "text": "昂揚 ― 容赦無い泥塊が攻撃するたび、あなたの墓地にあるカードにカード・タイプが合計４種類以上含まれる場合、緑の３/３のウーズ・クリーチャー・トークンを１体タップ状態で攻撃している状態で戦場に出す。", "type": "クリーチャー — ウーズ"}, {"language": "Korean", "multiverseId": 412283, "name": "냉혹한 형체 덩어리", "text": "섬망 — 냉혹한 형체 덩어리가 공격할 때마다, 당신의 무덤에 네 개 이상의 카드 유형이 있다면, 3/3 녹색 점액괴물 생물 토큰 한 개를 탭되어 공격하는 상태로 전장에 놓는다.", "type": "생물 — 점액괴물"}, {"language": "Portuguese (Brazil)", "multiverseId": 412613, "name": "Bolha Inexorável", "text": "Delírio — Toda vez que Bolha Inexorável atacar, se houver quatro ou mais tipos de card entre os cards de seu cemitério, coloque no campo de batalha virada e atacando uma ficha de criatura verde 3/3 do tipo Lodo.", "type": "Criatura — Lodo"}, {"language": "Russian", "multiverseId": 412943, "name": "Неумолимый Пузырь", "text": "Буйство — Каждый раз, когда Неумолимый Пузырь атакует, если среди карт на вашем кладбище есть не менее четырех типов карт, положите на поле битвы одну фишку существа 3/3 зеленая Тина повернутой и атакующей.", "type": "Существо — Тина"}, {"language": "Chinese Simplified", "multiverseId": 410303, "name": "难阻黏浆", "text": "躁狂～每当难阻黏浆攻击时，若你坟墓场中牌的类别有四种或更多，则将一个3/3绿色流浆衍生生物横置放进战场且正进行攻击。", "type": "生物～流浆"}, {"language": "Chinese Traditional", "multiverseId": 410633, "name": "難阻黏漿", "text": "躁狂～每當難阻黏漿攻擊時，若你墳墓場中牌的類別有四種或更多，則將一個3/3綠色流漿衍生生物橫置放進戰場且正進行攻擊。", "type": "生物～流漿"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "206163", "cardKingdomId": "205781", "cardsphereId": "41883", "mcmId": "289112", "mcmMetaId": "222247", "mtgjsonV4Id": "2e835ec8-0be3-5506-87bf-e14d241a8ef2", "mtgoFoilId": "60135", "mtgoId": "60134", "multiverseId": "409973", "scryfallId": "0210ff44-19d9-4d24-9d32-f1f9f219d9e0", "scryfallIllustrationId": "cc8e0de4-9d8b-4db4-9451-fd8308cab532", "scryfallOracleId": "bddf0772-503c-42f1-bb86-1dfeeedf4a7e", "tcgplayerProductId": "116252"}, "keywords": ["Delirium"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}", "manaValue": 3.0, "name": "Inexorable Blob", "number": "212", "originalText": "Delirium — Whenever Inexorable Blob attacks, if there are four or more card types among cards in your graveyard, put a 3/3 green Ooze creature token onto the battlefield tapped and attacking.", "originalType": "Creature — Ooze", "power": "3", "printings": ["PSOI", "SOI"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/f10939b46c38f187", "cardKingdomFoil": "https://mtgjson.com/links/40f10b732124e8e2", "cardmarket": "https://mtgjson.com/links/f491b887b1f7c668", "tcgplayer": "https://mtgjson.com/links/00542876463655e4"}, "rarity": "rare", "rulings": [{"date": "2016-04-08", "text": "You declare which player or planeswalker the token is attacking as you put it onto the battlefield. It doesn’t have to be the same player or planeswalker Inexorable Blob is attacking."}, {"date": "2016-04-08", "text": "Although the token is attacking, it was never declared as an attacking creature (for purposes of abilities that trigger whenever a creature attacks, for example)."}, {"date": "2016-04-08", "text": "If an effect gives the token vigilance, the token will still enter the battlefield tapped."}, {"date": "2016-04-08", "text": "The card types in Magic are artifact, creature, enchantment, instant, land, planeswalker, sorcery, and tribal (a card type that appears on some older cards). Supertypes (such as legendary and basic) and subtypes (such as Human and Equipment) are not counted."}, {"date": "2016-04-08", "text": "The number of card types matters, not the number of cards. For example, Wicker Witch (an artifact creature) along with Catalog (an instant) and Chaplain’s Blessing (a sorcery) will enable delirium."}, {"date": "2016-04-08", "text": "Because you consider only the characteristics of a double-faced card’s front face while it’s not on the battlefield, the types of its back face won’t be counted for delirium."}, {"date": "2016-04-08", "text": "In some rare cases, you can have a token or a copy of a spell in your graveyard at the moment that an object’s delirium ability counts the card types among cards in your graveyard, before that token or copy ceases to exist. Because tokens and copies of spells are not cards, even if they are copies of cards, their types will never be counted."}, {"date": "2016-04-08", "text": "Most triggered delirium abilities use an intervening “if” clause. There must be four or more card types among cards in your graveyard in order for these abilities to trigger, otherwise they never trigger at all. There’s no way to have the ability trigger if there aren’t enough card types, even if you intend to raise that number in response to the triggered ability. The number of card types is checked again as the trigger resolves, and if it has become too low somehow, the ability does nothing. If which card types are in your graveyard changes but the quantity of card types stays the same (or increases), then the delirium triggered ability will still resolve."}], "securityStamp": "oval", "setCode": "SOI", "subtypes": ["Ooze"], "supertypes": [], "text": "Delirium — Whenever Inexorable Blob attacks, if there are four or more card types among cards in your graveyard, create a 3/3 green Ooze creature token that's tapped and attacking.", "toughness": "3", "type": "Creature — Ooze", "types": ["Creature"], "uuid": "006cb9a2-0ee2-5404-b3c9-4a23e200f67a"}