{"artist": "Anthony Palumbo", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 5.0, "edhrecRank": 5732, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 519429, "name": "Höllisches Präsent", "text": "Bestimme einen Gegner. Du und jener Spieler opfert je eine Kreatur. Jeder Spieler, der auf diese Weise eine Kreatur geopfert hat, zieht zwei Karten.\nBestimme einen Gegner. Bringe eine Kreaturenkarte aus deinem Friedhof ins Spiel zurück, dann bringt jener Spieler eine Kreaturenkarte aus seinem Friedhof ins Spiel zurück.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 519677, "name": "Ofrenda infernal", "text": "Elige un oponente. Ese jugador y tú sacrifican una criatura cada uno. Cada jugador que sacrificó una criatura de esta manera roba dos cartas.\nElige un oponente. Regresa una carta de criatura de tu cementerio al campo de batalla, luego ese jugador regresa una carta de criatura de su cementerio al campo de batalla.", "type": "Conjuro"}, {"language": "French", "multiverseId": 519925, "name": "Offrande infernale", "text": "Choisissez un adversaire. Ce joueur et vous sacrifiez chacun une créature. Chaque joueur qui a sacrifié une créature de cette manière pioche deux cartes.\nChoisissez un adversaire. Renvoyez sur le champ de bataille une carte de créature depuis votre cimetière, puis ce joueur renvoie sur le champ de bataille une carte de créature depuis son cimetière.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 520173, "name": "Offerta Infernale", "text": "Scegli un avversario. Tu e quel giocatore sacrificate ognuno una creatura. Ogni giocatore che ha sacrificato una creatura in questo modo pesca due carte.\nScegli un avversario. Rimetti sul campo di battaglia una carta creatura dal tuo cimitero, poi quel giocatore rimette sul campo di battaglia una carta creatura dal suo cimitero.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 520421, "name": "冥府の捧げ物", "text": "対戦相手１人を選ぶ。あなたとそのプレイヤーはそれぞれクリーチャー１体を生け贄に捧げる。これによりクリーチャーを生け贄に捧げた各プレイヤーはそれぞれカード２枚を引く。\n対戦相手１人を選ぶ。あなたの墓地からクリーチャー・カード１枚を戦場に戻す。その後、そのプレイヤーは自分の墓地からクリーチャー・カード１枚を戦場に戻す。", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 520669, "name": "Oferenda Infernal", "text": "Escolha um oponente. Você e aquele jogador sacrificam, cada um, uma criatura. Cada jogador que sacrificou uma criatura dessa forma compra dois cards.\nEscolha um oponente. Devolva um card de criatura de seu cemitério para o campo de batalha, depois aquele jogador devolve um card de criatura do próprio cemitério para o campo de batalha.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 520917, "name": "Дьявольское Подношение", "text": "Выберите оппонента. Вы и тот игрок жертвуете по существу. Каждый игрок, который таким образом пожертвовал существо, берет две карты.\nВыберите оппонента. Верните карту существа из вашего кладбища на поле битвы, затем тот игрок возвращает карту существа из своего кладбища на поле битвы.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 521165, "name": "炼狱乐施", "text": "选择一位对手。你和该牌手各牺牲一个生物。每位以此法牺牲生物的牌手各抓两张牌。\n选择一位对手。将一张生物牌从你的坟墓场移回战场，然后该牌手将一张生物牌从其坟墓场移回战场。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 521413, "name": "煉獄樂施", "text": "選擇一位對手。你和該玩家各犧牲一個生物。每位以此法犧牲生物的玩家各抽兩張牌。\n選擇一位對手。將一張生物牌從你的墳墓場移回戰場，然後該玩家將一張生物牌從其墳墓場移回戰場。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "245286", "cardsphereId": "76576", "mcmId": "559509", "mtgjsonV4Id": "6322a3e2-bf1d-5177-bce1-d5ad3bed3b65", "mtgoId": "89393", "multiverseId": "519181", "scryfallId": "8af751fd-bfac-43cb-af3b-6116fd643703", "scryfallIllustrationId": "d7d0b40a-4005-4834-bea5-499e7b3d5d56", "scryfallOracleId": "348201c4-79de-4278-9896-d8b1567cc5cc", "tcgplayerProductId": "236423"}, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{B}", "manaValue": 5.0, "name": "Infernal Offering", "number": "146", "originalText": "Choose an opponent. You and that player each sacrifice a creature. Each player who sacrificed a creature this way draws two cards.\nChoose an opponent. Return a creature card from your graveyard to the battlefield, then that player returns a creature card from their graveyard to the battlefield.", "originalType": "Sorcery", "printings": ["C14", "C21"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/c6a29697c5e1c829", "tcgplayer": "https://mtgjson.com/links/b6d799f921bdf55e"}, "rarity": "rare", "rulings": [{"date": "2014-11-07", "text": "The sacrifice isn’t optional. If you control at least one creature, you must sacrifice one. If you control no creatures, you won’t sacrifice one and you won’t draw two cards. The same is true for the chosen opponent."}, {"date": "2014-11-07", "text": "You choose which creature card you’re returning to the battlefield, then the chosen opponent chooses which creature card they are returning. These choices aren’t made until Infernal Offering resolves. Neither card is a target of Infernal Offering."}, {"date": "2014-11-07", "text": "You may choose the same opponent for each of the effects, or you may choose different opponents. None of the affected players are targets of the spell."}, {"date": "2014-11-07", "text": "You choose the opponents for each effect as the spell resolves."}], "securityStamp": "oval", "setCode": "C21", "subtypes": [], "supertypes": [], "text": "Choose an opponent. You and that player each sacrifice a creature. Each player who sacrificed a creature this way draws two cards.\nChoose an opponent. Return a creature card from your graveyard to the battlefield, then that player returns a creature card from their graveyard to the battlefield.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "4c36e35b-cdaa-57f0-b381-12bc2abd11e1"}