{"artist": "Igor Kieryluk", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 6.0, "edhrecRank": 10316, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 390231, "name": "Unendliche Spiegelung", "text": "Verzaubert eine Kreatur\nWenn Unendliche Spiegelung an eine Kreatur angelegt ins Spiel kommt, werden alle anderen Nichtspielsteinkreaturen, die du kontrollierst, zu einer Kopie dieser Kreatur.\nAlle Nichtspielsteinkreaturen, die du kontrollierst, kommen als Kopie der verzauberten Kreatur ins Spiel.", "type": "Verzauberung — Aura"}, {"language": "Spanish", "multiverseId": 391579, "name": "Reflejo infinito", "text": "Encantar criatura.\nCuando el Reflejo infinito entre al campo de batalla anexado a una criatura, cada una de las otras criaturas que controlas que no sea ficha se convierte en una copia de esa criatura.\nLas criaturas que controlas que no sean fichas entran al campo de batalla como una copia de la criatura encantada.", "type": "Encantamiento — Aura"}, {"language": "French", "multiverseId": 390568, "name": "Reflets infinis", "text": "Enchanter : créature\nQuand les Reflets infinis arrivent sur le champ de bataille attachés à une créature, chaque autre créature non-jeton que vous contrôlez devient une copie de cette créature.\nLes créatures non-jeton que vous contrôlez arrivent sur le champ de bataille en tant que copie de la créature enchantée.", "type": "Enchantement : aura"}, {"language": "Italian", "multiverseId": 390905, "name": "Riflesso Infinito", "text": "Incanta creatura\nQuando il Riflesso Infinito entra nel campo di battaglia assegnato a una creatura, ogni altra creatura non pedina che controlli diventa una copia di quella creatura.\nLe creature non pedina che controlli entrano nel campo di battaglia come una copia della creatura incantata.", "type": "Incantesimo — Aura"}, {"language": "Japanese", "multiverseId": 391242, "name": "無限反射", "text": "エンチャント（クリーチャー）\n無限反射がクリーチャーにつけられた状態で戦場に出たとき、あなたがコントロールする他のトークンでないクリーチャーは、そのクリーチャーのコピーになる。\nあなたがコントロールするトークンでないクリーチャーは、エンチャントされているクリーチャーのコピーとして戦場に出る。", "type": "エンチャント — オーラ"}, {"language": "Chinese Simplified", "multiverseId": 389894, "name": "无限映象", "text": "结附于生物\n当无限映象进战场且结附于生物上时，所有由你操控且非衍生物的其他生物均成为所结附的生物之复制品。\n由你操控且非衍生物的生物进战场时是所结附的生物之复制品。", "type": "结界～灵气"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "196932", "cardsphereId": "10017", "mcmId": "270571", "mcmMetaId": "205362", "mtgjsonV4Id": "8a655bda-cf93-5e14-a3f2-a06f5847c43c", "mtgoFoilId": "54998", "mtgoId": "54997", "multiverseId": "389557", "scryfallId": "bb6c9287-7af5-4741-9555-c256b82c5b76", "scryfallIllustrationId": "43e36eec-9e9f-4c1c-acbd-67e0c36574c4", "scryfallOracleId": "5bbcfb73-cccc-47b0-81ae-17eb7c33ff5e", "tcgplayerProductId": "94274"}, "isReprint": true, "isStarter": true, "keywords": ["Enchant"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{5}{U}", "manaValue": 6.0, "name": "Infinite Reflection", "number": "114", "originalText": "Enchant creature\nWhen Infinite Reflection enters the battlefield attached to a creature, each other nontoken creature you control becomes a copy of that creature.\nNontoken creatures you control enter the battlefield as a copy of enchanted creature.", "originalType": "Enchantment — Aura", "printings": ["AVR", "C14"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1488714ff70cd966", "cardmarket": "https://mtgjson.com/links/f1c83f656191df8c", "tcgplayer": "https://mtgjson.com/links/7a6dc68bac04cd76"}, "rarity": "rare", "rulings": [{"date": "2012-05-01", "text": "Infinite Reflection can enchant a creature controlled by another player."}, {"date": "2012-05-01", "text": "If Infinite Reflection enters the battlefield attached to a creature and then becomes attached to a different creature before its enters-the-battlefield trigger resolves, each other nontoken creature you control will become a copy of the first creature."}, {"date": "2012-05-01", "text": "If Infinite Reflection leaves the battlefield or becomes attached to a different creature, none of the copy effects end. Your creatures will still be copies of whatever creature each was a copy of."}, {"date": "2012-05-01", "text": "If Infinite Reflection enters the battlefield attached to a token creature, the nontoken creatures that become copies of that creature are not themselves tokens."}, {"date": "2012-05-01", "text": "Creatures you control don’t copy whether the enchanted creature is tapped or untapped, whether it has any counters on it, whether it has any Auras and Equipment attached to it, or any noncopy effects that have changed its power, toughness, types, color, or so on."}, {"date": "2012-05-01", "text": "Because creatures you control enter the battlefield as a copy of the enchanted creature, any enters-the-battlefield triggered abilities printed on such creatures won’t trigger. However, if the enchanted creature has any enters-the-battlefield triggered abilities, those will trigger."}, {"date": "2012-05-01", "text": "Replacement effects that modify how a permanent enters the battlefield are now applied in the following order: control-changing effects (such as Gather Specimens), then copy effects (such as the abilities of Infinite Reflection and Clone), then all other effects."}, {"date": "2012-05-01", "text": "If a creature such as Clone is entering the battlefield under your control, there will be two copy effects to apply: the creature’s own and Infinite Reflection’s. No matter what order these effects are applied, the creature will be a copy of the enchanted creature when it enters the battlefield."}, {"date": "2012-05-01", "text": "Other enters-the-battlefield replacement abilities printed on the creature entering the battlefield won’t be applied because the creature will already be a copy of the enchanted creature at that point (and therefore it won’t have those abilities). For example, if the enchanted creature is Serra Angel, a creature that normally enters the battlefield tapped will enter the battlefield as an untapped copy of Serra Angel, and a creature that would normally enter the battlefield with counters on it will enter the battlefield as a copy of Serra Angel with no counters."}, {"date": "2012-05-01", "text": "External abilities may still affect how a creature enters the battlefield. For example, if your opponent controls Urabrask the Hidden, which reads, in part, “Creatures your opponents control enter the battlefield tapped,” a creature entering the battlefield under your control will be a tapped copy of the enchanted creature."}, {"date": "2012-05-01", "text": "If you control more than one Infinite Reflection, you can apply those copy effects in any order. Creatures you control will enter the battlefield as a copy of the one whose copy effect you apply last."}], "securityStamp": "oval", "setCode": "C14", "subtypes": ["Aura"], "supertypes": [], "text": "Enchant creature\nWhen Infinite Reflection enters the battlefield attached to a creature, each other nontoken creature you control becomes a copy of that creature.\nNontoken creatures you control enter the battlefield as a copy of enchanted creature.", "type": "Enchantment — Aura", "types": ["Enchantment"], "uuid": "99d67ac5-5be0-5810-a1ac-9dba45c609fb"}