{"artist": "Jason Rainville", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B", "U"], "colors": ["B", "U"], "convertedManaCost": 4.0, "edhrecRank": 2064, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "ca4aa7e4-ecc8-5131-aef1-021e2f90ff0e", "mtgoId": "91353", "scryfallId": "a1c641d0-f899-447b-ae11-4d65c5c833de", "scryfallIllustrationId": "9b9f3709-cbf0-4325-b927-100d30effc1f", "scryfallOracleId": "354defd2-f63f-4a48-9fd4-2526b3878a84"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Ninjutsu"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{B}", "manaValue": 4.0, "name": "Ingenious Infiltrator", "number": "91353", "originalReleaseDate": "2021-08-26", "power": "2", "printings": ["H1R", "J21", "MH1", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2019-06-14", "text": "If Ingenious Infiltrator is dealt lethal combat damage at the same time a Ninja you control deals combat damage to a player, its ability triggers."}, {"date": "2019-06-14", "text": "The ninjutsu ability can be activated only after blockers have been declared. Before then, attacking creatures are neither blocked nor unblocked."}, {"date": "2019-06-14", "text": "As you activate a ninjutsu ability, you reveal the Ninja card in your hand and return the attacking creature. The Ninja isn’t put onto the battlefield until the ability resolves. If it leaves your hand before then, it won’t enter the battlefield at all."}, {"date": "2019-06-14", "text": "The creature with ninjutsu enters the battlefield attacking the same player or planeswalker that the returned creature was attacking. This is a rule specific to ninjutsu; in other cases, when a creature is put onto the battlefield attacking, that creature’s controller chooses which player or planeswalker it’s attacking."}, {"date": "2019-06-14", "text": "Although the Ninja is attacking, it was never declared as an attacking creature (for purposes of abilities that trigger whenever a creature attacks, for example)."}, {"date": "2019-06-14", "text": "The ninjutsu ability can be activated during the declare blockers step, combat damage step, or end of combat step. If you wait until after the declare blockers step, because all combat damage is dealt at once, the Ninja won’t normally deal combat damage."}, {"date": "2019-06-14", "text": "If a creature in combat has first strike or double strike, you can activate the ninjutsu ability during the first-strike combat damage step. The Ninja will deal combat damage during the regular combat damage step, even if it has first strike."}], "setCode": "PRM", "subtypes": ["Vedalken", "Ninja"], "supertypes": [], "text": "Ninjutsu {U}{B} ({U}{B}, Return an unblocked attacker you control to hand: Put this card onto the battlefield from your hand tapped and attacking.)\nWhenever a Ninja you control deals combat damage to a player, draw a card.", "toughness": "3", "type": "Creature — Vedalken Ninja", "types": ["Creature"], "uuid": "9248d3e5-45c4-5235-aaf5-14fccdc28979"}