{"artist": "Brandon Dorman", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 17914, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 163542, "name": "Tintenlöscher", "text": "Verwandtschaft Zu Beginn deines Versorgungssegments kannst du dir die oberste Karte deiner Bibliothek anschauen. Hat sie mindestens einen Kreaturentyp mit dem Tintenlöscher gemeinsam, kannst du sie offen vorzeigen. Falls du dies tust, legen alle Gegner die obersten drei Karten ihrer Bibliothek auf ihren Friedhof.", "type": "Kreatur — Meervolk, Zauberer"}, {"language": "Spanish", "multiverseId": 163392, "name": "Disolvente de tinta", "text": "Hermandad Al comienzo de tu mantenimiento, puedes mirar la primera carta de tu biblioteca. Si comparte un tipo de criatura con el Disolvente de tinta, puedes mostrarla. Si lo haces, cada oponente pone las primeras tres cartas de su biblioteca en su cementerio.", "type": "Criatura — Hechicero tritón"}, {"language": "French", "multiverseId": 164292, "name": "Dissolveur d'encre", "text": "Parenté — Au début de votre entretien, vous pouvez regarder la carte du dessus de votre bibliothèque. Si elle partage un type de créature avec le Dissolveur d'encre, vous pouvez la révéler. Si vous faites ainsi, chaque adversaire met les trois cartes du dessus de sa bibliothèque dans son cimetière.", "type": "Créature : ondin et sorcier"}, {"language": "Italian", "multiverseId": 163692, "name": "Dissolvi Inchiostro", "text": "Parentela All'inizio del tuo mantenimento, puoi guardare la prima carta del tuo grimorio. Se condivide un tipo di creatura con il Dissolvi Inchiostro, puoi rivelarla. Se lo fai, ogni avversario mette nel proprio cimitero le prime tre carte del proprio grimorio.", "type": "Creatura — Mago Tritone"}, {"language": "Japanese", "multiverseId": 163992, "name": "墨溶かし", "text": "族系 ― あなたのアップキープの開始時に、あなたはあなたのライブラリーの一番上のカードを見てもよい。 それが墨溶かしと共通のクリーチャー・タイプを持つ場合、あなたはそれを公開してもよい。 そうした場合、各対戦相手は、自分のライブラリーの一番上から３枚のカードを自分の墓地に置く。", "type": "クリーチャー — マーフォーク・ウィザード"}, {"language": "Portuguese (Brazil)", "multiverseId": 163842, "name": "Dissolvedor de Tinta", "text": "Parentesco No início de sua manutenção, você pode olhar o card do topo do seu grimório. Se ele compartilhar um tipo de criatura com Dissolvedor de Tinta, você poderá revelá-lo. Se fizer isso, cada oponente colocará os três cards do topo de seu próprio grimório em seu próprio cemitério.", "type": "Criatura — Tritão Mago"}, {"language": "Russian", "multiverseId": 164442, "name": "Растворитель Чернил", "text": "Сходство В начале вашего шага поддержки вы можете посмотреть верхнюю карту вашей библиотеки. Если у нее есть такой же тип существа, как у Растворителя Чернил, вы можете ее показать. Если вы это делаете, каждый оппонент кладет три верхние карты своей библиотеки на свое кладбище.", "type": "Существо — Мерфолк Чародей"}, {"language": "Chinese Simplified", "multiverseId": 164142, "name": "溶墨师", "text": "血族～在你的维持开始时，你可以检视你的牌库顶牌。 如果它与溶墨师有共通之生物类别，你可以展示该牌。 若你如此作，则每位对手各将其牌库顶的三张牌置入其坟墓场。", "type": "生物～人鱼／法术师"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "124366", "cardKingdomId": "124216", "cardsphereId": "32517", "mcmId": "18865", "mcmMetaId": "9453", "mtgjsonV4Id": "eba0727f-39dc-5816-b57e-89153ed90314", "mtgoFoilId": "29085", "mtgoId": "29084", "multiverseId": "152736", "scryfallId": "6e1bf0ad-f718-4118-9e9b-19041cfbb5cf", "scryfallIllustrationId": "81c48d0c-fdac-4d63-9f21-2902544b87ca", "scryfallOracleId": "a138ca33-6ea4-468e-9cfb-c908ee62c516", "tcgplayerProductId": "17999"}, "keywords": ["Kinship", "Mill"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Ink Dissolver", "number": "36", "originalText": "Kinship At the beginning of your upkeep, you may look at the top card of your library. If it shares a creature type with Ink Dissolver, you may reveal it. If you do, each opponent puts the top three cards of his or her library into his or her graveyard.", "originalType": "Creature - Merfolk Wizard", "power": "2", "printings": ["MOR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/38e198342465e4f1", "cardKingdomFoil": "https://mtgjson.com/links/a7257093cc81a99a", "cardmarket": "https://mtgjson.com/links/064fc26bff8c5750", "tcgplayer": "https://mtgjson.com/links/23ea3a651a560f44"}, "rarity": "common", "rulings": [{"date": "2008-04-01", "text": "Kinship is an ability word that indicates a group of similar triggered abilities that appear on _Morningtide_ creatures. It doesn’t have any special rules associated with it."}, {"date": "2008-04-01", "text": "The first two sentences of every kinship ability are the same (except for the creature’s name). Only the last sentence varies from one kinship ability to the next."}, {"date": "2008-04-01", "text": "You don’t have to reveal the top card of your library, even if it shares a creature type with the creature that has the kinship ability."}, {"date": "2008-04-01", "text": "After the kinship ability finishes resolving, the card you looked at remains on top of your library."}, {"date": "2008-04-01", "text": "If you have multiple creatures with kinship abilities, each triggers and resolves separately. You’ll look at the same card for each one, unless you have some method of shuffling your library or moving that card to a different zone."}, {"date": "2008-04-01", "text": "If the top card of your library is already revealed (due to Magus of the Future, for example), you still have the option to reveal it or not as part of a kinship ability’s effect."}], "setCode": "MOR", "subtypes": ["Merfolk", "Wizard"], "supertypes": [], "text": "Kinship — At the beginning of your upkeep, you may look at the top card of your library. If it shares a creature type with Ink Dissolver, you may reveal it. If you do, each opponent mills three cards.", "toughness": "1", "type": "Creature — Merfolk Wizard", "types": ["Creature"], "uuid": "30258a82-da21-52f5-87e5-e1748a7a824e"}