{"artist": "Zoltan Boros", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 6017, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 495686, "name": "Inschrift der Einsicht", "text": "Bonus {2}{U}{U}\nBestimme eines. Falls die Bonuskosten dieses Zauberspruchs bezahlt wurden, bestimme stattdessen eine beliebige Anzahl.\n• Bringe bis zu zwei Kreaturen deiner Wahl auf die Hand ihrer Besitzer zurück.\n• Hellsicht 2, ziehe dann zwei Karten.\n• Ein Spieler deiner Wahl erzeugt einen X/X blauen Illusion-Kreaturenspielstein, wobei X gleich der Anzahl an Karten auf seiner Hand ist.", "type": "Hexerei"}, {"language": "French", "multiverseId": 495761, "name": "Inscription de perspicacité", "text": "Kick {2}{U}{U}\nChoisissez l'un. Si ce sort a été kické, choisissez n'importe quel nombre à la place.\n• Renvoyez jusqu'à deux créatures ciblées dans les mains de leurs propriétaires.\n• Regard 2, puis piochez deux cartes.\n• Un joueur ciblé crée un jeton de créature X/X bleue Illusion, X étant le nombre de cartes dans sa main.", "type": "Rituel"}, {"language": "Japanese", "multiverseId": 495836, "name": "洞察の碑文", "text": "キッカー{2}{U}{U}\n以下から１つを選ぶ。この呪文がキッカーされていたなら、代わりに以下から望む数だけ選ぶ。\n• クリーチャー最大２体を対象とする。それらをオーナーの手札に戻す。\n• 占術２を行い、その後カードを２枚引く。\n• プレイヤー１人を対象とする。そのプレイヤーは青のＸ/Ｘのイリュージョン・クリーチャー・トークンを１体生成する。Ｘはそのプレイヤーの手札にあるカードの枚数に等しい。", "type": "ソーサリー"}], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "237549", "cardKingdomId": "237223", "cardsphereId": "71286", "mcmId": "496475", "mcmMetaId": "317030", "mtgjsonV4Id": "afa5f407-54a9-5900-865f-3be6e0f3320d", "multiverseId": "495611", "scryfallId": "bea9e50b-f76e-4797-8e52-1e30ccfdb284", "scryfallIllustrationId": "b611bb16-c2ac-4b63-82d9-125da06ad511", "scryfallOracleId": "1551fe97-437e-4e89-a0d2-c398cb2155e4", "tcgplayerProductId": "222113"}, "isStarter": true, "keywords": ["Kicker", "Scry"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Inscription of Insight", "number": "329", "originalText": "Kicker {2}{U}{U}\nChoose one. If this spell was kicked, choose any number instead.\n• Return up to two target creatures to their owners' hands.\n• Scry 2, then draw two cards.\n• Target player creates an X/X blue Illusion creature token, where X is the number of cards in their hand.", "originalType": "Sorcery", "printings": ["PRM", "PZNR", "ZNR"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/868e33bef65fd5ae", "cardKingdomFoil": "https://mtgjson.com/links/44dbf26a9699d0b9", "cardmarket": "https://mtgjson.com/links/c3025188c41716ac", "tcgplayer": "https://mtgjson.com/links/fac22eedce3ea26b"}, "rarity": "rare", "rulings": [{"date": "2020-09-25", "text": "If you kick Inscription of Insight, you can’t choose any one mode more than once."}, {"date": "2020-09-25", "text": "If more than one mode is chosen, perform them in the order written. Nothing can happen in between, however, and no player may choose to take actions. Any abilities that trigger will be put onto the stack after the spell has finished resolving."}, {"date": "2020-09-25", "text": "If any targets become illegal, the other targets will still be affected as appropriate. If any targets are chosen and every target becomes illegal, Inscription of Insight doesn’t resolve. You won’t scry 2 or draw two cards if the middle mode was chosen."}, {"date": "2020-09-25", "text": "The value of X is determined only as you perform the third mode while Inscription of Insight is resolving. Once that happens, the value of X won’t change even if the number of cards in the player’s hand changes."}, {"date": "2020-09-25", "text": "Kicker represents an optional additional cost that you may choose to pay as you cast the spell. A spell cast with that additional cost paid is “kicked.”"}, {"date": "2020-09-25", "text": "You can’t pay a kicker cost more than once."}, {"date": "2020-09-25", "text": "If you put a permanent with a kicker ability onto the battlefield without casting it, you can’t kick it."}, {"date": "2020-09-25", "text": "If you copy a kicked spell, the copy is also kicked. If a card or token enters the battlefield as a copy of a permanent that’s already on the battlefield, the new permanent isn’t kicked, even if the original was."}, {"date": "2020-09-25", "text": "To determine a spell’s total cost, start with the mana cost (or an alternative cost if another card’s effect allows you to pay one instead), add any cost increases (such as kicker), then apply any cost reductions. The converted mana cost of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2020-09-25", "text": "Some instant or sorcery spells require alternative or additional targets if they’re kicked. You ignore these targeting requirements if those spells aren’t kicked, and you can’t kick those spells unless you can choose the appropriate targets. On the other hand, you can kick a permanent spell even if you won’t be able to choose targets for an enters-the-battlefield ability of that permanent once the spell resolves."}, {"date": "2020-09-25", "text": "An ability that triggers when a player casts a kicked spell resolves before the spell that caused it to trigger, but after targets have been chosen for that spell. It resolves even if that spell is countered."}], "securityStamp": "oval", "setCode": "ZNR", "subtypes": [], "supertypes": [], "text": "Kicker {2}{U}{U}\nChoose one. If this spell was kicked, choose any number instead.\n• Return up to two target creatures to their owners' hands.\n• Scry 2, then draw two cards.\n• Target player creates an X/X blue Illusion creature token, where X is the number of cards in their hand.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "cf8f334c-a03f-507b-b094-21828459be93", "variations": ["2c48aa0e-796b-5d48-9add-625b25250d9c"]}