{"artist": "Zoltan Boros", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 3.0, "edhrecRank": 10153, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 495700, "name": "Inschrift der Verheerung", "text": "Bonus {2}{B}{B}\nBestimme eines. Falls die Bonuskosten dieses Zauberspruchs bezahlt wurden, bestimme stattdessen eine beliebige Anzahl.\n• Ein Gegner deiner Wahl wirft zwei Karten ab.\n• Bringe eine Kreaturenkarte deiner Wahl mit umgewandelten Manakosten von 2 oder weniger aus deinem Friedhof ins Spiel zurück.\n• Zerstöre eine Kreatur deiner Wahl mit umgewandelten Manakosten von 3 oder weniger.", "type": "Hexerei"}, {"language": "French", "multiverseId": 495775, "name": "Inscription de ruine", "text": "Kick {2}{B}{B}\nChoisissez l'un. Si ce sort a été kické, choisissez n'importe quel nombre à la place.\n• Un adversaire ciblé se défausse de deux cartes.\n• Renvoyez sur le champ de bataille depuis votre cimetière une carte de créature ciblée avec un coût converti de mana inférieur ou égal à 2.\n• Détruisez une créature ciblée dont le coût converti de mana est inférieur ou égal à 3.", "type": "Rituel"}, {"language": "Japanese", "multiverseId": 495850, "name": "遺跡の碑文", "text": "キッカー{2}{B}{B}\n以下から１つを選ぶ。この呪文がキッカーされていたなら、代わりに以下から望む数だけ選ぶ。\n・対戦相手１人を対象とする。そのプレイヤーはカード２枚を捨てる。\n• あなたの墓地から点数で見たマナ・コストが２以下のクリーチャー・カード１枚を対象とする。それを戦場に戻す。\n• 点数で見たマナ・コストが３以下のクリーチャー１体を対象とする。それを破壊する。", "type": "ソーサリー"}], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "237545", "cardKingdomId": "237219", "cardsphereId": "71240", "mcmId": "495900", "mcmMetaId": "316655", "mtgjsonV4Id": "546e87dc-0db2-58a2-8038-190a656c623f", "multiverseId": "495625", "scryfallId": "a267c7c9-dc93-445a-92e0-8cda9742e4cb", "scryfallIllustrationId": "1a57085b-97a7-4587-b317-e1e2bc0327ae", "scryfallOracleId": "760e8561-4ec6-4594-ba5d-f79cb9f25fd0", "tcgplayerProductId": "222017"}, "isStarter": true, "keywords": ["Kicker"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}", "manaValue": 3.0, "name": "Inscription of Ruin", "number": "340", "originalText": "Kicker {2}{B}{B}\nChoose one. If this spell was kicked, choose any number instead.\n• Target opponent discards two cards.\n• Return target creature card with converted mana cost 2 or less from your graveyard to the battlefield.\n• Destroy target creature with converted mana cost 3 or less.", "originalType": "Sorcery", "printings": ["PRM", "PZNR", "ZNR"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/db2651999a42def3", "cardKingdomFoil": "https://mtgjson.com/links/8b2f947ad2b8339d", "cardmarket": "https://mtgjson.com/links/f5a78b6236bb872d", "tcgplayer": "https://mtgjson.com/links/3657b6a903a76aa3"}, "rarity": "rare", "rulings": [{"date": "2020-09-25", "text": "If you kick Inscription of Ruin, you can’t choose any one mode more than once."}, {"date": "2020-09-25", "text": "If more than one mode is chosen, perform them in the order written. Nothing can happen in between, however, and no player may choose to take actions. Any abilities that trigger will be put onto the stack after the spell has finished resolving."}, {"date": "2020-09-25", "text": "If any targets become illegal, the other targets will still be affected as appropriate."}, {"date": "2020-09-25", "text": "If a card in a player’s graveyard or a creature on the battlefield has {X} in its mana cost, X is considered to be 0."}, {"date": "2020-09-25", "text": "Because targets are chosen as you cast a spell, you can’t have Inscription of Ruin return a creature card and then destroy that creature."}, {"date": "2020-09-25", "text": "Kicker represents an optional additional cost that you may choose to pay as you cast the spell. A spell cast with that additional cost paid is “kicked.”"}, {"date": "2020-09-25", "text": "You can’t pay a kicker cost more than once."}, {"date": "2020-09-25", "text": "If you put a permanent with a kicker ability onto the battlefield without casting it, you can’t kick it."}, {"date": "2020-09-25", "text": "If you copy a kicked spell, the copy is also kicked. If a card or token enters the battlefield as a copy of a permanent that’s already on the battlefield, the new permanent isn’t kicked, even if the original was."}, {"date": "2020-09-25", "text": "To determine a spell’s total cost, start with the mana cost (or an alternative cost if another card’s effect allows you to pay one instead), add any cost increases (such as kicker), then apply any cost reductions. The converted mana cost of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2020-09-25", "text": "Some instant or sorcery spells require alternative or additional targets if they’re kicked. You ignore these targeting requirements if those spells aren’t kicked, and you can’t kick those spells unless you can choose the appropriate targets. On the other hand, you can kick a permanent spell even if you won’t be able to choose targets for an enters-the-battlefield ability of that permanent once the spell resolves."}, {"date": "2020-09-25", "text": "An ability that triggers when a player casts a kicked spell resolves before the spell that caused it to trigger, but after targets have been chosen for that spell. It resolves even if that spell is countered."}], "securityStamp": "oval", "setCode": "ZNR", "subtypes": [], "supertypes": [], "text": "Kicker {2}{B}{B}\nChoose one. If this spell was kicked, choose any number instead.\n• Target opponent discards two cards.\n• Return target creature card with mana value 2 or less from your graveyard to the battlefield.\n• Destroy target creature with mana value 3 or less.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "4329adcd-a317-5e28-8edd-5d703f8deb19", "variations": ["f5b4df8e-eafe-5af7-bfe8-ad1468f80a25"]}