{"artist": "John Penick", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 4.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "250084", "cardsphereId": "83032", "mcmId": "414999", "mtgjsonV4Id": "e45049c7-4ca8-5575-a8ec-773ca4a6768e", "scryfallId": "38da4dc4-f076-4abc-8436-58dc3751164f", "scryfallIllustrationId": "e004a0bb-734a-4e8c-a108-abed52f1f4a9", "scryfallOracleId": "9be5ca70-6fc2-4a7a-853e-cf5c810846aa", "tcgplayerProductId": "246975"}, "isFunny": true, "isReprint": true, "isStarter": true, "keywords": ["Haste", "Vigilance"], "language": "English", "layout": "normal", "legalities": {}, "manaCost": "{3}{G}", "manaValue": 4.0, "name": "Interplanar Brushwagg", "number": "79", "power": "6", "printings": ["CMB1", "CMB2"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/f2781bbb5026492d", "tcgplayer": "https://mtgjson.com/links/637870dbbe44c5f1"}, "rarity": "rare", "rulings": [{"date": "2019-11-12", "text": "Objects on the interplanar battlefield are on the battlefield and are known as interplanar permanents."}, {"date": "2019-11-12", "text": "An interplanar permanent is a permanent that you don’t control, but it’s not a permanent an opponent controls."}, {"date": "2019-11-12", "text": "If an effect refers to an interplanar permanent’s controller, that part of the effect doesn’t happen."}, {"date": "2019-11-12", "text": "If an effect attempts to give a player control of an interplanar permanent, that part of the effect doesn’t happen."}, {"date": "2019-11-12", "text": "If an interplanar permanent gains an ability that refers to its controller or refers to “you,” that part of the ability has no effect."}, {"date": "2019-11-12", "text": "If a non-interplanar permanent becomes a copy of an interplanar permanent, the first permanent is still non-interplanar. If an interplanar permanent becomes a copy of a non-interplanar permanent, the first permanent is still interplanar."}, {"date": "2019-11-12", "text": "If multiple triggered abilities of interplanar permanents need to be put on the stack, the active player puts them on the stack in any order they choose after all players have put any triggered abilities they control onto the stack. (In other words, the triggered abilities of interplanar permanents will resolve first.) These abilities have no controller."}, {"date": "2019-11-12", "text": "If a player attacks with multiple creatures with power 4 or greater, that player chooses one player or planeswalker those creatures are attacking, and Interplanar Brushwagg ends up attacking that player or planeswalker."}, {"date": "2019-11-12", "text": "Although Interplanar Brushwagg is an attacking creature if it uses its triggered ability, it was never declared as an attacking creature. This means that abilities that trigger whenever a creature attacks won’t trigger when it becomes attacking."}, {"date": "2019-11-12", "text": "Any effects that say that Interplanar Brushwagg can’t attack or can’t attack a certain player (such as that of Propaganda, or if Interplanar Brushwagg gains defender) affect only the declaration of attackers. They won’t stop Interplanar Brushwagg from becoming an attacking creature through its triggered ability."}, {"date": "2019-11-12", "text": "Interplanar Brushwagg may end up attacking its owner this way."}], "setCode": "CMB2", "subtypes": ["Brushwagg"], "supertypes": [], "text": "Interplanar (This creature enters onto the interplanar battlefield. Players can't control creatures on the interplanar battlefield.)\nVigilance, haste\nWhenever a player attacks with a creature with power 4 or greater, Interplanar Brushwagg also attacks the player or planeswalker that creature is attacking.", "toughness": "4", "type": "Creature — Brushwagg", "types": ["Creature"], "uuid": "fd6e4a14-0f22-5f5d-8dc8-8c603a50762e"}