{"artist": "Cynthia Sheppard", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 6.0, "edhrecRank": 6832, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 380935, "name": "Die Zeichen deuten", "text": "Hellsicht 3, decke dann die oberste Karte deiner Bibliothek auf. Ziehe so viele Karten, wie die umgewandelten Manakosten dieser Karte betragen. (Betrachte für Hellsicht 3 die obersten drei Karten deiner Bibliothek und lege dann eine beliebige Anzahl davon unter deine Bibliothek und den Rest in beliebiger Reihenfolge oben darauf.)", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 382090, "name": "Interpretar las señales", "text": "Adivina 3, luego muestra la primera carta de tu biblioteca. Roba una cantidad de cartas igual al coste de maná convertido de esa carta. (Para adivinar 3, mira las tres primeras cartas de tu biblioteca, luego pon cualquier cantidad de ellas en el fondo de tu biblioteca y el resto en la parte superior en cualquier orden.)", "type": "Conjuro"}, {"language": "French", "multiverseId": 381100, "name": "Interpréter les signes", "text": "Regard 3, puis révélez la carte du dessus de votre bibliothèque. Piochez un nombre de cartes égal au coût converti de mana de cette carte. (Pour appliquer regard 3, regardez les trois cartes du dessus de votre bibliothèque. Mettez n'importe quel nombre d'entre elles au-dessous de votre bibliothèque et le reste au-dessus, dans n'importe quel ordre.)", "type": "Rituel"}, {"language": "Italian", "multiverseId": 381265, "name": "Interpretare i Segni", "text": "Profetizza 3, poi rivela la prima carta del tuo grimorio. Pesca un numero di carte pari al costo di mana convertito di quella carta. (Per profetizzare 3, guarda le prime tre carte del tuo grimorio, poi mettine un qualsiasi numero in fondo al tuo grimorio e le altre in cima in qualsiasi ordine.)", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 381430, "name": "啓示の解読", "text": "占術３を行い、その後あなたのライブラリーの一番上のカードを公開する。そのカードの点数で見たマナ・コストに等しい枚数のカードを引く。（占術３を行うには、あなたのライブラリーの一番上から３枚のカードを見て、そのうちの望む枚数のカードを望む順番であなたのライブラリーの一番下に置き、残りを望む順番で一番上に置く。）", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 381595, "name": "징조 해석", "text": "점술 3을 한 후, 당신의 서고 맨 위의 카드를 공개한다. 그 주문의 전환마나비용과 같은 수의 카드를 뽑는다. (점술 3을 하려면, 당신의 서고 맨 위의 카드 세 장을 본다. 당신은 그 카드들 중 원하는 만큼을 당신의 서고 맨 밑에 놓고 나머지를 당신의 서고 맨 위에 원하는 순서대로 놓을 수 있다.)", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 381760, "name": "Interpretar os Sinais", "text": "Use vidência 3 e revele o card do topo do seu grimório. Compre um número de cards equivalente ao custo de mana convertido daquele card. (Para usar vidência 3, olhe os três cards do topo do seu grimório. Depois, coloque qualquer número deles no fundo do seu grimório e o resto no topo em qualquer ordem.)", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 381925, "name": "Чтение Знаков", "text": "Предскажите 3, затем покажите верхнюю карту вашей библиотеки. Возьмите количество карт, равное конвертированной мана-стоимости той карты. (Чтобы предсказать 3, посмотрите три верхние карты вашей библиотеки, затем положите любое количество из них в низ вашей библиотеки, а остальные на верх вашей библиотеки в любом порядке.)", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 380605, "name": "解读预兆", "text": "占卜3，然后展示你的牌库顶牌。抓若干牌，其数量等同于该牌的总法术力费用。（占卜3的流程是检视你牌库顶的三张牌，然后将其中任意数量的牌以任意顺序置于你牌库底，其余则以任意顺序置于你牌库顶。）", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 380770, "name": "解讀預兆", "text": "占卜3，然後展示你的牌庫頂牌。抽若干牌，其數量等同於該牌的總魔法力費用。（占卜3的流程是檢視你牌庫頂的三張牌，然後將其中任意數量的牌以任意順序置於你牌庫底，其餘則以任意順序置於你牌庫頂。）", "type": "巫術"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "194208", "cardKingdomId": "193945", "cardsphereId": "22130", "mcmId": "266613", "mcmMetaId": "209510", "mtgjsonV4Id": "01486b5b-a142-5a85-9ff2-dd3fb6d28e96", "mtgoFoilId": "52127", "mtgoId": "52126", "multiverseId": "380440", "scryfallId": "696f2da6-3943-4555-9610-e6b925b3d6bc", "scryfallIllustrationId": "0da77d15-3d9c-4fa6-ba73-3959896a438b", "scryfallOracleId": "834554f6-3b65-44fd-b1d1-8495b740dbfc", "tcgplayerProductId": "82220"}, "keywords": ["Scry"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{5}{U}", "manaValue": 6.0, "name": "Interpret the Signs", "number": "43", "originalText": "Scry 3, then reveal the top card of your library. Draw cards equal to that card's converted mana cost. (To scry 3, look at the top three cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)", "originalType": "Sorcery", "printings": ["CMR", "J22", "JOU"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/50f03d5e73f07e6f", "cardKingdomFoil": "https://mtgjson.com/links/997b52e45520a764", "cardmarket": "https://mtgjson.com/links/6aaaa34286819bc9", "tcgplayer": "https://mtgjson.com/links/08a7c0a08774ec83"}, "rarity": "uncommon", "rulings": [{"date": "2020-11-10", "text": "If you reveal a card with mana value 0, such as a land card, you won't draw any cards. Otherwise, the card you revealed will be the first card you draw."}, {"date": "2020-11-10", "text": "If a card in a player's library has {X} in its mana cost, X is considered to be 0."}], "setCode": "JOU", "subtypes": [], "supertypes": [], "text": "Scry 3, then reveal the top card of your library. Draw cards equal to that card's mana value. (To scry 3, look at the top three cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "292ce9d2-e05c-5b79-87dc-8585f0c58fd5"}