{"artist": "Filip Burburan", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": [], "convertedManaCost": 7.0, "edhrecRank": 17586, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 584044, "name": "Eisenmagen-Brechmaschine", "text": "Immer wenn die Eisenmagen-Brechmaschine angreift, erhält eine angreifende Kreatur deiner Wahl bis zum Ende des Zuges +X/+0, wobei X gleich der Stärke der Eisenmagen-Brechmaschine ist.\n//PRT-Prototype_Mech//\n{2}{G}{G}\nPrototyp (Du kannst diesen Zauberspruch mit anderen Manakosten, Farben und anderer Größe wirken. Er behält seine Fähigkeiten und Typen.)\n2/5", "type": "Artefaktkreatur — Wurm"}, {"language": "Spanish", "multiverseId": 584305, "name": "Triturador de acero", "text": "Siempre que el Triturador de acero ataque, la criatura atacante objetivo obtiene +X/+0 hasta el final del turno, donde X es la fuerza del Triturador de acero.\n//PRT-Prototype_Mech//\n{2}{G}{G}\nPrototipo. (Puedes lanzar este hechizo con un coste de maná, color y tamaño distintos. Sus habilidades y tipos no cambian.)\n2/5", "type": "Criatura artefacto — Sierpe"}, {"language": "French", "multiverseId": 584566, "name": "Écrabouilleur gorge-de-fer", "text": "À chaque fois que l'Écrabouilleur gorge-de-fer attaque, une créature attaquante ciblée gagne +X/+0 jusqu'à la fin du tour, X étant la force de l'Écrabouilleur gorge-de-fer.\n//PRT-Prototype_Mech//\n{2}{G}{G}\nPrototype (Vous pouvez lancer ce sort avec un coût de mana, une couleur et une taille différents. Il garde ses capacités et ses types.)\n2/5", "type": "Créature-artefact : guivre"}, {"language": "Italian", "multiverseId": 584827, "name": "Frantumatore Becco Ferreo", "text": "Ogniqualvolta il Frantumatore Becco Ferreo attacca, una creatura attaccante bersaglio prende +X/+0 fino alla fine del turno, dove X è la forza del Frantumatore Becco Ferreo.\n//PRT-Prototype_Mech//\n{2}{G}{G}\nPrototipo (Puoi lanciare questa magia con costo di mana, colore e dimensione diversi. Mantiene le sue abilità e i suoi tipi.)\n2/5", "type": "Creatura Artefatto — Wurm"}, {"language": "Japanese", "multiverseId": 585088, "name": "鉄管の破壊者", "text": "鉄管の破壊者が攻撃するたび、攻撃クリーチャー１体を対象とする。ターン終了時まで、それは＋Ｘ/＋０の修整を受ける。Ｘは鉄管の破壊者のパワーに等しい。\n//PRT-Prototype_Mech//\n{2}{G}{G}\n試作（あなたはこの呪文を、異なるマナ・コスト、色、サイズで唱えてもよい。これは能力とタイプを保持する。）\n2/5", "type": "アーティファクト・クリーチャー — ワーム"}, {"language": "Portuguese (Brazil)", "multiverseId": 585349, "name": "Esmagador Papo-de-ferro", "text": "Toda vez que Esmagador Papo-de-ferro ataca, a criatura atacante alvo recebe +X/+0 até o final do turno, sendo X o poder de Esmagador Papo-de-ferro.\n//PRT-Prototype_Mech//\n{2}{G}{G}\nProtótipo (Você pode conjurar esta mágica com custo de mana, cor e tamanho diferentes. Ela permanece com suas habilidades e tipos.)\n2/5", "type": "Criatura Artefato — Vorme"}, {"language": "Chinese Simplified", "multiverseId": 585610, "name": "铁爪轧龙", "text": "每当铁爪轧龙攻击时，目标进行攻击的生物得+X/+0直到回合结束，X为铁爪轧龙的力量。\n//PRT-Prototype_Mech//\n{2}{G}{G}\n试作（你施放此咒语时可选不同法术力费用、颜色和攻防的版本，其异能与类别不变。）\n2/5", "type": "神器生物 ～亚龙"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "269128", "cardKingdomId": "268818", "cardsphereId": "95282", "mcmId": "683333", "mcmMetaId": "414068", "mtgArenaId": "83696", "mtgjsonV4Id": "9569b0f3-67dc-5d0d-bad6-812f2a954ce8", "mtgoId": "105020", "multiverseId": "583783", "scryfallId": "64e2ec10-f45f-46ef-a076-52425bf3fe3b", "scryfallIllustrationId": "c1467914-4f41-4c1a-b813-2bb644cd18c0", "scryfallOracleId": "b04f45de-cb35-45a4-b039-0bf008c3ca56", "tcgplayerProductId": "452662"}, "keywords": ["Prototype"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{7}", "manaValue": 7.0, "name": "Iron-Craw Crusher", "number": "200", "originalText": "Whenever Iron-Craw Crusher attacks, target attacking creature gets +X/+0 until end of turn, where X is Iron-Craw Crusher's power.\n//PRT-Prototype_\nMech//\n{2}{G}{G}\nPrototype (You may cast this spell with different mana cost, color, and size. It keeps its abilities and types.)\n2/5", "originalType": "Artifact Creature — Wurm", "power": "4", "printings": ["BRO"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/af3f49f99e748d1b", "cardKingdomFoil": "https://mtgjson.com/links/792ef48234903b36", "cardmarket": "https://mtgjson.com/links/e3b33c1b848e1ef6", "tcgplayer": "https://mtgjson.com/links/255035615bdd6731"}, "rarity": "uncommon", "rulings": [{"date": "2022-10-14", "text": "A prototype card is a colorless card in every zone except the stack or the battlefield, as well as while on the stack or the battlefield if not cast as a prototyped spell. Ignore its alternative characteristics in those cases. For example, while it’s in your graveyard, Blitz Automaton is a colorless creature card with mana value 7. It can’t be the target of Recommission, a spell that targets an artifact or creature card with mana value 3 or less in your graveyard."}, {"date": "2022-10-14", "text": "When cast as a prototyped spell, that spell has the mana cost, power, and toughness characteristics shown in its colored, secondary text box rather than the normal values of those characteristics. Its color and mana value are determined by that mana cost. The permanent that spell becomes as it resolves has the same characteristics. If the spell leaves the stack in any other way, or the permanent it becomes leaves the battlefield, it immediately resumes using its normal characteristics."}, {"date": "2022-10-14", "text": "Regardless of how it was cast, a prototype card always has the same name, abilities, types, and so on. Only the mana cost, mana value, color, power, and toughness change depending on whether the card was cast as a prototyped spell."}, {"date": "2022-10-14", "text": "The prototype ability functions in any zone that the spell could be cast from. For example, if an effect allows you to cast artifact spells from your graveyard, you could cast a prototyped Blitz Automaton from your graveyard."}, {"date": "2022-10-14", "text": "Casting a prototyped spell isn’t the same as casting it for an alternative cost, and an alternative cost may be applied to a spell cast this way. For example, if an effect allows you to cast an artifact card without paying its mana cost, you could either cast Blitz Automaton normally, or as a prototyped spell."}, {"date": "2022-10-14", "text": "When casting a prototyped spell, use only its prototype characteristics to determine whether it’s legal to cast it. For example, if Blitz Automaton is exiled with the last ability of Chandra, Dressed to Kill, you would be able to cast it for {2}{R} (because it’s a red spell), even though you wouldn’t be able to cast it as a colorless spell for its normal cost."}, {"date": "2022-10-14", "text": "If an effect copies a prototyped spell, that copy (as well as the token it becomes on the battlefield) will have the same characteristics as the prototyped spell. Similarly, if an effect creates a token that’s a copy of a prototyped permanent or causes another permanent to become a copy of it, the copy would have the same characteristics as the prototyped permanent."}], "setCode": "BRO", "subtypes": ["Wurm"], "supertypes": [], "text": "Prototype {2}{G}{G} — 2/5 (You may cast this spell with different mana cost, color, and size. It keeps its abilities and types.)\nWhenever Iron-Craw Crusher attacks, target attacking creature gets +X/+0 until end of turn, where X is Iron-Craw Crusher's power.", "toughness": "6", "type": "Artifact Creature — Wurm", "types": ["Artifact", "Creature"], "uuid": "0d9b74f3-200b-56a7-87f2-ef9f6686860c"}