{"artist": "Zoltan Boros & Gabor Szikszai", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210261", "mcmId": "294434", "mtgjsonV4Id": "1471e49c-7e9b-5945-bd53-2132112d5ae0", "multiverseId": "423620", "scryfallId": "51bbbfd8-795f-4223-86f3-b3b3111d38c3", "scryfallIllustrationId": "55a63577-a300-4cca-9570-af1a11866052", "scryfallOracleId": "f017380f-97db-4a36-b111-b257aa17ebaf", "tcgplayerProductId": "125595"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Isle of Vesuva", "number": "39", "originalText": "Whenever a nontoken creature enters the battlefield, its controller puts a token onto the battlefield that's a copy of that creature.\nWhenever you roll {Chaos}, destroy target creature and all other creatures with the same name as that creature.", "originalType": "Plane — Dominaria", "printings": ["OHOP", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/5569bb072a963d02", "tcgplayer": "https://mtgjson.com/links/66e7bd9109471731"}, "rarity": "common", "rulings": [{"date": "2009-10-01", "text": "A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."}, {"date": "2009-10-01", "text": "The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."}, {"date": "2009-10-01", "text": "If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}, {"date": "2009-10-01", "text": "As a token is created by Isle of Vesuva’s first ability, it checks the printed values of the creature it’s copying, as well as any copy effects that have been applied to it. It won’t copy counters on the creature, nor will it copy other effects that have changed the creature’s power, toughness, types, color, and so on."}, {"date": "2009-10-01", "text": "A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"}, {"date": "2009-10-01", "text": "The chaos ability will destroy all creatures with the same name as the target creature, not just tokens created by Isle of Vesuva’s first ability. It doesn’t matter who controls them."}, {"date": "2009-10-01", "text": "If the permanent targeted by the chaos ability has become an illegal target by the time the ability resolves, the ability doesn’t resolve. Nothing will be destroyed."}, {"date": "2009-10-01", "text": "A token’s name is the same as the creature types listed by the effect that created it, unless the token copies a permanent or that effect specifically gives that token a name. For example, the effect of The Fourth Sphere’s chaos ability creates a token with the name “Zombie.”"}, {"date": "2009-10-01", "text": "A face-down creature has no name, so it doesn’t have the same name as anything else."}, {"date": "2009-10-01", "text": "If the creature that caused Isle of Vesuva’s first ability to trigger has already left the battlefield by the time the ability resolves, the ability still creates a token. It will have the copiable values of the characteristics of that nontoken creature as it last existed on the battlefield."}, {"date": "2013-07-01", "text": "If the permanent targeted by the chaos ability isn’t destroyed (because it regenerates, or because it has indestructible), all other permanents with the same name as it will still be destroyed."}], "setCode": "OPCA", "subtypes": ["Dominaria"], "supertypes": [], "text": "Whenever a nontoken creature enters the battlefield, its controller creates a token that's a copy of that creature.\nWhenever you roll {CHAOS}, destroy target creature and all other creatures with the same name as that creature.", "type": "Plane — Dominaria", "types": ["Plane"], "uuid": "b9404e01-ef25-5dc0-b51e-996c7a12309a"}