{"artist": "Zoltan Boros & Gabor Szikszai", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U", "W"], "colors": ["U", "W"], "convertedManaCost": 7.0, "edhrecRank": 12552, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 509909, "name": "Ith, Hoher Arkanier", "text": "Wachsamkeit\n{T}: Enttappe eine angreifende Kreatur deiner Wahl. Verhindere allen Kampfschaden, der ihr in diesem Zug zugefügt und von ihr zugefügt würde.\nAussetzen 4 — {W}{U}", "type": "Legendäre Kreatur — Mensch, Zauberer"}, {"language": "Spanish", "multiverseId": 510198, "name": "Ith, gran arcanista", "text": "Vigilancia.\n{T}: Endereza la criatura atacante objetivo. Prevén todo el daño de combate que fuera a hacer y que se le fuera a hacer a esa criatura este turno.\nSuspender 4—{W}{U}.", "type": "Criatura legendaria — Hechicero humano"}, {"language": "French", "multiverseId": 510487, "name": "Ith, grand arcaniste", "text": "Vigilance\n{T} : Dégagez une créature attaquante ciblée. Prévenez, ce tour-ci, toutes les blessures de combat qui devraient être infligées à et par cette créature.\nSuspension 4 — {W}{U}", "type": "Créature légendaire : humain et sorcier"}, {"language": "Italian", "multiverseId": 510776, "name": "Ith, Sommo Arcanista", "text": "Cautela\n{T}: STAPpa una creatura attaccante bersaglio. Previeni tutto il danno da combattimento che verrebbe inflitto a e da quella creatura in questo turno.\nSospendere 4—{W}{U}", "type": "Creatura Leggendaria — Mago Umano"}, {"language": "Japanese", "multiverseId": 511065, "name": "高位の秘儀術師、イス", "text": "警戒\n{T}：攻撃クリーチャー１体を対象とする。それをアンタップする。このターン、それが受ける戦闘ダメージとそれが与えるすべての戦闘ダメージを軽減する。\n待機４―{W}{U}", "type": "伝説のクリーチャー — 人間・ウィザード"}, {"language": "Portuguese (Brazil)", "multiverseId": 511354, "name": "Ith, Alto Arcanista", "text": "Vigilância\n{T}: Desvire a criatura alvo atacante. Previna todo o dano de combate que seria causado e sofrido por aquela criatura neste turno.\nSuspender 4 — {W}{U}", "type": "Criatura Lendária — Humano Mago"}, {"language": "Russian", "multiverseId": 511643, "name": "Ис, Верховный Арканист", "text": "Бдительность\n{T}: разверните целевое атакующее существо. Предотвратите все боевые повреждения, которые должны быть нанесены в этом ходу тем существом и тому существу.\nОтсрочка 4 — {W}{U}", "type": "Легендарное Существо — Человек Чародей"}, {"language": "Chinese Simplified", "multiverseId": 511932, "name": "奥术大师伊斯", "text": "警戒\n{T}：重置目标进行攻击的生物。于本回合中，防止该生物将受到与造成的所有战斗伤害。\n延缓4～{W}{U}", "type": "传奇生物 ～人类／法术师"}, {"language": "Chinese Traditional", "multiverseId": 512221, "name": "奧術大師伊斯", "text": "警戒\n{T}：重置目標進行攻擊的生物。於本回合中，防止該生物將受到與造成的所有戰鬥傷害。\n延緩4～{W}{U}", "type": "傳奇生物 ～人類／魔法師"}], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "243251", "cardKingdomId": "242822", "cardsphereId": "75068", "mcmId": "548206", "mcmMetaId": "8419", "mtgjsonV4Id": "95c9da02-9714-5650-af1c-71ca9c3a634a", "mtgoId": "86885", "multiverseId": "509620", "scryfallId": "54c32735-e8e7-46a1-84ea-92806f459e84", "scryfallIllustrationId": "3b3356ee-a0d1-4b6c-a530-74a695ab1f06", "scryfallOracleId": "eb933723-b879-44c8-bbc8-d8c84ce5ab12", "tcgplayerProductId": "234273"}, "isReprint": true, "keywords": ["Suspend", "Vigilance"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{5}{W}{U}", "manaValue": 7.0, "name": "Ith, High Arcanist", "number": "255", "originalText": "Vigilance\n{T}: Untap target attacking creature. Prevent all combat damage that would be dealt to and dealt by that creature this turn.\nSuspend 4—{W}{U}", "originalType": "Legendary Creature — Human Wizard", "power": "3", "printings": ["PLIST", "TSP", "TSR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/9efab8d45087c6e0", "cardKingdomFoil": "https://mtgjson.com/links/37d091d01472e2aa", "cardmarket": "https://mtgjson.com/links/1456405e9ed3bec9", "tcgplayer": "https://mtgjson.com/links/62652026b2ee81a8"}, "rarity": "rare", "rulings": [{"date": "2013-07-01", "text": "In a Commander game where this card is your commander, you cannot suspend it from the Command zone."}, {"date": "2021-03-19", "text": "Ith’s ability can target an untapped attacking creature. It will still prevent any combat damage dealt to and dealt by that creature this turn."}, {"date": "2021-03-19", "text": "The creature isn’t removed from combat; it just has its damage prevented. It’s still an attacking creature until the combat phase is complete."}, {"date": "2021-03-19", "text": "You can activate Ith’s ability targeting an attacking creature you control during the combat damage step or the end of combat step. It’ll untap and the damage it had already dealt won’t be undone."}, {"date": "2021-06-18", "text": "A creature cast using suspend will enter the battlefield with haste. It will have haste until another player gains control of it. (In some rare cases, another player may gain control of the creature spell itself. If this happens, the creature won’t enter the battlefield with haste.)"}, {"date": "2021-06-18", "text": "If you cast a card “without paying its mana cost,” such as with suspend, you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those if you want to cast the card."}, {"date": "2021-06-18", "text": "You are never forced to activate mana abilities to pay costs, so if there is a mandatory additional mana cost (such as from Thalia, Guardian of Thraben), you can decline to activate mana abilities to pay for it and hence fail to cast the suspended card, leaving it in exile."}, {"date": "2021-06-18", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2021-06-18", "text": "The mana value of a spell cast without paying its mana cost is determined by its mana cost, even though that cost wasn’t paid."}, {"date": "2021-06-18", "text": "Suspend is a keyword that represents three abilities. The first is a static ability that allows you to exile the card from your hand with the specified number of time counters (the number before the dash) on it by paying its suspend cost (listed after the dash). The second is a triggered ability that removes a time counter from the suspended card at the beginning of each of your upkeeps. The third is a triggered ability that causes you to cast the card when the last time counter is removed. If you cast a creature spell this way, it gains haste until you lose control of that creature (or, in rare cases, you lose control of the creature spell while it’s on the stack)."}, {"date": "2021-06-18", "text": "You can exile a card in your hand using suspend any time you could cast that card. Consider its card type, any effects that modify when you could cast it (such as flash) and any other effects that stop you from casting it (such as from Meddling Mage’s ability) to determine if and when you can do this. Whether you could actually complete all steps in casting the card is irrelevant. For example, you can exile a card with suspend that has no mana cost or that requires a target even if no legal targets are available at that time."}, {"date": "2021-06-18", "text": "Cards exiled with suspend are exiled face up."}, {"date": "2021-06-18", "text": "Exiling a card with suspend isn’t casting that card. This action doesn’t use the stack and can’t be responded to."}, {"date": "2021-06-18", "text": "If the spell requires any targets, those targets are chosen when the spell is finally cast, not when it’s exiled."}, {"date": "2021-06-18", "text": "If an effect refers to a “suspended card,” that means a card that (1) has suspend, (2) is in exile, and (3) has one or more time counters on it."}, {"date": "2021-06-18", "text": "If the first triggered ability of suspend (the one that removes time counters) is countered, no time counter is removed. The ability will trigger again at the beginning of the card’s owner’s next upkeep."}, {"date": "2021-06-18", "text": "When the last time counter is removed, the second triggered ability of suspend (the one that lets you cast the card) triggers. It doesn’t matter why the last time counter was removed or what effect removed it."}, {"date": "2021-06-18", "text": "If the second triggered ability is countered, the card can’t be cast. It remains exiled with no time counters on it, and it’s no longer suspended."}, {"date": "2021-06-18", "text": "As the second triggered ability resolves, you must cast the card if able. You must do so even if it requires targets and the only legal targets are ones that you really don’t want to target. Timing permissions based on the card’s type are ignored."}, {"date": "2021-06-18", "text": "If you can’t cast the card, perhaps because there are no legal targets available, it remains exiled with no time counters on it, and it’s no longer suspended."}], "securityStamp": "oval", "setCode": "TSR", "subtypes": ["Human", "Wizard"], "supertypes": ["Legendary"], "text": "Vigilance\n{T}: Untap target attacking creature. Prevent all combat damage that would be dealt to and dealt by that creature this turn.\nSuspend 4—{W}{U}", "toughness": "5", "type": "Legendary Creature — Human Wizard", "types": ["Creature"], "uuid": "c9401d33-abb7-5f3b-825e-f6a796c3f283"}