{"artist": "Chase Stone", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 14365, "finishes": ["nonfoil", "foil"], "flavorText": "Jace awoke to the certainty that he was lost.", "foreignData": [{"flavorText": "Als Jace erwachte, wusste er, dass er nichts mehr wusste.", "language": "German", "multiverseId": 435467, "name": "Ixalans Bann", "text": "Wenn Ixalans Bann ins Spiel kommt, schicke eine bleibende Karte deiner Wahl, die kein Land ist und die ein Gegner kontrolliert, ins Exil, bis Ixalans Bann das Spiel verlässt.\nDeine Gegner können keine Zaubersprüche wirken, die denselben Namen wie die ins Exil geschickte Karte haben.", "type": "Verzauberung"}, {"flavorText": "Cuando Jace se despertó, tuvo la certeza de que estaba perdido.", "language": "Spanish", "multiverseId": 437560, "name": "Reclusión de Ixalan", "text": "Cuando la Reclusión de Ixalan entre al campo de batalla, exilia el permanente objetivo que no sea tierra que controla un oponente hasta que la Reclusión de Ixalan deje el campo de batalla.\nTus oponentes no pueden lanzar hechizos con el mismo nombre que la carta exiliada.", "type": "Encantamiento"}, {"flavorText": "Jace se réveilla, certain d'être perdu.", "language": "French", "multiverseId": 435766, "name": "Entrave d'Ixalan", "text": "Quand l'Entrave d'Ixalan arrive sur le champ de bataille, exilez un permanent non-terrain ciblé qu'un adversaire contrôle jusqu'à ce que l'Entrave d'Ixalan quitte le champ de bataille.\nVos adversaires ne peuvent pas lancer de sorts ayant le même nom que la carte exilée.", "type": "Enchantement"}, {"flavorText": "Jace si risvegliò con la certezza di essersi perso.", "language": "Italian", "multiverseId": 436065, "name": "Vincolo di Ixalan", "text": "Quando il Vincolo di Ixalan entra nel campo di battaglia, esilia un permanente non terra bersaglio controllato da un avversario finché il Vincolo di Ixalan non lascia il campo di battaglia.\nI tuoi avversari non possono lanciare magie con lo stesso nome della carta esiliata.", "type": "Incantesimo"}, {"flavorText": "意識を取り戻したとき、ジェイスはただ途方に暮れるだけだった。", "language": "Japanese", "multiverseId": 436364, "name": "イクサランの束縛", "text": "イクサランの束縛が戦場に出たとき、対戦相手がコントロールしていて土地でないパーマネント１つを対象とする。イクサランの束縛が戦場を離れるまでそれを追放する。\n対戦相手は、その追放されたカードと同じ名前を持つ呪文を唱えられない。", "type": "エンチャント"}, {"flavorText": "제이스는 자신이 길을 잃었음을 확실히 깨달았다.", "language": "Korean", "multiverseId": 436663, "name": "익살란의 구속", "text": "익살란의 구속이 전장에 들어올 때, 상대가 조종하는 대지가 아닌 지속물을 목표로 정한다. 그 지속물을 익살란의 구속이 전장을 떠날 때까지 추방한다.\n당신의 상대들은 이렇게 추방한 카드와 같은 이름을 가진 주문들을 발동할 수 없다.", "type": "부여마법"}, {"flavorText": "Jace acordou com a certeza de que estava perdido.", "language": "Portuguese (Brazil)", "multiverseId": 436962, "name": "Aprisionamento de Ixalan", "text": "Quando Aprisionamento de Ixalan entrar no campo de batalha, exile a permanente alvo que um oponente controla que não seja um terreno até Aprisionamento de Ixalan deixar o campo de batalha.\nSeus oponentes não podem conjurar mágicas com o mesmo nome que o card exilado.", "type": "Encantamento"}, {"flavorText": "Джейс очнулся с ясным пониманием того, что потерялся.", "language": "Russian", "multiverseId": 437261, "name": "Узы Иксалана", "text": "Когда Узы Иксалана выходят на поле битвы, изгоните целевой не являющийся землей перманент под контролем оппонента до тех пор, пока Узы Иксалана не покинут поле битвы.\nВаши оппоненты не могут разыгрывать заклинания с таким же именем, как у изгнанной карты.", "type": "Чары"}, {"flavorText": "杰斯醒转过来后，发现自己脑中一片空白。", "language": "Chinese Simplified", "multiverseId": 437859, "name": "依夏兰的束缚", "text": "当依夏兰的束缚进战场时，放逐目标由对手操控的非地永久物，直到依夏兰的束缚离开战场为止。\n所有对手都不能施放与所放逐的牌同名之咒语。", "type": "结界"}, {"flavorText": "傑斯醒轉過來後，發現自己腦中一片空白。", "language": "Chinese Traditional", "multiverseId": 438158, "name": "依夏蘭的束縛", "text": "當依夏蘭的束縛進戰場時，放逐目標由對手操控的非地永久物，直到依夏蘭的束縛離開戰場為止。\n所有對手都不能施放與所放逐的牌同名之咒語。", "type": "結界"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "214290", "cardKingdomId": "213987", "cardsphereId": "51029", "mcmId": "301285", "mcmMetaId": "226815", "mtgArenaId": "65993", "mtgjsonV4Id": "9fcf8b91-9616-511c-8d59-6c486ba44a82", "mtgoFoilId": "65045", "mtgoId": "65044", "multiverseId": "435168", "scryfallId": "5f3c8c31-ceb8-4a2c-beb6-0ff5f7b6ae07", "scryfallIllustrationId": "43f272f2-47f2-4e2b-97a8-7712a28f7e46", "scryfallOracleId": "5a2d0df9-950e-4c3d-8a08-275f179e33c7", "tcgplayerProductId": "144817"}, "isStorySpotlight": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}", "manaValue": 4.0, "name": "Ixalan's Binding", "number": "17", "originalText": "When Ixalan's Binding enters the battlefield, exile target nonland permanent an opponent controls until Ixalan's Binding leaves the battlefield.\nYour opponents can't cast spells with the same name as the exiled card.", "originalType": "Enchantment", "printings": ["XLN"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/05c428f9e404b962", "cardKingdomFoil": "https://mtgjson.com/links/1006091f390af03e", "cardmarket": "https://mtgjson.com/links/ffce6edf76e510e1", "tcgplayer": "https://mtgjson.com/links/7eeb3bfd4b0f01a3"}, "rarity": "uncommon", "rulings": [{"date": "2017-09-29", "text": "Auras attached to the exiled permanent will be put into their owners’ graveyards. Any Equipment will become unattached and remain on the battlefield. Any counters on the exiled permanent will cease to exist."}, {"date": "2017-09-29", "text": "If a token is exiled this way, it will cease to exist and won’t return to the battlefield."}, {"date": "2017-09-29", "text": "The exiled card returns to the battlefield immediately after Ixalan’s Binding leaves the battlefield. Nothing happens between the two events, including state-based actions."}, {"date": "2017-09-29", "text": "If Ixalan’s Binding leaves the battlefield before its triggered ability resolves, the target permanent won’t be exiled."}, {"date": "2017-09-29", "text": "If the exiled card is a land card that’s become a nonland permanent, Ixalan’s Binding won’t stop players from playing lands with that name."}, {"date": "2017-09-29", "text": "If there is no exiled card (perhaps because the exiled permanent was a token or was a commander that moved to the command zone in the Commander variant), Ixalan’s Binding won’t stop players from casting spells."}, {"date": "2017-09-29", "text": "In a multiplayer game, if Ixalan’s Binding’s owner leaves the game and another player owns the exiled card, the exiled card will return to the battlefield under its owner’s control. Because the one-shot effect that returns the card isn’t an ability that goes on the stack, it won’t cease to exist along with the leaving player’s spells and abilities on the stack."}, {"date": "2017-09-29", "text": "If the exiled card has a different name in exile than it did on the battlefield, Ixalan’s Binding stops players from casting spells with the name of that card as it exists in exile."}, {"date": "2018-01-19", "text": "There are many important moments in the story, but the most crucial—called “story spotlights”—are shown on cards. These cards have the Planeswalker symbol in their text box; this symbol has no effect on gameplay. You can read more about these events in the official Magic fiction at http://www.mtgstory.com."}], "setCode": "XLN", "subtypes": [], "supertypes": [], "text": "When Ixalan's Binding enters the battlefield, exile target nonland permanent an opponent controls until Ixalan's Binding leaves the battlefield.\nYour opponents can't cast spells with the same name as the exiled card.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "7b3bae10-6ecf-5c23-8685-7cc9e966c68c", "watermark": "planeswalker"}