{"artist": "Terese Nielsen", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 4009, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 132979, "name": "Ixidron", "text": "Sowie das Ixidron ins Spiel kommt, verdecke alle anderen Kreaturen außer Spielsteinen. Sie sind 2/2 Kreaturen.\nStärke und Widerstandskraft des Ixidrons sind gleich der Anzahl an verdeckten Kreaturen im Spiel.", "type": "Kreatur — Illusion"}, {"language": "Spanish", "multiverseId": 134484, "name": "Íxidron", "text": "En cuanto Íxidron entre en juego, pon boca abajo todas las otras criaturas en juego que no sean fichas. Son criaturas 2/2.\nTanto la fuerza como la resistencia de Íxidron son iguales al número de criaturas boca abajo que haya en juego.", "type": "Criatura — Ilusión"}, {"language": "French", "multiverseId": 132678, "name": "Ixidron", "text": "Au moment où Ixidron arrive en jeu, retournez toutes les autres créatures non-jeton en jeu face cachée. Ce sont des créatures 2/2.\nLa force et l'endurance d'Ixidron sont chacune égale au nombre de créatures face cachée en jeu.", "type": "Créature : illusion"}, {"language": "Italian", "multiverseId": 133280, "name": "Ixidron", "text": "Mentre Ixidron entra in gioco, gira a faccia in giù tutte le altre creature non pedina in gioco. Sono creature 2/2.\nLa forza e la costituzione di Ixidron sono pari al numero di creature a faccia in giù in gioco.", "type": "Creatura — Illusione"}, {"language": "Japanese", "multiverseId": 133581, "name": "イクシドロン", "text": "イクシドロンが場に出るに際し、場に出ている他のトークンでないクリーチャーをすべて裏向きにする。 それらは２/２のクリーチャーである。\nイクシドロンのパワーとタフネスは、それぞれ場に出ている裏向きのクリーチャーの総数に等しい。", "type": "クリーチャー — イリュージョン"}, {"language": "Portuguese (Brazil)", "multiverseId": 133882, "name": "Ixidron", "text": "Conforme Ixidron entrar em jogo, vire para baixo a face de todas as outras criaturas que não sejam fichas em jogo. Elas serão criaturas 2/2.\nO poder e a resistência de Ixidron são ambos iguais ao número de criaturas com a face voltada para baixo em jogo.", "type": "Criatura — Ilusão"}, {"language": "Russian", "multiverseId": 134183, "name": "Иксидрон", "text": "При входе Иксидрона в игру, переверните все остальные существа (не фишки) лицом вниз. Все они являются существами 2/2.\nСила и защита Иксидрона равны количеству существ в игре, лежащих лицом вниз.", "type": "Существо — Иллюзия"}, {"language": "Chinese Simplified", "multiverseId": 132377, "name": "意塑影", "text": "于意塑影进场时，将场上所有非衍生物的其它生物翻为牌面朝下。 它们是2/2生物。\n意塑影的力量与防御力各等同于场上牌面朝下生物的数量。", "type": "生物～虚影"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "121576", "cardKingdomId": "121286", "cardsphereId": "44420", "mcmId": "13882", "mcmMetaId": "8421", "mtgjsonV4Id": "6161f2d0-60ec-5ab2-b0d0-d6abdced1360", "mtgoFoilId": "25938", "mtgoId": "25937", "multiverseId": "124313", "scryfallId": "a2f5c613-80ad-487f-995a-6a869c137798", "scryfallIllustrationId": "7acc7f97-5c1d-4ba1-98f5-62e7f7ad6904", "scryfallOracleId": "a86587ea-14ec-45db-8bac-10b6b9eaeb25", "tcgplayerProductId": "14269"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}{U}", "manaValue": 5.0, "name": "Ixidron", "number": "65", "originalText": "As Ixidron comes into play, turn all other nontoken creatures in play face down. They're 2/2 creatures.\nIxidron's power and toughness are each equal to the number of face-down creatures in play.", "originalType": "Creature - Illusion", "power": "*", "printings": ["C14", "C19", "TSP"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/5785e5bf6f8d2640", "cardKingdomFoil": "https://mtgjson.com/links/fe7372e3b75c87de", "cardmarket": "https://mtgjson.com/links/0f053853d7eb6ed0", "tcgplayer": "https://mtgjson.com/links/bcbf6d422e092b31"}, "rarity": "rare", "rulings": [{"date": "2006-09-25", "text": "If Ixidron and another creature are entering the battlefield at the same time, the other creature enters the battlefield face up."}, {"date": "2006-09-25", "text": "The controller of a face-down creature can look at it at any time, even if it doesn’t have morph. Other players can’t, but the rules for face-down permanents state that “you must ensure at all times that your face-down spells and permanents can be easily differentiated from each other.” As a result, all players must be able to figure out what each of the creatures Ixidron turned face down is."}, {"date": "2006-09-25", "text": "You turn the creatures face-down *as* Ixidron enters the battlefield. There is never a moment when Ixidron is on the battlefield and the creatures are face-up. If a creature on the battlefield has a “whenever another creature enters the battlefield” ability, it won’t trigger because that creature will be face down before Ixidron enters the battlefield."}, {"date": "2006-09-25", "text": "Turning a face-down creature face-down typically has no effect; the creature’s status is unchanged."}, {"date": "2018-04-27", "text": "Creatures turned face down by Ixidron are 2/2 creatures with no text, no name, no subtypes, no expansion symbol, and no mana cost. These values are copiable if an object becomes a copy of one of those creatures, and their normal values are not copiable."}], "setCode": "TSP", "subtypes": ["Illusion"], "supertypes": [], "text": "As Ixidron enters the battlefield, turn all other nontoken creatures face down. (They're 2/2 creatures.)\nIxidron's power and toughness are each equal to the number of face-down creatures on the battlefield.", "toughness": "*", "type": "Creature — Illusion", "types": ["Creature"], "uuid": "3e3ca885-e392-57d4-878a-bd388582c7ea"}