{"artist": "Franz Vohwinkel", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210262", "mcmId": "294435", "mtgjsonV4Id": "8160ac01-14c6-5ab3-becf-a07fc27c9690", "multiverseId": "423621", "scryfallId": "d01d1b4f-5ac5-40b0-b4ad-34ac70aeb488", "scryfallIllustrationId": "e5169463-65cc-4aa0-8f7e-f0c2e3af32b5", "scryfallOracleId": "e5f8b2bb-e9bb-4a0a-aa88-7fa0299f52a9", "tcgplayerProductId": "125596"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Izzet Steam Maze", "number": "40", "originalText": "Whenever a player casts an instant or sorcery spell, that player copies it. The player may choose new targets for the copy.\nWhenever you roll {Chaos}, instant and sorcery spells you cast this turn cost {3} less to cast.", "originalType": "Plane — Ravnica", "printings": ["OHOP", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/da5319aa1081565c", "tcgplayer": "https://mtgjson.com/links/f2500467ae2c4bb5"}, "rarity": "common", "rulings": [{"date": "2009-10-01", "text": "A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"}, {"date": "2009-10-01", "text": "A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."}, {"date": "2009-10-01", "text": "The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."}, {"date": "2009-10-01", "text": "If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}, {"date": "2009-10-01", "text": "The effect of Izzet Steam Maze’s first ability is mandatory. You must copy the spell whether you want to or not."}, {"date": "2009-10-01", "text": "Izzet Steam Maze’s first ability will copy any instant or sorcery spell, not just one with targets."}, {"date": "2009-10-01", "text": "The controller of the spell that caused Izzet Steam Maze’s first ability to trigger also controls the copy. The copy resolves before the original spell."}, {"date": "2009-10-01", "text": "A copy is created even if the spell that caused Izzet Steam Maze’s first ability to trigger has been countered by the time that ability resolves."}, {"date": "2009-10-01", "text": "The copy will have the same targets as the spell it’s copying unless its controller chooses new ones. That player may change any number of the targets, including all of them or none of them. The new targets must be legal."}, {"date": "2009-10-01", "text": "If the spell that’s copied is modal (that is, it says “Choose one —” or the like), the copy will have the same mode. Its controller can’t choose a different one."}, {"date": "2009-10-01", "text": "If the spell that’s copied has an X whose value was determined as it was cast (like Earthquake does), the copy has the same value of X."}, {"date": "2009-10-01", "text": "The controller of the copy can’t choose to pay any additional costs for the copy. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too."}, {"date": "2009-10-01", "text": "The copy that Izzet Steam Maze’s first ability creates is created on the stack, so it’s not “cast.” Abilities that trigger when a player casts a spell (like Izzet Steam Maze’s first ability itself) won’t trigger."}], "setCode": "OPCA", "subtypes": ["Ravnica"], "supertypes": [], "text": "Whenever a player casts an instant or sorcery spell, that player copies it. The player may choose new targets for the copy.\nWhenever you roll {CHAOS}, instant and sorcery spells you cast this turn cost {3} less to cast.", "type": "Plane — Ravnica", "types": ["Plane"], "uuid": "2b91bc68-b964-5f2c-9552-80c83744d1a8"}