{"artist": "David Rapoza", "availability": ["arena", "mtgo", "paper"], "borderColor": "borderless", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 4151, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 495156, "name": "Jace der Spiegelmagier", "text": "Bonus {2}\nWenn Jace der Spiegelmagier ins Spiel kommt und falls seine Bonuskosten bezahlt wurden, erzeuge einen Spielstein, der eine Kopie von Jace der Spiegelmagier ist, außer dass er nicht Legendär ist und Startloyalität 1 hat.\n+1: Hellsicht 2.\n0: Ziehe eine Karte und zeige sie offen vor. Entferne so viele Loyalitätsmarken von Jace dem Spiegelmagier, wie die umgewandelten Manakosten der Karte betragen.", "type": "Legendärer Planeswalker — Jace"}, {"language": "Spanish", "multiverseId": 495159, "name": "Jace, mago reflejado", "text": "Estímulo {2}.\nCuando Jace, mago reflejado entre al campo de batalla, si Jace fue estimulado, crea una ficha que es una copia de Jace, mago reflejado, excepto que no es legendaria y su lealtad inicial es 1.\n+1: Adivina 2.\n0: Roba una carta y muéstrala. Remueve una cantidad de contadores de lealtad de Jace, mago reflejado igual al coste de maná convertido de esa carta.", "type": "Planeswalker legendario — Jace"}, {"language": "French", "multiverseId": 495162, "name": "Jace, mage du miroir", "text": "Kick {2}\nQuand Jace, mage du miroir arrive sur le champ de bataille, si Jace a été kické, créez un jeton qui est une copie de Jace, mage du miroir, excepté qu'il n'est pas légendaire et que sa loyauté de départ est 1.\n+1: Regard 2.\n0: Piochez une carte et révélez-la. Retirez un nombre de marqueurs « loyauté » égal au coût converti de mana de cette carte à Jace, mage du miroir.", "type": "Planeswalker légendaire : Jace"}, {"language": "Italian", "multiverseId": 495165, "name": "Jace, Mago Speculare", "text": "Potenziamento {2}\nQuando Jace, Mago Speculare entra nel campo di battaglia, se Jace è stato potenziato, crea una pedina che è una copia di Jace, Mago Speculare, tranne che non è leggendaria e la sua fedeltà iniziale è 1.\n+1: Profetizza 2.\n0: Pesca una carta e rivelala. Rimuovi da Jace, Mago Speculare un numero di segnalini fedeltà pari al costo di mana convertito di quella carta.", "type": "Planeswalker Leggendario — Jace"}, {"language": "Japanese", "multiverseId": 495168, "name": "鏡映魔道士、ジェイス", "text": "キッカー{2}\n鏡映魔道士、ジェイスが戦場に出たとき、鏡映魔道士、ジェイスがキッカーされていた場合、伝説でなく初期忠誠度が１であることを除いて鏡映魔道士、ジェイスのコピーであるトークンを１体生成する。\n+1：占術２を行う。\n0：カードを１枚引き、公開する。鏡映魔道士、ジェイスの上からそのカードの点数で見たマナ・コストに等しい数の忠誠カウンターを取り除く。", "type": "伝説のプレインズウォーカー — ジェイス"}, {"language": "Korean", "multiverseId": 495171, "name": "거울 마도사, 제이스", "text": "키커 {2}\n거울 마도사, 제이스가 전장에 들어올 때, 제이스의 키커 비용이 지불되었다면, 거울 마도사, 제이스의 복사본이지만 전설적이 아니며 시작 충성도가 1인 토큰 한 개를 만든다.\n+1: 점술 2를 한다.\n0: 카드 한 장을 뽑고 그 카드를 공개한다. 거울 마도사, 제이스에서 그 카드의 전환마나비용만큼 충성 카운터를 제거한다.", "type": "전설적 플레인즈워커 — 제이스"}, {"language": "Portuguese (Brazil)", "multiverseId": 495174, "name": "Jace, Mago dos Espelhos", "text": "Reforçar {2}\nQuando Jace, Mago dos Espelhos, entrar no campo de batalha, se Jace tiver sido reforçado, crie uma ficha que seja uma cópia de Jace, Mago dos Espelhos, com a exceção de não ser lendária e sua lealdade inicial ser 1.\n+1: Use vidência 2.\n0: Compre um card e revele-o. Remova de Jace, Mago dos Espelhos, um número de marcadores de lealdade igual ao custo de mana convertido daquele card.", "type": "Planeswalker Lendário — Jace"}, {"language": "Russian", "multiverseId": 495177, "name": "Джейс, Маг Зеркал", "text": "Усилитель {2}\nКогда Джейс, Маг Зеркал выходит на поле битвы, если он получил Усилитель, создайте одну фишку, являющуюся копией Джейса, Мага Зеркал, но при этом она не является легендарной и ее начальная верность равна 1.\n+1: предскажите 2.\n0: возьмите карту и покажите ее. Удалите с Джейса, Мага Зеркал количество жетонов верности, равное конвертированной мана-стоимости той карты.", "type": "Легендарный Planeswalker — Джейс"}, {"language": "Chinese Simplified", "multiverseId": 495180, "name": "镜像法师杰斯", "text": "增幅{2}\n当镜像法师杰斯进战场时，若杰斯已增幅，则派出一个为镜像法师杰斯之复制品的衍生物，但它不是传奇，且起始忠诚为1。\n+1：占卜2。\n0：抓一张牌并展示之。从镜像法师杰斯上移去若干忠诚指示物，其数量等同于该牌的总法术力费用。", "type": "传奇鹏洛客 ～杰斯"}, {"language": "Chinese Traditional", "multiverseId": 495183, "name": "鏡像法師傑斯", "text": "增幅{2}\n當鏡像法師傑斯進戰場時，若傑斯已增幅，則派出一個為鏡像法師傑斯之複製品的衍生物，但它不是傳奇，且起始忠誠為1。\n+1：占卜2。\n0：抽一張牌並展示之。從鏡像法師傑斯上移去若干忠誠指示物，其數量等同於該牌的總魔法力費用。", "type": "傳奇鵬洛客 ～傑斯"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "237479", "cardKingdomId": "236869", "cardsphereId": "70118", "mcmId": "492944", "mcmMetaId": "315274", "mtgArenaId": "74695", "mtgjsonV4Id": "bb957fcd-3eba-5cbc-b10a-9d3cf33d6139", "multiverseId": "495153", "scryfallId": "961bb827-f13a-417d-8284-5cd2aac3d034", "scryfallIllustrationId": "11ff29e4-7e73-4540-b361-a25d4663e6bc", "scryfallOracleId": "7ca99e2f-faf2-4301-a0ae-7cb880ba965b", "tcgplayerProductId": "221450"}, "isStarter": true, "keywords": ["Kicker", "Scry"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "loyalty": "4", "manaCost": "{1}{U}{U}", "manaValue": 3.0, "name": "Jace, Mirror Mage", "number": "281", "originalText": "Kicker {2}\nWhen Jace, Mirror Mage enters the battlefield, if Jace was kicked, create a token that's a copy of Jace, Mirror Mage, except it's not legendary and its starting loyalty is 1.\n+1: Scry 2.\n0: Draw a card and reveal it. Remove a number of loyalty counters equal to that card's converted mana cost from Jace, Mirror Mage.", "originalType": "Legendary Planeswalker — Jace", "printings": ["PRM", "PZNR", "ZNR"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/a2a63f6c5dbc2b4e", "cardKingdomFoil": "https://mtgjson.com/links/9779e09a603d4a74", "cardmarket": "https://mtgjson.com/links/0df7be35ef775b15", "tcgplayer": "https://mtgjson.com/links/c0c05d4c81f43c87"}, "rarity": "mythic", "rulings": [{"date": "2020-09-25", "text": "If you copy a kicked spell, the copy is also kicked. If a card or token enters the battlefield as a copy of a permanent that’s already on the battlefield, the new permanent isn’t kicked, even if the original was."}, {"date": "2020-09-25", "text": "The token from Jace’s triggered ability copies exactly what is printed on Jace and nothing else. It doesn’t copy how many counters are on him, or any non-copy effects that have changed his color or types, and so on. It enters the battlefield with one loyalty counter. You can activate one loyalty ability of each of the Jaces this turn."}, {"date": "2020-09-25", "text": "The token created by Jace’s triggered ability doesn’t have the legendary supertype and has a starting loyalty of 1 rather than 4. If another object becomes a copy of the token, that copy also won’t be legendary and will have a starting loyalty of 1."}, {"date": "2020-09-25", "text": "You can control one legendary Jace, Mirror Mage in addition to any number of nonlegendary copies of Jace, Mirror Mage."}, {"date": "2020-09-25", "text": "While resolving Jace’s last ability, you must reveal the card before it’s mixed with the other cards in your hand."}, {"date": "2020-09-25", "text": "If a card in a player’s hand has {X} in its mana cost, X is considered to be 0."}, {"date": "2020-09-25", "text": "If the card draw from Jace’s last ability is modified by a replacement effect, you don’t reveal any card, even if the draw was replaced by one or more card draws. No loyalty counters will be removed from Jace in that case."}, {"date": "2020-09-25", "text": "If the converted mana cost of the drawn card is greater than Jace’s loyalty, you remove all loyalty counters from him. He’ll be put into your graveyard as a state-based action before you can take any actions."}, {"date": "2020-09-25", "text": "Kicker represents an optional additional cost that you may choose to pay as you cast the spell. A spell cast with that additional cost paid is “kicked.”"}, {"date": "2020-09-25", "text": "You can’t pay a kicker cost more than once."}, {"date": "2020-09-25", "text": "If you put a permanent with a kicker ability onto the battlefield without casting it, you can’t kick it."}, {"date": "2020-09-25", "text": "To determine a spell’s total cost, start with the mana cost (or an alternative cost if another card’s effect allows you to pay one instead), add any cost increases (such as kicker), then apply any cost reductions. The converted mana cost of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2020-09-25", "text": "Some instant or sorcery spells require alternative or additional targets if they’re kicked. You ignore these targeting requirements if those spells aren’t kicked, and you can’t kick those spells unless you can choose the appropriate targets. On the other hand, you can kick a permanent spell even if you won’t be able to choose targets for an enters-the-battlefield ability of that permanent once the spell resolves."}, {"date": "2020-09-25", "text": "An ability that triggers when a player casts a kicked spell resolves before the spell that caused it to trigger, but after targets have been chosen for that spell. It resolves even if that spell is countered."}], "securityStamp": "oval", "setCode": "ZNR", "subtypes": ["Jace"], "supertypes": ["Legendary"], "text": "Kicker {2}\nWhen Jace, Mirror Mage enters the battlefield, if Jace was kicked, create a token that's a copy of Jace, Mirror Mage, except it's not legendary and its starting loyalty is 1.\n[+1]: Scry 2.\n[0]: Draw a card and reveal it. Remove a number of loyalty counters equal to that card's mana value from Jace, Mirror Mage.", "type": "Legendary Planeswalker — Jace", "types": ["Planeswalker"], "uuid": "1e6cfbf9-83b7-5999-a544-d2b78b9f1a30", "variations": ["19914d4f-3f02-5050-a11e-c1c72acda20d"]}