{"artist": "Jaime Jones", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 5110, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 355780, "name": "Jace der Gedankenarchitekt", "text": "+1: Immer wenn bis zu deinem nächsten Zug eine Kreatur angreift, die ein Gegner kontrolliert, erhält sie -1/-0 bis zum Ende des Zuges.\n-2: Decke die obersten drei Karten deiner Bibliothek auf. Ein Gegner teilt diese Karten auf zwei Haufen auf. Nimm die Karten des einen Haufens auf deine Hand und lege die anderen in beliebiger Reihenfolge unter deine Bibliothek.\n-8: Durchsuche für jeden Spieler dessen Bibliothek nach einer Karte, die kein Land ist, und schicke sie ins Exil; dieser Spieler mischt dann seine Bibliothek. Du kannst diese Karten wirken, ohne ihre Manakosten zu bezahlen.", "type": "Planeswalker — Jace"}, {"language": "Spanish", "multiverseId": 365502, "name": "Jace, arquitecto del pensamiento", "text": "+1: Hasta tu próximo turno, siempre que una criatura que controle un oponente ataque, obtiene -1/-0 hasta el final del turno.\n-2: Muestra las primeras tres cartas de tu biblioteca. Un oponente separa esas cartas en dos montones. Pon uno de los montones en tu mano y el otro en el fondo de tu biblioteca en cualquier orden.\n-8: Por cada jugador, busca en la biblioteca de ese jugador una carta que no sea tierra y exíliala, luego ese jugador baraja su biblioteca. Puedes lanzar esas cartas sin pagar sus costes de maná.", "type": "Planeswalker — Jace"}, {"language": "French", "multiverseId": 356054, "name": "Jace, architecte des pensées", "text": "+1 : Jusqu'à votre prochain tour, à chaque fois qu'une créature qu'un adversaire contrôle attaque, elle gagne -1/-0 jusqu'à la fin du tour.\n-2 : Révélez les trois cartes du dessus de votre bibliothèque. Un adversaire sépare ces cartes en deux tas. Mettez l'un d'eux dans votre main et l'autre au-dessous de votre bibliothèque, dans l'ordre de votre choix.\n-8 : Pour chaque joueur, cherchez dans la bibliothèque de ce joueur une carte non-terrain et exilez-la, puis ce joueur mélange sa bibliothèque. Vous pouvez lancer ces cartes sans payer leur coût de mana.", "type": "Planeswalker : Jace"}, {"language": "Italian", "multiverseId": 356328, "name": "Jace, Architetto del Pensiero", "text": "+1: Fino al tuo prossimo turno, ogniqualvolta una creatura controllata da un avversario attacca, prende -1/-0 fino alla fine del turno.\n-2: Rivela le prime tre carte del tuo grimorio. Un avversario separa quelle carte in due pile. Aggiungi una pila alla tua mano e metti l'altra in fondo al tuo grimorio in qualsiasi ordine.\n-8: Per ogni giocatore, passa in rassegna il suo grimorio per una carta non terra ed esiliala, poi quel giocatore rimescola il suo grimorio. Puoi lanciare le carte esiliate in questo modo senza pagare il loro costo di mana.", "type": "Planeswalker — Jace"}, {"language": "Japanese", "multiverseId": 356602, "name": "思考を築く者、ジェイス", "text": "＋１：あなたの次のターンまで、対戦相手１人がコントロールするクリーチャー１体が攻撃するたび、それはターン終了時まで－１/－０の修整を受ける。\n－２：あなたのライブラリーの一番上から３枚のカードを公開する。対戦相手１人は、それらのカードを２つの束に分ける。一方の束をあなたの手札に加え、もう一方をあなたのライブラリーの一番下に望む順番で置く。\n－８：プレイヤー１人につき、そのプレイヤーのライブラリーから土地でないカードを１枚探してそれを追放する。その後そのプレイヤーは自分のライブラリーを切り直す。あなたはそれらのカードを、マナ・コストを支払うことなく唱えてもよい。", "type": "プレインズウォーカー — ジェイス"}, {"language": "Korean", "multiverseId": 357424, "name": "생각의 설계자 제이스", "text": "+1: 당신의 다음 턴이 될 때까지, 상대가 조종하는 생물이 공격할 때마다, 그 생물은 턴종료까지 -1/-0을 받는다.\n-2: 당신의 서고 맨 위의 카드 세 장을 공개한다. 한 상대가 이렇게 공개된 카드를 두 더미로 나눈다. 한 더미는 당신의 손으로 가져가고, 다른 더미는 당신의 서고 맨 밑에 원하는 순서로 놓는다.\n-8: 각 플레이어의 서고에서 대지가 아닌 카드 한 장을 찾아 추방한다. 그러고 나서 그 플레이어들은 자신의 서고를 섞는다. 당신은 그 카드들을 마나비용의 지불 없이 발동할 수 있다.", "type": "플레인즈워커 — - 제이스"}, {"language": "Portuguese (Brazil)", "multiverseId": 356876, "name": "Jace, Arquiteto do Pensamento", "text": "+1: Até seu próximo turno, toda vez que uma criatura que um oponente controla ataca, ela recebe -1/-0 até o final do turno.\n-2: Revele os três cards do topo de seu grimório. Um oponente separa aqueles cards em dois montes. Coloque um deles na sua mão e o outro no fundo do seu grimório em qualquer ordem.\n-8: Para cada jogador, procure um card que não seja um terreno no grimório dele e exile-o. Depois, aquele jogador embaralha o próprio grimório. Você pode conjurar esses cards sem pagar seus custos de mana.", "type": "Planeswalker — Jace"}, {"language": "Russian", "multiverseId": 355232, "name": "Джейс, Архитектор Мысли", "text": "+1: до вашего следующего хода каждый раз, когда находящееся под контролем оппонента существо атакует, оно получает -1/-0 до конца хода.\n-2: покажите три верхние карты вашей библиотеки. Оппонент делит те карты на две стопки. Положите одну стопку в вашу руку, а другую — в низ вашей библиотеки в любом порядке.\n-8: для каждого игрока, найдите в библиотеке того игрока не являющуюся землей карту и изгоните ее, затем тот игрок тасует свою библиотеку. Вы можете разыграть те карты без уплаты их мана-стоимости.", "type": "Planeswalker — Джейс"}, {"language": "Chinese Simplified", "multiverseId": 357150, "name": "筑念师杰斯", "text": "+1：直到你的下一个回合，每当任一个由对手操控的生物攻击时，它得-1/-0直到回合结束。\n-2：展示你牌库顶的三张牌。由任一对手将它们分成两堆。将其中一堆置于你手上，另一堆则以任意顺序置于你的牌库底。\n-8：对每位牌手而言，你从该牌手的牌库中搜寻一张非地牌并将它放逐，然后该牌手将其牌库洗牌。你可以施放这些牌，且不需支付其法术力费用。", "type": "鹏洛客～杰斯"}, {"language": "Chinese Traditional", "multiverseId": 355506, "name": "築念師傑斯", "text": "+1：直到你的下一個回合，每當任一個由對手操控的生物攻擊時，它得-1/-0直到回合結束。\n-2：展示你牌庫頂的三張牌。由任一對手將它們分成兩堆。將其中一堆置於你手上，另一堆則以任意順序置於你的牌庫底。\n-8：對每位玩家而言，你從該玩家的牌庫中搜尋一張非地牌並將它放逐，然後該玩家將其牌庫洗牌。你可以施放這些牌，且不需支付其魔法力費用。", "type": "鵬洛客～傑斯"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "188428", "cardKingdomId": "188068", "cardsphereId": "38756", "mcmId": "258195", "mcmMetaId": "206421", "mtgjsonV4Id": "f2d5de60-2f24-59e7-a498-9e6cdbbb9444", "mtgoFoilId": "46550", "mtgoId": "46549", "multiverseId": "253653", "scryfallId": "d4df3a38-678e-42dc-a3fd-d1d399368f07", "scryfallIllustrationId": "bb18894d-ac3d-4e9e-86a9-12657a65bb10", "scryfallOracleId": "2274c7ae-5a40-4fd4-a4ac-6f56b23034e4", "tcgplayerProductId": "66382"}, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "loyalty": "4", "manaCost": "{2}{U}{U}", "manaValue": 4.0, "name": "Jace, Architect of Thought", "number": "44", "originalText": "+1: Until your next turn, whenever a creature an opponent controls attacks, it gets -1/-0 until end of turn.\n-2: Reveal the top three cards of your library. An opponent separates those cards into two piles. Put one pile into your hand and the other on the bottom of your library in any order.\n-8: For each player, search that player's library for a nonland card and exile it, then that player shuffles his or her library. You may cast those cards without paying their mana costs.", "originalType": "Planeswalker — Jace", "printings": ["C20", "DDM", "NEC", "RTR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/5209ca1270b69ba1", "cardKingdomFoil": "https://mtgjson.com/links/e3f3342927e612d7", "cardmarket": "https://mtgjson.com/links/125047afebdd6d0b", "tcgplayer": "https://mtgjson.com/links/89d33853a0ac8a5c"}, "rarity": "mythic", "rulings": [{"date": "2012-10-01", "text": "Jace's first ability creates a delayed triggered ability that triggers whenever a creature an opponent controls attacks. It doesn't matter which player or planeswalker that creature is attacking."}, {"date": "2012-10-01", "text": "You pick one of your opponents when Jace's second ability resolves. The ability doesn't target that opponent. All players may see the revealed cards and offer opinions. You (not your opponent) choose which pile is put into your hand and which pile is put on the bottom of your library."}, {"date": "2012-10-01", "text": "Piles can be empty. If one of the piles is empty, you choose to put all the revealed cards in your hand or on the bottom of your library."}, {"date": "2012-10-01", "text": "When resolving Jace's third ability, you search each player's library (including yours) and exile the nonland cards before casting any of them."}, {"date": "2012-10-01", "text": "For each library, the search is complete only when you explicitly say it is. For example, you can look through one player's library, set that library down, look at another player's library, choose a nonland card in the first library, then choose a nonland card in the second library. Don't reveal any cards from those libraries to any other player until you exile them."}, {"date": "2012-10-01", "text": "You cast the cards by putting them on the stack one at a time, choosing modes, targets, and so on. The last card you cast will be the first one to resolve."}, {"date": "2012-10-01", "text": "When casting a card this way, ignore timing restrictions based on the card's type. Other timing restrictions, such as “Cast [this card] only during combat,” must be followed."}, {"date": "2012-10-01", "text": "If you can't cast a card, perhaps because there are no legal targets available, or if you choose not to cast one, it will remain exiled. Jace's ability won't allow you to cast it later."}, {"date": "2012-10-01", "text": "If you cast a card “without paying its mana cost,” you can't pay alternative costs such as overload costs. You can pay additional costs such as kicker costs. If the card has mandatory additional costs, you must pay those."}, {"date": "2012-10-01", "text": "If a card has {X} in its mana cost, you must choose 0 as its value."}], "setCode": "RTR", "subtypes": ["Jace"], "supertypes": ["Legendary"], "text": "[+1]: Until your next turn, whenever a creature an opponent controls attacks, it gets -1/-0 until end of turn.\n[−2]: Reveal the top three cards of your library. An opponent separates those cards into two piles. Put one pile into your hand and the other on the bottom of your library in any order.\n[−8]: For each player, search that player's library for a nonland card and exile it, then that player shuffles. You may cast those cards without paying their mana costs.", "type": "Legendary Planeswalker — Jace", "types": ["Planeswalker"], "uuid": "41162bba-7a2b-57d3-8c70-a2377a308bac"}