{"artist": "Jason Chan", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 1904, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 210590, "name": "Jace, der Gedankenformer", "text": "+2: Schaue dir die oberste Karte der Bibliothek eines Spielers deiner Wahl an. Du kannst diese Karte unter die Bibliothek dieses Spielers legen.\n0: Ziehe drei Karten und lege dann zwei Karten aus deiner Hand in beliebiger Reihenfolge oben auf deine Bibliothek.\n-1: Bringe eine Kreatur deiner Wahl auf die Hand ihres Besitzers zurück.\n-12: Schicke alle Karten der Bibliothek eines Spielers deiner Wahl ins Exil, anschließend mischt dieser Spieler die Karten auf seiner Hand in seine Bibliothek.", "type": "Planeswalker — Jace"}, {"language": "Spanish", "multiverseId": 211605, "name": "Jace, el escultor mental", "text": "+2: Mira la primera carta de la biblioteca del jugador objetivo. Puedes poner esa carta en el fondo de la biblioteca de ese jugador.\n0: Roba tres cartas, luego pon dos cartas de tu mano en la parte superior de tu biblioteca en cualquier orden.\n-1: Regresa la criatura objetivo a la mano de su propietario.\n-12: Exilia todas las cartas de la biblioteca del jugador objetivo, luego ese jugador bajara su mano en su biblioteca.", "type": "Planeswalker — Jace"}, {"language": "French", "multiverseId": 211315, "name": "Jace, le sculpteur de l'esprit", "text": "+2 : Regardez la carte du dessus de la bibliothèque du joueur ciblé. Vous pouvez mettre cette carte au-dessous de la bibliothèque de ce joueur.\n0 : Piochez trois cartes et mettez ensuite deux cartes de votre main au-dessus de votre bibliothèque dans n'importe quel ordre.\n-1 : Renvoyez la créature ciblée dans la main de son propriétaire.\n-12 : Exilez toutes les cartes de la bibliothèque du joueur ciblé. Ce joueur mélange ensuite sa main dans sa bibliothèque.", "type": "Planeswalker : Jace"}, {"language": "Italian", "multiverseId": 211170, "name": "Jace, lo Scultore di Menti", "text": "+2: Guarda la prima carta del grimorio di un giocatore bersaglio. Puoi mettere quella carta in fondo al grimorio di quel giocatore.\n0: Pesca tre carte, poi metti due carte dalla tua mano in cima al tuo grimorio in qualsiasi ordine.\n-1: Fai tornare una creatura bersaglio in mano al suo proprietario.\n-12: Esilia tutte le carte dal grimorio di un giocatore bersaglio, poi quel giocatore rimescola la sua mano nel suo grimorio.", "type": "Planeswalker — Jace"}, {"language": "Japanese", "multiverseId": 210735, "name": "精神を刻む者、ジェイス", "text": "+2: プレイヤー１人を対象とし、そのプレイヤーのライブラリーの一番上のカードを見る。 あなたはそのカードをそのプレイヤーのライブラリーの一番下に置いてもよい。\n0: カードを３枚引き、その後あなたの手札にあるカードを２枚、あなたのライブラリーの一番上に望む順番で置く。\n-1: クリーチャー１体を対象とし、それをオーナーの手札に戻す。\n-12: プレイヤー１人を対象とする。そのプレイヤーのライブラリーのカードをすべて追放し、その後そのプレイヤーは自分の手札を自分のライブラリーに加えて切り直す。", "type": "プレインズウォーカー — ジェイス"}, {"language": "Portuguese (Brazil)", "multiverseId": 210880, "name": "Jace, o Escultor de Mentes", "text": "+2: Olhe o card do topo do grimório do jogador alvo. Você pode colocar aquele card no fundo do grimório daquele jogador.\n0: Compre três cards, depois coloque dois cards de sua mão no topo de seu grimório em qualquer ordem.\n-1: Devolva a criatura alvo para a mão de seu dono.\n-12: Exile todos os cards do grimório do jogador alvo, depois aquele jogador embaralha sua mão no próprio grimório.", "type": "Planeswalker — Jace"}, {"language": "Russian", "multiverseId": 211460, "name": "Джейс, Скульптор Сознания", "text": "+2: посмотрите верхнюю карту библиотеки целевого игрока. Вы можете положить ту карту в низ библиотеки того игрока.\n0: возьмите три карты, затем положите две карты из вашей руки на верх вашей библиотеки в любом порядке.\n-1: верните целевое существо в руку его владельца.\n-12: изгоните все карты из библиотеки целевого игрока, затем тот игрок втасовывает свою руку в свою библиотеку.", "type": "Planeswalker — Джейс"}, {"language": "Chinese Simplified", "multiverseId": 211025, "name": "心灵塑师杰斯", "text": "+2：检视目标牌手的牌库顶牌。 你可以将该牌置于该牌手的牌库底。\n0：抓三张牌，然后从你手上将两张牌以任意顺序置于你牌库顶。\n-1：将目标生物移回其拥有者手上。\n-12：放逐目标牌手牌库中所有的牌，然后该牌手将其手牌洗回牌库。", "type": "鹏洛客～杰斯"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "130184", "cardKingdomId": "129937", "cardsphereId": "47448", "mcmId": "22110", "mcmMetaId": "10956", "mtgjsonV4Id": "30503791-e51c-5885-b0ee-d05860de950c", "mtgoFoilId": "35592", "mtgoId": "35591", "multiverseId": "195297", "scryfallId": "0e606072-a3aa-4300-ba90-ec92a721fa76", "scryfallIllustrationId": "b0ab416a-c7a8-4531-8e6a-00a167db4f76", "scryfallOracleId": "7f77a84e-5a4b-4834-aefa-3cecc175ae8e", "tcgplayerProductId": "34384"}, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "vintage": "Legal"}, "loyalty": "3", "manaCost": "{2}{U}{U}", "manaValue": 4.0, "name": "Jace, the Mind Sculptor", "number": "31", "originalText": "+2: Look at the top card of target player's library. You may put that card on the bottom of that player's library.\n0: Draw three cards, then put two cards from your hand on top of your library in any order.\n-1: Return target creature to its owner's hand.\n-12: Exile all cards from target player's library, then that player shuffles his or her hand into his or her library.", "originalType": "Planeswalker — Jace", "printings": ["2XM", "A25", "EMA", "MED", "PRM", "SLD", "V13", "VMA", "WWK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d92ee4d421b7e772", "cardKingdomFoil": "https://mtgjson.com/links/a3c709f9c8be392e", "cardmarket": "https://mtgjson.com/links/aa04ecf207878504", "tcgplayer": "https://mtgjson.com/links/38cfaaf279a1f9d3"}, "rarity": "mythic", "rulings": [{"date": "2020-08-07", "text": "You draw three cards and put two cards back all while Jace's second ability is resolving. Nothing can happen between the two, and no player may choose to take actions."}, {"date": "2020-08-07", "text": "If the target player for Jace's last ability has no cards in hand, that player shuffles nothing into their library, and that player's library will remain empty. That player won't lose the game until they try to draw from the empty library."}], "setCode": "WWK", "subtypes": ["Jace"], "supertypes": ["Legendary"], "text": "[+2]: Look at the top card of target player's library. You may put that card on the bottom of that player's library.\n[0]: Draw three cards, then put two cards from your hand on top of your library in any order.\n[−1]: Return target creature to its owner's hand.\n[−12]: Exile all cards from target player's library, then that player shuffles their hand into their library.", "type": "Legendary Planeswalker — Jace", "types": ["Planeswalker"], "uuid": "635f9f1e-4ea0-50d4-8f8b-0dd6b0d609b2"}