{"artist": "Ben Thompson", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 4.0, "edhrecRank": 22417, "finishes": ["nonfoil", "foil"], "flavorText": "Before the Kami War, the shishi were symbolic guardians, protecting the shrines where they stood. But after the kami turned on the material world, shishi began pouncing from their perches to attack would-be supplicants.", "foreignData": [{"flavorText": "Vor dem Kami-Krieg waren die Shishi symbolische Wächter, die die Schreine dort, wo sie standen, bewachten. Doch als sich die Kami der materiellen Welt zuwandten, fingen auch die Shishi an, sich von ihren Sockeln auf Möchtegern-Bittsteller zu stürzen.", "language": "German", "multiverseId": 85904, "name": "Jadestandbild", "text": "Immer wenn du einen Geist oder einen arkanen Zauber spielst, wird das Jadestandbild bis zum Ende des Zuges zu einer 4/4 Geist-Artefaktkreatur.", "type": "Artefakt"}, {"flavorText": "Antes de la guerra con los kami, los shishi eran guardianes simbólicos, que protegían los altares donde se alzaban. Pero cuando los kami se volvieron contra el mundo material, los shishi comenzaron a saltar de sus pedestales para atacar a los suplicantes.", "language": "Spanish", "multiverseId": 87132, "name": "Ídolo de jade", "text": "Siempre que juegues un hechizo arcano o de Espíritu, el Ídolo de jade se convierte en una criatura artefacto Espíritu 4/4 hasta el final del turno.", "type": "Artefacto"}, {"flavorText": "Avant la Guerre des kami, les shishi étaient les protecteurs symboliques des reliquaires. Mais après le déferlement des kami sur le monde, ils sautèrent de leur piédestal pour attaquer les supplicateurs.", "language": "French", "multiverseId": 85597, "name": "Idole de jade", "text": "À chaque fois que vous jouez un sort d'esprit ou d'arcane, l'Idole de jade devient une créature-artefact 4/4 Esprit jusqu'à la fin du tour.", "type": "Artefact"}, {"flavorText": "Prima della Guerra dei Kami, gli shishi erano guardiani simbolici, che proteggevano i santuari davanti ai quali erano posti. Ma dopo che i kami si ribellarono al mondo materiale, essi cominciarono a balzare dai propri piedistalli per attaccare i sedicenti supplicanti.", "language": "Italian", "multiverseId": 86211, "name": "Idolo di Giada", "text": "Ogniqualvolta giochi una magia Spirito o Arcano, l'Idolo di Giada diventa una creatura artefatto Spirito 4/4 fino alla fine del turno.", "type": "Artefatto"}, {"flavorText": "神の乱の前、獅子は守護者の象徴で、自らの祭殿を護っていた。しかし神が現し世に争いを仕掛けたとき、獅子は台座を飛び降り、慈悲を請う者どもに襲い掛かった。", "language": "Japanese", "multiverseId": 86518, "name": "翡翠の彫像", "text": "あなたがスピリット呪文か秘儀呪文をプレイするたび、翡翠の彫像はターン終了時まで４/４のスピリット・アーティファクト・クリーチャーになる。", "type": "アーティファクト"}, {"flavorText": "Antes da Guerra dos Kamis, os shishis eram guardiães simbólicos, protetores dos sacrários nos quais ficavam. Mas depois que os kamis se voltaram contra o mundo material, os shishis começaram a saltar de seus poleiros para atacar os pretensos suplicantes.", "language": "Portuguese (Brazil)", "multiverseId": 86825, "name": "Ídolo de Jade", "text": "Toda vez que você jogar uma mágica Arcana ou de Espírito, Ídolo de Jade torna-se uma criatura artefato 4/4 do tipo Espírito até o final do turno.", "type": "Artefato"}, {"flavorText": "在逆神之战以前，狮子像是守护者的象征，用来护卫祭祠。自从神明袭击实界以来，狮子像也开始跳下基座，攻击过往信众。", "language": "Chinese Simplified", "multiverseId": 85290, "name": "玉雕像", "text": "每当你使用精怪或古咒咒语时，玉雕像成为4/4精怪神器生物直到回合结束。", "type": "神器"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "112161", "cardKingdomId": "111862", "cardsphereId": "7978", "mcmId": "12061", "mcmMetaId": "7031", "mtgjsonV4Id": "372cfb96-19f0-515f-af37-15776b7a8659", "mtgoFoilId": "21572", "mtgoId": "21571", "multiverseId": "80531", "scryfallId": "a58f63c5-cdc5-4079-a727-cff45668d546", "scryfallIllustrationId": "1e4d6d14-5c81-4d1f-b077-0d6309b9e1b2", "scryfallOracleId": "36b4daf5-6568-402b-a4f9-fe3ffddc847c", "tcgplayerProductId": "12042"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}", "manaValue": 4.0, "name": "Jade Idol", "number": "256", "originalText": "Whenever you play a Spirit or Arcane spell, Jade Idol becomes a 4/4 Spirit artifact creature until end of turn.", "originalType": "Artifact", "printings": ["CHK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/8ca87d1966e486dd", "cardKingdomFoil": "https://mtgjson.com/links/9fa54cabc8cd0317", "cardmarket": "https://mtgjson.com/links/d68fca8a1bc4ae02", "tcgplayer": "https://mtgjson.com/links/c898bdf9021ad78d"}, "rarity": "uncommon", "rulings": [{"date": "2008-08-01", "text": "A noncreature permanent that turns into a creature can attack, and its {T} abilities can be activated, only if its controller has continuously controlled that permanent since the beginning of their most recent turn. It doesn’t matter how long the permanent has been a creature."}], "setCode": "CHK", "subtypes": [], "supertypes": [], "text": "Whenever you cast a Spirit or Arcane spell, Jade Idol becomes a 4/4 Spirit artifact creature until end of turn.", "type": "Artifact", "types": ["Artifact"], "uuid": "c3edae41-7135-5098-9228-d8df5cae67b5"}