{"artist": "Chris Rahn", "availability": ["arena", "mtgo", "paper"], "borderColor": "black", "colorIdentity": ["G", "U"], "colors": ["G"], "convertedManaCost": 4.0, "edhrecRank": 4727, "faceName": "Journey to the Oracle", "finishes": ["nonfoil", "foil"], "foreignData": [], "frameEffects": ["legendary", "extendedart"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardsphereId": "76317", "mcmId": "558273", "mcmMetaId": "339153", "mtgjsonV4Id": "589dcae8-7026-5f66-9dff-0ce17a22d8c7", "multiverseId": "516917", "scryfallId": "b0a96416-9ee5-4202-a99f-e09db8794567", "scryfallIllustrationId": "c1c1d7d4-b08e-4c64-907d-f2fc1753e467", "scryfallOracleId": "ca79cd3f-13ba-4d11-b885-48a504ae69aa", "tcgplayerProductId": "235957"}, "isStarter": true, "language": "English", "layout": "modal_dfc", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}{G}", "manaValue": 4.0, "name": "Jadzi, Oracle of Arcavios // Journey to the Oracle", "number": "325", "originalText": "Discard a card: Return Jadzi, Oracle of Arcavios to its owner's hand.\nMagecraft — Whenever you cast or copy an instant or sorcery spell, reveal the top card of your library. If it's a nonland card, you may cast it by paying {1} rather than paying its mana cost. If it's a land card, put it onto the battlefield.\n\n\nSorcery\n{2}{G}{G}", "originalType": "Legendary Creature — Human Wizard", "otherFaceIds": ["1181384e-826b-5079-8d9a-064d2f955539"], "printings": ["PRM", "PSTX", "STX"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardmarket": "https://mtgjson.com/links/e9bd70beacb44b6e", "tcgplayer": "https://mtgjson.com/links/24fd032ff51c2ae1"}, "rarity": "mythic", "rulings": [{"date": "2021-04-16", "text": "Putting a land onto the battlefield does not count as playing a land for the turn and doesn’t use the normal timing restrictions."}, {"date": "2021-04-16", "text": "You may choose not to cast a nonland card revealed by Jadzi’s triggered ability. If you don’t cast it, it stays on top of your library."}, {"date": "2021-04-16", "text": "If you’re casting the card you reveal with Jadzi’s ability, you ignore normal timing restrictions."}, {"date": "2021-04-16", "text": "If you reveal a modal double-faced card with Jadzi’s triggered ability, and both faces are nonland, you may cast either face by paying {1} rather than its mana cost. If only the back face is a land, you may cast the front face. If both faces are lands, you will put onto the battlefield front face up."}, {"date": "2021-04-16", "text": "If you cast a spell with {X} in its mana cost using Jadzi’s magecraft ability, you must choose 0 as the value of X."}, {"date": "2021-04-16", "text": "Because the magecraft ability supplies an alternative cost of {1} for the spell, you cannot pay any other alternative costs that may apply. However, you may pay additional costs and must pay any additional costs that are required."}, {"date": "2021-04-16", "text": "You may activate Jadzi’s activated ability only while Jadzi is on the battlefield. If Jadzi is no longer on the battlefield as the ability resolves, it won’t return her to your hand from any other zone."}, {"date": "2021-04-16", "text": "Each magecraft ability has a different effect, although they all have the same trigger condition, whenever you cast or copy an instant or sorcery spell."}, {"date": "2021-04-16", "text": "For example, if you control Archmage Emeritus and cast an instant or sorcery spell, Archmage Emeritus’s magecraft ability will trigger and you will draw a card."}, {"date": "2021-04-16", "text": "If an effect creates a copy of an instant or sorcery spell, this will also cause the magecraft ability to trigger."}, {"date": "2021-04-16", "text": "If an effect creates multiple copies of an instant or sorcery spell, magecraft abilities trigger once for each copy created by the effect."}, {"date": "2021-04-16", "text": "Some effects instruct you to copy an instant or sorcery card in a zone other than the stack. These copies do not cause magecraft abilities to trigger. However, most effects that do this also allow you to cast the copy, and casting the copy will cause magecraft abilities to trigger."}], "securityStamp": "oval", "setCode": "STX", "side": "b", "subtypes": [], "supertypes": [], "text": "You may put any number of land cards from your hand onto the battlefield. Then if you control eight or more lands, you may discard a card. If you do, return Journey to the Oracle to its owner's hand.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "16d703d7-6310-58a6-b32b-a2c0ad852ced", "variations": ["cf445c3c-3759-5b0c-aa94-78312ce2ed7c"]}