{"artist": "Lius Lasahido", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G", "R", "W"], "colors": ["G", "R", "W"], "convertedManaCost": 3.0, "edhrecRank": 6856, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "d0cf0ff7-f4fe-559e-8c98-5a687449fd4e", "mtgoId": "86232", "scryfallId": "07310eb0-c6b2-4292-8b5b-b303945223b8", "scryfallIllustrationId": "f23d15bf-b65c-44b5-be13-b733f2cfac48", "scryfallOracleId": "b48da54c-002f-4afb-9fdf-2a3e1cf77383"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{R}{G}{W}", "manaValue": 3.0, "name": "Jared Carthalion, True Heir", "number": "86232", "originalReleaseDate": "2020-12-15", "power": "3", "printings": ["CMR", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-11-10", "text": "If damage that can’t be prevented is dealt to Jared Carthalion while you’re the monarch, the damage is dealt and you’ll simultaneously put that many +1/+1 counters on it, all before the game checks for lethal damage."}, {"date": "2020-11-10", "text": "If you’re the monarch and damage would be dealt to Jared Carthalion at the same time combat damage is dealt to you, Jared Carthalion’s last ability will prevent damage and put counters on it before the triggered ability that makes another player the monarch resolves."}, {"date": "2020-11-10", "text": "If the first ability resolves but the target opponent can’t become the monarch (perhaps because they also had a Jared Carthalion enter the battlefield earlier in the turn), the current monarch stays the monarch, even if that player is you."}, {"date": "2020-11-10", "text": "The game starts with no monarch. Once an effect makes one player the monarch, the game will have exactly one monarch from that point forward. As a player becomes the monarch, the current monarch (if any) ceases being the monarch."}, {"date": "2020-11-10", "text": "There are two inherent triggered abilities associated with being the monarch. These triggered abilities have no source and are controlled by the player who was the monarch at the time the abilities triggered. The full texts of these abilities are “At the beginning of the monarch’s end step, that player draws a card” and “Whenever a creature deals combat damage to the monarch, its controller becomes the monarch.”"}, {"date": "2020-11-10", "text": "If the triggered ability that causes the monarch to draw a card goes on the stack and a different player becomes the monarch before that ability resolves, the first player will still draw the card."}, {"date": "2020-11-10", "text": "If the monarch leaves the game during another player’s turn, that player becomes the monarch. If the monarch leaves the game during their turn, the next player in turn order becomes the monarch."}, {"date": "2020-11-10", "text": "If combat damage dealt to the monarch causes that player to lose the game, the triggered ability that causes the controller of the attacking creature to become the monarch doesn’t resolve. In most cases, the controller of the attacking creature will still become the monarch as it is likely their turn."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Human", "Warrior"], "supertypes": ["Legendary"], "text": "When Jared Carthalion, True Heir enters the battlefield, target opponent becomes the monarch. You can't become the monarch this turn.\nIf damage would be dealt to Jared Carthalion while you're the monarch, prevent that damage and put that many +1/+1 counters on it.", "toughness": "3", "type": "Legendary Creature — Human Warrior", "types": ["Creature"], "uuid": "ceca439a-46f5-563c-9b6b-38ec1ce8bbe9"}