{"artist": "Chris Rallis", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 2582, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "d77a4d69-6f6c-5a1d-af76-f919ce4e4477", "mtgoId": "85948", "scryfallId": "8abfb0d3-2140-4f7f-9557-ce363d768793", "scryfallIllustrationId": "d92cca3e-8e4e-480e-acca-5d71d7fd1287", "scryfallOracleId": "b1fbfcf3-6921-4417-a58e-0f5e5d34a105"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Partner"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "loyalty": "0", "manaCost": "{2}{R}", "manaValue": 3.0, "name": "Jeska, Thrice Reborn", "number": "85948", "originalReleaseDate": "2020-12-15", "printings": ["CMR", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2020-11-10", "text": "If you cast Jeska, Thrice Reborn and she is your commander, that casting counts for her first ability."}, {"date": "2020-11-10", "text": "For a creature affected by Jeska’s second ability, if that creature has trample, only the damage dealt to the defending player is tripled (as long as that player is one of your opponents). For example, say you activate that ability targeting a 5/5 creature with trample, attack one of your opponents with that creature, and that creature is blocked by a 3/3 creature. You could assign 3 damage to the blocking creature and 2 damage to the defending player. If you did, your attacker would deal 3 damage to the blocking creature and 6 damage (2 damage tripled) to the defending player. All of the damage remains combat damage."}, {"date": "2020-11-10", "text": "If a creature is targeted by Jeska’s second ability twice, combat damage it would deal one of your opponents is multiplied by nine. Three abilities multiply the damage by twenty-seven, and so on."}, {"date": "2020-11-10", "text": "If your Commander deck has two commanders, you can only include cards whose own color identities are also found in your commanders’ combined color identities. If Falthis and Kediss are your commanders, your deck may contain cards with black and/or red in their color identity, but not cards with green, white, or blue."}, {"date": "2020-11-10", "text": "Both commanders start in the command zone, and the remaining 98 cards (or 58 cards in a Commander Draft game) of your deck are shuffled to become your library."}, {"date": "2020-11-10", "text": "To have two commanders, both must have the partner ability as the game begins. Losing the ability during the game doesn’t cause either to cease to be your commander."}, {"date": "2020-11-10", "text": "Once the game begins, your two commanders are tracked separately. If you cast one, you won’t have to pay an additional {2} the first time you cast the other. A player loses the game after having been dealt 21 damage from any one of them, not from both of them combined."}, {"date": "2020-11-10", "text": "If something refers to your commander while you have two commanders, it refers to one of them of your choice. If you are instructed to perform an action on your commander (e.g. put it from the command zone into your hand due to Command Beacon), you choose one of your commanders at the time the effect happens."}, {"date": "2020-11-10", "text": "An effect that checks whether you control your commander is satisfied if you control one or both of your two commanders."}, {"date": "2020-11-10", "text": "You can choose two commanders with partner that are the same color or colors. In Commander Draft, you can even choose two of the same commander with partner if you drafted them. If you do this, make sure you keep the number of times you’ve cast each from the command zone clear for “commander tax” purposes."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Jeska"], "supertypes": ["Legendary"], "text": "Jeska, Thrice Reborn enters the battlefield with a loyalty counter on her for each time you've cast a commander from the command zone this game.\n[0]: Choose target creature. Until your next turn, if that creature would deal combat damage to one of your opponents, it deals triple that damage to that player instead.\n[−X]: Jeska, Thrice Reborn deals X damage to each of up to three targets.\nJeska, Thrice Reborn can be your commander.\nPartner", "type": "Legendary Planeswalker — Jeska", "types": ["Planeswalker"], "uuid": "8d14e336-2777-50a1-9212-bc7853112fcd"}