{"artist": "Matt Cavotta", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 21903, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 127282, "name": "Narrenszepter", "text": "Wenn das Narrenszepter ins Spiel kommt, entferne die obersten fünf Karten der Bibliothek eines Spielers deiner Wahl verdeckt ganz aus dem Spiel. Du darfst dir diese Karten anschauen, solange sie ganz aus dem Spiel entfernt sind.\n{2}, {T}, lege eine Karte, die durch das Narrenszepter ganz aus dem Spiel entfernt wurde, auf den Friedhof ihres Besitzers: Neutralisiere einen Zauberspruch deiner Wahl, falls er denselben Namen wie diese Karte hat.", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 128057, "name": "Cetro del bufón", "text": "Cuando el Cetro del bufón entre en juego, remueve del juego boca abajo las primeras cinco cartas de la biblioteca del jugador objetivo. Puedes mirar esas cartas mientras permanezcan removidas del juego.\n{2}, {T}, pon en el cementerio de su propietario una carta removida del juego con el Cetro del bufón: Contrarresta el hechizo objetivo si tiene el mismo nombre que esa carta.", "type": "Artefacto"}, {"language": "French", "multiverseId": 127127, "name": "Sceptre du bouffon", "text": "Quand le Sceptre du bouffon arrive en jeu, retirez de la partie, face cachée, les cinq cartes du dessus de la bibliothèque du joueur ciblé. Vous pouvez regarder ces cartes tant qu'elles restent retirées de la partie.\n{2}, {T}, mettez une carte retirée de la partie par le Sceptre du bouffon dans le cimetière de son propriétaire : Contrecarrez le sort ciblé s'il a le même nom que cette carte.", "type": "Artefact"}, {"language": "Italian", "multiverseId": 127437, "name": "Scettro del Giullare", "text": "Quando lo Scettro del Giullare entra in gioco, rimuovi dal gioco a faccia in giù le prime cinque carte del grimorio di un giocatore bersaglio. Puoi guardare quelle carte fintanto che rimangono rimosse dal gioco.\n{2}, {T}, Metti nel cimitero del suo proprietario una carta rimossa dal gioco con lo Scettro del Giullare: Neutralizza una magia bersaglio se ha lo stesso nome di quella carta.", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 127592, "name": "道化の王笏", "text": "道化の王笏が場に出たとき、プレイヤー１人を対象とし、そのプレイヤーのライブラリーの一番上から５枚のカードを裏向きにゲームから取り除く。 あなたはそれらのカードがゲームから取り除かれた状態にあるかぎり、それらを見てもよい。\n{2}, {T}, 道化の王笏によりゲームから取り除かれたカードを１枚オーナーの墓地に置く：呪文１つを対象とする。それがそのカードと同じカード名である場合、それを打ち消す。", "type": "アーティファクト"}, {"language": "Portuguese (Brazil)", "multiverseId": 127747, "name": "Cetro do Bufão", "text": "Quando Cetro do Bufão entrar em jogo, remova do jogo os cinco cards do topo do grimório do jogador alvo com a face voltada para baixo. Você pode olhar esses cards enquanto eles permanecerem removidos do jogo.\n{2}, {T}, Coloque um card removido do jogo com Cetro do Bufão no cemitério de seu dono: Anule a mágica alvo se essa tiver o mesmo nome daquele card.", "type": "Artefato"}, {"language": "Chinese Simplified", "multiverseId": 126972, "name": "小丑权杖", "text": "当小丑权杖进场时，将目标牌手牌库顶的五张牌以牌面朝下的方式移出对战。 只要这些牌持续被移出对战，你便可以检视这些牌。\n{2}，{T}，将一张以小丑权杖移出对战的牌置入其拥有者之坟墓场：如果目标咒语的名称与该牌相同，则反击之。", "type": "神器"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "120927", "cardKingdomId": "120772", "cardsphereId": "8644", "mcmId": "13663", "mcmMetaId": "8215", "mtgjsonV4Id": "17a6a2d3-41f9-529b-a5b9-45fe4b7635f4", "mtgoFoilId": "24796", "mtgoId": "24795", "multiverseId": "122066", "scryfallId": "7118c2e0-04d6-4a71-8ffd-b9365b154050", "scryfallIllustrationId": "f33eb3b3-6f9d-4dec-b7a1-52e3d65a00d7", "scryfallOracleId": "396b943c-b45d-4e5b-a9c1-f70bc603ee9f", "tcgplayerProductId": "14056"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Jester's Scepter", "number": "137", "originalText": "When Jester's Scepter comes into play, remove the top five cards of target player's library from the game face down. You may look at those cards as long as they remain removed from the game.\n{2}, {T}, Put a card removed from the game with Jester's Scepter into its owner's graveyard: Counter target spell if it has the same name as that card.", "originalType": "Artifact", "printings": ["CSP"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/e06ba768596bf246", "cardKingdomFoil": "https://mtgjson.com/links/d02ee6f3c70bbc7d", "cardmarket": "https://mtgjson.com/links/e9242b58ace4db3a", "tcgplayer": "https://mtgjson.com/links/24f06e07918c6263"}, "rarity": "rare", "rulings": [{"date": "2006-07-15", "text": "You can see the cards that are exiled with Jester’s Scepter, but no one else can."}, {"date": "2006-07-15", "text": "Because the cards that are exiled are not hidden to you, you can choose which one to put into its owner’s graveyard when you activate the second ability."}, {"date": "2006-07-15", "text": "When Jester’s Scepter’s second ability is activated, any of the exiled cards may be put into its owner’s graveyard, and any spell may be targeted, whether or not the card and the spell have the same name. If they don’t have the same name, the effect does nothing. The spell’s controller and the owner of the card put into a graveyard this way may be different."}, {"date": "2006-07-15", "text": "If half of a split card is cast (for example, Hit), and you put one of those split cards into its owner’s graveyard with Jester’s Scepter (for example, Hit/Run), the spell is countered."}], "setCode": "CSP", "subtypes": [], "supertypes": [], "text": "When Jester's Scepter enters the battlefield, exile the top five cards of target player's library face down. You may look at those cards for as long as they remain exiled.\n{2}, {T}, Put a card exiled with Jester's Scepter into its owner's graveyard: Counter target spell if it has the same name as that card.", "type": "Artifact", "types": ["Artifact"], "uuid": "2379c5e6-fd3e-5213-8e54-78409c1c402a"}