{"artist": "WolfSkullJack", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B", "G", "U"], "colors": ["B", "U"], "convertedManaCost": 3.0, "edhrecRank": 6122, "faceName": "Kaldring, the Rimestaff", "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "778f01f0-03ad-507d-b6d8-5783d3c374a5", "mtgoId": "88350", "scryfallId": "e17e81ab-b33a-4ad1-89fb-941a19bf4e8e", "scryfallIllustrationId": "2b62fe5f-1130-45e9-815f-a817945bccdf", "scryfallOracleId": "bd43b485-e42e-4c20-adcb-799b0ce18a59"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "modal_dfc", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}{B}", "manaValue": 3.0, "name": "Jorn, God of Winter // Kaldring, the Rimestaff", "number": "88350", "originalReleaseDate": "2021-02-28", "otherFaceIds": ["02b8ed82-be16-57fd-9413-32bfda7f286a"], "printings": ["KHM", "PKHM", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "Even though you may play the card, it isn’t in your hand, so you can’t, for example, discard it or foretell it."}, {"date": "2021-02-05", "text": "There is a single triangle icon in the top left corner of the front face. There is a double triangle icon in the top left corner of the back face."}, {"date": "2021-02-05", "text": "To determine whether it is legal to play a modal double-faced card, consider only the characteristics of the face you’re playing and ignore the other face’s characteristics."}, {"date": "2021-02-05", "text": "If an effect allows you to play a specific modal double-faced card, you may cast it as a spell or play it as a land, as determined by which face you choose to play. If an effect allows you to cast (rather than “play”) a specific modal double-faced card, you can’t play it as a land."}, {"date": "2021-02-05", "text": "If an effect allows you to play a land or cast a spell from among a group of cards, you may play or cast a modal double-faced card with any face that fits the criteria of that effect."}, {"date": "2021-02-05", "text": "The converted mana cost of a modal double-faced card is based on the characteristics of the face that’s being considered. On the stack and battlefield, consider whichever face is up. In all other zones, consider only the front face. This is different than how the converted mana cost of a transforming double-faced card is determined."}, {"date": "2021-02-05", "text": "A modal double-faced card can’t be transformed or be put onto the battlefield transformed. Ignore any instruction to transform a modal double-faced card or to put one onto the battlefield transformed."}, {"date": "2021-02-05", "text": "If an effect puts a double-faced card onto the battlefield, it enters with its front face up. If that front face can’t be put onto the battlefield, it doesn’t enter the battlefield."}, {"date": "2021-02-05", "text": "If an effect instructs a player to choose a card name, the name of either face may be chosen. If that effect or a linked ability refers to a spell with the chosen name being cast and/or a land with the chosen name being played, it considers only the chosen name, not the other face’s name."}, {"date": "2021-02-05", "text": "In the Commander variant, a double-faced card’s color identity is determined by the mana costs and mana symbols in the rules text of both faces combined. If either face has a color indicator or basic land type, those are also considered."}, {"date": "2021-02-05", "text": "Snow is a supertype, not a card type. It has no rules meaning or function by itself, but spells and abilities may refer to it."}, {"date": "2021-02-05", "text": "The {S} symbol is a generic mana symbol. It represents a cost that can be paid by one mana that was produced by a snow source. That mana can be any color or colorless."}, {"date": "2021-02-05", "text": "Snow isn’t a type of mana. If an effect says you may spend mana as though it were any type, you can’t pay for {S} using mana that wasn’t produced by a snow source."}, {"date": "2021-02-05", "text": "Some cards have additional effects for each {S} spent to cast them. You can cast these spells even if you don’t spend any snow mana to cast them; their additional effects simply won’t do anything."}, {"date": "2021-02-05", "text": "The Kaldheim set doesn’t have any cards with mana costs that include {S}, but some previous sets do. If an effect says such a spell costs {1} less to cast, that reduction doesn’t apply to any {S} costs. This is also true for activated abilities that include {S} in their activation costs and effects that reduce those costs."}, {"date": "2021-02-05", "text": "Jorn’s triggered ability will untap Jorn itself."}, {"date": "2021-02-05", "text": "A snow permanent card is any artifact, creature, enchantment, land, or planeswalker card with the supertype snow."}, {"date": "2021-02-05", "text": "You don’t play the card as Kaldring’s activated ability is resolving; rather, that ability gives you permission to play that card that turn. You must follow the normal timing permissions and restrictions for the card when you play it. To play a land this way, you must have a land play available. Notably, if you activate Kaldring’s ability during an opponent’s turn, you won’t be able to cast a spell that way unless it has flash and you won’t be able to play a land that way at all."}, {"date": "2021-02-05", "text": "You’ll still pay all costs to cast a spell this way, including any additional costs. You may also pay alternative costs if any are available."}, {"date": "2021-02-05", "text": "If you don’t end up playing the card, it remains in your graveyard. You can’t play it on future turns unless you target it again with Kaldring’s ability (or something else lets you play it)."}], "securityStamp": "oval", "setCode": "PRM", "side": "b", "subtypes": [], "supertypes": ["Legendary", "Snow"], "text": "{T}: You may play target snow permanent card from your graveyard this turn. If you do, it enters the battlefield tapped.", "type": "Legendary Snow Artifact", "types": ["Artifact"], "uuid": "ec7c6503-a3ee-559f-8dd1-1eae2f954637"}