{"artist": "Glen Angus", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 5.0, "edhrecRank": 14349, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 167805, "name": "Bumm!", "text": "Bestimme eine beliebige Anzahl an Spielern deiner Wahl. Decke für jeden dieser Spieler Karten oben von deiner Bibliothek auf, bis du eine Karte aufdeckst, die kein Land ist. Bumm Bumm fügt jedem Spieler Schaden in Höhe der umgewandelten Manakosten der für ihn aufgedeckten Karte zu. Lege dann die auf diese Weise aufgedeckten Karten in beliebiger Reihenfolge unter deine Bibliothek.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 170465, "name": "¡Cataplum!", "text": "Elige cualquier número de jugadores objetivo. Por cada uno de esos jugadores, muestra cartas de la parte superior de tu biblioteca hasta que muestres una carta que no sea tierra. El ¡Cataplum hace una cantidad de daño igual al coste de maná convertido de esa carta a ese jugador, luego pon las cartas mostradas en la parte inferior de tu biblioteca en cualquier orden.", "type": "Conjuro"}, {"language": "French", "multiverseId": 168161, "name": "Kaboum !", "text": "Choisissez un nombre quelconque de joueurs ciblés. Pour chacun de ces joueurs, l'un après l'autre, révélez les cartes du dessus de votre bibliothèque jusqu'à ce que vous révéliez une carte non-terrain. Kaboum inflige des blessures égales au coût converti de mana de cette carte à ce joueur. Mettez les cartes ainsi révélées au-dessous de votre bibliothèque dans l'ordre de votre choix.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 168526, "name": "Kaboom!", "text": "Scegli un qualsiasi numero di giocatori bersaglio. Per ognuno di quei giocatori, rivela le carte dalla cima del tuo grimorio fino a quando riveli una carta non terra. Kaboom infligge un ammontare di danni pari al costo di mana convertito di quella carta a quel giocatore, poi metti le carte rivelate in fondo al tuo grimorio nell'ordine che preferisci.", "type": "Stregoneria"}, {"language": "Japanese", "name": "ドカーン！"}, {"language": "Portuguese (Brazil)", "multiverseId": 168876, "name": "Cabum!", "text": "Escolha um número qualquer de jogadores alvo. Para cada um daqueles jogadores, revele cards do topo de seu grimório até revelar um card que não seja um terreno. Cabum causa uma quantidade de pontos de dano igual ao custo de mana convertido daquele card àquele jogador, depois, coloque os cards revelados no fundo de seu grimório em qualquer ordem.", "type": "Feitiço"}], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "61213", "cardKingdomId": "60213", "cardsphereId": "34802", "mcmId": "1845", "mcmMetaId": "3009", "mtgjsonV4Id": "ae1fb4d6-aa89-5a38-98fe-5241c46b3557", "mtgoFoilId": "18094", "mtgoId": "18093", "multiverseId": "39559", "scryfallId": "1e81e5fc-0e18-4dd8-a505-aa7dba8521a8", "scryfallIllustrationId": "fea9648d-2c04-4bee-97b4-c03c924ead14", "scryfallOracleId": "c92802ff-484c-4d55-aba4-c3a000264113", "tcgplayerProductId": "10597"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "penny": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{4}{R}", "manaValue": 5.0, "name": "Kaboom!", "number": "214", "originalText": "Choose any number of target players. For each of those players, reveal cards from the top of your library until you reveal a nonland card. Kaboom deals damage equal to that card's converted mana cost to that player, then you put the revealed cards on the bottom of your library in any order.", "originalType": "Sorcery", "printings": ["ONS"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/81eb41af519baf98", "cardKingdomFoil": "https://mtgjson.com/links/fd4a5f2add521be8", "cardmarket": "https://mtgjson.com/links/e7c2b35816ac1b6a", "tcgplayer": "https://mtgjson.com/links/dcc42614c812743c"}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "If all the cards in your library are lands, this card deals zero damage."}, {"date": "2018-10-05", "text": "As Kaboom! resolves, you choose one of the target players or planeswalkers before revealing any cards, then complete the spell's process for that player or planeswalker, and then repeat until each target has been through the process."}], "setCode": "ONS", "subtypes": [], "supertypes": [], "text": "Choose any number of target players or planeswalkers. For each of them, reveal cards from the top of your library until you reveal a nonland card, Kaboom! deals damage equal to that card's mana value to that player or planeswalker, then you put the revealed cards on the bottom of your library in any order.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "ec6e4530-3356-52a9-8ab4-0b033f149dc9"}