{"artist": "Jason A. Engle", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["G", "W"], "colors": ["G", "W"], "convertedManaCost": 5.0, "edhrecRank": 1296, "finishes": ["foil"], "foreignData": [], "frameEffects": ["nyxtouched", "legendary", "showcase"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "231887", "cardsphereId": "66033", "mcmId": "440258", "mtgjsonV4Id": "4afc4467-77fa-5eb8-a3b7-a34533e6ca80", "multiverseId": "479498", "scryfallId": "2fe0295f-c731-4e13-9edd-f0e9a9d81769", "scryfallIllustrationId": "0f276548-dd94-484c-927e-56d12e2d0c93", "scryfallOracleId": "984e763c-5a83-4231-8ec4-1be76846479a", "tcgplayerProductId": "209398"}, "isFullArt": true, "isReprint": true, "isStarter": true, "keywords": ["Indestructible"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{G}{W}", "manaValue": 5.0, "name": "Karametra, God of Harvests", "number": "69", "originalReleaseDate": "2020-02-14", "originalText": "Indestructible\nAs long as your devotion to green and white is less than seven, Karametra isn't a creature.\nWhenever you cast a creature spell, you may search your library for a Forest or Plains card, put it onto the battlefield tapped, then shuffle your library.", "originalType": "Legendary Enchantment Creature — God", "power": "6", "printings": ["BNG", "C20", "CMR", "PLIST", "PRM", "SLD"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/36b17f145036d447", "tcgplayer": "https://mtgjson.com/links/e2fe650f8adae987"}, "rarity": "mythic", "rulings": [{"date": "2013-09-15", "text": "Numeric mana symbols ({0}, {1}, and so on) in mana costs of permanents you control don’t count toward your devotion to any color."}, {"date": "2013-09-15", "text": "If an activated ability or triggered ability has an effect that depends on your devotion to a color, you count the number of mana symbols of that color among the mana costs of permanents you control as the ability resolves. The permanent with that ability will be counted if it’s still on the battlefield at that time."}, {"date": "2013-09-15", "text": "Hybrid mana symbols, monocolored hybrid mana symbols, and Phyrexian mana symbols do count toward your devotion to their color(s)."}, {"date": "2013-09-15", "text": "Mana symbols in the text boxes of permanents you control don’t count toward your devotion to any color."}, {"date": "2014-02-01", "text": "You can use the last ability to put any land card with the subtype Forest or Plains onto the battlefield, not just ones named Forest or Plains."}, {"date": "2014-02-01", "text": "If you cast a creature card with bestow for its bestow cost, it becomes an Aura spell and not a creature spell. Karametra’s last ability won’t trigger."}, {"date": "2020-01-24", "text": "If a God is attacking or blocking and it stops being a creature, it will be removed from combat. It won’t rejoin combat if it resumes being a creature later during that combat."}, {"date": "2020-01-24", "text": "Your devotion to two colors is the number of mana symbols among mana costs of permanents you control that are the first color, the second, or both. If an effect counts your devotion to two colors, a hybrid symbol that is both of those colors is counted just once."}, {"date": "2020-01-24", "text": "The type-changing ability that can make a God not be a creature functions only on the battlefield. It’s always a creature card in other zones, regardless of your devotion to its color. It’s always a creature spell while it’s on the stack."}, {"date": "2020-01-24", "text": "As a God enters the battlefield, your devotion to its color will determine whether any replacement effects that affect creatures entering the battlefield apply to that God. Because replacement effects are considered before the God is on the battlefield, the mana symbols in its mana cost won’t be counted when determining this."}, {"date": "2020-01-24", "text": "When a God enters the battlefield, your devotion to its color (including the mana symbols in the mana cost of the God itself) will determine if a creature entered the battlefield or not for abilities that trigger whenever a creature enters the battlefield."}, {"date": "2020-01-24", "text": "If a God stops being a creature, it loses the type creature and the creature type God. It continues to be a legendary enchantment."}, {"date": "2020-01-24", "text": "The abilities of Gods function as long as they’re on the battlefield, regardless of whether they’re creatures."}, {"date": "2020-01-24", "text": "Counters put on a God remain on it while it’s not a creature, even if they have no effect."}, {"date": "2020-01-24", "text": "If an effect causes a God to lose all abilities, its ability that causes it to stop being a creature still applies if appropriate."}, {"date": "2020-11-10", "text": "Karametra’s abilities function as long as it’s on the battlefield, regardless of whether it’s a creature."}, {"date": "2020-11-10", "text": "If Karametra stops being a creature, it loses the type creature and the creature type God. It continues to be a legendary enchantment."}, {"date": "2020-11-10", "text": "If an effect causes Karametra to lose all abilities, its ability that causes it to stop being a creature still applies if appropriate."}, {"date": "2020-11-10", "text": "When Karametra enters the battlefield, your devotion to green and white will determine if a creature entered the battlefield or not for abilities that trigger whenever a creature enters the battlefield. The mana symbols in Karametra’s own mana cost are counted when determining this."}, {"date": "2020-11-10", "text": "Counters put on Karametra remain on it while it’s not a creature, even if they have no effect."}, {"date": "2020-11-10", "text": "If Karametra is attacking or blocking and it stops being a creature, it will be removed from combat. It won’t rejoin combat if it resumes being a creature later during that combat."}, {"date": "2020-11-10", "text": "An ability that triggers when a player casts a spell resolves before the spell that caused it to trigger. It resolves even if that spell is countered."}, {"date": "2020-11-10", "text": "The type-changing ability that can make Karametra not be a creature functions only on the battlefield. It’s always a creature card in other zones, regardless of your devotion to its color. It’s always a creature spell while it’s on the stack."}, {"date": "2020-11-10", "text": "As Karametra enters the battlefield, your devotion to green and white will determine whether any replacement effects that affect creatures entering the battlefield apply. Because replacement effects are considered before Karametra is on the battlefield, the mana symbols in its mana cost won’t be counted when determining this."}], "securityStamp": "oval", "setCode": "SLD", "subset": ["Theros Stargazing, Volume I"], "subtypes": ["God"], "supertypes": ["Legendary"], "text": "Indestructible\nAs long as your devotion to green and white is less than seven, Karametra isn't a creature.\nWhenever you cast a creature spell, you may search your library for a Forest or Plains card, put it onto the battlefield tapped, then shuffle.", "toughness": "7", "type": "Legendary Enchantment Creature — God", "types": ["Enchantment", "Creature"], "uuid": "15fffe16-8007-5eba-ad0d-dccfab8ff28b"}