{"artist": "Jason Chan", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 7.0, "edhrecRank": 2946, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "Japanese", "multiverseId": 456855, "name": "解放された者、カーン", "text": "+4：プレイヤー１人を対象とする。そのプレイヤーは自分の手札からカード１枚を追放する。\n-3：パーマネント１つを対象とし、それを追放する。\n-14：解放された者、カーンにより追放された、オーラでないパーマネント・カードをすべて追放したまま、ゲームを再び開始する。その後、それらのカードをあなたのコントロール下で戦場に出す。", "type": "伝説のプレインズウォーカー — カーン"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "222807", "cardKingdomId": "222486", "cardsphereId": "57944", "mcmId": "366155", "mcmMetaId": "202655", "mtgjsonV4Id": "9c4d839a-3fd0-573d-b6c7-3d96b03f0928", "mtgoFoilId": "70084", "mtgoId": "70083", "multiverseId": "456601", "scryfallId": "69714257-2848-48e1-95cf-cdb6595215f0", "scryfallIllustrationId": "8716b016-e464-4301-b181-2f21fc93b2a8", "scryfallOracleId": "0ca233f4-1b7f-4807-ab6e-2b1f5439b3db", "tcgplayerProductId": "179450"}, "isReprint": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "vintage": "Legal"}, "loyalty": "6", "manaCost": "{7}", "manaValue": 7.0, "name": "Karn Liberated", "number": "5", "originalText": "+4: Target player exiles a card from their hand.\n−3: Exile target permanent.\n−14: Restart the game, leaving in exile all non-Aura permanent cards exiled with Karn Liberated. Then put those cards onto the battlefield under your control.", "originalType": "Legendary Planeswalker — Karn", "printings": ["2XM", "J22", "MM2", "NPH", "PLIST", "PRM", "PUMA", "UMA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/676ecee8a189385e", "cardKingdomFoil": "https://mtgjson.com/links/fb0c989ef1fbbeec", "cardmarket": "https://mtgjson.com/links/91c11c0a3b81a5aa", "tcgplayer": "https://mtgjson.com/links/e28465e7df244380"}, "rarity": "mythic", "rulings": [{"date": "2020-08-07", "text": "A game that restarts immediately ends the preceding game. The players in that game then immediately begin a new game. No player wins, loses, or draws the original game as a result of Karn's ability."}, {"date": "2020-08-07", "text": "Players can't move cards between their deck and sideboard before the new game."}, {"date": "2020-08-07", "text": "The player who controlled the ability that restarted the game is the starting player in the new game. The new game starts like a game normally does: Each player shuffles their deck (except the cards left in exile by Karn's ability). Each player's life total becomes 20 (or the starting life total for whatever format you're playing). Players draw a hand of seven cards. Players may take mulligans. Players may take actions based on cards in their opening hands, such as those of Leylines."}, {"date": "2020-08-07", "text": "Karn's first and third abilities are linked. Similarly, Karn's second and third abilities are linked. Only non-Aura permanent cards exiled by either of Karn's first two abilities will remain in exile when the game restarts."}, {"date": "2020-08-07", "text": "After the pregame procedure is complete but before the new game's first turn, Karn's ability finishes resolving and the cards left in exile are put onto the battlefield. If this causes any triggered abilities to trigger, those abilities are put onto the stack at the beginning of the first upkeep step."}, {"date": "2020-08-07", "text": "Permanents put onto the battlefield due to Karn's ability will have been under the starting controller's control continuously since the beginning of that player's first turn. Creatures among them can attack and their activated abilities with {T} in the cost can be activated."}, {"date": "2020-08-07", "text": "Any permanents put onto the battlefield with Karn's ability that entered the battlefield tapped will untap during their controller's first untap step."}, {"date": "2020-08-07", "text": "No actions taken in the game that was restarted apply to the new game. For example, if you were dealt damage by Stigma Lasher in the original game, the effect that states you can't gain life doesn't carry over to the new game."}, {"date": "2020-08-07", "text": "Players won't have any counters or emblems they had in the original game."}, {"date": "2020-08-07", "text": "In a multiplayer game, any player who left the game before it was restarted with Karn's ability won't be involved in the new game."}, {"date": "2020-08-07", "text": "If a player leaves the game, all cards that player owns leave as well. If you leave the game, the permanents you control from Karn's ability are exiled."}, {"date": "2020-08-07", "text": "In a Commander game, each player puts their commander into the command zone before shuffling their deck, unless it was exiled with Karn. In that case, the commander remains in exile and will be put onto the battlefield when Karn's ability finishes resolving."}, {"date": "2020-08-07", "text": "The number of times a player has cast their commander from the command zone resets to zero. The amount of combat damage dealt to players by each commander is reset to 0."}], "securityStamp": "oval", "setCode": "UMA", "subtypes": ["Karn"], "supertypes": ["Legendary"], "text": "[+4]: Target player exiles a card from their hand.\n[−3]: Exile target permanent.\n[−14]: Restart the game, leaving in exile all non-Aura permanent cards exiled with Karn Liberated. Then put those cards onto the battlefield under your control.", "type": "Legendary Planeswalker — Karn", "types": ["Planeswalker"], "uuid": "351d222e-eb1d-5d2d-9fcf-941df021e2ba"}