{"artist": "Wayne England", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 7353, "finishes": ["foil"], "foreignData": [], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "255256", "mtgjsonV4Id": "5968f677-33be-5910-baf7-34415cf31b38", "scryfallId": "a30390cc-d5f5-442f-b387-0242eb768ede", "scryfallIllustrationId": "bdd83e8a-28ca-4c83-a30d-4916b8bfe99f", "scryfallOracleId": "b3122a15-c7ab-40f1-9632-f5fbc4484c59", "tcgplayerProductId": "275377"}, "isReprint": true, "isStarter": true, "keywords": ["Cumulative upkeep"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}{R}", "manaValue": 4.0, "name": "Karplusan Minotaur", "number": "10", "power": "3", "printings": ["CSP", "PHED"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/4911a4f708cd279b", "tcgplayer": "https://mtgjson.com/links/1db2c573e37ee741"}, "rarity": "rare", "rulings": [{"date": "2006-07-15", "text": "The coin flip rules have changed. You now win or lose a flip only if *you* flipped the coin. If your opponent loses a flip, that no longer means that you win that flip. Only coin flips caused by cards that say “win” and/or “lose” anywhere on them have a winner or loser."}, {"date": "2006-07-15", "text": "If a spell or ability uses a coin flip to determine what happens on a heads result versus a tails result, the flipping player doesn’t call “heads” or “tails.” Such flips have no winner or loser."}, {"date": "2006-07-15", "text": "When Karplusan Minotaur’s cumulative upkeep ability resolves, you either flip a number of coins equal to the number of age counters on it, or you sacrifice it. Once you start to flip, you can’t stop; you must continue until all flips are made. If you flip, you call heads or tails for each flip. Each time you’re right, the Minotaur’s second ability triggers. Each time you’re wrong, the Minotaur’s third ability triggers. The triggers wait until after you’re done flipping, then they all go on the stack in whatever order you choose. Each may have a different target."}, {"date": "2006-07-15", "text": "The Minotaur’s last two abilities will trigger whenever you win or lose any coin flip. For example, if you cast Stitch in Time, one of the Minotaur’s abilities will trigger."}], "setCode": "PHED", "subtypes": ["Minotaur", "Warrior"], "supertypes": [], "text": "Cumulative upkeep—Flip a coin. (At the beginning of your upkeep, put an age counter on this permanent, then sacrifice it unless you pay its upkeep cost for each age counter on it.)\nWhenever you win a coin flip, Karplusan Minotaur deals 1 damage to any target.\nWhenever you lose a coin flip, Karplusan Minotaur deals 1 damage to any target of an opponent's choice.", "toughness": "3", "type": "Creature — Minotaur Warrior", "types": ["Creature"], "uuid": "d228e0d7-08a5-527c-8e27-2560ef5ecb6e"}