{"artist": "Pete Venters", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 23002, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 187514, "name": "Katharischer Kreischer", "text": "Fliegend\nExhumieren {2}{U} ({2}{U}: Bringe diese Karte aus deinem Friedhof ins Spiel zurück. Sie hat Eile. Entferne sie am Ende des Zuges oder falls sie das Spiel verlassen würde ganz aus dem Spiel. Spiele Exhumieren nur wie eine Hexerei.)", "type": "Kreatur — Vogel, Soldat"}, {"language": "Spanish", "multiverseId": 187763, "name": "Chirriante kathari", "text": "Vuela.\nDesenterrar {2}{U}. ({2}{U}: Regresa esta carta de tu cementerio al juego. Gana la habilidad de prisa. Remuévela del juego al final del turno o si fuera a dejar el juego. Desentierra sólo como un conjuro.)", "type": "Criatura — Soldado ave"}, {"language": "French", "multiverseId": 188510, "name": "Kathari grinçant", "text": "Vol\nExhumation {2}{U} ({2}{U} : Renvoyez en jeu cette carte depuis votre cimetière. Elle acquiert la célérité. Retirez-la de la partie à la fin du tour ou si elle devait quitter le jeu. N'exhumez que lorsque vous pourriez jouer un rituel.)", "type": "Créature : oiseau et soldat"}, {"language": "Italian", "multiverseId": 188261, "name": "Urlatore Kathari", "text": "Volare\nDissotterrare {2}{U} ({2}{U}: Rimetti in gioco questa carta dal tuo cimitero. Ha rapidità. Rimuovila dal gioco alla fine del turno o se sta per lasciare il gioco. Dissotterra solo quando potresti giocare una stregoneria.)", "type": "Creatura — Uccello Soldato"}, {"language": "Japanese", "multiverseId": 187016, "name": "カターリの金切り声上げ", "text": "飛行\n蘇生 {2}{U} ({2}{U}：このカードをあなたの墓地から場に戻す。 それは速攻を得る。 ターン終了時かそれが場を離れる場合にそれをゲームから取り除く。 蘇生はソーサリーとしてのみ行う。）", "type": "クリーチャー — 鳥・兵士"}, {"language": "Portuguese (Brazil)", "multiverseId": 188012, "name": "Guinchador Kathari", "text": "Voar\nDesenterrar {2}{U} ({2}{U}: Devolva este card de seu cemitério para o jogo. Ele ganha ímpeto. Remova-o do jogo no final do turno ou se ele for deixar o jogo. Use desenterrar somente como um feitiço.)", "type": "Criatura — Ave Soldado"}, {"language": "Russian", "multiverseId": 188759, "name": "Крикун Катари", "text": "Полет\nОткопать {2}{U} ({2}{U}: верните эту карту из вашего кладбища в игру. Она получает Ускорение. Удалите ее из игры в конце хода, или если она должна покинуть игру. Откапывайте только как волшебство.)", "type": "Существо — Птица Солдат"}, {"language": "Chinese Simplified", "multiverseId": 187265, "name": "尖鸣卡刹立", "text": "飞行\n破坟{2}{U} （{2}{U}：将此牌从你的坟墓场移回场上。 它获得敏捷。 于它将离场时，或在回合结束时，将它移出对战。 破坟的时机视同法术。）", "type": "生物～鸟／士兵"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "125997", "cardKingdomId": "125758", "cardsphereId": "42459", "mcmId": "19818", "mcmMetaId": "10132", "mtgjsonV4Id": "31378b87-6ae3-5d65-8a4e-d20568f253f9", "mtgoFoilId": "30910", "mtgoId": "30909", "multiverseId": "174837", "scryfallId": "150cf865-79e2-4f74-a872-44e1e5bc73c4", "scryfallIllustrationId": "e394e6cd-6e3f-481a-86b3-210885c6bc02", "scryfallOracleId": "fb51bafe-5a70-4910-a42e-ef75d9dd2f0a", "tcgplayerProductId": "27712"}, "keywords": ["Flying", "Unearth"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}", "manaValue": 3.0, "name": "Kathari Screecher", "number": "47", "originalText": "Flying\nUnearth {2}{U} ({2}{U}: Return this card from your graveyard to play. It gains haste. Remove it from the game at end of turn or if it would leave play. Unearth only as a sorcery.)", "originalType": "Creature - Bird Soldier", "power": "2", "printings": ["ALA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/558265d8188c382b", "cardKingdomFoil": "https://mtgjson.com/links/0baee66e0e4041d9", "cardmarket": "https://mtgjson.com/links/b41d3d346d293eba", "tcgplayer": "https://mtgjson.com/links/3ae07e4363a92f50"}, "rarity": "common", "rulings": [{"date": "2008-10-01", "text": "If you activate a card’s unearth ability but that card is removed from your graveyard before the ability resolves, that unearth ability will resolve and do nothing."}, {"date": "2008-10-01", "text": "Activating a creature card’s unearth ability isn’t the same as casting the creature card. The unearth ability is put on the stack, but the creature card is not. Spells and abilities that interact with activated abilities (such as Stifle) will interact with unearth, but spells and abilities that interact with spells (such as Remove Soul) will not."}, {"date": "2008-10-01", "text": "At the beginning of the end step, a creature returned to the battlefield with unearth is exiled. This is a delayed triggered ability, and it can be countered by effects such as Stifle or Voidslime that counter triggered abilities. If the ability is countered, the creature will stay on the battlefield and the delayed trigger won’t trigger again. However, the replacement effect will still exile the creature when it eventually leaves the battlefield."}, {"date": "2008-10-01", "text": "Unearth grants haste to the creature that’s returned to the battlefield. However, neither of the “exile” abilities is granted to that creature. If that creature loses all its abilities, it will still be exiled at the beginning of the end step, and if it would leave the battlefield, it is still exiled instead."}, {"date": "2008-10-01", "text": "If a creature returned to the battlefield with unearth would leave the battlefield for any reason, it’s exiled instead — unless the spell or ability that’s causing the creature to leave the battlefield is actually trying to exile it! In that case, it succeeds at exiling it. If it later returns the creature card to the battlefield (as Oblivion Ring or Flickerwisp might, for example), the creature card will return to the battlefield as a new object with no relation to its previous existence. The unearth effect will no longer apply to it."}], "setCode": "ALA", "subtypes": ["Bird", "Soldier"], "supertypes": [], "text": "Flying\nUnearth {2}{U} ({2}{U}: Return this card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.)", "toughness": "2", "type": "Creature — Bird Soldier", "types": ["Creature"], "uuid": "a20e71ad-3bad-5d9f-9253-2707cc6d8d1f"}