{"artist": "Paul Bonner", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 5.0, "edhrecRank": 1505, "finishes": ["nonfoil", "foil"], "flavorText": "Warning to those who scale the cliffs without paying tribute: It's a long way down.", "foreignData": [{"flavorText": "Eine Warnung an diejenigen, die durch die Klippen klettern wollen, ohne Tribut zu zahlen: Der Weg nach unten ist lang, dauert aber nur kurz.", "language": "German", "multiverseId": 210643, "name": "Kazuul, der Tyrann der Klippen", "text": "Immer wenn eine Kreatur angreift, die ein Gegner kontrolliert, und du der verteidigende Spieler bist, bringe einen 3/3 roten Oger-Kreaturenspielstein ins Spiel, falls der Beherrscher der angreifenden Kreatur nicht {3} bezahlt.", "type": "Legendäre Kreatur — Oger, Krieger"}, {"flavorText": "Advertencia a aquellos que escalan los precipicios sin pagar el peaje: es un largo camino hacia abajo.", "language": "Spanish", "multiverseId": 211658, "name": "Kazuul, tirano de los precipicios", "text": "Siempre que una criatura que controle un oponente ataque, si eres el jugador defensor, pon en el campo de batalla una ficha de criatura Ogro roja 3/3 a menos que el controlador de esa criatura pague {3}.", "type": "Criatura legendaria — Guerrero ogro"}, {"flavorText": "Un avertissement à quiconque escaladerait les falaises sans payer son dû : la chute est longue.", "language": "French", "multiverseId": 211368, "name": "Kazuul, Tyran des Falaises", "text": "À chaque fois qu'une créature qu'un adversaire contrôle attaque, si vous êtes le joueur défenseur, mettez sur le champ de bataille un jeton de créature 3/3 rouge Ogre à moins que le contrôleur de cette créature ne paie {3}.", "type": "Créature légendaire : ogre et guerrier"}, {"flavorText": "State attenti a scalare i dirupi senza pagarne il pedaggio a chi di dovere: la discesa è lunga.", "language": "Italian", "multiverseId": 211223, "name": "Kazuul, Tiranno dei Dirupi", "text": "Ogniqualvolta una creatura controllata da un avversario attacca, se sei il giocatore in difesa, metti sul campo di battaglia una pedina creatura Ogre 3/3 rossa a meno che il controllore di quella creatura non paghi {3}.", "type": "Creatura Leggendaria — Guerriero Ogre"}, {"flavorText": "貢ぎ物を出さずに崖を登る者に警告：長い道のりになるぞ。", "language": "Japanese", "multiverseId": 210788, "name": "崖の暴君、カズール", "text": "いずれかの対戦相手がコントロールするクリーチャーが１体攻撃するたび、あなたが防御プレイヤーである場合、そのクリーチャーのコントローラーが{3}を支払わないかぎり、あなたは赤の３/３のオーガ・クリーチャー・トークンを１体戦場に出す。", "type": "伝説のクリーチャー — オーガ・戦士"}, {"flavorText": "Aviso aos que escalam os penhascos sem pagar tributo: é uma longa descida.", "language": "Portuguese (Brazil)", "multiverseId": 210933, "name": "Kazuul, Tirano dos Penhascos", "text": "Toda vez que uma criatura que um oponente controla ataca, se você for o jogador defensor, coloque no campo de batalha uma ficha de criatura vermelha 3/3 do tipo Ogre, a menos que o controlador daquela criatura pague {3}.", "type": "Criatura Lendária — Ogre Guerreiro"}, {"flavorText": "Предупреждение тем, кто взбирается на утесы и не платит дань: до подножья лететь очень далеко.", "language": "Russian", "multiverseId": 211513, "name": "Казуул, Тиран Утесов", "text": "Каждый раз когда существо под контролем оппонента атакует, если вы являетесь защищающимся игроком, положите на поле битвы одну фишку существа 3/3 красный Огр, если только контролирующий то существо игрок не заплатит {3}.", "type": "Легендарное Существо — Огр Воин"}, {"flavorText": "警告那些不付过路费就爬上山崖者：往下的路很长。", "language": "Chinese Simplified", "multiverseId": 211078, "name": "山崖暴君克卒", "text": "每当由对手操控的一个生物进行攻击时，若你是防御牌手，则除非该生物的操控者支付{3}，否则你将一个3/3红色食人魔衍生物放进战场。", "type": "传奇生物～食人魔／战士"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "130251", "cardKingdomId": "130101", "cardsphereId": "47459", "mcmId": "22196", "mcmMetaId": "11032", "mtgjsonV4Id": "5c315b4f-cd89-5dae-b3d2-bc430fa3e17d", "mtgoFoilId": "35662", "mtgoId": "35661", "multiverseId": "197145", "scryfallId": "09154170-70f5-45ca-8903-027ad04bc98b", "scryfallIllustrationId": "d8c61e7d-1890-4397-a622-b9f3e96dccff", "scryfallOracleId": "f8bf3d91-cb50-48ce-88c6-cdcb37b64b57", "tcgplayerProductId": "34390"}, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}{R}", "manaValue": 5.0, "name": "Kazuul, Tyrant of the Cliffs", "number": "84", "originalText": "Whenever a creature an opponent controls attacks, if you're the defending player, put a 3/3 red Ogre creature token onto the battlefield unless that creature's controller pays {3}.", "originalType": "Legendary Creature — Ogre Warrior", "power": "5", "printings": ["C16", "CLB", "NCC", "SCD", "WWK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/9e08e98af1367889", "cardKingdomFoil": "https://mtgjson.com/links/efaaf7ffda9a1fda", "cardmarket": "https://mtgjson.com/links/2fb2fb992ffca52f", "tcgplayer": "https://mtgjson.com/links/65e3ef078da6e385"}, "rarity": "rare", "rulings": [{"date": "2010-03-01", "text": "You're the defending player if a creature is attacking you or a planeswalker you control."}, {"date": "2010-03-01", "text": "If you're the defending player, Kazuul's ability triggers once for each creature that attacks, not just once per combat. The attacking player chooses whether to pay {3} or let you have an Ogre token each time one of those abilities resolves."}, {"date": "2010-03-01", "text": "As the ability resolves, you can't put the Ogre token onto the battlefield without explicitly giving the attacking player the option to pay {3}, even if the attacking player has forgotten about this ability."}, {"date": "2010-03-01", "text": "The ability triggers and resolves during the declare attackers step. If you put an Ogre token onto the battlefield as a result, you may block with it during that combat phase."}, {"date": "2010-03-01", "text": "If an attacking creature has a “Whenever this creature attacks” ability, that ability is put on the stack first, then Kazuul's ability is put on the stack. Although Kazuul's ability will resolve first, and potentially create an Ogre token, any target of the other ability will already have been chosen at this point, and thus could not have been the new Ogre token."}, {"date": "2010-03-01", "text": "In a multiplayer game, the ability checks whether you're the defending player for each individual attacking creature. For example, if one creature attacks you and two creatures attack another player, Kazuul's ability triggers just once."}], "setCode": "WWK", "subtypes": ["Ogre", "Warrior"], "supertypes": ["Legendary"], "text": "Whenever a creature an opponent controls attacks, if you're the defending player, create a 3/3 red Ogre creature token unless that creature's controller pays {3}.", "toughness": "4", "type": "Legendary Creature — Ogre Warrior", "types": ["Creature"], "uuid": "a0b9ffa0-87a2-517b-987d-dbad9acb2968"}