{"artist": "Zezhou Chen", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G", "U", "W"], "colors": ["G", "U", "W"], "convertedManaCost": 4.0, "edhrecRank": 6241, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameEffects": ["legendary", "nyxtouched"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "ad21ba36-1a2b-56d4-b435-6a64b55920fb", "mtgoId": "70699", "scryfallId": "530bddd1-80b0-403a-b3ab-40ace802c565", "scryfallIllustrationId": "87613ab2-b050-4bed-81d3-d086ddb17203", "scryfallOracleId": "21620bfc-8ef0-4e43-b675-d0bbad86e83d"}, "isOnlineOnly": true, "isReprint": true, "keywords": ["Bestow"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}{W}{U}", "manaValue": 4.0, "name": "Kestia, the Cultivator", "number": "70699", "originalReleaseDate": "2018-12-06", "power": "4", "printings": ["C18", "PZ2"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2018-07-13", "text": "If multiple enchanted or enchantment creatures you control attack, you draw that many cards."}, {"date": "2018-07-13", "text": "If an enchanted enchantment creature attacks, you draw only one card for it."}, {"date": "2018-07-13", "text": "The phrase “you control” applies to both “enchanted creature” and “enchantment creature.” That is, Kestia’s ability triggers when an enchanted creature you control attacks, not any player’s enchanted creature."}, {"date": "2018-07-13", "text": "Bestow is an alternative cost to cast the spell with bestow. It can’t be combined with other alternative costs, such as casting a spell “without paying its mana cost.”"}, {"date": "2018-07-13", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a bestow cost) you’re paying, add any cost increases, then apply any cost reductions. The converted mana cost of the spell remains unchanged, no matter what the total cost to cast it was."}, {"date": "2018-07-13", "text": "A spell with bestow is either a creature spell or an Aura spell. It’s never both. Similarly, a permanent with bestow is either a creature or an Aura, but not both."}, {"date": "2018-07-13", "text": "Unlike other Aura spells, an Aura spell with bestow still resolves if its target is illegal. Instead of entering the battlefield as an Aura, the effect making it an Aura spell ends, it loses enchant creature, and it resolves and enters the battlefield as an enchantment creature."}, {"date": "2018-07-13", "text": "Unlike other Auras, an Aura with bestow isn’t put into its owner’s graveyard if the enchanted creature leaves the battlefield or becomes an illegal creature for the Aura to enchant. Rather, the effect making it an Aura ends, it loses enchant creature, and it remains on the battlefield as an enchantment creature. It can attack (and its abilities can be activated, if it has any) on the turn it becomes unattached if it’s been under your control continuously, even as an Aura, since your most recent turn began."}, {"date": "2018-07-13", "text": "If a permanent with bestow enters the battlefield by any method other than being cast, it will be an enchantment creature. You can’t choose to pay the bestow cost and have it become an Aura."}, {"date": "2018-07-13", "text": "Auras attached to a creature don’t become tapped when the creature becomes tapped. Except in some rare cases, an Aura with bestow remains untapped when it becomes unattached and becomes a creature."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": ["Nymph"], "supertypes": ["Legendary"], "text": "Bestow {3}{G}{W}{U} (If you cast this card for its bestow cost, it's an Aura spell with enchant creature. It becomes a creature again if it's not attached to a creature.)\nEnchanted creature gets +4/+4.\nWhenever an enchanted creature or enchantment creature you control attacks, draw a card.", "toughness": "4", "type": "Legendary Enchantment Creature — Nymph", "types": ["Enchantment", "Creature"], "uuid": "f08d3846-e848-50c4-b636-93801841e134"}