{"artist": "Karl Kopinski", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B", "G", "U"], "colors": ["B", "G", "U"], "convertedManaCost": 6.0, "edhrecRank": 19381, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "200404", "cardsphereId": "37288", "mcmId": "269689", "mtgjsonV4Id": "cc4f6e30-7789-5128-9602-dee36fc255b1", "scryfallId": "84434d6d-7649-4562-8427-e9de5af43257", "scryfallIllustrationId": "63d56895-2396-4f70-8e01-c158af88d145", "scryfallOracleId": "7e4cbfd1-2393-4643-bc05-022d06b30210", "tcgplayerProductId": "93366"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}{G}{U}", "manaValue": 6.0, "name": "Kheru Lich Lord", "number": "182s", "power": "4", "printings": ["KTK", "PKTK"], "promoTypes": ["setpromo", "datestamped", "prerelease"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/8f792a3178a8aebb", "tcgplayer": "https://mtgjson.com/links/551d92661c5450ab"}, "rarity": "rare", "rulings": [{"date": "2014-09-20", "text": "You decide whether to pay {2}{B} as the ability resolves."}, {"date": "2014-09-20", "text": "The creature card returned to the battlefield is chosen at random as the ability resolves. If any player responds to the ability, that player won’t yet know what card will be returned."}, {"date": "2014-09-20", "text": "Because the ability doesn’t target any creature card, any creature card (including Kheru Lich Lord itself) put into the graveyard in response to that ability may be returned to the battlefield."}, {"date": "2014-09-20", "text": "The ability that exiles the card at the beginning of your next end step is a delayed triggered ability. If the delayed triggered ability is countered, the creature will stay on the battlefield and the ability won’t trigger again. However, the replacement effect will still exile the creature when it eventually leaves the battlefield."}, {"date": "2014-09-20", "text": "Kheru Lich Lord grants flying, trample, and haste to the creature that’s returned to the battlefield. However, neither of the “exile” abilities is granted to that creature. If that creature loses all its abilities, it will still be exiled at the beginning of your next end step, and if it would leave the battlefield, it is still exiled instead."}, {"date": "2014-09-20", "text": "If a creature card returned to the battlefield with Kheru Lich Lord would leave the battlefield for any reason, it’s exiled instead. However, if that creature is already being exiled, then the replacement effect won’t apply. If the spell or ability that exiles it later returns it to the battlefield (as Suspension Field might, for example), the creature card will return to the battlefield as a new object with no relation to its previous existence. The effects from Kheru Lich Lord will no longer apply to it."}, {"date": "2014-09-20", "text": "The exiled creature is never put into the graveyard. Any abilities the creature has that trigger when it dies won’t trigger."}], "securityStamp": "oval", "setCode": "PKTK", "subtypes": ["Zombie", "Wizard"], "supertypes": [], "text": "At the beginning of your upkeep, you may pay {2}{B}. If you do, return a creature card at random from your graveyard to the battlefield. It gains flying, trample, and haste. Exile that card at the beginning of your next end step. If it would leave the battlefield, exile it instead of putting it anywhere else.", "toughness": "4", "type": "Creature — Zombie Wizard", "types": ["Creature"], "uuid": "cd008092-e2ce-57b1-be71-533f13e59de6", "watermark": "sultai"}