{"artist": "Clint Cearley", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 5607, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 387388, "name": "Kheru-Zauberdiebin", "text": "Morph {4}{U}{U} (Du kannst diese Karte verdeckt für {3} als eine 2/2 Kreatur wirken. Decke sie zu einem beliebigen Zeitpunkt für ihre Morph-Kosten auf.)\nWenn die Kheru-Zauberdiebin aufgedeckt wird, neutralisiere einen Zauberspruch deiner Wahl. Falls der Zauberspruch auf diese Weise neutralisiert wird, schicke ihn ins Exil, anstatt ihn auf den Friedhof seines Besitzers zu legen. Du kannst diese Karte wirken, ohne ihre Manakosten zu bezahlen, solange sie im Exil bleibt.", "type": "Kreatur — Naga, Zauberer"}, {"language": "Spanish", "multiverseId": 389271, "name": "Robahechizos de Kheru", "text": "Metamorfosis {4}{U}{U}. (Puedes lanzar esta carta boca abajo como una criatura 2/2 pagando {3}. Ponla boca arriba en cualquier momento pagando su coste de metamorfosis.)\nCuando la Robahechizos de Kheru se ponga boca arriba, contrarresta el hechizo objetivo. Si ese hechizo es contrarrestado de esta manera, exílialo en vez de ponerlo en el cementerio de su propietario. Puedes lanzar esa carta sin pagar su coste de maná mientras permanezca exiliada.", "type": "Criatura — Hechicero naga"}, {"language": "French", "multiverseId": 387657, "name": "Fauchesort de Kheru", "text": "Mue {4}{U}{U} (Vous pouvez lancer cette carte face cachée comme une créature 2/2 pour {3}. Retournez-la à tout moment pour son coût de mue.)\nQuand la Fauchesort de Kheru est retournée face visible, contrecarrez le sort ciblé. Si ce sort est contrecarré de cette manière, exilez-le à la place de le mettre dans le cimetière de son propriétaire. Vous pouvez lancer cette carte sans payer son coût de mana tant qu'elle reste exilée.", "type": "Créature : naga et sorcier"}, {"language": "Italian", "multiverseId": 387926, "name": "Rubamagie di Kheru", "text": "Metamorfosi {4}{U}{U} (Puoi lanciare questa carta a faccia in giù come una creatura 2/2 pagando {3}. Girala a faccia in su in qualsiasi momento pagando il suo costo di metamorfosi.)\nQuando la Rubamagie di Kheru viene girata a faccia in su, neutralizza una magia bersaglio. Se quella magia è neutralizzata in questo modo, esiliala invece di metterla nel cimitero del suo proprietario. Puoi lanciare quella carta senza pagare il suo costo di mana fintanto che rimane esiliata.", "type": "Creatura — Mago Naga"}, {"language": "Japanese", "multiverseId": 388195, "name": "ケルゥの呪文奪い", "text": "変異{4}{U}{U}（あなたはこのカードを、{3}で２/２クリーチャーとして裏向きに唱えてもよい。これの変異コストで、これをいつでも表向きにしてよい。）\nケルゥの呪文奪いが表向きになったとき、呪文１つを対象とし、それを打ち消す。その呪文がこれにより打ち消されたなら、それをオーナーの墓地に置く代わりに追放する。そのカードが追放されているかぎり、あなたはそのカードをそのマナ・コストを支払うことなく唱えてもよい。", "type": "クリーチャー — ナーガ・ウィザード"}, {"language": "Korean", "multiverseId": 388464, "name": "케루 주문도둑", "text": "변이 {4}{U}{U} (당신은 {3}을 지불해서 이 카드를 뒷면 상태의 2/2 생물로 발동할 수 있다. 언제든지 변이 비용을 지불하고 앞면이 보이도록 뒤집을 수 있다.)\n케루 주문도둑이 앞면으로 뒤집히면, 주문을 목표로 정한다. 그 주문을 무효화한다. 이렇게 그 주문이 무효화되면 그 카드를 소유자의 무덤에 넣는 대신 추방한다. 그 카드가 추방되어있는 한, 당신은 마나 비용을 지불하지 않고 그 카드를 발동할 수 있다.", "type": "생물 — 나가 마법사"}, {"language": "Portuguese (Brazil)", "multiverseId": 388733, "name": "Ladra de Feitiços de Kheru", "text": "Metamorfose {4}{U}{U} (Você pode conjurar este card com a face voltada para baixo como uma criatura 2/2 por {3}. Volte sua face para cima a qualquer momento pagando seu custo de metamorfose.)\nQuando Ladra de Feitiços de Kheru for voltada para cima, anule a mágica alvo. Se aquela mágica for anulada dessa maneira, exile-a em vez de colocá-la no cemitério de seu dono. Você poderá conjurar aquele card sem pagar seu custo de mana enquanto ele permanecer exilado.", "type": "Criatura — Naga Mago"}, {"language": "Russian", "multiverseId": 389002, "name": "Воровка Заклинаний из Керу", "text": "Оборотень {4}{U}{U} (Вы можете разыграть эту карту рубашкой вверх как существо 2/2 за {3}. Переверните ее рубашкой вниз в любой момент за ее стоимость Оборотня.)\nКогда Воровка Заклинаний из Керу переворачивается рубашкой вниз, отмените целевое заклинание. Если то заклинание отменяется таким образом, изгоните его вместо того, чтобы положить его на кладбище его владельца. Вы можете разыграть ту карту заклинания без уплаты ее мана-стоимости, пока она остается в изгнании.", "type": "Существо — Нага Чародей"}, {"language": "Chinese Simplified", "multiverseId": 386850, "name": "赫鲁窃咒者", "text": "变身{4}{U}{U}（你可牌面朝下地施放此牌并支付{3}，将其当成2/2生物。可随时支付其变身费用使其翻回正面。）\n当赫鲁窃咒者翻回正面时，反击目标咒语。如果以此法反击该咒语，则改为将其放逐，而非置入拥有者的坟墓场。于该牌持续被放逐期间，你可以施放它且不需支付其法术力费用。", "type": "生物～那伽／法术师"}, {"language": "Chinese Traditional", "multiverseId": 387119, "name": "赫魯竊咒者", "text": "變身{4}{U}{U}（你可牌面朝下地施放此牌並支付{3}，將其當成2/2生物。可隨時支付其變身費用使其翻回正面。）\n當赫魯竊咒者翻回正面時，反擊目標咒語。如果以此法反擊該咒語，則改為將其放逐，而非置入擁有者的墳墓場。於該牌持續被放逐期間，你可以施放它且不需支付其魔法力費用。", "type": "生物～那伽／魔法師"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "196241", "cardKingdomId": "195745", "cardsphereId": "23555", "mcmId": "269189", "mcmMetaId": "210212", "mtgjsonV4Id": "d89e9f88-ebf0-5cdc-86d9-9b5793e51ea4", "mtgoFoilId": "54245", "mtgoId": "54244", "multiverseId": "386581", "scryfallId": "0e15117f-f05e-4c5d-9ef5-98f21f4d7529", "scryfallIllustrationId": "7922875f-c6d5-43e7-8e3a-daf3c20031d0", "scryfallOracleId": "c01411e0-77b2-4e65-a369-5dbe13745769", "tcgplayerProductId": "92951"}, "keywords": ["Morph"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Kheru Spellsnatcher", "number": "45", "originalText": "Morph {4}{U}{U} (You may cast this card face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.)\nWhen Kheru Spellsnatcher is turned face up, counter target spell. If that spell is countered this way, exile it instead of putting it into its owner's graveyard. You may cast that card without paying its mana cost for as long as it remains exiled.", "originalType": "Creature — Naga Wizard", "power": "3", "printings": ["C19", "KTK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/82b941f0b52104a8", "cardKingdomFoil": "https://mtgjson.com/links/34c604410c57bcea", "cardmarket": "https://mtgjson.com/links/03b7c05dd9dcd5ef", "tcgplayer": "https://mtgjson.com/links/99fe33927da8408e"}, "rarity": "rare", "rulings": [{"date": "2014-09-20", "text": "You can target a spell you control with Kheru Spellsnatcher’s triggered ability. This will give you the ability to cast the card later without paying its mana cost."}, {"date": "2014-09-20", "text": "Because you’re already casting the card using an alternative cost (by casting it without paying its mana cost), you can’t pay any other alternative costs for the card, including casting it face down using the morph ability. You can pay additional costs, such as kicker costs. If the card has any mandatory additional costs, you must pay those."}, {"date": "2014-09-20", "text": "If the card has {X} in its mana cost, you must choose 0 as the value for X when casting it."}, {"date": "2014-09-20", "text": "Morph lets you cast a card face down by paying {3}, and lets you turn the face-down permanent face up any time you have priority by paying its morph cost."}, {"date": "2014-09-20", "text": "The face-down spell has no mana cost and has a converted mana cost of 0. When you cast a face-down spell, put it on the stack face down so no other player knows what it is, and pay {3}. This is an alternative cost."}, {"date": "2014-09-20", "text": "When the spell resolves, it enters the battlefield as a 2/2 creature with no name, mana cost, creature types, or abilities. It’s colorless and has a converted mana cost of 0. Other effects that apply to the creature can still grant it any of these characteristics."}, {"date": "2014-09-20", "text": "Any time you have priority, you may turn the face-down creature face up by revealing what its morph cost is and paying that cost. This is a special action. It doesn’t use the stack and can’t be responded to. Only a face-down permanent can be turned face up this way; a face-down spell cannot."}, {"date": "2014-09-20", "text": "Because the permanent is on the battlefield both before and after it’s turned face up, turning a permanent face up doesn’t cause any enters-the-battlefield abilities to trigger."}, {"date": "2014-09-20", "text": "A permanent that turns face up or face down changes characteristics but is otherwise the same permanent. Spells and abilities that were targeting that permanent, as well as Auras and Equipment that were attached to the permanent, aren’t affected."}, {"date": "2014-09-20", "text": "At any time, you can look at a face-down spell or permanent you control. You can’t look at face-down spells or permanents you don’t control unless an effect instructs you to do so."}, {"date": "2014-09-20", "text": "You must ensure that your face-down spells and permanents can easily be differentiated from each other. You’re not allowed to mix up the cards that represent them on the battlefield in order to confuse other players. The order they entered the battlefield should remain clear. Common methods for doing this include using markers or dice, or simply placing them in order on the battlefield."}, {"date": "2014-09-20", "text": "If a face-down permanent leaves the battlefield, you must reveal it. You must also reveal all face-down spells and permanents you control if you leave the game or if the game ends."}], "securityStamp": "oval", "setCode": "KTK", "subtypes": ["Naga", "Wizard"], "supertypes": [], "text": "Morph {4}{U}{U} (You may cast this card face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.)\nWhen Kheru Spellsnatcher is turned face up, counter target spell. If that spell is countered this way, exile it instead of putting it into its owner's graveyard. You may cast that card without paying its mana cost for as long as it remains exiled.", "toughness": "3", "type": "Creature — Naga Wizard", "types": ["Creature"], "uuid": "d519d779-eae0-5e00-a55b-2a7b6851f247", "watermark": "sultai"}