{"artist": "Dany Orizio", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 16725, "finishes": ["nonfoil", "foil"], "flavorText": "\"Start knockin' heads, boys, and don't stop 'til the ragamuffyn sings!\"", "foreignData": [{"flavorText": "„Fangt an, Köpfe einzuschlagen, Jungs — und hört erst auf, wenn die Gassenjungen pfeifen.\"", "language": "German", "multiverseId": 123023, "name": "Das Blutbad anheizen", "text": "Wirf eine zufällig bestimmte Karte aus deiner Hand ab. Falls du dies tust, fügt Das Blutbad anheizen allen Kreaturen Schadenspunkte in Höhe der umgewandelten Manakosten dieser Karte zu. Du kannst diesen Vorgang beliebig oft wiederholen.", "type": "Hexerei"}, {"flavorText": "\"¡Vamos chicos, empiecen a aplastar cabezas y no paren hasta que el zaparrastroso cante\"", "language": "Spanish", "multiverseId": 123923, "name": "Avivar la masacre", "text": "Descarta una carta al azar. Si lo haces, Avivar la masacre hace daño a cada criatura igual al coste de maná convertido de esa carta. Puedes repetir este proceso tantas veces como quieras.", "type": "Conjuro"}, {"flavorText": "« Commencez à frapper, et continuez jusqu'à ce que le marmouset se décide à chanter »", "language": "French", "multiverseId": 122843, "name": "Embrasement du carnage", "text": "Défaussez-vous d'une carte au hasard. Si vous faites ainsi, l'Embrasement du carnage inflige à chaque créature un nombre de blessures égal au coût converti de mana de cette carte. Vous pouvez répéter ce processus autant de fois que vous le souhaitez.", "type": "Rituel"}, {"flavorText": "\"Cominciate a schiantare teste, ragazzi, e non fermatevi finché la cenciosa non comincia a cantare\"", "language": "Italian", "multiverseId": 123203, "name": "Incitare alla Carneficina", "text": "Scarta una carta a caso. Se lo fai, Incitare alla Carneficina infligge un ammontare di danni pari al costo di mana convertito di quella carta a ogni creatura. Puoi ripetere questo processo quante volte vuoi.", "type": "Stregoneria"}, {"flavorText": "頭を叩くんだ、坊主。ぼろ娘が歌うまで続けるんだ！", "language": "Japanese", "multiverseId": 123383, "name": "殺戮の焚きつけ", "text": "カードを無作為に１枚捨てる。 そうした場合、殺戮の焚きつけはそのカードの点数で見たマナ・コストに等しい点数のダメージを各クリーチャーに与える。 あなたはこの手順を望む回数だけ繰り返してもよい。", "type": "ソーサリー"}, {"flavorText": "\"Comecem a golpear, rapazes, e não parem até que a moleca maltrapilha comece a cantar\"", "language": "Portuguese (Brazil)", "multiverseId": 123563, "name": "Inflamar a Carnificina", "text": "Descarte um card aleatoriamente. Se o fizer, Inflamar a Carnificina causará dano igual ao custo de mana convertido daquele card a cada criatura. Você pode repetir esse processo quantas vezes quiser.", "type": "Feitiço"}, {"flavorText": "\"Давайте, начинайте расшибать головы, парни, и не бросайте, пока не завопит беспризорница\"", "language": "Russian", "multiverseId": 123743, "name": "Разжигание резни", "text": "Случайным образом сбросьте карту. Если вы это делаете, Разжигание резни наносит каждому существу повреждения, равные общей мановой стоимости этой карты. Этот процесс можно повторять сколько угодно раз.", "type": "Волшебство"}, {"flavorText": "「大家开始砸人头吧，在僵小鬼唱歌前别停手！」", "language": "Chinese Simplified", "multiverseId": 122663, "name": "煽动屠杀", "text": "随机弃一张牌。 若你如此作，煽动屠杀对每个生物造成伤害，其数量等同于该牌的总法术力费用。 你可将此流程重复进行任意次数。", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "120373", "cardKingdomId": "120193", "cardsphereId": "13023", "mcmId": "13022", "mcmMetaId": "7606", "mtgjsonV4Id": "ad98fa85-6ace-5149-b54b-667b0cf1dc57", "mtgoFoilId": "24234", "mtgoId": "24233", "multiverseId": "107446", "scryfallId": "4b5dfa91-8f93-41b7-95e9-3374550f1617", "scryfallIllustrationId": "101a6a52-11b7-4d56-bdb8-1edd134adaa4", "scryfallOracleId": "6562f141-7f57-4218-b873-f2fc0211e124", "tcgplayerProductId": "13886"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}{R}", "manaValue": 3.0, "name": "Kindle the Carnage", "number": "66", "originalText": "Discard a card at random. If you do, Kindle the Carnage deals damage equal to that card's converted mana cost to each creature. You may repeat this process any number of times.", "originalType": "Sorcery", "printings": ["DIS"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/a6af695aeb1afe3b", "cardKingdomFoil": "https://mtgjson.com/links/1c9eba5bd6f80d61", "cardmarket": "https://mtgjson.com/links/b3736570e101914b", "tcgplayer": "https://mtgjson.com/links/771faf78a3705753"}, "rarity": "uncommon", "rulings": [{"date": "2006-05-01", "text": "You decide whether to repeat the process after each iteration. In other words, you discard a card, see what it is, Kindle the Carnage deals damage, then you decide whether to continue. If so, you discard a card, see what it is, Kindle the Carnage deals damage, then you decide whether to continue, and so on."}, {"date": "2006-05-01", "text": "Any damage prevention or regeneration abilities must be activated before Kindle the Carnage starts resolving in order to have any effect. You can’t wait to see which (if any) cards are discarded."}, {"date": "2006-05-01", "text": "A creature that’s been dealt lethal damage by an iteration of this effect will remain on the battlefield and be dealt more damage by any further iterations. After you stop, all creatures that have been dealt lethal damage are put into their owners’ graveyards at the same time."}, {"date": "2006-05-01", "text": "All the damage has the same source. However, each iteration of this process is a separate instance of damage. An effect that prevents damage the “next time” this card would deal it will prevent damage from only one iteration."}, {"date": "2006-05-01", "text": "A single regeneration shield is sufficient to save a particular creature, no matter how many instances of damage are on it."}], "setCode": "DIS", "subtypes": [], "supertypes": [], "text": "Discard a card at random. If you do, Kindle the Carnage deals damage equal to that card's mana value to each creature. You may repeat this process any number of times.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "93b8a058-b34d-54a4-8a51-83d45fc503d6"}