{"artist": "Dan Scott", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 6.0, "edhrecRank": 4313, "finishes": ["nonfoil", "foil"], "flavorText": "For goblins, quantity is quality.", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "e094434f-eb9b-5b2b-8a15-9fb48a4be1c5", "mtgoId": "65721", "scryfallId": "67cd1c43-a85d-44f9-9e25-cf4aeb0367af", "scryfallIllustrationId": "e8fc979b-82d1-4caf-81bc-373ebedcf863", "scryfallOracleId": "eb0b5b5f-54d3-49c6-9ad8-d44a5551acdb"}, "isOnlineOnly": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{R}{R}", "manaValue": 6.0, "name": "Kindred Charge", "number": "65721", "printings": ["C17", "PZ2"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2017-08-25", "text": "The tokens copy exactly what was printed on the creatures and nothing else (unless one of those creatures was copying something else or was a token; see below). They don’t copy whether that creature was tapped or untapped, whether it had any counters on it or Auras and/or Equipment attached to it, or any non-copy effects that changed its power, toughness, types, color, and so on."}, {"date": "2017-08-25", "text": "If a copied creature had {X} in its mana cost, X is 0."}, {"date": "2017-08-25", "text": "If a copied creature was copying something else, the tokens enter the battlefield as whatever that creature was copying."}, {"date": "2017-08-25", "text": "If a copied creature is a token, the token created by Kindred Charge copies the original characteristics of that token as stated by the effect that put it onto the battlefield."}, {"date": "2017-08-25", "text": "Any enters-the-battlefield abilities of the copied creatures will trigger when the tokens enter the battlefield. Any “As [this creature] enters the battlefield” or “[This creature] enters the battlefield with” abilities of the copied creature will also work."}, {"date": "2017-08-25", "text": "All of the tokens enter the battlefield at the same time. Any triggered abilities they have will see each other entering the battlefield."}, {"date": "2017-08-25", "text": "If a copied creature is legendary, any triggered abilities it has will trigger if appropriate before the “legend rule” causes one of those legendary creatures to be put into its owner’s graveyard. Those abilities will be put on the stack after the “legend rule” is applied."}, {"date": "2017-08-25", "text": "You must choose an existing creature type, such as Vampire or Cat. Card types such as “artifact” can’t be chosen."}, {"date": "2017-08-25", "text": "You can’t choose multiple creature types, such as “Cat Warrior.” A Cat Warrior is both a Cat and a Warrior. It’s affected by anything that affects either type and unaffected by things that affect non-Cat or non-Warrior creatures."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": [], "supertypes": [], "text": "Choose a creature type. For each creature you control of the chosen type, create a token that's a copy of that creature. Those tokens gain haste. Exile them at the beginning of the next end step.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "1257eae1-f39c-5dba-9f9a-1604f7ea4ea1"}