{"artist": "Greg Staples", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 5049, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 380938, "name": "König Makar der Goldverfluchte", "text": "Inspiriert — Immer wenn König Makar der Goldverfluchte enttappt wird, kannst du eine Kreatur deiner Wahl ins Exil schicken. Falls du dies tust, bringe einen farblosen Artefaktspielstein namens Gold ins Spiel. Er hat „Opfere dieses Artefakt: Erhöhe deinen Manavorrat um ein Mana einer beliebigen Farbe.\"", "type": "Legendäre Kreatur — Mensch"}, {"language": "Spanish", "multiverseId": 382093, "name": "Rey Macar, el maldecido áureo", "text": "Inspiración — Siempre que el Rey Macar, el maldecido áureo se enderece, puedes exiliar la criatura objetivo. Si lo haces, pon en el campo de batalla una ficha de artefacto incolora llamada Oro. Tiene \"Sacrificar este artefacto: Agrega un maná de cualquier color a tu reserva de maná\".", "type": "Criatura legendaria — Humano"}, {"language": "French", "multiverseId": 381103, "name": "Macar, le roi au toucher d'or", "text": "Inspiration — À chaque fois que Macar, le roi au toucher d'or devient dégagé, vous pouvez exiler une créature ciblée. Si vous faites ainsi, mettez sur le champ de bataille un jeton d'artefact incolore appelé Or. Il a « Sacrifiez cet artefact : Ajoutez un mana de la couleur de votre choix à votre réserve. »", "type": "Créature légendaire : humain"}, {"language": "Italian", "multiverseId": 381268, "name": "Re Macar, il Maledetto dall'Oro", "text": "Ispirazione — Ogniqualvolta Re Macar, il Maledetto dall'Oro viene STAPpato, puoi esiliare una creatura bersaglio. Se lo fai, metti sul campo di battaglia una pedina artefatto incolore chiamata Oro. Ha \"Sacrifica questo artefatto: Aggiungi un mana di un qualsiasi colore alla tua riserva di mana\".", "type": "Creatura Leggendaria — Umano"}, {"language": "Japanese", "multiverseId": 381433, "name": "黄金の呪いのマカール王", "text": "神啓 ― 黄金の呪いのマカール王がアンタップ状態になるたび、クリーチャー１体を対象とする。あなたはそれを追放してもよい。そうしたなら、「金」と言う名前の無色のアーティファクト・トークンを１つ戦場に出す。それは「このアーティファクトを生け贄に捧げる：あなたのマナ・プールに好きな色１色のマナ１点を加える。」を持つ。", "type": "伝説のクリーチャー — 人間"}, {"language": "Korean", "multiverseId": 381598, "name": "황금의 저주를 받은 왕 마카르", "text": "영감 — 황금의 저주를 받은 왕 마카르가 언탭될 때마다, 생물을 목표로 정한다. 당신은 그 생물을 추방할 수 있다. 그렇게 하면, 이름이 금인 무색 마법물체 토큰 한 개를 전장에 놓는다. 그 마법물체는 \"이 마법물체를 희생한다: 당신의 마나풀에 원하는 색의 마나 한 개를 담는다.\"라는 능력을 가진다.", "type": "전설적 생물 — 인간"}, {"language": "Portuguese (Brazil)", "multiverseId": 381763, "name": "Macar, Rei do Toque Maldito", "text": "Inspirado — Toda vez que Macar, Rei do Toque Maldito, é desvirado, você pode exilar a criatura alvo. Se fizer isso, coloque uma ficha de artefato incolor com o nome Ouro no campo de batalha. Ela tem \"Sacrifique este artefato: Adicione um mana de qualquer cor a sua reserva de mana.\"", "type": "Criatura Lendária — Humano"}, {"language": "Russian", "multiverseId": 381928, "name": "Царь Макарий, Проклятый Золотом", "text": "Одухотворение — Каждый раз, когда Царь Макарий, Проклятый Золотом становится развернутым, вы можете изгнать целевое существо. Если вы это делаете, положите на поле битвы одну фишку бесцветного артефакта с именем Золото. Она имеет способность «Пожертвуйте этот артефакт: добавьте одну ману любого цвета в ваше хранилище маны».", "type": "Легендарное Существо — Человек"}, {"language": "Chinese Simplified", "multiverseId": 380608, "name": "点金咒马卡耳王", "text": "启悟～每当点金咒马卡耳王成为未橫置时，你可以放逐目标生物。若你如此作，将一个名称为黄金的无色衍生神器放进战场。它具有「牺牲此神器：加一点任意颜色的法术力到你的法术力池中。」", "type": "传奇生物～人类"}, {"language": "Chinese Traditional", "multiverseId": 380773, "name": "點金咒馬卡耳王", "text": "啟悟～每當點金咒馬卡耳王成為未橫置時，你可以放逐目標生物。若你如此作，將一個名稱為黃金的無色衍生神器放進戰場。它具有「犧牲此神器：加一點任意顏色的魔法力到你的魔法力池中。」", "type": "傳奇生物～人類"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "194214", "cardKingdomId": "193953", "cardsphereId": "22136", "mcmId": "266622", "mcmMetaId": "209518", "mtgjsonV4Id": "01c89e31-62d7-5173-96d8-0a4c7328388f", "mtgoFoilId": "52115", "mtgoId": "52114", "multiverseId": "380443", "scryfallId": "ff5987ab-570a-426c-ae4a-a270fac6b346", "scryfallIllustrationId": "9dd16dc7-06eb-46a0-9c87-c20e2f839271", "scryfallOracleId": "1ebafd78-269a-4974-88d2-e75b44b744c2", "tcgplayerProductId": "82230"}, "keywords": ["Inspired"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}{B}", "manaValue": 4.0, "name": "King Macar, the Gold-Cursed", "number": "74", "originalText": "Inspired — Whenever King Macar, the Gold-Cursed becomes untapped, you may exile target creature. If you do, put a colorless artifact token named Gold onto the battlefield. It has \"Sacrifice this artifact: Add one mana of any color to your mana pool.\"", "originalType": "Legendary Creature — Human", "power": "2", "printings": ["JOU"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/b9f10b03ab1ee983", "cardKingdomFoil": "https://mtgjson.com/links/c6aba0d7ac49fd61", "cardmarket": "https://mtgjson.com/links/5b94029706f69e70", "tcgplayer": "https://mtgjson.com/links/cc6e8f3be8993698"}, "rarity": "rare", "rulings": [{"date": "2014-04-26", "text": "The player who controlled King Macar when its ability triggered will control the artifact token, not the player who controlled the creature that was exiled."}, {"date": "2014-04-26", "text": "Inspired abilities trigger no matter how the creature becomes untapped: by the turn-based action at the beginning of the untap step or by a spell or ability."}, {"date": "2014-04-26", "text": "If an inspired ability triggers during your untap step, the ability will be put on the stack at the beginning of your upkeep. If the ability creates one or more token creatures, those creatures won't be able to attack that turn (unless they gain haste)."}, {"date": "2014-04-26", "text": "Inspired abilities don't trigger when the creature enters the battlefield."}, {"date": "2014-04-26", "text": "If the inspired ability includes an optional cost, you decide whether to pay that cost as the ability resolves. You can do this even if the creature leaves the battlefield in response to the ability."}], "setCode": "JOU", "subtypes": ["Human", "Noble"], "supertypes": ["Legendary"], "text": "Inspired — Whenever King Macar, the Gold-Cursed becomes untapped, you may exile target creature. If you do, create a Gold token. (It's an artifact with \"Sacrifice this artifact: Add one mana of any color.\")", "toughness": "3", "type": "Legendary Creature — Human Noble", "types": ["Creature"], "uuid": "b2f58460-d5d8-57b8-93d6-3c7190354222"}