{"artist": "Victor Adame Minguez", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 7.0, "edhrecRank": 2894, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 476557, "name": "Kiora besiegt die Meeresgöttin", "text": "(Je eine Sagenmarke beim Ins-Spiel-Kommen und nach deinem Ziehsegment. Opfern nach III.)\nI — Erzeuge einen 8/8 blauen Krake-Kreaturenspielstein mit Fluchsicherheit.\nII — Tappe alle bleibenden Karten, die keine Länder sind und die ein Gegner deiner Wahl kontrolliert. Sie enttappen nicht während des nächsten Enttappsegments ihres Beherrschers.\nIII — Übernimm die Kontrolle über eine bleibende Karte deiner Wahl, die ein Gegner kontrolliert. Enttappe sie.", "type": "Verzauberung — Sage"}, {"language": "Spanish", "multiverseId": 476811, "name": "Kiora derrota a la diosa del mar", "text": "(En cuanto esta Saga entre y después de tu paso de robar, agrega un contador de sabiduría. Sacrifícala después de III.)\nI — Crea una ficha de criatura Kraken azul 8/8 con la habilidad de antimaleficio.\nII — Gira todos los permanentes que no sean tierra que controla el oponente objetivo. No se enderezan durante el próximo paso de enderezar de su controlador.\nIII — Gana el control del permanente objetivo que controla un oponente. Enderézalo.", "type": "Encantamiento — Saga"}, {"language": "French", "multiverseId": 477065, "name": "Kiora vainc la déesse de la Mer", "text": "(Au moment où cette saga arrive sur le champ de bataille et après votre étape de pioche, ajoutez un marqueur « sapience ». Sacrifiez après III.)\nI — Créez un jeton de créature 8/8 bleue Kraken avec la défense talismanique.\nII — Engagez tous les permanents non-terrain qu'un adversaire ciblé contrôle. Ils ne se dégagent pas pendant la prochaine étape de dégagement de leur contrôleur.\nIII — Acquérez le contrôle d'un permanent ciblé qu'un adversaire contrôle. Dégagez-le.", "type": "Enchantement : saga"}, {"language": "Italian", "multiverseId": 477319, "name": "Kiora Beffa la Dea del Mare", "text": "(Mentre questa Saga entra e dopo la tua sottofase di acquisizione, aggiungi un segnalino sapere. Sacrifica dopo III.)\nI — Crea una pedina creatura Kraken 8/8 blu con anti-malocchio.\nII — TAPpa tutti i permanenti non terra controllati da un avversario bersaglio. Non STAPpano durante il prossimo STAP dei rispettivi controllori.\nIII — Prendi il controllo di un permanente bersaglio controllato da un avversario. STAPpalo.", "type": "Incantesimo — Saga"}, {"language": "Japanese", "multiverseId": 477573, "name": "キオーラ、海神を打ち倒す", "text": "（この英雄譚が出た際とあなたのドロー・ステップの後に、伝承カウンターを１個加える。IIIの後に、生け贄に捧げる。）\nI ― 呪禁を持つ青の８/８のクラーケン・クリーチャー・トークンを１体生成する。\nII ― 対戦相手１人を対象とする。そのプレイヤーがコントロールしていて土地でないパーマネントをすべてタップする。それらは、そのコントローラーの次のアンタップ・ステップにアンタップしない。\nIII ― 対戦相手がコントロールしているパーマネント１つを対象とし、それのコントロールを得る。それをアンタップする。", "type": "エンチャント — 英雄譚"}, {"language": "Korean", "multiverseId": 477827, "name": "키오라가 바다신을 이기다", "text": "(이 서사시가 들어오면서 그리고 당신의 뽑기단 후에, 전승 카운터 한 개를 추가한다. III 이후에 희생한다.)\nI — 방호를 가진 8/8 청색 크라켄 생물 토큰 한 개를 만든다.\nII — 상대를 목표로 정한다. 그 플레이어가 조종하는 대지가 아닌 모든 지속물들을 탭한다. 그 지속물들은 그 조종자의 다음 언탭단에 언탭되지 않는다.\nIII — 상대가 조종하는 지속물을 목표로 정한다. 그 지속물의 조종권을 얻는다. 그 지속물을 언탭한다.", "type": "부여마법 — 서사시"}, {"language": "Portuguese (Brazil)", "multiverseId": 478081, "name": "Kiora Supera a Deusa do Mar", "text": "(Conforme esta Saga entra e após sua etapa de compra, adicione um marcador de conhecimento. Sacrifique-a após III.)\nI — Crie uma ficha de criatura azul 8/8 do tipo Kraken com resistência a magia.\nII — Vire todas as permanentes que o oponente alvo controla que não sejam terrenos. Elas não são desviradas durante a próxima etapa de desvirar de seus controladores.\nIII — Ganhe o controle da permanente alvo que um oponente controla. Desvire-a.", "type": "Encantamento — Saga"}, {"language": "Russian", "multiverseId": 478335, "name": "Киора Побеждает Богиню Моря", "text": "(При выходе этой Саги и после вашего шага взятия карты добавьте один жетон знаний. Пожертвуйте после III.)\nI — Создайте одну фишку существа 8/8 синий Кракен с Порчеустойчивостью.\nII — Поверните все не являющиеся землями перманенты под контролем целевого оппонента. Они не разворачиваются во время следующего шага разворота контролирующего их игрока.\nIII — Получите контроль над целевым перманентом под контролем оппонента. Разверните его.", "type": "Чары — Сага"}, {"language": "Chinese Simplified", "multiverseId": 478589, "name": "奇奥拉力克海神", "text": "（于此传纪进战场时及于你抓牌步骤后，加一个学问指示物。到III后牺牲之。）\nI — 派出一个8/8蓝色，具辟邪异能的巨海兽衍生生物。\nII — 横置由目标对手操控的所有非地永久物。它们于其操控者的下一个重置步骤中不能重置。\nIII — 获得目标由对手操控的永久物之操控权。将之重置。", "type": "结界 ～传纪"}, {"language": "Chinese Traditional", "multiverseId": 478843, "name": "奇奧拉力克海神", "text": "（於此傳紀進戰場時及於你抽牌步驟後，加一個學問指示物。到III後犧牲之。）\nI — 派出一個8/8藍色，具辟邪異能的巨海獸衍生生物。\nII — 橫置由目標對手操控的所有非地永久物。它們於其操控者的下一個重置步驟中不能重置。\nIII — 獲得目標由對手操控的永久物之操控權。將之重置。", "type": "結界 ～傳紀"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "231149", "cardKingdomId": "230850", "cardsphereId": "65193", "mcmId": "431014", "mcmMetaId": "291354", "mtgArenaId": "70563", "mtgjsonV4Id": "b73ca04a-f8d6-5e78-baec-b63dc5c6f4f0", "mtgoId": "79228", "multiverseId": "476303", "scryfallId": "2b604451-4f6c-4cfa-8d3a-01f18d01d88f", "scryfallIllustrationId": "ac00ae3a-8603-4ba6-af37-3b2cf1c6d607", "scryfallOracleId": "84d0c616-2fce-47f4-bfdd-783741a63fd2", "tcgplayerProductId": "206854"}, "language": "English", "layout": "saga", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{5}{U}{U}", "manaValue": 7.0, "name": "Kiora Bests the Sea God", "number": "52", "originalText": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI — Create an 8/8 blue Kraken creature token with hexproof.\nII — Tap all nonland permanents target opponent controls. They don't untap during their controller's next untap step.\nIII — Gain control of target permanent an opponent controls. Untap it.", "originalType": "Enchantment — Saga", "printings": ["PTHB", "THB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/93dfac9531bbdc4d", "cardKingdomFoil": "https://mtgjson.com/links/74fcfd9e52b918cf", "cardmarket": "https://mtgjson.com/links/c33c45d908fb09d4", "tcgplayer": "https://mtgjson.com/links/11a3f0e73c8943af"}, "rarity": "mythic", "rulings": [{"date": "2020-01-24", "text": "Nonland permanents target opponent controls that are already tapped when the second chapter ability resolves won’t be tapped again, but they won’t untap during their controller’s next untap step."}, {"date": "2020-01-24", "text": "The second chapter ability keeps the permanents tapped even if Kiora Bests the Sea God leaves the battlefield before that player’s next untap step."}, {"date": "2020-01-24", "text": "Any nonland permanents that come under the target player’s control after the second chapter ability resolves will untap as normal."}, {"date": "2020-01-24", "text": "The second chapter ability targets the player but not their permanents. Permanents with hexproof may be tapped this way."}, {"date": "2020-01-24", "text": "The control-change effect of the third chapter ability lasts indefinitely. It doesn’t wear off during the cleanup step. In a multiplayer game, it does expire if you leave the game."}, {"date": "2020-01-24", "text": "As a Saga enters the battlefield, its controller puts a lore counter on it. As your precombat main phase begins (immediately after your draw step), you put another lore counter on each Saga you control. Putting a lore counter on a Saga in either of these ways doesn’t use the stack."}, {"date": "2020-01-24", "text": "Each symbol on the left of a Saga’s text box represents a chapter ability. A chapter ability is a triggered ability that triggers when a lore counter that is put on the Saga causes the number of lore counters on the Saga to become equal to or greater than the ability’s chapter number. Chapter abilities are put onto the stack and may be responded to."}, {"date": "2020-01-24", "text": "A chapter ability doesn’t trigger if a lore counter is put on a Saga that already had a number of lore counters greater than or equal to that chapter’s number. For example, the third lore counter put on a Saga causes the III chapter ability to trigger, but I and II won’t trigger again."}, {"date": "2020-01-24", "text": "Once a chapter ability has triggered, the ability on the stack won’t be affected if the Saga gains or loses counters, or if it leaves the battlefield."}, {"date": "2020-01-24", "text": "If multiple chapter abilities trigger at the same time, their controller puts them on the stack in any order. If any of them require targets, those targets are chosen as you put the abilities on the stack, before any of those abilities resolve."}, {"date": "2020-01-24", "text": "Removing lore counters won’t cause a previous chapter ability to trigger. If lore counters are removed from a Saga, the appropriate chapter abilities will trigger again when the Saga receives lore counters."}, {"date": "2020-01-24", "text": "Once the number of lore counters on a Saga is greater than or equal to the greatest number among its chapter abilities, the Saga’s controller sacrifices it as soon as its chapter ability has left the stack, most likely by resolving or being countered. This state-based action doesn’t use the stack."}], "securityStamp": "oval", "setCode": "THB", "subtypes": ["Saga"], "supertypes": [], "text": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI — Create an 8/8 blue Kraken creature token with hexproof.\nII — Tap all nonland permanents target opponent controls. They don't untap during their controller's next untap step.\nIII — Gain control of target permanent an opponent controls. Untap it.", "type": "Enchantment — Saga", "types": ["Enchantment"], "uuid": "0b922fe8-0130-5a97-bea1-141f9e6705f4"}