{"artist": "Quinton Hoover & Val Mayerik", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 18712, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 163522, "name": "Kithkin-Windreiter", "text": "Verwandtschaft Zu Beginn deines Versorgungssegments kannst du dir die oberste Karte deiner Bibliothek anschauen. Hat sie mindestens einen Kreaturentyp mit dem Kithkin-Windreiter gemeinsam, kannst du sie offen vorzeigen. Falls du dies tust, erhält der Kithkin-Windreiter bis zum Ende des Zuges +2/+2, Flugfähigkeit und Wachsamkeit.", "type": "Kreatur — Kithkin, Soldat"}, {"language": "Spanish", "multiverseId": 163372, "name": "Cefironauta kithkin", "text": "Hermandad Al comienzo de tu mantenimiento, puedes mirar la primera carta de tu biblioteca. Si comparte un tipo de criatura con el Cefironauta kithkin, puedes mostrarla. Si lo haces, el Cefironauta kithkin obtiene +2/+2 y gana las habilidades de volar y vigilancia hasta el final del turno.", "type": "Criatura — Soldado kithkin"}, {"language": "French", "multiverseId": 164272, "name": "Zéphyrnaute sangami", "text": "Parenté — Au début de votre entretien, vous pouvez regarder la carte du dessus de votre bibliothèque. Si elle partage un type de créature avec le Zéphyrnaute sangami, vous pouvez la révéler. Si vous faites ainsi, le Zéphyrnaute sangami gagne +2/+2 et acquiert le vol et la vigilance jusqu'à la fin du tour.", "type": "Créature : sangami et soldat"}, {"language": "Italian", "multiverseId": 163672, "name": "Zefirnauta Kithkin", "text": "Parentela All'inizio del tuo mantenimento, puoi guardare la prima carta del tuo grimorio. Se condivide un tipo di creatura con lo Zefirnauta Kithkin, puoi rivelarla. Se lo fai, lo Zefirnauta Kithkin prende +2/+2 e ha cautela e volare fino alla fine del turno.", "type": "Creatura — Soldato Kithkin"}, {"language": "Japanese", "multiverseId": 163972, "name": "キスキンの西風乗り", "text": "族系 ― あなたのアップキープの開始時に、あなたはあなたのライブラリーの一番上のカードを見てもよい。 それがキスキンの西風乗りと共通のクリーチャー・タイプを持つ場合、あなたはそれを公開してもよい。 そうした場合、キスキンの西風乗りはターン終了時まで＋２/＋２の修整を受けるとともに飛行と警戒を持つ。", "type": "クリーチャー — キスキン・兵士"}, {"language": "Portuguese (Brazil)", "multiverseId": 163822, "name": "Kithkin Zefironauta", "text": "Parentesco No início de sua manutenção, você pode olhar o card do topo do seu grimório. Se ele compartilhar um tipo de criatura com Kithkin Zefironauta, você poderá revelá-lo. Se fizer isso, Kithkin Zefironauta receberá +2/+2 e ganhará voar e vigilância até o final do turno.", "type": "Criatura — Kithkin Soldado"}, {"language": "Russian", "multiverseId": 164422, "name": "Кискен-Ветронавт", "text": "Сходство В начале вашего шага поддержки вы можете посмотреть верхнюю карту вашей библиотеки. Если у нее есть такой же тип существа, как у Кискена-Ветронавта, вы можете ее показать. Если вы это делаете, Кискен-Ветронавт получает +2/+2, Полет и Бдительность до конца хода.", "type": "Существо — Кискен Солдат"}, {"language": "Chinese Simplified", "multiverseId": 164122, "name": "风飘洁英", "text": "血族～在你的维持开始时，你可以检视你的牌库顶牌。 如果它与风飘洁英有共通之生物类别，你可以展示该牌。 如果你如此作，则风飘洁英得+2/+2且获得飞行与警戒异能直到回合结束。", "type": "生物～洁英／士兵"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "124371", "cardKingdomId": "124221", "cardsphereId": "32527", "mcmId": "18845", "mcmMetaId": "9433", "mtgjsonV4Id": "c9757591-dc25-5712-92b2-9e61bd3ca339", "mtgoFoilId": "29107", "mtgoId": "29106", "multiverseId": "152858", "scryfallId": "8671abe8-4333-4b23-a87e-58bcc65deef2", "scryfallIllustrationId": "44bc3ef2-180a-4c7e-95fe-fc947ebd5583", "scryfallOracleId": "f69e9629-a7f7-4241-bf0c-c8def7d19d66", "tcgplayerProductId": "18004"}, "keywords": ["Kinship"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}", "manaValue": 3.0, "name": "Kithkin Zephyrnaut", "number": "16", "originalText": "Kinship At the beginning of your upkeep, you may look at the top card of your library. If it shares a creature type with Kithkin Zephyrnaut, you may reveal it. If you do, Kithkin Zephyrnaut gets +2/+2 and gains flying and vigilance until end of turn.", "originalType": "Creature - Kithkin Soldier", "power": "2", "printings": ["MOR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/0f0a649baf16f903", "cardKingdomFoil": "https://mtgjson.com/links/d720402a73fd5c30", "cardmarket": "https://mtgjson.com/links/b8f623d09417fcad", "tcgplayer": "https://mtgjson.com/links/34c38af9c38dc7ca"}, "rarity": "common", "rulings": [{"date": "2008-04-01", "text": "Kinship is an ability word that indicates a group of similar triggered abilities that appear on _Morningtide_ creatures. It doesn’t have any special rules associated with it."}, {"date": "2008-04-01", "text": "The first two sentences of every kinship ability are the same (except for the creature’s name). Only the last sentence varies from one kinship ability to the next."}, {"date": "2008-04-01", "text": "You don’t have to reveal the top card of your library, even if it shares a creature type with the creature that has the kinship ability."}, {"date": "2008-04-01", "text": "After the kinship ability finishes resolving, the card you looked at remains on top of your library."}, {"date": "2008-04-01", "text": "If you have multiple creatures with kinship abilities, each triggers and resolves separately. You’ll look at the same card for each one, unless you have some method of shuffling your library or moving that card to a different zone."}, {"date": "2008-04-01", "text": "If the top card of your library is already revealed (due to Magus of the Future, for example), you still have the option to reveal it or not as part of a kinship ability’s effect."}], "setCode": "MOR", "subtypes": ["Kithkin", "Soldier"], "supertypes": [], "text": "Kinship — At the beginning of your upkeep, you may look at the top card of your library. If it shares a creature type with Kithkin Zephyrnaut, you may reveal it. If you do, Kithkin Zephyrnaut gets +2/+2 and gains flying and vigilance until end of turn.", "toughness": "2", "type": "Creature — Kithkin Soldier", "types": ["Creature"], "uuid": "dda6fbc8-4f3d-50a4-a4ee-fa4182617f6b"}