{"artist": "Jason A. Engle", "availability": ["arena", "mtgo", "paper"], "borderColor": "black", "colorIdentity": ["G", "R"], "colors": ["G", "R"], "convertedManaCost": 3.0, "edhrecRank": 2849, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameEffects": ["nyxtouched", "showcase", "legendary", "fullart"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "231312", "cardKingdomId": "230795", "cardsphereId": "65621", "mcmId": "430394", "mcmMetaId": "290799", "mtgArenaId": "73761", "mtgjsonV4Id": "83d1e639-1473-57f9-bebc-fb5cf097f244", "scryfallId": "4d747889-04db-4e7a-ad4c-7549514b5112", "scryfallIllustrationId": "24343437-32f3-4f4f-be5d-5ad7a4314895", "scryfallOracleId": "e8473969-195f-41ee-a84d-463cc8c0ef02", "tcgplayerProductId": "206459"}, "isFullArt": true, "isStarter": true, "keywords": ["Indestructible"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}{G}", "manaValue": 3.0, "name": "Klothys, God of Destiny", "number": "268", "power": "4", "printings": ["PRM", "PTHB", "THB"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/3cbc7eb164ba6fdb", "cardKingdomFoil": "https://mtgjson.com/links/162fca4ad5c7583b", "cardmarket": "https://mtgjson.com/links/5377bdada7cd62d4", "tcgplayer": "https://mtgjson.com/links/a669d72d0f57c6b4"}, "rarity": "mythic", "rulings": [{"date": "2020-01-24", "text": "If the target card in a graveyard is an illegal target by the time Klothys’s last ability tries to resolve, the ability won’t resolve. You won’t add mana, gain life, or deal damage."}, {"date": "2020-01-24", "text": "If you exile a land card that has another card type (such as an artifact land), you add one mana, but you won’t gain life or deal damage."}, {"date": "2020-01-24", "text": "If you exile a nonland card, you gain only 2 life, no matter how many opponents are dealt damage."}, {"date": "2020-01-24", "text": "In a Two-Headed Giant game, Klothys’s last ability causes the opposing team to lose 4 life and you gain 2 life."}, {"date": "2020-01-24", "text": "Colorless and generic mana symbols ({C}, {0}, {1}, {2}, {X}, and so on) in mana costs of permanents you control don’t count toward your devotion to any color."}, {"date": "2020-01-24", "text": "Mana symbols in the text boxes of permanents you control don’t count toward your devotion to any color."}, {"date": "2020-01-24", "text": "Hybrid mana symbols, monocolored hybrid mana symbols, and Phyrexian mana symbols do count toward your devotion to their color(s)."}, {"date": "2020-01-24", "text": "If an activated ability or triggered ability has an effect that depends on your devotion to a color, you count the number of mana symbols of that color among the mana costs of permanents you control as the ability resolves. The permanent with that ability will be counted if it’s still on the battlefield at that time."}, {"date": "2020-01-24", "text": "If you put an Aura on an opponent’s permanent, you still control the Aura, and mana symbols in its mana cost count towards your devotion."}, {"date": "2020-01-24", "text": "Your devotion to two colors is the number of mana symbols among mana costs of permanents you control that are the first color, the second, or both. If an effect counts your devotion to two colors, a hybrid symbol that is both of those colors is counted just once."}, {"date": "2020-01-24", "text": "The type-changing ability that can make a God not be a creature functions only on the battlefield. It’s always a creature card in other zones, regardless of your devotion to its color. It’s always a creature spell while it’s on the stack."}, {"date": "2020-01-24", "text": "As a God enters the battlefield, your devotion to its color will determine whether any replacement effects that affect creatures entering the battlefield apply to that God. Because replacement effects are considered before the God is on the battlefield, the mana symbols in its mana cost won’t be counted when determining this."}, {"date": "2020-01-24", "text": "When a God enters the battlefield, your devotion to its color (including the mana symbols in the mana cost of the God itself) will determine if a creature entered the battlefield or not for abilities that trigger whenever a creature enters the battlefield."}, {"date": "2020-01-24", "text": "If a God stops being a creature, it loses the type creature and the creature type God. It continues to be a legendary enchantment."}, {"date": "2020-01-24", "text": "The abilities of Gods function as long as they’re on the battlefield, regardless of whether they’re creatures."}, {"date": "2020-01-24", "text": "If a God is attacking or blocking and it stops being a creature, it will be removed from combat. It won’t rejoin combat if it resumes being a creature later during that combat."}, {"date": "2020-01-24", "text": "Counters put on a God remain on it while it’s not a creature, even if they have no effect."}, {"date": "2020-01-24", "text": "If an effect causes a God to lose all abilities, its ability that causes it to stop being a creature still applies if appropriate."}], "securityStamp": "oval", "setCode": "THB", "subtypes": ["God"], "supertypes": ["Legendary"], "text": "Indestructible\nAs long as your devotion to red and green is less than seven, Klothys isn't a creature.\nAt the beginning of your precombat main phase, exile target card from a graveyard. If it was a land card, add {R} or {G}. Otherwise, you gain 2 life and Klothys deals 2 damage to each opponent.", "toughness": "5", "type": "Legendary Enchantment Creature — God", "types": ["Enchantment", "Creature"], "uuid": "2d343b2e-9dd7-5125-8768-7fb2dd194c10", "variations": ["bed702eb-e2ed-5989-9341-3b1198980180"]}