{"artist": "Cyril Van Der Haegen", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 17903, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 509676, "name": "Ritter aus Sursi", "text": "Fliegend; Flankenangriff (Immer wenn eine Kreatur ohne Flankenangriff diese Kreatur blockt, erhält die blockende Kreatur -1/-1 bis zum Ende des Zuges.)\nAussetzen 3 — {W} (Statt diese Karte aus deiner Hand zu wirken, kannst du {W} bezahlen und sie mit drei Zeitmarken ins Exil schicken. Entferne zu Beginn deines Versorgungssegments eine Zeitmarke von ihr. Wenn die letzte Zeitmarke entfernt wird, wirke die Karte, ohne ihre Manakosten zu bezahlen. Sie hat Eile.)", "type": "Kreatur — Mensch, Ritter"}, {"language": "Spanish", "multiverseId": 509965, "name": "Caballero de Sursi", "text": "Vuela, flanquea. (Siempre que una criatura sin la habilidad de flanquear bloquee a esta criatura, la criatura bloqueadora obtiene -1/-1 hasta el final del turno.)\nSuspender 3—{W}. (En lugar de lanzar esta carta de tu mano, puedes pagar {W} y exiliarla con tres contadores de tiempo sobre ella. Al comienzo de tu mantenimiento, remueve un contador de tiempo. Cuando remuevas el último, lánzala sin pagar su coste de maná. Tiene la habilidad de prisa.)", "type": "Criatura — Caballero humano"}, {"language": "French", "multiverseId": 510254, "name": "Chevalière de Sursi", "text": "Vol ; débordement (À chaque fois qu'une créature sans le débordement bloque cette créature, la créature bloqueuse gagne -1/-1 jusqu'à la fin du tour.)\nSuspension 3 — {W} (Plutôt que lancer cette carte depuis votre main, vous pouvez payer {W} et l'exiler avec trois marqueurs « temps » sur elle. Au début de votre entretien, retirez un marqueur « temps ». Quand le dernier marqueur est retiré, lancez cette carte sans payer son coût de mana. Elle a la célérité.)", "type": "Créature : humain et chevalier"}, {"language": "Italian", "multiverseId": 510543, "name": "Cavaliera di Sursi", "text": "Volare; aggirare (Ogniqualvolta una creatura senza aggirare blocca questa creatura, la creatura bloccante prende -1/-1 fino alla fine del turno.)\nSospendere 3—{W} (Invece di lanciare questa carta dalla tua mano, puoi pagare {W} ed esiliarla con tre segnalini tempo su di essa. All'inizio del tuo mantenimento, rimuovi un segnalino tempo. Quando l'ultimo viene rimosso, lancia la carta senza pagare il suo costo di mana. Ha rapidità.)", "type": "Creatura — Cavaliere Umano"}, {"language": "Japanese", "multiverseId": 510832, "name": "サーシの騎士", "text": "飛行、側面攻撃（側面攻撃を持たないクリーチャー１体がこのクリーチャーをブロックするたび、ターン終了時まで、そのブロック・クリーチャーは－１/－１の修整を受ける。）\n待機３―{W}（あなたはこのカードをあなたの手札から唱えるのではなく、{W}を支払って時間カウンター３個を置いた状態で追放してもよい。あなたのアップキープの開始時に、時間カウンター１個を取り除く。最後の１個を取り除いたとき、これをこれのマナ・コストを支払うことなく唱える。これは速攻を持つ。）", "type": "クリーチャー — 人間・騎士"}, {"language": "Portuguese (Brazil)", "multiverseId": 511121, "name": "Cavaleiro de Sursi", "text": "Voar; flanquear (Toda vez que uma criatura sem flanquear bloquear esta criatura, a criatura bloqueadora receberá -1/-1 até o final do turno.)\nSuspender 3 — {W} (Em vez de conjurar este card da sua mão, você pode pagar {W} e exilá-lo com três marcadores temporais. No início de sua manutenção, remova um marcador temporal. Quando o último for removido, conjure-o sem pagar seu custo de mana. Ele tem ímpeto.)", "type": "Criatura — Humano Cavaleiro"}, {"language": "Russian", "multiverseId": 511410, "name": "Рыцарь из Сурси", "text": "Полет; Обход (Каждый раз, когда существо без Обхода блокирует это существо, то блокирующее существо получает -1/-1 до конца хода.)\nОтсрочка 3 — {W} (Вместо того, чтобы разыграть эту карту из вашей руки, вы можете заплатить {W} и изгнать ее с тремя временными жетонами на ней. В начале вашего шага поддержки удалите один временной жетон. Когда удален последний временной жетон, разыграйте эту карту без уплаты ее мана-стоимости. Она имеет Ускорение.)", "type": "Существо — Человек Рыцарь"}, {"language": "Chinese Simplified", "multiverseId": 511699, "name": "苏西骑士", "text": "飞行；侧面攻击（每当一个不具侧面攻击异能的生物阻挡此生物时，该阻挡生物得-1/-1直到回合结束。）\n延缓3～{W}（除了从你手上施放此牌，你可以支付{W}并将它放逐，且上面有三个计时指示物。在你的维持开始时，从其上移去一个计时指示物。当移去最后一个时，施放它且不需支付其法术力费用。它具有敏捷。）", "type": "生物 ～人类／骑士"}, {"language": "Chinese Traditional", "multiverseId": 511988, "name": "蘇西騎士", "text": "飛行；側面攻擊（每當一個不具側面攻擊異能的生物阻擋此生物時，該阻擋生物得-1/-1直到回合結束。）\n延緩3~{W}（除了從你手上施放此牌，你可以支付{W}並將它放逐，且上面有三個計時指示物。在你的維持開始時，從其上移去一個計時指示物。當移去最後一個時，施放它且不需支付其魔法力費用。它具有敏捷。）", "type": "生物 ～人類／騎士"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "242945", "cardKingdomId": "242440", "cardsphereId": "74617", "mcmId": "542571", "mcmMetaId": "8931", "mtgjsonV4Id": "fad05f7e-7570-591c-9c98-fef09bac1224", "mtgoId": "86407", "multiverseId": "509387", "scryfallId": "8693bec1-9bd9-4840-9d7f-954f92d968c9", "scryfallIllustrationId": "11ab0326-415c-4748-ad4b-88900714d722", "scryfallOracleId": "8dfe5fb5-89f1-42be-9038-40d3c71ce59a", "tcgplayerProductId": "233464"}, "isReprint": true, "keywords": ["Flanking", "Flying", "Suspend"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}", "manaValue": 4.0, "name": "Knight of Sursi", "number": "22", "originalText": "Flying; flanking (Whenever a creature without flanking blocks this creature, the blocking creature gets -1/-1 until end of turn.)\nSuspend 3—{W} (Rather than cast this card from your hand, you may pay {W} and exile it with three time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost. It has haste.)", "originalType": "Creature — Human Knight", "power": "2", "printings": ["FUT", "TSR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/cec35327f63b10e6", "cardKingdomFoil": "https://mtgjson.com/links/23be0f8f282c651c", "cardmarket": "https://mtgjson.com/links/64680899ea13100c", "tcgplayer": "https://mtgjson.com/links/cd2150abb0f21647"}, "rarity": "common", "rulings": [{"date": "2021-06-18", "text": "Suspend is a keyword that represents three abilities. The first is a static ability that allows you to exile the card from your hand with the specified number of time counters (the number before the dash) on it by paying its suspend cost (listed after the dash). The second is a triggered ability that removes a time counter from the suspended card at the beginning of each of your upkeeps. The third is a triggered ability that causes you to cast the card when the last time counter is removed. If you cast a creature spell this way, it gains haste until you lose control of that creature (or, in rare cases, you lose control of the creature spell while it’s on the stack)."}, {"date": "2021-06-18", "text": "You can exile a card in your hand using suspend any time you could cast that card. Consider its card type, any effects that modify when you could cast it (such as flash) and any other effects that stop you from casting it (such as from Meddling Mage’s ability) to determine if and when you can do this. Whether you could actually complete all steps in casting the card is irrelevant. For example, you can exile a card with suspend that has no mana cost or that requires a target even if no legal targets are available at that time."}, {"date": "2021-06-18", "text": "Cards exiled with suspend are exiled face up."}, {"date": "2021-06-18", "text": "Exiling a card with suspend isn’t casting that card. This action doesn’t use the stack and can’t be responded to."}, {"date": "2021-06-18", "text": "If the spell requires any targets, those targets are chosen when the spell is finally cast, not when it’s exiled."}, {"date": "2021-06-18", "text": "If an effect refers to a “suspended card,” that means a card that (1) has suspend, (2) is in exile, and (3) has one or more time counters on it."}, {"date": "2021-06-18", "text": "If the first triggered ability of suspend (the one that removes time counters) is countered, no time counter is removed. The ability will trigger again at the beginning of the card’s owner’s next upkeep."}, {"date": "2021-06-18", "text": "When the last time counter is removed, the second triggered ability of suspend (the one that lets you cast the card) triggers. It doesn’t matter why the last time counter was removed or what effect removed it."}, {"date": "2021-06-18", "text": "If the second triggered ability is countered, the card can’t be cast. It remains exiled with no time counters on it, and it’s no longer suspended."}, {"date": "2021-06-18", "text": "As the second triggered ability resolves, you must cast the card if able. You must do so even if it requires targets and the only legal targets are ones that you really don’t want to target. Timing permissions based on the card’s type are ignored."}, {"date": "2021-06-18", "text": "If you can’t cast the card, perhaps because there are no legal targets available, it remains exiled with no time counters on it, and it’s no longer suspended."}, {"date": "2021-06-18", "text": "If you cast a card “without paying its mana cost,” such as with suspend, you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those if you want to cast the card."}, {"date": "2021-06-18", "text": "You are never forced to activate mana abilities to pay costs, so if there is a mandatory additional mana cost (such as from Thalia, Guardian of Thraben), you can decline to activate mana abilities to pay for it and hence fail to cast the suspended card, leaving it in exile."}, {"date": "2021-06-18", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2021-06-18", "text": "The mana value of a spell cast without paying its mana cost is determined by its mana cost, even though that cost wasn’t paid."}, {"date": "2021-06-18", "text": "A creature cast using suspend will enter the battlefield with haste. It will have haste until another player gains control of it. (In some rare cases, another player may gain control of the creature spell itself. If this happens, the creature won’t enter the battlefield with haste.)"}], "setCode": "TSR", "subtypes": ["Human", "Knight"], "supertypes": [], "text": "Flying; flanking (Whenever a creature without flanking blocks this creature, the blocking creature gets -1/-1 until end of turn.)\nSuspend 3—{W} (Rather than cast this card from your hand, you may pay {W} and exile it with three time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost. It has haste.)", "toughness": "2", "type": "Creature — Human Knight", "types": ["Creature"], "uuid": "b97c45c1-96c0-5e50-9d70-33d4ba231701"}