{"artist": "Mike Bierek", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 6.0, "edhrecRank": 4195, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2003", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "245132", "cardsphereId": "76988", "mcmId": "557919", "mcmMetaId": "202421", "mtgjsonV4Id": "239d2c24-6e7e-554b-bdfb-042b6dbabb59", "scryfallId": "d3e684c1-7718-4f00-a787-a692c148f0ff", "scryfallIllustrationId": "5b7b4a08-6769-4072-9efb-89838f8061b7", "scryfallOracleId": "cb53bd72-dee8-46fa-b0f9-1eee3a99379a", "tcgplayerProductId": "210391"}, "isReprint": true, "keywords": ["Imprint"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{6}", "manaValue": 6.0, "name": "Knowledge Pool", "number": "396", "originalReleaseDate": "2021-04-24", "printings": ["FMB1", "MBS", "PLIST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/026860c6fdac8509", "cardmarket": "https://mtgjson.com/links/26030745360ab53e", "tcgplayer": "https://mtgjson.com/links/f91efe41a49da38d"}, "rarity": "rare", "rulings": [{"date": "2011-06-01", "text": "You may cast any other card exiled by Knowledge Pool, including one owned by an opponent. Any card exiled by Knowledge Pool’s enters-the-battlefield ability or its other triggered ability may be cast."}, {"date": "2011-06-01", "text": "The spell a player casts from their hand won’t resolve if it’s exiled, even if that spell can’t be countered by spells or abilities."}, {"date": "2011-06-01", "text": "If the original spell isn’t exiled (perhaps because it’s countered by another spell or ability before Knowledge Pool’s second triggered ability resolves), the rest of the ability does nothing. The player doesn’t get to cast an exiled card."}, {"date": "2011-06-01", "text": "If there are no nonland cards exiled by Knowledge Pool, the original spell is still exiled."}, {"date": "2011-06-01", "text": "You may pay additional costs, such as kicker costs, of the exiled card."}, {"date": "2011-06-01", "text": "If the card has any mandatory additional costs, as Kuldotha Rebirth does, you must pay them in order to cast the spell."}, {"date": "2011-06-01", "text": "Timing restrictions based on the card’s type are ignored. For example, you can cast an exiled creature card this way. Other restrictions, such as Spinal Embrace’s “Cast Spinal Embrace only during combat” are not ignored."}, {"date": "2011-06-01", "text": "If the card you cast without paying its mana cost has an X in its mana cost, you must choose 0 as its value."}, {"date": "2011-06-01", "text": "Any other abilities that trigger when you cast the original spell (for example, if you cast Emrakul, the Aeons Torn) will still trigger and go on the stack."}, {"date": "2011-06-01", "text": "If multiple Knowledge Pools are on the battlefield, keep track of which cards are exiled by each of them. Whenever a player casts a spell from their hand: -- If all Knowledge Pools are controlled by the same player, that player chooses the order in which the triggered abilities are put onto the stack. The last one put onto the stack will be the first to resolve. -- If multiple players each control one or more Knowledge Pools, the active player put their triggered abilities on the stack in any order, then each other player in turn order does the same. The last ability put onto the stack this way will be the first to resolve. -- The first triggered ability to resolve will exile the original spell, then the player who cast that spell may cast one of the nonland cards exiled by the Knowledge Pool that generated that triggered ability. The abilities of other Knowledge Pools will do nothing when they resolve, as the original spell will already have been exiled."}], "setCode": "PLIST", "subtypes": [], "supertypes": [], "text": "Imprint — When Knowledge Pool enters the battlefield, each player exiles the top three cards of their library.\nWhenever a player casts a spell from their hand, that player exiles it. If the player does, they may cast a spell from among other cards exiled with Knowledge Pool without paying its mana cost.", "type": "Artifact", "types": ["Artifact"], "uuid": "1d2317a3-3e8e-5e95-ae98-a612eff07b10", "watermark": "mirran"}