{"artist": "Jason Chan", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 4814, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 231138, "name": "Koth vom Hammerclan", "text": "+1: Entappe ein Gebirge deiner Wahl. Es wird bis zum Ende des Zuges zu einer 4/4 roten Elementarwesen-Kreatur. Es ist immer noch ein Land.\n-2: Erhöhe deinen Manavorrat für jedes Gebirge, das du kontrollierst, um {R}.\n-5: Du erhältst ein Emblem mit „Gebirge, die du kontrollierst, haben '{T}: Dieses Land fügt einer Kreatur oder einem Spieler deiner Wahl 1 Schadenspunkt zu.'\".", "type": "Planeswalker — Koth"}, {"language": "Spanish", "multiverseId": 232632, "name": "Koth del Martillo", "text": "+1: Endereza la montaña objetivo. Se convierte en una criatura Elemental roja 4/4 hasta el final del turno. Sigue siendo una tierra.\n-2: Agrega {R} a tu reserva de maná por cada montaña que controlas.\n-5: Obtienes un emblema con \"Las montañas que controlas tienen '{T}: Esta tierra hace 1 punto de daño a la criatura o jugador objetivo'\".", "type": "Planeswalker — Koth"}, {"language": "French", "multiverseId": 231885, "name": "Koth du Marteau", "text": "+1 : Dégagez la montagne ciblée. Elle devient une créature 4/4 rouge Élémental jusqu'à la fin du tour. C'est toujours un terrain.\n-2 : Ajoutez {R} à votre réserve pour chaque montagne que vous contrôlez.\n-5 : Vous gagnez un emblème avec « Les montagnes que vous contrôlez ont '{T} : Ce terrain inflige 1 blessure à une cible, créature ou joueur.' »", "type": "Planeswalker : Koth"}, {"language": "Italian", "multiverseId": 232881, "name": "Koth del Martello", "text": "+1: STAPpa una Montagna bersaglio. Diventa una creatura Elementale 4/4 rossa fino alla fine del turno. È ancora una terra.\n-2: Aggiungi {R} alla tua riserva di mana per ogni Montagna che controlli.\n-5: Ottieni un emblema con \"Le Montagne che controlli hanno '{T}: Questa terra infligge 1 danno a una creatura o a un giocatore bersaglio'.\"", "type": "Planeswalker — Koth"}, {"language": "Japanese", "multiverseId": 231636, "name": "槌のコス", "text": "+1: 山を１つ対象とし、それをアンタップする。 それはターン終了時まで、赤の４/４のエレメンタル・クリーチャーになる。 それは土地でもある。\n-2: あなたがコントロールする山１つにつき、あなたのマナ・プールに{R}を加える。\n-5: あなたは「あなたがコントロールする山は『{T}：クリーチャー１体かプレイヤー１人を対象とする。この土地はそれに１点のダメージを与える。』を持つ。」を持つ紋章を得る。", "type": "プレインズウォーカー — コス"}, {"language": "Portuguese (Brazil)", "multiverseId": 230889, "name": "Koth do Martelo", "text": "+1: Desvire a Montanha alvo. Ela se torna uma criatura vermelha 4/4 do tipo Elemental até o final do turno. Ela ainda conta como um terreno.\n-2: Adicione {R} à sua reserva de mana para cada Montanha que você controlar.\n-5: Você ganha um emblema com \"As Montanhas que você controla têm '{T}: Este terreno causa 1 ponto de dano à criatura ou ao jogador alvo.'\"", "type": "Planeswalker — Koth"}, {"language": "Russian", "multiverseId": 231387, "name": "Кос из Племени Молота", "text": "+1: разверните целевую Гору. Она становится существом 4/4 красный Элементаль до конца хода. При этом она остается землей.\n-2: добавьте {R} в ваше хранилище маны за каждую Гору под вашим контролем.\n-5: вы получаете эмблему со способностью «Горы под вашим контролем имеют способность \"{T}: эта земля наносит 1 повреждение целевому существу или игроку\"».", "type": "Planeswalker — Кос"}, {"language": "Chinese Simplified", "multiverseId": 232383, "name": "锤族的寇斯", "text": "+1：重置目标山脉。 它成为4/4红色的元素生物直到回合结束。 它仍然是地。\n-2：你每操控一个山脉，便加{R}到你的法术力池中。\n-5：你获得具有「由你操控的山脉具有『{T}：此地对目标生物或牌手造成1点伤害」的鰴记。", "type": "鹏洛客～寇斯"}, {"language": "Chinese Traditional", "multiverseId": 232134, "name": "鎚族的寇斯", "text": "+1：重置目標山脈。 它成為4/4紅色的元素生物直到回合結束。 它仍然是地。\n-2：你每操控一個山脈，便加{R}到你的魔法力池中。\n-5：你獲得具有「由你操控的山脈具有『{T}：此地對目標生物或玩家造成1點傷害』」的徽記。", "type": "鵬洛客～寇斯"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "132353", "cardKingdomId": "132103", "cardsphereId": "40431", "mcmId": "242582", "mcmMetaId": "200709", "mtgjsonV4Id": "245fb364-eff7-5a76-9d1c-0ce130245174", "mtgoFoilId": "38332", "mtgoId": "38331", "multiverseId": "212238", "scryfallId": "af8b9c79-a161-4d7d-944d-82a44a5f2ab9", "scryfallIllustrationId": "34f1852f-c42e-4b47-bfaa-1dcc9c5f8f95", "scryfallOracleId": "589186e0-3ebe-46a3-a9e7-798b1712fa93", "tcgplayerProductId": "36315"}, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "vintage": "Legal"}, "loyalty": "3", "manaCost": "{2}{R}{R}", "manaValue": 4.0, "name": "Koth of the Hammer", "number": "94", "originalText": "+1: Untap target Mountain. It becomes a 4/4 red Elemental creature until end of turn. It's still a land.\n-2: Add {R} to your mana pool for each Mountain you control.\n-5: You get an emblem with \"Mountains you control have ‘{T}: This land deals 1 damage to target creature or player.'\"", "originalType": "Planeswalker — Koth", "printings": ["DDI", "SOM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/15b262d0959bf267", "cardKingdomFoil": "https://mtgjson.com/links/f98a2e8efbf38bf4", "cardmarket": "https://mtgjson.com/links/30efbdc2dc2f2bd0", "tcgplayer": "https://mtgjson.com/links/4dd877f6f1ae41b6"}, "rarity": "mythic", "rulings": [{"date": "2011-01-01", "text": "Emblems behave similarly to enchantments: They have an ability that, in a general sense, continually affects the game. The primary difference between them is that emblems aren’t permanents and don’t exist on the battlefield. Nothing in the game can remove an emblem, simply because no other spell or ability references them. Once you get an emblem, you keep it for the rest of the game. Emblems have no color, name, card type, or other characteristics beyond the listed ability."}, {"date": "2011-01-01", "text": "Koth’s first ability can target any Mountain, including an untapped Mountain and/or a Mountain another player controls."}, {"date": "2011-01-01", "text": "If Koth’s first ability animates a Mountain that came under your control that turn, it will have “summoning sickness” and be unable to attack. It will also be unable to be tapped to activate an ability with the {T} symbol in its cost, such as the Mountain’s mana ability or the ability granted to it by Koth’s emblem."}, {"date": "2011-01-01", "text": "Loyalty abilities can’t be mana abilities. Koth’s second ability uses the stack and can be countered or otherwise responded to. Like all loyalty abilities, it can be activated only once per turn, during your main phase, when the stack is empty, and only if no other loyalty abilities of this permanent have been activated this turn."}, {"date": "2011-01-01", "text": "Koth’s emblem grants an activated ability to each Mountain you control at any given time for the rest of the game. It will continuously check which permanents you control are Mountains to determine what has the ability. For example, a Mountain that comes under your control later in the game will have the ability, while a Mountain you controlled at the time the emblem was created, but that later came under the control of another player, will no longer have the ability."}], "setCode": "SOM", "subtypes": ["Koth"], "supertypes": ["Legendary"], "text": "[+1]: Untap target Mountain. It becomes a 4/4 red Elemental creature until end of turn. It's still a land.\n[−2]: Add {R} for each Mountain you control.\n[−5]: You get an emblem with \"Mountains you control have '{T}: This land deals 1 damage to any target.'\"", "type": "Legendary Planeswalker — Koth", "types": ["Planeswalker"], "uuid": "131b8963-eeac-5c4b-a551-6f0a584c11dd"}