{"artist": "Mathias Kollros", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 1665, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "f548a582-b627-5b4d-97d0-ec24ba60c4e5", "mtgoId": "86240", "scryfallId": "d976a01f-d28c-436a-a5e9-eaa9df8631d4", "scryfallIllustrationId": "45a99cca-52e1-43c1-90b6-34064e496a97", "scryfallOracleId": "18e421c0-2879-4ad8-b027-397f168dfbc2"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Partner"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Restricted", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}", "manaValue": 2.0, "name": "Krark, the Thumbless", "number": "86240", "originalReleaseDate": "2020-12-15", "power": "2", "printings": ["CMR", "PHED", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-11-10", "text": "If you lose the flip and the spell is returned to its owner’s hand, it’s removed from the stack and won’t resolve. This isn’t the same as countering the spell, and a spell that can’t be countered can be returned to hand."}, {"date": "2020-11-10", "text": "Krark’s ability triggers at the same time as any other abilities that say “When you cast this spell” or similar, including cascade. Those abilities may be put on the stack in any order. Those triggered abilities are unaffected by the original spell being returned to hand, countered, or otherwise removed from the stack."}, {"date": "2020-11-10", "text": "If you cast a copy of an instant or sorcery card (for example, one created by Mnemonic Deluge), and the spell is returned to its owner’s hand, it will cease to exist. You won’t be able to cast it again."}, {"date": "2020-11-10", "text": "If you win the flip, the copy will resolve before the original spell does."}, {"date": "2020-11-10", "text": "If you win the flip, the spell will be copied even if it doesn’t require targets."}, {"date": "2020-11-10", "text": "If you win the flip, but the spell that caused Krark’s triggered ability to trigger isn’t on the stack anymore (most likely because it was countered), the copy is still created."}, {"date": "2020-11-10", "text": "If you lose the flip, but the spell that caused Krark’s triggered ability to trigger isn’t on the stack anymore (most likely because it was countered), nothing is returned to your hand. The card stays in its current zone."}, {"date": "2020-11-10", "text": "If you copy a spell with targets, the copy will have the same targets unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for any of the targets, you can’t choose a new legal target, that target remains unchanged (even if the current target is illegal)."}, {"date": "2020-11-10", "text": "If the spell that’s copied is modal (that is, it has a bulleted list of modes), the copy will have the same mode or modes. You can’t choose different ones."}, {"date": "2020-11-10", "text": "If the spell that’s copied has an X whose value was determined as it was cast, the copy will have the same value of X."}, {"date": "2020-11-10", "text": "If the spell has damage divided as it was cast (like Monstrous Onslaught), the division can’t be changed, although the targets receiving that damage still can. The same is true of spells that distribute counters."}, {"date": "2020-11-10", "text": "You can’t choose to pay any alternative or additional costs for the copy. However, effects based on any alternative or additional costs that were paid for the original spell are copied as though those same costs were paid for the copy."}, {"date": "2020-11-10", "text": "The copy from winning the flip is created on the stack, so it’s not “cast.” Abilities that trigger when a player casts a spell won’t trigger."}, {"date": "2020-11-10", "text": "If your Commander deck has two commanders, you can only include cards whose own color identities are also found in your commanders’ combined color identities. If Falthis and Kediss are your commanders, your deck may contain cards with black and/or red in their color identity, but not cards with green, white, or blue."}, {"date": "2020-11-10", "text": "Both commanders start in the command zone, and the remaining 98 cards (or 58 cards in a Commander Draft game) of your deck are shuffled to become your library."}, {"date": "2020-11-10", "text": "To have two commanders, both must have the partner ability as the game begins. Losing the ability during the game doesn’t cause either to cease to be your commander."}, {"date": "2020-11-10", "text": "Once the game begins, your two commanders are tracked separately. If you cast one, you won’t have to pay an additional {2} the first time you cast the other. A player loses the game after having been dealt 21 damage from any one of them, not from both of them combined."}, {"date": "2020-11-10", "text": "If something refers to your commander while you have two commanders, it refers to one of them of your choice. If you are instructed to perform an action on your commander (e.g. put it from the command zone into your hand due to Command Beacon), you choose one of your commanders at the time the effect happens."}, {"date": "2020-11-10", "text": "An effect that checks whether you control your commander is satisfied if you control one or both of your two commanders."}, {"date": "2020-11-10", "text": "You can choose two commanders with partner that are the same color or colors. In Commander Draft, you can even choose two of the same commander with partner if you drafted them. If you do this, make sure you keep the number of times you’ve cast each from the command zone clear for “commander tax” purposes."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Goblin", "Wizard"], "supertypes": ["Legendary"], "text": "Whenever you cast an instant or sorcery spell, flip a coin. If you lose the flip, return that spell to its owner's hand. If you win the flip, copy that spell, and you may choose new targets for the copy.\nPartner (You can have two commanders if both have partner.)", "toughness": "2", "type": "Legendary Creature — Goblin Wizard", "types": ["Creature"], "uuid": "4921b74d-a334-5c51-829d-7794fc1a497b"}