{"artist": "Quinton Hoover", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 5.0, "edhrecRank": 20663, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "1997", "hasFoil": false, "hasNonFoil": true, "identifiers": {"mcmId": "259532", "mtgjsonV4Id": "2cfc2db8-9691-5ba1-be6e-f4a9081e9111", "scryfallId": "7e8cbd3c-e88d-4d08-8553-20dfbad5f833", "scryfallIllustrationId": "f1b7cf7f-9b8e-4ef4-b937-8e1641a9ee00", "scryfallOracleId": "8fa93c01-f9ea-4d48-a040-418d1ca6be19"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "Japanese", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "paupercommander": "Restricted", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}{B}", "manaValue": 5.0, "name": "Krovikan Vampire", "number": "3", "power": "3", "printings": ["ICE", "ME2", "PHJ"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "At the beginning of each end step, the game checks all creatures that died that turn to see if Krovikan Vampire had dealt damage to them during the turn. It doesn’t matter whether the damage was combat damage, and it doesn’t matter whether the damage was what caused the creatures to die."}, {"date": "2004-10-04", "text": "If a creature Krovikan Vampire dealt damage to dies, then leaves the graveyard by some means, the game loses track of it. Krovikan Vampire’s ability won’t be able to return it to the battlefield, even if it’s put back into the graveyard before the end step."}, {"date": "2008-08-01", "text": "Whoever controls Krovikan Vampire when the ability triggers will return the applicable cards to the battlefield under their control. It doesn’t matter who controlled it at the time the damage was dealt."}, {"date": "2008-08-01", "text": "If Krovikan Vampire isn’t on the battlefield at the beginning of the end step, its ability won’t trigger. No cards will be returned to the battlefield, even if Krovikan Vampire dealt damage to some creatures that died that turn."}, {"date": "2008-10-01", "text": "If a creature that Krovikan Vampire dealt damage to that turn dies in response to the triggered ability, that creature card will be put onto the battlefield. Note that an appropriate creature must have died prior to the beginning of the end step in order for the ability to trigger in the first place."}], "setCode": "PHJ", "subtypes": ["Vampire"], "supertypes": [], "text": "At the beginning of each end step, if a creature dealt damage by Krovikan Vampire this turn died, put that card onto the battlefield under your control. Sacrifice it when you lose control of Krovikan Vampire.", "toughness": "3", "type": "Creature — Vampire", "types": ["Creature"], "uuid": "424dc6c9-d3bb-5ad3-b4f0-f865dda5b501"}