{"artist": "Zack Stella", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 5941, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 439902, "name": "Kumenas Erwachen", "text": "Aufstieg (Falls du zehn oder mehr bleibende Karten kontrollierst, erhältst du für den Rest der Partie den Segen der Stadt.)\nZu Beginn deines Versorgungssegments zieht jeder Spieler eine Karte. Falls du den Segen der Stadt hast, ziehst stattdessen nur du eine Karte.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 440105, "name": "Despertar de Kumena", "text": "Ascender. (Si controlas diez o más permanentes, obtienes la bendición de la ciudad durante el resto del juego.)\nAl comienzo de tu mantenimiento, cada jugador roba una carta. Si tienes la bendición de la ciudad, en vez de eso, solo tú robas una carta.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 440308, "name": "Éveil de Kumena", "text": "Ascension (Si vous contrôlez au moins dix permanents, vous gagnez l'agrément de la cité pour le reste de la partie.)\nAu début de votre entretien, chaque joueur pioche une carte. Si vous avez l'agrément de la cité, à la place, vous seul piochez une carte.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 440511, "name": "Risveglio di Kumena", "text": "Ascesa (Se controlli dieci o più permanenti, ottieni la benedizione della città per il resto della partita.)\nAll'inizio del tuo mantenimento, ogni giocatore pesca una carta. Se hai la benedizione della città, invece solo tu peschi una carta.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 440714, "name": "クメーナの覚醒", "text": "昇殿（あなたがパーマネントを10個以上コントロールしているなら、このゲームの間、あなたは都市の承認を得る。）\nあなたのアップキープの開始時に、各プレイヤーはそれぞれカードを１枚引く。あなたが都市の承認を持っているなら、代わりに、あなたのみがカードを１枚引く。", "type": "エンチャント"}, {"language": "Korean", "multiverseId": 440917, "name": "쿠메나의 각성", "text": "승격 (당신이 지속물을 열 개 이상 조종한다면, 당신은 이 게임이 끝날 때까지 도시의 축복을 받는다.)\n당신의 유지단 시작에, 각 플레이어는 카드 한 장을 뽑는다. 당신이 도시의 축복을 가지고 있다면, 대신 당신만 카드 한 장을 뽑는다.", "type": "부여마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 441120, "name": "Despertar de Kumena", "text": "Ascender (Se você controla dez ou mais permanentes, você recebe a bênção da cidade pelo restante do jogo.)\nNo início da sua manutenção, cada jogador compra um card. Se você tiver a bênção da cidade, em vez disso, só você compra um card.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 441323, "name": "Пробуждение Кумены", "text": "Возвышение (Если под вашим контролем есть десять или больше перманентов, вы получаете благословение города до конца партии.)\nВ начале вашего шага поддержки каждый игрок берет одну карту. Если у вас есть благословение города, то вместо этого только вы берете карту.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 441526, "name": "库莫那觉醒", "text": "登殿（如果你操控十个或更多永久物，则于这盘游戏接下来的时段中，你得到黄金城祝福。）\n在你的维持开始时，每位牌手各抓一张牌。若你有黄金城祝福，则改为只有你抓一张牌。", "type": "结界"}, {"language": "Chinese Traditional", "multiverseId": 441729, "name": "庫莫那覺醒", "text": "登殿（如果你操控十個或更多永久物，則於這盤遊戲接下來的時段中，你得到黃金城祝福。）\n在你的維持開始時，每位玩家各抽一張牌。若你有黃金城祝福，則改為只有你抽一張牌。", "type": "結界"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "216313", "cardKingdomId": "216032", "cardsphereId": "53133", "mcmId": "315302", "mcmMetaId": "236107", "mtgArenaId": "66701", "mtgjsonV4Id": "399ecf83-7060-531a-9538-d45fdee4b0ba", "mtgoId": "66537", "multiverseId": "439699", "scryfallId": "3a86f499-a2d4-47f1-9fc1-b543e5ad5c82", "scryfallIllustrationId": "8ae4354d-57a6-4580-9535-d8193ce2d741", "scryfallOracleId": "f7a8066e-f8a4-4202-8825-0327d11e58c3", "tcgplayerProductId": "155591"}, "keywords": ["Ascend"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{U}", "manaValue": 4.0, "name": "Kumena's Awakening", "number": "42", "originalText": "Ascend (If you control ten or more permanents, you get the city's blessing for the rest of the game.)\nAt the beginning of your upkeep, each player draws a card. If you have the city's blessing, instead only you draw a card.", "originalType": "Enchantment", "printings": ["PRIX", "RIX"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/35bdc1c641a68196", "cardKingdomFoil": "https://mtgjson.com/links/e483738637afc9f2", "cardmarket": "https://mtgjson.com/links/f113bc37e2d1e288", "tcgplayer": "https://mtgjson.com/links/8b8b8443d8778712"}, "rarity": "rare", "rulings": [{"date": "2018-01-19", "text": "Once you have the city’s blessing, you have it for the rest of the game, even if you lose control of some or all of your permanents. The city’s blessing isn’t a permanent itself and can’t be removed by any effect."}, {"date": "2018-01-19", "text": "A permanent is any object on the battlefield, including tokens and lands. Spells and emblems aren’t permanents."}, {"date": "2018-01-19", "text": "If you cast a spell with ascend, you don’t get the city’s blessing until it resolves. Players may respond to that spell by trying to change whether you get the city’s blessing."}, {"date": "2018-01-19", "text": "If you control ten permanents but don’t control a permanent or resolving spell with ascend, you don’t get the city’s blessing. For example, if you control ten permanents, lose control of one, then cast Golden Demise, you won’t have the city’s blessing and the spell will affect creatures you control."}, {"date": "2018-01-19", "text": "If your tenth permanent enters the battlefield and then a permanent leaves the battlefield immediately afterwards (most likely due to the “Legend Rule” or due to being a creature with 0 toughness), you get the city’s blessing before it leaves the battlefield."}, {"date": "2018-01-19", "text": "Ascend on a permanent isn’t a triggered ability and doesn’t use the stack. Players can respond to a spell that will give you your tenth permanent, but they can’t respond to getting the city’s blessing once you control that tenth permanent. This means that if your tenth permanent is a land you play, players can’t respond before you get the city’s blessing."}, {"date": "2018-01-19", "text": "Some cards have triggered abilities that check if you have the city’s blessing, but don’t use an intervening “if” clause. These abilities trigger regardless of whether you have the city’s blessing and check whether you do only as they resolve."}], "securityStamp": "oval", "setCode": "RIX", "subtypes": [], "supertypes": [], "text": "Ascend (If you control ten or more permanents, you get the city's blessing for the rest of the game.)\nAt the beginning of your upkeep, each player draws a card. If you have the city's blessing, instead only you draw a card.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "05d0d71c-a2d8-5267-b0c0-920cc95d38f7"}