{"artist": "Karl Kopinski", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 1.0, "edhrecRank": 4549, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 380944, "name": "Die Flotte aussenden", "text": "Streben — Die Flotte aussenden kostet beim Wirken für jedes Ziel außer dem ersten {1} mehr.\nBis zum Ende des Zuges erhält eine beliebige Anzahl an Kreaturen deiner Wahl „Immer wenn diese Kreatur angreift, bringe einen 1/1 weißen Soldat-Kreaturenspielstein getappt und angreifend ins Spiel.\"", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 382099, "name": "Flota a la carga", "text": "Esfuerzo — Lanzar Flota a la carga cuesta {1} más por cada objetivo después del primero.\nHasta el final del turno, cualquier cantidad de criaturas objetivo ganan cada una \"Siempre que esta criatura ataque, pon en el campo de batalla una ficha de criatura Soldado blanca 1/1 girada y atacando\".", "type": "Conjuro"}, {"language": "French", "multiverseId": 381109, "name": "Déployer la flotte", "text": "Obstination — Déployer la flotte coûte {1} de plus à lancer pour chaque cible après la première.\nJusqu'à la fin du tour, n'importe quel nombre de créatures ciblées gagnent chacune « À chaque fois que cette créature attaque, mettez sur le champ de bataille, engagé et attaquant, un jeton de créature 1/1 blanche Soldat. »", "type": "Rituel"}, {"language": "Italian", "multiverseId": 381274, "name": "Arrembaggio della Flotta", "text": "Sforzo — L'Arrembaggio della Flotta costa {1} in più per essere lanciato per ogni bersaglio oltre il primo.\nScegli un qualsiasi numero di creature bersaglio. Ognuna di esse ha \"Ogniqualvolta questa creatura attacca, metti sul campo di battaglia una pedina creatura Soldato 1/1 bianca TAPpata e attaccante\" fino alla fine del turno.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 381439, "name": "船団の出航", "text": "奮励 ― 船団の出航を唱えるためのコストは、２つ目以降の対象１つにつき{1}多くなる。\n望む数のクリーチャーを対象とする。それらはそれぞれターン終了時まで「このクリーチャーが攻撃するたび、タップ状態で攻撃している白の１/１の兵士・クリーチャー・トークンを１体戦場に出す。」を得る。", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 381604, "name": "함대 출진", "text": "분투 — 함대 출진은 한 개를 초과하는 목표의 수만큼 발동하는 데 {1}씩 비용이 더 든다.\n생물을 원하는 수만큼 목표로 정한다. 턴종료까지, 그 생물들은 각각 '이 생물이 공격할 때마다, 1/1 백색 병사 생물 토큰 한 개를 탭되어서 공격하고 있는 채로 전장에 놓는다'를 얻는다.", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 381769, "name": "Lançar a Frota", "text": "Esforço — Lançar a Frota custa {1} a mais para ser conjurado para cada alvo além do primeiro.\nAté o final do turno, qualquer número de criaturas alvo ganha \"Toda vez que esta criatura atacar, coloque no campo de batalha uma ficha de criatura 1/1 branca do tipo Soldado virada e atacando.\"", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 381934, "name": "Спуск Флота", "text": "Стремление — За каждую цель после первой разыгрывание Спуска Флота стоит на {1} больше.\nДо конца хода любое количество целевых существ получают способность «Каждый раз, когда это существо атакует, положите на поле битвы одну фишку существа 1/1 белый Солдат повернутой и атакующей».", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 380614, "name": "舰队启航", "text": "积力～舰队启航在第一个目标之外每有一个目标，便增加{1}来施放。\n直到回合结束，任意数量的目标生物各获得「每当此生物攻击时，将一个1/1白色士兵衍生生物横置放进战场且正进行攻击。」", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 380779, "name": "艦隊啟航", "text": "積力～艦隊啟航在第一個目標之外每有一個目標，便增加{1}來施放。\n直到回合結束，任意數量的目標生物各獲得「每當此生物攻擊時，將一個1/1白色士兵衍生生物橫置放進戰場且正進行攻擊。」", "type": "巫術"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "194206", "cardKingdomId": "193943", "cardsphereId": "22149", "mcmId": "266616", "mcmMetaId": "209513", "mtgjsonV4Id": "f334b579-782c-5f71-ad9c-3035fa082722", "mtgoFoilId": "52207", "mtgoId": "52206", "multiverseId": "380449", "scryfallId": "bc3e52c0-2f79-4537-8f1c-70b68836bac0", "scryfallIllustrationId": "4f05b9c2-d065-4a55-92fd-30194d1f7c02", "scryfallOracleId": "3362dec2-b157-4a00-8abf-0d7b5a14c6f8", "tcgplayerProductId": "82226"}, "keywords": ["Strive"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{W}", "manaValue": 1.0, "name": "Launch the Fleet", "number": "15", "originalText": "Strive — Launch the Fleet costs {1} more to cast for each target beyond the first.\nUntil end of turn, any number of target creatures each gain \"Whenever this creature attacks, put a 1/1 white Soldier creature token onto the battlefield tapped and attacking.\"", "originalType": "Sorcery", "printings": ["40K", "JOU"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1b4fbcf7e406f3d8", "cardKingdomFoil": "https://mtgjson.com/links/3675c0ff49f03822", "cardmarket": "https://mtgjson.com/links/e6ac578108055c0d", "tcgplayer": "https://mtgjson.com/links/0527090b4c4b0299"}, "rarity": "rare", "rulings": [{"date": "2014-04-26", "text": "You declare which player or planeswalker each token is attacking as you put it onto the battlefield. It doesn't have to be the same player or planeswalker the original creature is attacking."}, {"date": "2014-04-26", "text": "Although the tokens are attacking, they were never declared as attacking creatures (for purposes of abilities that trigger whenever a creature attacks, for example)."}, {"date": "2014-04-26", "text": "You choose how many targets each spell with a strive ability has and what those targets are as you cast it. It's legal to cast such a spell with no targets, although this is rarely a good idea. You can't choose the same target more than once for a single strive spell."}, {"date": "2014-04-26", "text": "The mana cost and mana value of strive spells don't change no matter how many targets they have. Strive abilities affect only what you pay."}, {"date": "2014-04-26", "text": "If all of the spell's targets are illegal when the spell tries to resolve, it won't resolve and none of its effects will happen. If one or more of its targets are legal when it tries to resolve, the spell will resolve and affect only those legal targets. It will have no effect on any illegal targets."}, {"date": "2014-04-26", "text": "If such a spell is copied, and the effect that copies the spell allows a player to choose new targets for the copy, the number of targets can't be changed. The player may change any number of the targets, including all of them or none of them. If, for one of the targets, the player can't choose a new legal target, then it remains unchanged (even if the current target is illegal)."}, {"date": "2014-04-26", "text": "If a spell or ability allows you to cast a strive spell without paying its mana cost, you must pay the additional costs for any targets beyond the first."}], "setCode": "JOU", "subtypes": [], "supertypes": [], "text": "Strive — This spell costs {1} more to cast for each target beyond the first.\nUntil end of turn, any number of target creatures each gain \"Whenever this creature attacks, create a 1/1 white Soldier creature token that's tapped and attacking.\"", "type": "Sorcery", "types": ["Sorcery"], "uuid": "407b9968-a592-5990-8aa1-4114b56c40c8"}