{"artist": "Tuan Duong Chu", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 4582, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "260273", "cardsphereId": "88126", "mcmId": "659266", "mtgjsonV4Id": "449f4c50-4df3-5fb2-8896-2678fb1c1ace", "scryfallId": "ef618c8e-9635-4b99-a563-e88b5265437a", "scryfallIllustrationId": "b5ee4662-a2d4-4ead-8414-9ee5983c5717", "scryfallOracleId": "c4660b3c-a234-4a3e-83e7-e2fa9d556685", "tcgplayerProductId": "270618"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Connive", "Convoke"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}{B}", "manaValue": 4.0, "name": "Lethal Scheme", "number": "36p", "printings": ["NCC", "PNCC"], "promoTypes": ["promopack", "stamped", "planeswalkerstamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/a18442cdcc9d83a1", "tcgplayer": "https://mtgjson.com/links/c3dc634b0acab22c"}, "rarity": "rare", "rulings": [{"date": "2022-04-29", "text": "You can't tap more creatures to convoke Lethal Scheme than it takes to pay for its total cost. This means that normally no more than four creatures can convoke it."}, {"date": "2022-04-29", "text": "You can tap an untapped creature you haven't controlled continuously since the beginning of your most recent turn to convoke a spell."}, {"date": "2022-04-29", "text": "Convoke doesn't change a spell's mana cost or mana value."}, {"date": "2022-04-29", "text": "When calculating a spell's total cost, include any alternative costs, additional costs, or anything else that increases or reduces the cost to cast the spell. Convoke applies after the total cost is calculated."}, {"date": "2022-04-29", "text": "Because convoke isn't an alternative cost, it can be used in conjunction with alternative costs."}, {"date": "2022-04-29", "text": "Tapping a multicolored creature using convoke will pay for {1} or one mana of your choice of any of that creature's colors."}, {"date": "2022-04-29", "text": "If a creature you control has a mana ability with {T} in the cost, activating that ability while casting a spell with convoke will result in the creature being tapped before you pay the spell's costs. You won't be able to tap it again for convoke. Similarly, if you sacrifice a creature to activate a mana ability while casting a spell with convoke, that creature won't be on the battlefield when you pay the spell's costs, so you won't be able to tap it for convoke."}, {"date": "2022-04-29", "text": "When multiple creatures are instructed to connive simultaneously, they connive one at a time in the order of their controller's choice."}, {"date": "2022-04-29", "text": "Once an ability that causes a creature to connive begins to resolve, no player may take any other actions until it's done. Notably, opponents can't try to remove the conniving creature after you discard a nonland card but before it receives a counter."}, {"date": "2022-04-29", "text": "If no card is discarded, most likely because that player's hand is empty and an effect says they can't draw cards, the conniving creature does not receive a +1/+1 counter."}, {"date": "2022-04-29", "text": "If a resolving spell or ability instructs a specific creature to connive but that creature has left the battlefield, the creature still connives. If you discard a nonland card this way, you won't put a +1/+1 counter on anything. Abilities that trigger “when [that creature] connives” will trigger."}], "securityStamp": "oval", "setCode": "PNCC", "subtypes": [], "supertypes": [], "text": "Convoke (Your creatures can help cast this spell. Each creature you tap while casting this spell pays for {1} or one mana of that creature's color.)\nDestroy target creature or planeswalker. Each creature that convoked Lethal Scheme connives. (Draw a card, then discard a card. If you discarded a nonland card, put a +1/+1 counter on that creature.)", "type": "Instant", "types": ["Instant"], "uuid": "e91fe063-3033-5df6-bd45-02018aaeb9ee", "watermark": "obscura"}