{"artist": "Daniel Gelon", "availability": ["mtgo"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 13168, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "bc13ca8a-7191-539a-9c90-374c2334e385", "mtgoFoilId": "38551", "mtgoId": "38550", "multiverseId": "202483", "scryfallId": "d4d7d1fd-4a5e-4cc3-8056-12cae084cc6a", "scryfallIllustrationId": "e652abd6-370c-428d-b1a7-b73099566e68", "scryfallOracleId": "5b7515f2-7a5a-4e2a-9784-6cbacd768172"}, "isOnlineOnly": true, "isReprint": true, "isReserved": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{B}{B}{B}{B}", "manaValue": 4.0, "name": "Lich", "number": "89", "originalText": "As Lich enters the battlefield, you lose life equal to your life total.\nYou don't lose the game for having 0 or less life.\nIf you would gain life, draw that many cards instead.\nWhenever you're dealt damage, sacrifice that many nontoken permanents. If you can't, you lose the game.\nWhen Lich is put into a graveyard from the battlefield, you lose the game.", "originalType": "Enchantment", "printings": ["2ED", "30A", "CED", "CEI", "LEA", "LEB", "ME4"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "If an opponent steals control of Lich and no other effect prevents you from losing with a life total of zero, you will lose the game due to a zero life total as a State-Based Action before you can take any actions. The last sentence doesn’t apply in this case since the Lich didn’t leave the battlefield."}, {"date": "2004-10-04", "text": "If you have multiple Lich cards on the battlefield, you must sacrifice a permanent for each damage done to you for each Lich. This is because the sacrifice is a triggered ability. But you only draw one card for each life gained regardless of how many Liches you have. This is because the draw is a replacement effect and not a triggered one. You lose if any one of the Liches leaves the battlefield."}, {"date": "2004-10-04", "text": "You can lose life and take damage, and thereby have a negative life total, while Lich is on the battlefield."}, {"date": "2004-10-04", "text": "If an opponent steals control of Lich, their life total does not change. The life total changes for a player only when it enters the battlefield under that player’s control."}, {"date": "2004-10-04", "text": "If you take more than one damage at a time, sacrifice the permanents for that damage simultaneously. This allows you to sacrifice both a creature and any Aura that is on it all at once."}, {"date": "2004-10-04", "text": "You can’t pay life, just like any player at less than one life can’t pay life. You can pay zero life if you want."}, {"date": "2010-08-15", "text": "The last ability will cause you to lose the game even if you somehow manage to have a life total greater than 0 at the time the Lich leaves the battlefield or if some other effect would prevent you from losing for having 0 life. If, on the other hand, some effect such as that from Platinum Angel says that you can’t lose the game then even the last ability of the Lich cannot cause you to do so. The ability will just resolve and the game will continue as normal."}, {"date": "2010-08-15", "text": "Note that usually you will have 0 or less life at the time Lich leaves the battlefield causing you to lose as a State-Based Action before the last ability can even go on the stack."}, {"date": "2011-01-01", "text": "The last ability will cause you to lose the game even if you somehow manage to have a life total greater than 0 at the time the Lich is put into the graveyard or if some other effect would prevent you from losing for having 0 life. If, on the other hand, some effect such as that from Platinum Angel says that you can’t lose the game then even the last ability of the Lich cannot cause you to do so. The ability will just resolve and the game will continue as normal."}], "setCode": "ME4", "subtypes": [], "supertypes": [], "text": "As Lich enters the battlefield, you lose life equal to your life total.\nYou don't lose the game for having 0 or less life.\nIf you would gain life, draw that many cards instead.\nWhenever you're dealt damage, sacrifice that many nontoken permanents. If you can't, you lose the game.\nWhen Lich is put into a graveyard from the battlefield, you lose the game.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "713acd73-d16f-5a8e-a836-038f97a5ba93"}