{"artist": "Ash Wood", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 5.0, "edhrecRank": 10446, "finishes": ["foil"], "flavorText": "It shows not what you are but what you were.", "foreignData": [], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "232038", "cardsphereId": "66239", "mcmId": "443253", "mtgjsonV4Id": "ec5b02b4-aa0a-5a5e-b5b8-5eb0917e9c94", "scryfallId": "39f6aecb-5420-46e3-8eb0-bb560ad5b37e", "scryfallIllustrationId": "bbf2434f-e071-4a8e-bda5-29777256eb7f", "scryfallOracleId": "e81da4a7-4b03-4107-b7d9-4b635faa615d", "tcgplayerProductId": "210381"}, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{5}", "manaValue": 5.0, "name": "Lich's Mirror", "number": "106", "printings": ["ALA", "FMB1"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/682f9a7d551bab97", "tcgplayer": "https://mtgjson.com/links/3fc2154f910e2a1b"}, "rarity": "mythic", "rulings": [{"date": "2008-10-01", "text": "Lich’s Mirror has no effect if you concede the game. If you concede, you’ll lose."}, {"date": "2008-10-01", "text": "If you can’t lose the game (for example, you control a Platinum Angel), Lich’s Mirror won’t do anything."}, {"date": "2008-10-01", "text": "Lich’s Mirror shuffles permanents you own into your library, regardless of who controls them."}, {"date": "2008-10-01", "text": "Lich’s Mirror shuffles tokens you own into your library, too. The tokens you own will leave play. However, there’s no point to physically shuffling tokens into your library because you can’t draw them as part of Lich’s Mirror’s effect and they’ll cease to exist immediately afterwards."}, {"date": "2008-10-01", "text": "Any abilities that trigger when the permanents leave the battlefield will be put on the stack after Lich’s Mirror’s entire effect has been applied."}, {"date": "2008-10-01", "text": "Lich’s Mirror doesn’t affect spells on the stack, cards that have been exiled, or permanents you control but don’t own. They’ll stay where they are. Spells on the stack will then resolve as normal."}, {"date": "2008-10-01", "text": "Although Lich’s Mirror has you draw a hand of seven cards and sets your life total to 20, this isn’t a game restart. You can’t take a mulligan if you don’t like your new hand of cards."}, {"date": "2008-10-01", "text": "Lich's Mirror replaces the game-loss event if you would lose the game in the following ways: -- As a state-based action for having 0 or less life. -- As a state-based action for having tried to draw a card from an empty library since the last time state-based actions were checked. -- As a state-based action for having ten or more poison counters (though this isn’t that helpful; see below). -- Because an ability (such as the one from Immortal Coil) states that you do so."}, {"date": "2008-10-01", "text": "As part of Lich's Mirror's effect, it typically shuffles itself into your library. If it does, that means that if you'd lose the game *again* immediately after its effect is finished, it can't help you a second time. This can occur in a few different ways. For example: -- You have ten or more poison counters. Lich's Mirror doesn't remove poison counters. If you'd lose the game this way, you'll do what Lich's Mirror says, then you'll lose the game the next time state-based actions are checked. -- Your life total is 0 or less and an effect says that you can't gain life. Since your life total can't be raised, it stays at whatever it is rather than becoming 20, and you'll lose the game the next time state-based actions are checked. -- The number of nontoken permanents you own plus the number of cards in your hand, graveyard, and library is less than seven. When you try to draw seven cards as part of Lich's Mirror's effect, you'll be unable to complete at least one of those draws and you'll lose the game the next time state-based actions are checked. -- You control *but don't own* a permanent such as Immortal Coil with a triggered ability that causes you to lose the game when a certain game state happens (also known as a “state trigger”), and the condition that causes the “lose the game” ability to trigger hasn't changed. If you owned the permanent, Lich's Mirror would shuffle it into your library. In this case, however, it remains on the battlefield and its ability will trigger again."}, {"date": "2008-10-01", "text": "If you control *but don’t own* Lich’s Mirror, Lich’s Mirror itself will still be on the battlefield after its effect is finished. If you would lose the game again for any of the reasons above, Lich’s Mirror has its effect again . . . and again . . . and again. An involuntary infinite loop will be created, and the game will end in a draw. (In the case of the triggered ability example given last in the list above, it’s possible that a player could cause the loop to end while the ability is on the stack. None of the loops caused by state-based actions can be stopped at all.)"}, {"date": "2008-10-01", "text": "If all the players remaining in a game would lose simultaneously but one of them controls Lich’s Mirror, that player does what Lich’s Mirror says instead of losing, and everyone else loses. As a result, the controller of Lich’s Mirror wins the game because all of their opponents have lost. (If Lich’s Mirror weren’t in the picture, then the game would be a draw.)"}, {"date": "2008-10-01", "text": "If a spell causes you to lose the game the next time state-based actions are checked (by dealing damage to you greater than your life total, for example), that spell will already be in the graveyard by the time Lich’s Mirror’s effect happens. If it’s in your graveyard, it will be shuffled into your library."}, {"date": "2008-10-01", "text": "If, during a check of state-based actions, you’d lose the game at the same time a creature you own would be put into your graveyard (due to an Earthquake for 10 or combat damage dealt to both you and the creature, for example), that creature’s controller has a choice to make. The state-based actions rule is trying to simultaneously (a) shuffle that creature card into your library (due to Lich’s Mirror’s replacement effect) and (b) put it into your graveyard. Only one of those things can happen. The creature’s controller chooses which one. If the creature is put into your graveyard, it isn’t shuffled into your library. Abilities that trigger when that creature is put into a graveyard will trigger only if that option is chosen."}, {"date": "2008-10-01", "text": "If, during a check of state-based actions, you’d lose the game for multiple reasons (for example, if you were at 1 life and had one card in your library, then Night’s Whisper caused you to draw two cards and lose 2 life), a single Lich’s Mirror will replace all of them. You’ll do what Lich’s Mirror says just once."}, {"date": "2008-10-01", "text": "For your life total to become 20, you actually gain or lose the necessary amount of life. Keep in mind that you may have a negative life total when this happens. For example, if your life total is -4 when you would lose the game, Lich’s Mirror’s effect will cause you to gain 24 life. Other cards that interact with life gain or life loss will interact with this effect accordingly."}, {"date": "2008-10-01", "text": "Lich’s Mirror has no effect if a spell or ability (such as the one from Helix Pinnacle) states that a player “wins the game.” If a player wins the game, the game ends immediately."}, {"date": "2009-10-01", "text": "A token’s owner is the player under whose control it entered the battlefield."}, {"date": "2010-06-15", "text": "In a Two-Headed Giant game, if your team would lose the game and you control Lich’s Mirror, your team won’t lose. Instead, you’ll do what Lich’s Mirror says and your teammate won’t do anything. This is true even if the reason your team would lose is because your teammate tried to draw a card with an empty library or was affected by an ability that said they lost the game. Your life total (which is the same as your team’s life total) becomes 20. Your team’s life total is adjusted by the amount of life you gain or lose as a result of this, which basically means your team’s life total becomes 20."}], "setCode": "FMB1", "subtypes": [], "supertypes": [], "text": "If you would lose the game, instead shuffle your hand, your graveyard, and all permanents you own into your library, then draw seven cards and your life total becomes 20.", "type": "Artifact", "types": ["Artifact"], "uuid": "de09349e-0055-5e9e-a000-1e82d7ca0f20"}