{"artist": "Steve Prescott", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 11567, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "228823", "cardsphereId": "64110", "mcmId": "416146", "mcmMetaId": "210723", "mtgjsonV4Id": "fba65bc3-b92d-5c3a-b9d2-fb8c21cab465", "scryfallId": "3c689146-c45d-4c8a-bb51-fd37d265d007", "scryfallIllustrationId": "5532ea8d-6492-4b8a-a96f-3205a21adc82", "scryfallOracleId": "f2df375c-3741-409f-91d1-21bf632b2e1d", "tcgplayerProductId": "203166"}, "isReprint": true, "keywords": ["Manifest"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}{W}", "manaValue": 3.0, "name": "Lightform", "number": "160", "printings": ["C18", "FRF", "MB1"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/56ee9a824c0ef339", "cardmarket": "https://mtgjson.com/links/4765d2950a5520e5", "tcgplayer": "https://mtgjson.com/links/a8b35e8d7f1e94a7"}, "rarity": "uncommon", "rulings": [{"date": "2014-11-24", "text": "At any time, you can look at a face-down permanent you control. You can’t look at face-down permanents you don’t control unless an effect allows you to or instructs you to."}, {"date": "2014-11-24", "text": "If a face-down permanent you control leaves the battlefield, you must reveal it. You must also reveal all face-down spells and permanents you control if you leave the game or if the game ends."}, {"date": "2014-11-24", "text": "You must ensure that your face-down spells and permanents can easily be differentiated from each other. You’re not allowed to mix up the cards that represent them on the battlefield in order to confuse other players. The order they entered the battlefield should remain clear. Common methods for indicating this include using markers or dice, or simply placing them in order on the battlefield. You must also track how each became face down (manifested, cast face down using the morph ability, and so on)."}, {"date": "2014-11-24", "text": "There are no cards in the Fate Reforged set that would turn a face-down instant or sorcery card on the battlefield face up, but some older cards can try to do this. If something tries to turn a face-down instant or sorcery card on the battlefield face up, reveal that card to show all players it’s an instant or sorcery card. The permanent remains on the battlefield face down. Abilities that trigger when a permanent turns face up won’t trigger, because even though you revealed the card, it never turned face up."}, {"date": "2014-11-24", "text": "The face-down permanent is a 2/2 creature with no name, mana cost, creature types, or abilities. It’s colorless and has a converted mana cost of 0. Other effects that apply to the permanent can still grant or change any of these characteristics."}, {"date": "2014-11-24", "text": "You’ll still manifest the top card of your library even if the “Form” isn’t on the battlefield as its enters-the-battlefield ability resolves."}, {"date": "2014-11-24", "text": "If you have no cards in your library as the ability resolves, the “Form” will be put into its owner’s graveyard as a state-based action."}, {"date": "2014-11-24", "text": "If the enchanted creature is turned face up, the “Form” will continue to enchant it."}, {"date": "2014-11-24", "text": "Some older Magic sets feature double-faced cards, which have a Magic card face on each side rather than a Magic card face on one side and a Magic card back on the other. The rules for double-faced cards are changing slightly to account for the possibility that they are manifested. If a double-faced card is manifested, it will be put onto the battlefield face down. While face down, it can’t transform. If the front face of the card is a creature card, you can turn it face up by paying its mana cost. If you do, its front face will be up. A double-faced permanent on the battlefield still can’t be turned face down."}, {"date": "2014-11-24", "text": "Any time you have priority, you may turn a manifested creature face up by revealing that it’s a creature card (ignoring any copy effects or type-changing effects that might be applying to it) and paying its mana cost. This is a special action. It doesn’t use the stack and can’t be responded to."}, {"date": "2014-11-24", "text": "If a manifested creature would have morph if it were face up, you may also turn it face up by paying its morph cost."}, {"date": "2014-11-24", "text": "Unlike a face-down creature that was cast using the morph ability, a manifested creature may still be turned face up after it loses its abilities if it’s a creature card."}, {"date": "2014-11-24", "text": "Because the permanent is on the battlefield both before and after it’s turned face up, turning a permanent face up doesn’t cause any enters-the-battlefield abilities to trigger."}, {"date": "2014-11-24", "text": "Because face-down creatures don’t have names, they can’t have the same name as any other creature, even another face-down creature."}, {"date": "2014-11-24", "text": "A permanent that turns face up or face down changes characteristics but is otherwise the same permanent. Spells and abilities that were targeting that permanent, as well as Auras and Equipment that were attached to the permanent, aren’t affected."}, {"date": "2014-11-24", "text": "Turning a permanent face up or face down doesn’t change whether that permanent is tapped or untapped."}, {"date": "2018-07-13", "text": "The face-down characteristics of a permanent are copiable values. If another object becomes a copy of a face-down creature or if a token is created that’s a copy of a face-down creature, that new object is a 2/2 colorless face-up creature with no abilities."}, {"date": "2018-07-13", "text": "Any time you have priority, you may turn a manifested creature face up by revealing that it’s a creature card (ignoring any type-changing effects that might be applying to it) and paying its mana cost. This is a special action. It doesn’t use the stack and can’t be responded to."}, {"date": "2018-07-13", "text": "Because face-down creatures don’t have a name, they can’t have the same name as any other creature or share any creature types with any other creature, even another face-down creature."}, {"date": "2018-07-13", "text": "At any time, you can look at a face-down permanent you control. You can’t look at face-down permanents you don’t control unless an effect instructs you to do so."}, {"date": "2018-07-13", "text": "You must ensure that your face-down spells and permanents can easily be differentiated from each other. You’re not allowed to mix up the cards that represent them on the battlefield to confuse other players. The order they entered the battlefield should remain clear. Common methods for indicating this include using markers or dice, or simply placing them in order on the battlefield. You must also track how each became face down (manifested, cast face down using a morph ability, and so on)."}, {"date": "2018-07-13", "text": "There are no cards in this set that would turn a face-down instant or sorcery card on the battlefield face up, but some older cards can try to do this. If something tries to turn a face-down instant or sorcery card on the battlefield face up, reveal that card to show all players it’s an instant or sorcery card. The permanent remains on the battlefield face down. Abilities that trigger when a permanent turns face up won’t trigger, because even though you revealed the card, it never turned face up."}, {"date": "2018-07-13", "text": "If an effect tries to return a face-down creature to the battlefield after it leaves (such as Aminatou’s second ability or Adarkar Valkyrie’s delayed triggered ability), that effect returns the card face up. If it tries to put an instant or sorcery card onto the battlefield this way, that card remains in its current zone instead."}, {"date": "2018-07-13", "text": "Some previous Magic sets feature double-faced cards, which have a Magic card face on each side rather than a Magic card face on one side and a Magic card back on the other. If a double-faced card is manifested, it will be put onto the battlefield face down. While face down, it can’t transform. If the front face of the card is a creature card, you can turn it face up by paying its mana cost. If you do, its front face will be up. Although a double-faced card can enter the battlefield face down, one already on the battlefield can’t be turned face down."}], "setCode": "MB1", "subtypes": [], "supertypes": [], "text": "When Lightform enters the battlefield, it becomes an Aura with enchant creature. Manifest the top card of your library and attach Lightform to it. (To manifest a card, put it onto the battlefield face down as a 2/2 creature. Turn it face up any time for its mana cost if it's a creature card.)\nEnchanted creature has flying and lifelink.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "f18a142c-3e42-57b9-9a44-0c99dba2cb4e"}