{"artist": "Jesper Ejsing", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 2.0, "edhrecRank": 2045, "finishes": ["nonfoil"], "flavorText": "Bulgo paused, puzzled. What was that rustling sound, and why did he feel so stiff? And how could his *feet* be so thirsty?", "foreignData": [], "frameVersion": "2003", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "229269", "cardsphereId": "64119", "mcmId": "422016", "mcmMetaId": "9339", "mtgjsonV4Id": "c1ccc25f-2a5d-5b4a-a7c8-3b6fd8d6b1e0", "scryfallId": "060ed300-76ac-4a44-874c-c687c9ab421c", "scryfallIllustrationId": "48d233ba-ae11-431e-aa2a-f7f8cc9c2b18", "scryfallOracleId": "63625b26-3a19-4c3c-b18a-91247bb2a40c", "tcgplayerProductId": "203417"}, "isReprint": true, "keywords": ["Enchant"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}", "manaValue": 2.0, "name": "Lignify", "number": "1261", "printings": ["DDD", "GVL", "LRW", "MB1"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/964c5471b5091321", "cardmarket": "https://mtgjson.com/links/016f787ce68e6ef4", "tcgplayer": "https://mtgjson.com/links/ab3bff13b723cd53"}, "rarity": "common", "rulings": [{"date": "2007-10-01", "text": "Lignify overwrites previous effects that changed the enchanted creature’s creature types. Any such effects that apply after Lignify enters the battlefield will work normally."}, {"date": "2007-10-01", "text": "Lignify causes the enchanted creature to lose all abilities it had at the time it became enchanted. Any abilities granted to the creature after Lignify entered the battlefield will work normally."}, {"date": "2007-10-01", "text": "Lignify overwrites characteristic-defining abilities that specify the enchanted creature’s power or toughness (such as the one Dauntless Dourbark has) or that specify its creature types (such as changeling does)."}, {"date": "2007-10-01", "text": "If the enchanted creature has a characteristic-defining ability that specifies its color, that ability will still have its effect because it’s applied before the creature loses the ability."}, {"date": "2007-10-01", "text": "If Lignify leaves the battlefield, the creature goes back to being what it was before. Any effects that applied while the Lignify was on the battlefield, such as Giant Growth or Lace with Moonglove, will continue to apply."}, {"date": "2007-10-01", "text": "If a previous effect switched the creature’s power and toughness, that effect still applies (though it will apply to the creature’s new power and toughness)."}, {"date": "2007-10-01", "text": "Lignify will overwrite static abilities that come from the creature itself (such as the one on Verduran Enchantress) because Lignify causes the creature to lose that ability before it gets a chance to apply."}, {"date": "2009-10-01", "text": "Lignify will overwrite any previous effects that set the enchanted creature’s power or toughness (such as Serendib Sorcerer does). Any such effects that apply after Lignify entered the battlefield will work normally."}, {"date": "2009-10-01", "text": "Lignify will not overwrite effects such as those from Glorious Anthem, counters, or Giant Growth that change the enchanted creature’s power or toughness without setting it to a specific value. Apply such effects after applying Lignify."}], "setCode": "MB1", "subtypes": ["Treefolk", "Aura"], "supertypes": [], "text": "Enchant creature\nEnchanted creature is a Treefolk with base power and toughness 0/4 and loses all abilities.", "type": "Tribal Enchantment — Treefolk Aura", "types": ["Tribal", "Enchantment"], "uuid": "56e1300d-c13b-5b3f-a843-49a9217a0218"}