{"artist": "Wayne Reynolds", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["U", "W"], "colors": ["U", "W"], "convertedManaCost": 3.0, "edhrecRank": 3338, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 495731, "name": "Linvala, Schild von Seetor", "text": "Fliegend\nZu Beginn des Kampfes in deinem Zug und falls du eine vollständige Abenteurergruppe hast, bestimme eine bleibende Karte deiner Wahl, die kein Land ist und die ein Gegner kontrolliert. Bis zu deinem nächsten Zug kann sie nicht angreifen oder blocken, und ihre aktivierten Fähigkeiten können nicht aktiviert werden.\nOpfere Linvala: Bestimme Fluchsicherheit oder Unzerstörbarkeit. Kreaturen, die du kontrollierst, erhalten die bestimmte Fähigkeit bis zum Ende des Zuges.", "type": "Legendäre Kreatur — Engel, Zauberer"}, {"language": "French", "multiverseId": 495806, "name": "Linvala, bouclier de Porte des Mers", "text": "Vol\nAu début du combat pendant votre tour, si vous avez un groupe complet, choisissez un permanent non-terrain ciblé qu'un adversaire contrôle. Jusqu'à votre prochain tour, il ne peut ni attaquer ni bloquer et ses capacités activées ne peuvent pas être activées.\nSacrifiez Linvala : Choisissez la défense talismanique ou l'indestructible. Les créatures que vous contrôlez acquièrent cette capacité jusqu'à la fin du tour.", "type": "Créature légendaire : ange et sorcier"}, {"language": "Japanese", "multiverseId": 495881, "name": "海門の擁護者、リンヴァーラ", "text": "飛行\nあなたのターンの戦闘の開始時に、あなたのパーティーが全員そろっている場合、対戦相手がコントロールしていて土地でないパーマネント１つを対象とする。あなたの次のターンまで、それでは攻撃もブロックもできず、それの起動型能力は起動できない。\n海門の擁護者、リンヴァーラを生け贄に捧げる：呪禁か破壊不能を選ぶ。ターン終了時まで、あなたがコントロールしているクリーチャーはその能力を得る。", "type": "伝説のクリーチャー — 天使・ウィザード"}], "frameEffects": ["legendary", "extendedart"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "237487", "cardKingdomId": "236928", "cardsphereId": "71276", "mcmId": "494714", "mcmMetaId": "315969", "mtgjsonV4Id": "32b1bdba-cf80-5ee0-87de-a42ea08a9935", "multiverseId": "495656", "scryfallId": "15500025-e5ba-4f02-b875-bfa1b1a76875", "scryfallIllustrationId": "dc54eb31-6f02-477f-a5a8-f7f82c51bdec", "scryfallOracleId": "afd8ff3e-1d57-4fc5-91dc-1a8400c98787", "tcgplayerProductId": "221797"}, "isStarter": true, "keywords": ["Flying"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}{U}", "manaValue": 3.0, "name": "Linvala, Shield of Sea Gate", "number": "368", "originalText": "Flying\nAt the beginning of combat on your turn, if you have a full party, choose target nonland permanent an opponent controls. Until your next turn, it can't attack or block, and its activated abilities can't be activated.\nSacrifice Linvala: Choose hexproof or indestructible. Creatures you control gain that ability until end of turn.", "originalType": "Legendary Creature — Angel Wizard", "power": "3", "printings": ["PLIST", "PRM", "PZNR", "ZNR"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/bd09e76f3bc61243", "cardKingdomFoil": "https://mtgjson.com/links/b6db912cb0f6fc24", "cardmarket": "https://mtgjson.com/links/e472b15b6ffb8572", "tcgplayer": "https://mtgjson.com/links/d5048cc454fa9997"}, "rarity": "rare", "rulings": [{"date": "2020-09-25", "text": "Linvala’s middle ability won’t trigger at all if you don’t have a full party as your combat phase begins. It won’t affect the target if you don’t have a full party as it resolves. The number of creatures in your party may change between these times, however."}, {"date": "2020-09-25", "text": "The nonland permanent remains affected until your next turn even if the number of creatures in your party changes or Linvala leaves the battlefield."}, {"date": "2020-09-25", "text": "Activated abilities contain a colon. They’re generally written “[Cost]: [Effect].” Some keyword abilities (such as equip) are activated abilities and will have a colon in their reminder text. Triggered abilities (starting with “when,” “whenever,” or “at”) are unaffected."}, {"date": "2020-09-25", "text": "No abilities of the affected permanent can be activated, including mana abilities."}, {"date": "2020-09-25", "text": "In a multiplayer game, if you leave the game after Linvala’s middle ability resolves but before your next turn begins, its effect lasts until your next turn would have begun. It neither expires immediately nor lasts indefinitely."}, {"date": "2020-09-25", "text": "To determine “the number of creatures in your party,” check whether you control a Cleric, whether you control a Rogue, whether you control a Warrior, and whether you control a Wizard. The number is the total number of those checks to which you answered yes. Each creature you control can be counted for only one of those checks."}, {"date": "2020-09-25", "text": "If a creature has more than one party creature type, and there are multiple ways to count that creature that could result in a different number of creatures in your party, the highest such number is used. For example, if you control a Cleric and a Cleric Wizard, the number of creatures in your party is two. You can’t choose to have it be just one by counting the Cleric Wizard first as a Cleric."}, {"date": "2020-09-25", "text": "An ability referring to the number of creatures in your party gets a number from zero to four. Such abilities never ask which creatures are in your party, and you never have to designate specific creatures as being in your party. You can’t choose to exclude creatures from this count to lower the number."}, {"date": "2020-09-25", "text": "Some cards refer to you having a “full party.” This is true if the number of creatures in your party is four."}], "securityStamp": "oval", "setCode": "ZNR", "subtypes": ["Angel", "Wizard"], "supertypes": ["Legendary"], "text": "Flying\nAt the beginning of combat on your turn, if you have a full party, choose target nonland permanent an opponent controls. Until your next turn, it can't attack or block, and its activated abilities can't be activated.\nSacrifice Linvala: Choose hexproof or indestructible. Creatures you control gain that ability until end of turn.", "toughness": "3", "type": "Legendary Creature — Angel Wizard", "types": ["Creature"], "uuid": "fbe1c556-c85d-5da0-bfa5-1660855f0280", "variations": ["39ef7d4c-e9ec-507b-8c3b-aadb90a43490"]}