{"artist": "Colin Boyer", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 4.0, "edhrecRank": 780, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 495738, "name": "Lithoform-Maschine", "text": "{2}, {T}: Kopiere eine aktivierte oder ausgelöste Fähigkeit deiner Wahl, die du kontrollierst. Du kannst neue Ziele für die Kopie bestimmen.\n{3}, {T}: Kopiere einen Spontanzauber oder eine Hexerei deiner Wahl, den bzw. die du kontrollierst. Du kannst neue Ziele für die Kopie bestimmen.\n{4}, {T}: Kopiere einen Bleibende-Karte-Zauberspruch deiner Wahl, den du kontrollierst.", "type": "Legendäres Artefakt"}, {"language": "French", "multiverseId": 495813, "name": "Machine lithoforme", "text": "{2}, {T} : Copiez une capacité activée ou déclenchée ciblée que vous contrôlez. Vous pouvez choisir de nouvelles cibles pour cette copie.\n{3}, {T} : Copiez un sort d'éphémère ou de rituel ciblé que vous contrôlez. Vous pouvez choisir de nouvelles cibles pour cette copie.\n{4}, {T} : Copiez un sort de permanent ciblé que vous contrôlez.", "type": "Artefact légendaire"}, {"language": "Japanese", "multiverseId": 495888, "name": "石成エンジン", "text": "{2}, {T}：あなたがコントロールしていて起動型か誘発型である能力１つを対象とする。それをコピーする。あなたはそのコピーの新しい対象を選んでもよい。\n{3}, {T}：あなたがコントロールしていてインスタントかソーサリーである呪文１つを対象とする。それをコピーする。あなたはそのコピーの新しい対象を選んでもよい。\n{4}, {T}：あなたがコントロールしているパーマネント・呪文１つを対象とする。それをコピーする。", "type": "伝説のアーティファクト"}], "frameEffects": ["legendary", "extendedart"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "237553", "cardKingdomId": "237227", "cardsphereId": "71203", "mcmId": "496445", "mcmMetaId": "317015", "mtgjsonV4Id": "f7344a60-d02e-592b-82b1-43530141492c", "multiverseId": "495663", "scryfallId": "e3b02012-56b1-4386-936b-139480162e8f", "scryfallIllustrationId": "7c437d4f-08c2-477a-a056-4f5611abe1be", "scryfallOracleId": "0bf299da-1854-4153-baea-3cee2eb01ee8", "tcgplayerProductId": "222109"}, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}", "manaValue": 4.0, "name": "Lithoform Engine", "number": "375", "originalText": "{2}, {T}: Copy target activated or triggered ability you control. You may choose new targets for the copy.\n{3}, {T}: Copy target instant or sorcery spell you control. You may choose new targets for the copy.\n{4}, {T}: Copy target permanent spell you control.", "originalType": "Legendary Artifact", "printings": ["BRC", "PRM", "PZNR", "ZNR"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7d1c812e22b24f79", "cardKingdomFoil": "https://mtgjson.com/links/5318b9587ff75c03", "cardmarket": "https://mtgjson.com/links/c254e25d8952c17d", "tcgplayer": "https://mtgjson.com/links/82f1913c2cbc478a"}, "rarity": "mythic", "rulings": [{"date": "2020-09-25", "text": "The source of the copy from Lithoform Engine's first ability is the same as the source of the original ability."}, {"date": "2020-09-25", "text": "Activated abilities contain a colon. They're generally written “[Cost]: [Effect].” Some keyword abilities (such as equip) are activated abilities and will have a colon in their reminder text."}, {"date": "2020-09-25", "text": "Triggered abilities use the word “when,” “whenever,” or “at.” They're often written as “[Trigger condition], [effect].” Some keywords (such as prowess) are triggered abilities and will use “when,” “whenever,” or “at” in their reminder text."}, {"date": "2020-09-25", "text": "Lithoform Engine's first ability targets an activated or triggered ability that is on the stack and creates another instance of that ability on the stack. It doesn't cause any object to gain an ability."}, {"date": "2020-09-25", "text": "If an ability is linked to a second ability, copies of that first ability are also linked to that second ability. If the second ability refers to “the exiled card,” it refers to all cards exiled by the first ability and the copy. For example, if Fiend Hunter's enters-the-battlefield ability is copied and two creatures are exiled, they both return when Fiend Hunter leaves the battlefield."}, {"date": "2020-09-25", "text": "Lithoform Engine can copy any spell or ability on the stack, not just one with targets. If a permanent spell is copied, new targets can't be chosen for it, if it has any (perhaps because it's an Aura or a mutating creature spell)."}, {"date": "2020-09-25", "text": "The copy is created on the stack, so it's not “cast” or “activated.” Creating the copy won't cause abilities that trigger when a player casts a spell or activates an ability to trigger. Abilities that say that a triggered ability triggers additional times won't apply to copying a triggered ability."}, {"date": "2020-09-25", "text": "The copy will resolve before the original spell or ability does."}, {"date": "2020-09-25", "text": "The copy will have the same targets as the spell or ability it's copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can't choose a new legal target, then it remains unchanged (even if the current target is illegal)."}, {"date": "2020-09-25", "text": "If the spell or ability that's copied is modal (that is, it says “Choose one —” or the like), the copy will have the same mode. A different mode can't be chosen. This doesn't apply to copying a permanent spell with a modal enters-the-battlefield triggered ability, but it does apply to copying that ability."}, {"date": "2020-09-25", "text": "If the spell or ability that's copied has an X whose value was determined as it was cast or activated, the copy will have the same value of X."}, {"date": "2020-09-25", "text": "If the spell or ability has damage divided as it was put onto the stack, the division can't be changed, although the targets receiving that damage still can. The same is true of spells and abilities that distribute counters."}, {"date": "2020-09-25", "text": "You can't choose to pay any alternative or additional costs for the copy. However, effects based on any alternative or additional costs that were paid for the original spell are copied as though those same costs were paid for the copy. Most notably, if the original spell was kicked, the copy is kicked."}, {"date": "2020-09-25", "text": "Any choices made when the spell or ability resolves won't have been made yet when it's copied. Any such choices will be made separately when the copy resolves. Most notably, if a triggered ability asks you to pay a cost (such as that of Leyline Tyrant), you pay that cost for the copy if you wish to have it paid."}, {"date": "2020-09-25", "text": "If a permanent spell is copied, it's put onto the battlefield as a token as the spell resolves rather than putting the copy of the spell onto the battlefield. The rules that apply to a permanent spell becoming a permanent apply to a copy of a spell becoming a token."}, {"date": "2020-09-25", "text": "The token that a resolving copy of a spell becomes isn't said to have been “created.”"}], "securityStamp": "oval", "setCode": "ZNR", "subtypes": [], "supertypes": ["Legendary"], "text": "{2}, {T}: Copy target activated or triggered ability you control. You may choose new targets for the copy.\n{3}, {T}: Copy target instant or sorcery spell you control. You may choose new targets for the copy.\n{4}, {T}: Copy target permanent spell you control. (The copy becomes a token.)", "type": "Legendary Artifact", "types": ["Artifact"], "uuid": "3d0db380-3fa9-5ed1-8106-535eba2c266d", "variations": ["798c7a62-d5cc-51a9-9a7c-c63cdd8f79f3"]}