{"artist": "Adrián Rodríguez Pérez", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 10040, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "266398", "cardsphereId": "94319", "mtgjsonV4Id": "0dbffe5e-45cc-5b0e-9a67-647ed3dc89b2", "scryfallId": "1ad67201-0613-4d4f-9b1d-898a882b3503", "scryfallIllustrationId": "4dc79b9a-5274-42da-9d81-623f505fc5ba", "scryfallOracleId": "fd03f20a-d365-48fb-8b2a-ad4b502a0045", "tcgplayerProductId": "286420"}, "isAlternative": true, "isStarter": true, "keywords": ["Enmitic Exterminator", "Flying", "Unearth"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{1}{B}{B}{B}", "manaValue": 4.0, "name": "Lokhust Heavy Destroyer", "number": "38★", "power": "3", "printings": ["40K"], "promoTypes": ["surgefoil"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/9723a48c1d66caa0", "tcgplayer": "https://mtgjson.com/links/ece2156ad115ed5c"}, "rarity": "rare", "rulings": [{"date": "2022-10-07", "text": "When its triggered ability resolves, you may sacrifice Lokhust Heavy Destroyer itself. If you control no other creatures, you'll have to sacrifice it. If it was unearthed, it will be exiled."}, {"date": "2022-10-07", "text": "As Lokhust Heavy Destroyer’s triggered ability resolves, first the player whose turn it is chooses a creature to sacrifice, then each other player in turn order does the same knowing the choices made before them. Then all those creatures are sacrificed simultaneously."}, {"date": "2022-10-07", "text": "If you activate a card’s unearth ability but that card is removed from your graveyard before the ability resolves, that unearth ability will resolve and do nothing."}, {"date": "2022-10-07", "text": "Activating a permanent card's unearth ability isn’t the same as casting it as a spell. The unearth ability is put on the stack, but the card is not. Spells and abilities that interact with activated abilities (such as Stifle) will interact with unearth, but spells and abilities that interact with spells (such as Cancel) will not."}, {"date": "2022-10-07", "text": "If a permanent returned to the battlefield by an unearth ability would leave it for any reason, it’s exiled instead—unless the spell or ability that's causing it to leave the battlefield is actually trying to exile it. In that case, the spell or ability succeeds at exiling the permanent. If the spell or ability later returns the card to the battlefield, it will return as a new object with no relation to its previous existence. The unearth effect will no longer apply to it."}, {"date": "2022-10-07", "text": "At the beginning of the end step, a permanent returned to the battlefield with unearth is exiled. This is a delayed triggered ability, and it can be countered by effects that counter triggered abilities. If the ability is countered, the permanent will stay on the battlefield and the delayed trigger won’t trigger again. However, the replacement effect will still exile it if it eventually leaves the battlefield."}, {"date": "2022-10-07", "text": "Unearth grants haste to the permanent that’s returned to the battlefield. However, neither of the “exile” abilities is granted to that permanent. If that creature loses all its abilities, it will still be exiled at the beginning of the end step, and if it would leave the battlefield, it is still exiled instead."}], "securityStamp": "triangle", "setCode": "40K", "subtypes": ["Necron"], "supertypes": [], "text": "Flying\nEnmitic Exterminator — When Lokhust Heavy Destroyer enters the battlefield, each player sacrifices a creature.\nUnearth {5}{B}{B}{B} ({5}{B}{B}{B}: Return this card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.)", "toughness": "2", "type": "Artifact Creature — Necron", "types": ["Artifact", "Creature"], "uuid": "0aedcd78-1c19-5b1a-89ef-0ac7aeadbfbc", "variations": ["a346e73e-f771-5eab-992a-94abb5c50b62"]}