{"artist": "Jaime Jones", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 20273, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 405971, "name": "Einsamer Wiedergänger", "text": "Fluchsicher (Diese Kreatur kann nicht das Ziel von Zaubersprüchen oder Fähigkeiten sein, die deine Gegner kontrollieren.)Immer wenn der Einsame Wiedergänger einem Spieler Kampfschaden zufügt und falls du keine anderen Kreaturen kontrollierst, schaue dir die obersten vier Karten deiner Bibliothek an. Nimm eine davon auf deine Hand und lege den Rest in beliebiger Reihenfolge unter deine Bibliothek.", "type": "Kreatur — Geist"}, {"language": "Spanish", "multiverseId": 407339, "name": "Aparecido solitario", "text": "Antimaleficio. (Esta criatura no puede ser objetivo de hechizos o habilidades que controlan tus oponentes.)Siempre que el Aparecido solitario haga daño de combate a un jugador, si no controlas otras criaturas, mira las cuatro primeras cartas de tu biblioteca. Pon una de ellas en tu mano y el resto en el fondo de tu biblioteca en cualquier orden.", "type": "Criatura — Espíritu"}, {"language": "French", "multiverseId": 406313, "name": "Revenant solitaire", "text": "Défense talismanique (Cette créature ne peut pas être la cible de sorts ou de capacités que vos adversaires contrôlent.)À chaque fois que le Revenant solitaire inflige des blessures de combat à un joueur, si vous ne contrôlez pas d'autre créature, regardez les quatre cartes du dessus de votre bibliothèque. Mettez l'une d'elles dans votre main et le reste au-dessous de votre bibliothèque, dans l'ordre de votre choix.", "type": "Créature : esprit"}, {"language": "Italian", "multiverseId": 406655, "name": "Redivivo Solitario", "text": "Anti-malocchio (Questa creatura non può essere bersaglio di magie o abilità controllate dai tuoi avversari.)Ogniqualvolta il Redivivo Solitario infligge danno da combattimento a un giocatore, se non controlli altre creature, guarda le prime quattro carte del tuo grimorio. Aggiungi una di quelle carte alla tua mano e metti le altre in fondo al tuo grimorio in qualsiasi ordine.", "type": "Creatura — Spirito"}, {"language": "Japanese", "multiverseId": 406997, "name": "孤独な亡霊", "text": "呪禁（このクリーチャーは、対戦相手がコントロールする呪文や能力の対象にならない。）孤独な亡霊がプレイヤー１人に戦闘ダメージを与えるたび、あなたが他にクリーチャーをコントロールしていない場合、あなたのライブラリーの一番上から４枚のカードを見る。それらのうちの１枚をあなたの手札に加え、残りをあなたのライブラリーの一番下に望む順番で置く。", "type": "クリーチャー — スピリット"}, {"language": "Chinese Simplified", "multiverseId": 405629, "name": "独行复灵", "text": "辟邪（此生物不能成为由对手所操控之咒语或异能的目标。）每当独行复灵对任一牌手造成战斗伤害时，若你未操控其他生物，则检视你牌库顶的四张牌。将其中一张置于你手上，其余的牌则以任意顺序置于你的牌库底。", "type": "生物～精怪"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "203400", "cardsphereId": "10419", "mcmId": "285851", "mcmMetaId": "205517", "mtgjsonV4Id": "8fe1d6f8-d645-517a-97f4-b6606f39cbb9", "multiverseId": "405287", "scryfallId": "5cb09a51-07c1-4047-81cd-67219c01e9b3", "scryfallIllustrationId": "9813c0cc-4f42-4906-a8fb-8d40b0b7fbcf", "scryfallOracleId": "5d814b0b-82e8-4145-87e1-4fed44d16465", "tcgplayerProductId": "107983"}, "isReprint": true, "isStarter": true, "keywords": ["Hexproof"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}{U}", "manaValue": 5.0, "name": "Lone Revenant", "number": "96", "originalText": "Hexproof (This creature can't be the target of spells or abilities your opponents control.)\nWhenever Lone Revenant deals combat damage to a player, if you control no other creatures, look at the top four cards of your library. Put one of them into your hand and the rest on the bottom of your library in any order.", "originalType": "Creature — Spirit", "power": "4", "printings": ["AVR", "C15"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/5d53d1327540b44e", "cardmarket": "https://mtgjson.com/links/6eb8ade18f051866", "tcgplayer": "https://mtgjson.com/links/d0d1ad8baa92b16f"}, "rarity": "rare", "rulings": [{"date": "2012-05-01", "text": "You must put one of the cards into your hand, even if you’d rather put all four on the bottom of your library."}, {"date": "2012-05-01", "text": "If you control Lone Revenant and any other creature (including another Lone Revenant), its ability won’t trigger."}, {"date": "2012-05-01", "text": "Check whether Lone Revenant’s ability triggers after combat damage is dealt but before any creatures that are destroyed due to combat damage leave the battlefield. For example, if you control Lone Revenant and another creature, and that other creature takes lethal damage in the same combat damage step that Lone Revenant deals damage to a player, Lone Revenant’s ability won’t trigger."}, {"date": "2012-05-01", "text": "If you control no creatures when Lone Revenant’s ability resolves, you’ll still look at the top four cards and put one into your hand."}], "securityStamp": "oval", "setCode": "C15", "subtypes": ["Spirit"], "supertypes": [], "text": "Hexproof (This creature can't be the target of spells or abilities your opponents control.)\nWhenever Lone Revenant deals combat damage to a player, if you control no other creatures, look at the top four cards of your library. Put one of them into your hand and the rest on the bottom of your library in any order.", "toughness": "4", "type": "Creature — Spirit", "types": ["Creature"], "uuid": "37b1a8b9-6ec5-5a11-96e6-1b66a9fae33d"}