{"artist": "Rachel Turian", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "250094", "cardsphereId": "83059", "mcmId": "415049", "mtgjsonV4Id": "a4844727-39c1-58dc-aea0-8d9e924c705b", "scryfallId": "ef2c9489-8800-4d04-aedc-d9c4b0ea9c6a", "scryfallIllustrationId": "ccfe9b8d-f4c6-4d90-8476-430fc5dd97d8", "scryfallOracleId": "a9745ef6-b961-4fb4-9dde-4097c09bd92d", "tcgplayerProductId": "247000"}, "isFunny": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {}, "manaCost": "{2}{U}", "manaValue": 3.0, "name": "Loopy Lobster", "number": "26", "power": "?", "printings": ["CMB1", "CMB2"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/e6d9452dad83fb1c", "tcgplayer": "https://mtgjson.com/links/684383b40a3a5b85"}, "rarity": "rare", "rulings": [{"date": "2019-11-12", "text": "A permanent with four-faced starts at stage 1."}, {"date": "2019-11-12", "text": "If Loopy Lobster somehow enters the battlefield tapped, it will still be at stage 1."}, {"date": "2019-11-12", "text": "If an object becomes a copy of a permanent with four-faced, that object remains at the stage it was. If it wasn’t at a stage, it’s at stage 1."}, {"date": "2019-11-12", "text": "A creature card with four-faced that isn’t on the battlefield is a 0/0 creature."}, {"date": "2019-11-12", "text": "Activating Loopy Lobster’s stage 3 ability creates an effect that lasts even if it moves to stage 4 during that turn."}, {"date": "2019-11-12", "text": "Evolve means “Whenever a creature enters the battlefield under your control, if that creature has greater power or toughness than this creature, put a +1/+1 counter on this creature.”"}, {"date": "2019-11-12", "text": "When comparing the stats of the two creatures for evolve, you always compare power to power and toughness to toughness."}, {"date": "2019-11-12", "text": "Whenever a creature enters the battlefield under your control, check its power and toughness against the power and toughness of the creature with evolve. If neither stat of the new creature is greater, evolve won’t trigger at all."}, {"date": "2019-11-12", "text": "If evolve triggers, the stat comparison will happen again when the ability tries to resolve. If neither stat of the new creature is greater, the ability will do nothing. If the creature that entered the battlefield leaves the battlefield before evolve tries to resolve, use its last known power and toughness to compare the stats."}, {"date": "2019-11-12", "text": "If a creature enters the battlefield with +1/+1 counters on it, consider those counters when determining if evolve will trigger. For example, a 1/1 creature that enters the battlefield with two +1/+1 counters on it will cause the evolve ability of a 2/2 creature to trigger."}, {"date": "2019-11-12", "text": "If multiple creatures enter the battlefield at the same time, evolve may trigger multiple times, although the stat comparison will take place each time one of those abilities tries to resolve. For example, if you control a 2/2 creature with evolve and two 3/3 creatures enter the battlefield, evolve will trigger twice. The first ability will resolve and put a +1/+1 counter on the creature with evolve. When the second ability tries to resolve, neither the power nor the toughness of the new creature is greater than that of the creature with evolve, so that ability does nothing."}, {"date": "2019-11-12", "text": "When comparing the stats as the evolve ability resolves, it’s possible that the stat that’s greater changes from power to toughness or vice versa. If this happens, the ability will still resolve and you’ll put a +1/+1 counter on the creature with evolve. For example, if you control a 2/2 creature with evolve and a 1/3 creature enters the battlefield under your control, its toughness is greater so evolve will trigger. In response, the 1/3 creature gets +2/-2. When the evolve trigger tries to resolve, its power is greater. You’ll put a +1/+1 counter on the creature with evolve."}], "setCode": "CMB2", "subtypes": ["Lobster"], "supertypes": [], "text": "Four-faced (Whenever this becomes tapped, move it to the next stage, or to stage 1 if it's at stage 4.)\nStage 1 — (1/4)\nStage 2 — (4/1) Evolve\nStage 3 — (2/4) {U}: Loopy Lobster gets +1/-1 until end of turn.\nStage 4 — (4/4) Vigilance. {T}: Draw 2 cards.", "toughness": "?", "type": "Creature — Lobster", "types": ["Creature"], "uuid": "c6ca0e72-181a-56cb-a617-90fce4aaba88"}