{"artist": "Brandon Kitkouski", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 10334, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 509678, "name": "Verlorene Auraschöpfer", "text": "Verschwinden 3 (Diese Kreatur kommt mit drei Zeitmarken ins Spiel. Entferne zu Beginn deines Versorgungssegments eine Zeitmarke von ihr. Wenn die letzte Zeitmarke entfernt wird, opfere sie.)\nWenn die Verlorenen Auraschöpfer sterben und falls keine Zeitmarken auf ihnen lagen, kannst du deine Bibliothek nach einer Verzauberungskarte durchsuchen, sie ins Spiel bringen und dann deine Bibliothek mischen.", "type": "Kreatur — Mensch, Zauberer"}, {"language": "Spanish", "multiverseId": 509967, "name": "Auramantes perdidos", "text": "Desmaterializarse 3. (Esta criatura entra al campo de batalla con tres contadores de tiempo sobre ella. Al comienzo de tu mantenimiento, remueve un contador de tiempo de ella. Cuando sea removido el último, sacrifícala.)\nCuando los Auramantes perdidos mueran, si no tenían contadores de tiempo sobre ellos, puedes buscar en tu biblioteca una carta de encantamiento, ponerla en el campo de batalla y luego barajar tu biblioteca.", "type": "Criatura — Hechicero humano"}, {"language": "French", "multiverseId": 510256, "name": "Auramanciens égarés", "text": "Disparition 3 (Cette créature arrive sur le champ de bataille avec, sur elle, trois marqueurs « temps ». Au début de votre entretien, retirez-lui un marqueur « temps ». Quand le dernier marqueur est retiré, sacrifiez le permanent.)\nQuand les Auramanciens égarés meurent, s'ils n'avaient aucun marqueur « temps » sur eux, vous pouvez chercher dans votre bibliothèque une carte d'enchantement, la mettre sur le champ de bataille, puis mélanger votre bibliothèque.", "type": "Créature : humain et sorcier"}, {"language": "Italian", "multiverseId": 510545, "name": "Auramanti Persi", "text": "Evanescenza 3 (Questa creatura entra nel campo di battaglia con tre segnalini tempo. All'inizio del tuo mantenimento, rimuovi un segnalino tempo da essa. Quando l'ultimo viene rimosso, sacrificala.)\nQuando gli Auramanti Persi muoiono, se non avevano segnalini tempo, puoi passare in rassegna il tuo grimorio per una carta incantesimo e metterla sul campo di battaglia, poi rimescola il tuo grimorio.", "type": "Creatura — Mago Umano"}, {"language": "Japanese", "multiverseId": 510834, "name": "迷えるオーラ術師", "text": "消失３（このクリーチャーは、時間カウンター３個が置かれた状態で戦場に出る。あなたのアップキープの開始時に、これの上から時間カウンター１個を取り除く。最後の１個を取り除いたとき、これを生け贄に捧げる。）\n迷えるオーラ術師が死亡したとき、これの上に時間カウンターが置かれていなかった場合、あなたは「あなたのライブラリーからエンチャント・カード１枚を探し、戦場に出す。その後、あなたのライブラリーを切り直す。」を選んでもよい。", "type": "クリーチャー — 人間・ウィザード"}, {"language": "Portuguese (Brazil)", "multiverseId": 511123, "name": "Auromantes Perdidos", "text": "Desaparecer 3 (Esta criatura entra no campo de batalha com três marcadores temporais. No início da sua manutenção, remova um marcador temporal dela. Quando o último for removido, sacrifique-a.)\nQuando Auromantes Perdidos morre, se ele não tinha marcadores temporais, você pode procurar em seu grimório um card de encantamento, colocá-lo no campo de batalha e depois embaralhar seu grimório.", "type": "Criatura — Humano Mago"}, {"language": "Russian", "multiverseId": 511412, "name": "Забытые Ауроманты", "text": "Исчезновение 3 (Это существо выходит на поле битвы с тремя временными жетонами на нем. В начале вашего шага поддержки удалите с него один временной жетон. Когда удален последний временной жетон, пожертвуйте это существо.)\nКогда Забытые Ауроманты умирают, если на них не было временных жетонов, вы можете найти в вашей библиотеке карту чар, положить ее на поле битвы, затем перетасовать вашу библиотеку.", "type": "Существо — Человек Чародей"}, {"language": "Chinese Simplified", "multiverseId": 511701, "name": "迷失灵气法师", "text": "消逝3（此生物进战场时上面有三个计时指示物。在你的维持开始时，从其上移去一个计时指示物。当移去最后一个时，将它牺牲。）\n当迷失灵气法师死去时，若其上没有计时指示物，则你可以从你的牌库中搜寻一张结界牌，将之放进战场，然后将你的牌库洗牌。", "type": "生物 ～人类／法术师"}, {"language": "Chinese Traditional", "multiverseId": 511990, "name": "迷失靈氣法師", "text": "消逝3（此生物進戰場時上面有三個計時指示物。在你的維持開始時，從其上移去一個計時指示物。當移去最後一個時，將它犧牲。）\n當迷失靈氣法師死去時，若其上沒有計時指示物，則你可以從你的牌庫中搜尋一張結界牌，將之放進戰場，然後將你的牌庫洗牌。", "type": "生物 ～人類／魔法師"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "242941", "cardKingdomId": "242436", "cardsphereId": "74619", "mcmId": "542581", "mcmMetaId": "8932", "mtgjsonV4Id": "00f62bbe-e888-5411-bf87-95e523b015b5", "mtgoId": "86411", "multiverseId": "509389", "scryfallId": "c0595c72-5b32-4d7b-8efc-7ce5c83504dd", "scryfallIllustrationId": "33493a1e-c7b7-4269-ae0b-60f7f7369a33", "scryfallOracleId": "9adf1568-248a-4a41-807e-2d7bc6f4f84d", "tcgplayerProductId": "233453"}, "isReprint": true, "keywords": ["Vanishing"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}{W}", "manaValue": 4.0, "name": "Lost Auramancers", "number": "24", "originalText": "Vanishing 3 (This creature enters the battlefield with three time counters on it. At the beginning of your upkeep, remove a time counter from it. When the last is removed, sacrifice it.)\nWhen Lost Auramancers dies, if it had no time counters on it, you may search your library for an enchantment card, put it onto the battlefield, then shuffle your library.", "originalType": "Creature — Human Wizard", "power": "3", "printings": ["FUT", "TSR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2e370901e8bd1173", "cardKingdomFoil": "https://mtgjson.com/links/04a21fb6adace530", "cardmarket": "https://mtgjson.com/links/8e3daffb3022f600", "tcgplayer": "https://mtgjson.com/links/537e65b9510dfa95"}, "rarity": "uncommon", "rulings": [{"date": "2021-03-19", "text": "If an Aura is put onto the battlefield without being cast, the Aura’s controller-to-be chooses what it will enchant as it enters the battlefield. An Aura put onto the battlefield this way doesn’t target anything (so it could be attached to a permanent with shroud, for example), but the Aura’s enchant ability restricts what it can be attached to. If the Aura can’t legally be attached to anything, it remains in its current zone."}], "setCode": "TSR", "subtypes": ["Human", "Wizard"], "supertypes": [], "text": "Vanishing 3 (This creature enters the battlefield with three time counters on it. At the beginning of your upkeep, remove a time counter from it. When the last is removed, sacrifice it.)\nWhen Lost Auramancers dies, if it had no time counters on it, you may search your library for an enchantment card, put it onto the battlefield, then shuffle.", "toughness": "3", "type": "Creature — Human Wizard", "types": ["Creature"], "uuid": "58178a9e-a648-5955-9d76-1bc276ae9491"}