{"artist": "Michael Komarck", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 2.0, "edhrecRank": 1236, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 204105, "name": "Aufstieg des Luminarchen", "text": "Zu Beginn des Endsegments jedes Gegners kannst du eine Quest-Marke auf den Aufstieg des Luminarchen legen, falls du in diesem Zug keine Lebenspunkte verloren hast. (Schaden verursacht den Verlust von Lebenspunkten.)\n{1}{W}: Bringe einen 4/4 weißen Engel-Kreaturenspielstein mit Flugfähigkeit ins Spiel. Aktiviere diese Fähigkeit nur, falls auf dem Aufstieg des Luminarchen vier oder mehr Quest-Marken liegen.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 202760, "name": "Ascenso del luminarca", "text": "Al comienzo del paso final de cada oponente, si no perdiste vidas este turno, puedes poner un contador de búsqueda sobre el Ascenso del luminarca. (El daño causa pérdida de vidas.)\n{1}{W}: Pon en el campo de batalla una ficha de criatura Ángel blanca 4/4 con la habilidad de volar. Activa esta habilidad sólo si el Ascenso del luminarca tiene cuatro o más contadores de búsqueda sobre él.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 204374, "name": "Ascension du luminarque", "text": "Au début de l'étape de fin de chaque adversaire, si vous n'avez pas perdu de points de vie ce tour-ci, vous pouvez mettre un marqueur « quête » sur l'Ascension du luminarque. (Les blessures provoquent la perte de points de vie.)\n{1}{W} : Mettez sur le champ de bataille un jeton de créature 4/4 blanche Ange avec le vol. N'activez cette capacité que si l'Ascension du luminarque a au moins quatre marqueurs « quête » sur elle.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 203029, "name": "Ascensione del Luminarca", "text": "All'inizio della sottofase finale di ogni avversario, se non hai perso punti vita in questo turno, puoi mettere un segnalino ricerca sull'Ascensione del Luminarca. (Il danno provoca la perdita di punti vita.)\n{1}{W}: Metti sul campo di battaglia una pedina creatura Angelo 4/4 bianca con volare. Attiva questa abilità solo se l'Ascensione del Luminarca ha quattro o più segnalini ricerca.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 203836, "name": "光輝王の昇天", "text": "各対戦相手の終了ステップの開始時に、このターンあなたがライフを失っていない場合、あなたは光輝王の昇天の上に探索カウンターを１個置いてもよい。 （ダメージによりライフは失われる。）\n{1}{W}：飛行を持つ白の４/４の天使・クリーチャー・トークンを１体戦場に出す。 この能力は、光輝王の昇天の上に４個以上の探索カウンターが置かれている場合にのみ起動できる。", "type": "エンチャント"}, {"language": "Portuguese (Brazil)", "multiverseId": 203567, "name": "Ascensão do Luminarca", "text": "No início da etapa final de cada oponente, se você não perdeu pontos de vida neste turno, poderá colocar um marcador de busca em Ascensão do Luminarca. (Dano causa perda de pontos de vida.)\n{1}{W}: Coloque no campo de batalha uma ficha de criatura branca 4/4 do tipo Anjo com voar. Ative esta habilidade somente se Ascensão do Luminarca tiver quatro ou mais marcadores de busca.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 203298, "name": "Возвышение Световладыки", "text": "В начале заключительного шага каждого оппонента, если в этом ходу вы не потеряли ни одной жизни, вы можете положить жетон странствий на Возвышение Световладыки. (Повреждения вызывают потерю жизней.)\n{1}{W}: положите на поле битвы одну фишку существа 4/4 белый Ангел с Полетом. Активируйте эту способность, только если на Возвышении Световладыки есть не менее четырех жетонов странствий.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 204643, "name": "辉侯腾扬", "text": "在每位对手的结束步骤开始时，若你本回合并未失去生命值，你可以在辉侯腾扬上放置一个探索指示物。 （伤害会导致失去生命。）\n{1}{W}：将一个4/4白色，具飞行异能的天使衍生物放进战场。 只能于辉侯腾扬上有四个或更多探索指示物时起动此异能。", "type": "结界"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "128096", "cardKingdomId": "127840", "cardsphereId": "47868", "mcmId": "21725", "mcmMetaId": "10722", "mtgjsonV4Id": "aadde278-0267-5096-bf80-ad89e445aabf", "mtgoFoilId": "34817", "mtgoId": "34816", "multiverseId": "197889", "scryfallId": "e9f3a20f-a788-4d8b-946b-d9c1c983a85a", "scryfallIllustrationId": "b3b760ee-095f-497e-b741-414327d5947a", "scryfallOracleId": "90076bf5-aa9a-4a6e-9035-9aa97fd5561e", "tcgplayerProductId": "33358"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}", "manaValue": 2.0, "name": "Luminarch Ascension", "number": "25", "originalText": "At the beginning of each opponent's end step, if you didn't lose life this turn, you may put a quest counter on Luminarch Ascension. (Damage causes loss of life.)\n{1}{W}: Put a 4/4 white Angel creature token with flying onto the battlefield. Activate this ability only if Luminarch Ascension has four or more quest counters on it.", "originalType": "Enchantment", "printings": ["A25", "PS11", "ZEN"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/303bef7d3eb74fd6", "cardKingdomFoil": "https://mtgjson.com/links/39f02f487b4338a0", "cardmarket": "https://mtgjson.com/links/37dba1eb78950a57", "tcgplayer": "https://mtgjson.com/links/3f15f63febb19f75"}, "rarity": "rare", "rulings": [{"date": "2018-03-16", "text": "Luminarch Ascension’s first ability doesn’t trigger if you have lost life before an opponent’s end step begins. If it does trigger but you lose life before it resolves, it does nothing and you won’t put a quest counter on Luminarch Ascension."}, {"date": "2018-03-16", "text": "Luminarch Ascension’s first ability cares only whether you lost life this turn, even if Luminarch Ascension wasn’t on the battlefield when that happened. It doesn’t care how much you lost, whether you also gained life, or even whether you gained more life than you lost."}, {"date": "2018-03-16", "text": "You can activate Luminarch Ascension’s last ability during the end step in which it receives its fourth quest counter."}, {"date": "2018-03-16", "text": "In a Two-Headed Giant game, Luminarch Ascension’s first ability will trigger twice at the beginning of the opposing team’s end step if you didn’t lose life that turn. It doesn’t matter whether your teammate lost life or not."}], "setCode": "ZEN", "subtypes": [], "supertypes": [], "text": "At the beginning of each opponent's end step, if you didn't lose life this turn, you may put a quest counter on Luminarch Ascension. (Damage causes loss of life.)\n{1}{W}: Create a 4/4 white Angel creature token with flying. Activate only if Luminarch Ascension has four or more quest counters on it.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "b08e425e-dc91-58fe-a97d-3bd6c1564932"}