{"artist": "Carl Frank", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 5.0, "edhrecRank": 21718, "finishes": ["nonfoil", "foil"], "flavorText": "Once it has your scent, it will hunt you from the Gurmag Swamp to Ayagor.", "foreignData": [{"flavorText": "Sobald er die Witterung aufgenommen hat, jagt er dich vom Gurmag-Sumpf bis nach Ayagor.", "language": "German", "multiverseId": 395411, "name": "Lauernder Arynx", "text": "Gewaltig — {2}{G}: Eine Kreatur deiner Wahl blockt den Lauernden Arynx in diesem Zug, falls möglich. Aktiviere diese Fähigkeit nur, falls die Kreaturen, die du kontrollierst, eine Gesamtstärke von 8 oder mehr haben.", "type": "Kreatur — Katze, Bestie"}, {"flavorText": "Si ha descubierto tu olor, te dará caza desde el pantano Gurmag hasta Ayagor.", "language": "Spanish", "multiverseId": 397259, "name": "Árynx furtiva", "text": "Formidable — {2}{G}: La criatura objetivo bloquea a la Árynx furtiva este turno si puede. Activa esta habilidad solo si las criaturas que controlas tienen una fuerza total de 8 o más.", "type": "Criatura — Bestia felino"}, {"flavorText": "Une fois qu'il a senti votre odeur, il vous traquera du marais de Gurmag jusqu'à Ayagor.", "language": "French", "multiverseId": 395675, "name": "Arynx en maraude", "text": "Redoutable — {2}{G} : La créature ciblée bloque l'Arynx en maraude ce tour-ci si possible. N'activez cette capacité que si les créatures que vous contrôlez ont une force totale supérieure ou égale à 8.", "type": "Créature : chat et bête"}, {"flavorText": "Una volta fiutato il tuo odore, ti darà la caccia dalla palude di Gurmag fino ad Ayagor.", "language": "Italian", "multiverseId": 395939, "name": "Arynx in Agguato", "text": "Formidabile — {2}{G}: Una creatura bersaglio blocca l'Arynx in Agguato in questo turno, se può farlo. Attiva questa abilità solo se le creature che controlli hanno una forza totale pari o superiore a 8.", "type": "Creatura — Bestia Felino"}, {"flavorText": "一度獲物の匂いを嗅ぎ付けたら、それをグルマグ沼からアヤゴールまで付け狙うだろう。", "language": "Japanese", "multiverseId": 396203, "name": "隠れ潜むエイリンクス", "text": "圧倒 ― {2}{G}：クリーチャー１体を対象とする。このターン、それは可能なら隠れ潜むエイリンクスをブロックする。この能力は、あなたがコントロールするクリーチャーのパワーの合計が８以上であるときにのみ起動できる。", "type": "クリーチャー — 猫・ビースト"}, {"flavorText": "녀석들은 일단 사냥감의 냄새를 맡으면 거마그에서 아야고르까지라도 사냥감을 쫓는다.", "language": "Korean", "multiverseId": 396467, "name": "잠복한 아린크스", "text": "강대 — {2}{G}: 생물을 목표로 정한다. 그 생물은 이 턴에 가능하면 잠복한 아린크스를 방어해야 한다. 당신이 조종하는 생물들의 공격력 총합이 8 이상인 경우에만 이 능력을 활성화한다.", "type": "생물 — 고양이 야수"}, {"flavorText": "Uma vez que sentir seu cheiro, ela vai persegui-lo do Pântano de Gurmag a Ayagor.", "language": "Portuguese (Brazil)", "multiverseId": 396731, "name": "Arynx Espreitadora", "text": "Formidável — {2}{G}: A criatura alvo bloqueia Arynx Espreitadora neste turno se estiver apta. Ative esta habilidade somente se as criaturas que você controla tiverem um total de poder igual ou superior a 8.", "type": "Criatura — Felino Besta"}, {"flavorText": "Взяв твой след, он будет преследовать тебя от болота Гурмаг до Аягора.", "language": "Russian", "multiverseId": 396995, "name": "Охотящийся Аринкс", "text": "Внушительность — {2}{G}: целевое существо блокирует Охотящегося Аринкса в этом ходу, если может. Активируйте эту способность, только если сумма значений силы существ под вашим контролем равна 8 или больше.", "type": "Существо — Кошка Зверь"}, {"flavorText": "一旦它记住了你的味道，它就会从谷尔玛沼泽一路猎杀你到阿亚戈。", "language": "Chinese Simplified", "multiverseId": 394883, "name": "伏击猛猁", "text": "强横～{2}{G}：目标生物本回合中若能阻挡伏击猛猁，则须阻挡之。只能于由你操控之生物的力量总和等于或大于8时起动此异能。", "type": "生物～猫／野兽"}, {"flavorText": "一旦它記住了你的味道，它就會從谷爾瑪沼澤一路獵殺你到阿亞戈。", "language": "Chinese Traditional", "multiverseId": 395147, "name": "伏擊猛猁", "text": "強橫～{2}{G}：目標生物本回合中若能阻擋伏擊猛猁，則須阻擋之。只能於由你操控之生物的力量總和等於或大於8時起動此異能。", "type": "生物～貓／野獸"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "199889", "cardKingdomId": "199516", "cardsphereId": "13825", "mcmId": "273393", "mcmMetaId": "211354", "mtgjsonV4Id": "604a756d-ee84-5ea2-8484-2a3e7f33dcb9", "mtgoFoilId": "56293", "mtgoId": "56292", "multiverseId": "394619", "scryfallId": "7f59bc0b-88de-4580-bfc8-5af911d9ee99", "scryfallIllustrationId": "01fe03ea-0abb-43d1-ac91-92c5d2ea81a8", "scryfallOracleId": "57303267-7e69-4bd3-8e1f-a528d41121a1", "tcgplayerProductId": "96742"}, "keywords": ["Formidable"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{G}", "manaValue": 5.0, "name": "Lurking Arynx", "number": "192", "originalText": "Formidable — {2}{G}: Target creature blocks Lurking Arynx this turn if able. Activate this ability only if creatures you control have total power 8 or greater.", "originalType": "Creature — Cat Beast", "power": "3", "printings": ["DTK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ed08358909250a69", "cardKingdomFoil": "https://mtgjson.com/links/87e65bd53f733cc0", "cardmarket": "https://mtgjson.com/links/a0643bed32d7551a", "tcgplayer": "https://mtgjson.com/links/010429b00aee8697"}, "rarity": "uncommon", "rulings": [{"date": "2015-02-25", "text": "You may activate Lurking Arynx’s ability multiple times in a turn to force multiple creatures to block it if able."}, {"date": "2015-02-25", "text": "Activating Lurking Arynx’s ability doesn’t force you to attack with it that turn. If it doesn’t attack, the creatures affected by its ability can block other attacking creatures or not block at all."}, {"date": "2015-02-25", "text": "If a creature affected by Lurking Arynx’s ability can’t legally block it (perhaps because Lurking Arynx has gained flying), that creature can block other attacking creatures or not block at all."}, {"date": "2015-02-25", "text": "If, during the declare blockers step, a creature is tapped or is affected by a spell or ability that says it can’t block, it doesn’t block. If there’s a cost associated with having a creature block, its controller isn’t forced to pay that cost, so it doesn’t have to block in that case either."}, {"date": "2015-02-25", "text": "If you control a creature with power less than 0, use its actual power when calculating the total power of creatures you control. For example, if you control three creatures with powers 4, 5, and -2, the total power of creatures you control is 7."}, {"date": "2015-02-25", "text": "Some formidable abilities are activated abilities that require creatures you control to have total power 8 or greater. Once you activate these abilities, it doesn’t matter what happens to the total power of creatures you control."}, {"date": "2015-02-25", "text": "Other formidable abilities are triggered abilities with an “intervening ‘if’” clause. Such abilities check the total power of creatures you control twice: once at the appropriate time to see if the ability will trigger, and again as the ability tries to resolve. If, at that time, the total power of creatures you control is no longer 8 or greater, the ability will have no effect."}], "setCode": "DTK", "subtypes": ["Cat", "Beast"], "supertypes": [], "text": "Formidable — {2}{G}: Target creature blocks Lurking Arynx this turn if able. Activate only if creatures you control have total power 8 or greater.", "toughness": "5", "type": "Creature — Cat Beast", "types": ["Creature"], "uuid": "a5f115c7-d4fa-584f-b5c3-2867393a7b78", "watermark": "atarka"}