{"artist": "Slawomir Maniak", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B", "W"], "colors": ["B", "W"], "convertedManaCost": 3.0, "edhrecRank": 2552, "finishes": ["nonfoil"], "foreignData": [], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "252190", "cardsphereId": "81882", "mcmId": "578902", "mtgjsonV4Id": "5f80833b-5156-5d19-ae2f-d758ce0b2836", "scryfallId": "7b76dafa-46ed-4b22-908a-8932505d4f4c", "scryfallIllustrationId": "f715763e-13f5-4f16-87b6-466bf5dbffba", "scryfallOracleId": "3bc757c1-3adb-4321-8832-8e1cc9e687f7", "tcgplayerProductId": "251637"}, "isReprint": true, "isStarter": true, "keywords": ["Companion", "Lifelink"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Banned", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Banned", "modern": "Banned", "pioneer": "Banned", "vintage": "Legal"}, "manaCost": "{1}{W/B}{W/B}", "manaValue": 3.0, "name": "Lurrus of the Dream-Den", "number": "9", "power": "3", "printings": ["IKO", "PIKO", "PRM", "Q06"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2e38da8bbd3376db", "tcgplayer": "https://mtgjson.com/links/6a021bfe21de060e"}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "If a card in a player’s deck has {X} in its mana cost, X is considered to be 0."}, {"date": "2020-04-17", "text": "For spells with {X} in their mana costs, use the value chosen for X to determine the spell’s converted mana cost. For example, if a permanent spell costs {X}{W}, you could cast it with X as 1 but not as 2."}, {"date": "2020-04-17", "text": "You must pay the costs to cast that spell. If it has an alternative cost, such as a mutate cost, you may cast it for that cost instead."}, {"date": "2020-04-17", "text": "Once you begin to cast the spell, losing control of Lurrus won’t affect the spell. You can finish casting it as normal."}, {"date": "2020-04-17", "text": "If you cast a spell from your graveyard using another permission, Lurrus’s effect doesn’t apply. You can cast another permanent spell from your graveyard."}, {"date": "2020-04-17", "text": "If you cast one permanent spell from your graveyard and then have a new Lurrus come under your control in the same turn, you may cast another permanent spell from your graveyard that turn."}, {"date": "2020-04-17", "text": "If a permanent card is put into your graveyard during your main phase and the stack is empty, you have a chance to cast it before any player may attempt to remove that card from your graveyard."}, {"date": "2020-04-17", "text": "You must follow the normal timing permissions and restrictions of the spell you cast from your graveyard."}, {"date": "2020-04-17", "text": "Your companion begins the game outside the game. In tournament play, this means your sideboard. In casual play, it’s simply a card you own that’s not in your starting deck."}, {"date": "2020-04-17", "text": "Before shuffling your deck to become your library, you may reveal one card from outside the game to be your companion if your starting deck meets the requirements of the companion ability. You can’t reveal more than one. It remains revealed outside the game as the game begins."}, {"date": "2020-04-17", "text": "The requirements of the companion ability apply only to your starting deck. They do not apply to your sideboard."}, {"date": "2020-04-17", "text": "If more than one player wishes to reveal a companion, the starting player does so first, and players proceed in turn order. Once a player has chosen not to reveal a companion, that player can’t change their mind."}, {"date": "2020-04-17", "text": "The companion’s other abilities apply only if the creature is on the battlefield. They have no effect while the companion is outside the game."}, {"date": "2020-04-17", "text": "The companion ability has no effect if the card is in your starting deck and creates no restriction on putting a card with a companion ability into your starting deck. For example, Zirda may be in your starting deck even if your other permanent cards don’t all have activated abilities."}, {"date": "2020-04-17", "text": "You may have one companion in the Commander variant. Your deck, including your commander, must meet its companion requirement. Your companion is not one of your one hundred cards."}, {"date": "2020-04-17", "text": "Lurrus doesn’t let you play lands from your graveyard."}, {"date": "2020-04-17", "text": "Lurrus doesn’t care about instant and sorcery cards in your starting deck. They may have any converted mana cost."}, {"date": "2020-06-01", "text": "Once you put your companion into your hand, it behaves like any other card you’ve brought into the game. For example, if it’s countered or destroyed, it’s put into your graveyard, remaining in the game."}, {"date": "2020-06-01", "text": "Wizards of the Coast has issued functional errata for the Companion mechanic. Instead of casting companions from outside the game: Once per game, any time you could cast a sorcery (during your main phase when the stack is empty), you can pay {3} to put your companion from your sideboard into your hand. This is a special action, not an activated ability. It happens immediately and can’t be responded to. It can’t be countered or stopped by cards like Phyrexian Revoker. For more information please see https://magic.wizards.com/en/articles/archive/news/june-1-2020-banned-and-restricted-announcement"}], "securityStamp": "oval", "setCode": "Q06", "subtypes": ["Cat", "Nightmare"], "supertypes": ["Legendary"], "text": "Companion — Each permanent card in your starting deck has mana value 2 or less. (If this card is your chosen companion, you may put it into your hand from outside the game for {3} any time you could cast a sorcery.)\nLifelink\nDuring each of your turns, you may cast one permanent spell with mana value 2 or less from your graveyard.", "toughness": "2", "type": "Legendary Creature — Cat Nightmare", "types": ["Creature"], "uuid": "9f2f8507-5194-5b91-9c34-91fcdf04029f"}