{"artist": "Lie Setiawan", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R", "U"], "colors": ["R", "U"], "convertedManaCost": 3.0, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "9826e494-162d-5f27-91ce-83a200ef7488", "mtgoId": "80883", "scryfallId": "56d03b15-86a4-48e7-887b-f67cc2f0a634", "scryfallIllustrationId": "a710eb78-b119-49eb-8274-6bc76edffbbd", "scryfallOracleId": "158a6225-a246-4fd6-aa57-0df8067b4383"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Companion", "Flash"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Banned", "duel": "Banned", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Banned", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U/R}{U/R}", "manaValue": 3.0, "name": "Lutri, the Spellchaser", "number": "80883", "originalReleaseDate": "2020-04-30", "power": "3", "printings": ["IKO", "PIKO", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "The copy will have the same targets as the spell it’s copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can’t choose a new legal target, then it remains unchanged (even if the current target is illegal)."}, {"date": "2020-04-17", "text": "If the spell that’s copied is modal (that is, it says “Choose one —” or the like), the copy will have the same mode. A different mode can’t be chosen."}, {"date": "2020-04-17", "text": "If the spell that’s copied has an X whose value was determined as it was cast, the copy will have the same value of X."}, {"date": "2020-04-17", "text": "If the spell has damage divided as it was cast (like Mythos of Vadrok), the division can’t be changed, although the targets receiving that damage still can. The same is true of spells that distribute counters."}, {"date": "2020-04-17", "text": "The controller of a copy can’t choose to pay any alternative or additional costs for the copy. However, effects based on any alternative or additional costs that were paid for the original spell are copied as though those same costs were paid for the copy."}, {"date": "2020-04-17", "text": "Your companion begins the game outside the game. In tournament play, this means your sideboard. In casual play, it’s simply a card you own that’s not in your starting deck."}, {"date": "2020-04-17", "text": "Lutri’s ability can copy any instant or sorcery spell you control, not just one with targets."}, {"date": "2020-04-17", "text": "The requirements of the companion ability apply only to your starting deck. They do not apply to your sideboard."}, {"date": "2020-04-17", "text": "If more than one player wishes to reveal a companion, the starting player does so first, and players proceed in turn order. Once a player has chosen not to reveal a companion, that player can’t change their mind."}, {"date": "2020-04-17", "text": "The companion’s other abilities apply only if the creature is on the battlefield. They have no effect while the companion is outside the game."}, {"date": "2020-04-17", "text": "The companion ability has no effect if the card is in your starting deck and creates no restriction on putting a card with a companion ability into your starting deck. For example, Zirda may be in your starting deck even if your other permanent cards don’t all have activated abilities."}, {"date": "2020-04-17", "text": "You may have one companion in the Commander variant. Your deck, including your commander, must meet its companion requirement. Your companion is not one of your one hundred cards."}, {"date": "2020-04-17", "text": "Before shuffling your deck to become your library, you may reveal one card from outside the game to be your companion if your starting deck meets the requirements of the companion ability. You can’t reveal more than one. It remains revealed outside the game as the game begins."}, {"date": "2020-04-17", "text": "The copy is created on the stack, so it’s not “cast.” Abilities that trigger when a player casts a spell won’t trigger. It will resolve before the original spell does."}, {"date": "2020-06-01", "text": "Once you put your companion into your hand, it behaves like any other card you’ve brought into the game. For example, if it’s countered or destroyed, it’s put into your graveyard, remaining in the game."}, {"date": "2020-06-01", "text": "Wizards of the Coast has issued functional errata for the Companion mechanic. Instead of casting companions from outside the game: Once per game, any time you could cast a sorcery (during your main phase when the stack is empty), you can pay {3} to put your companion from your sideboard into your hand. This is a special action, not an activated ability. It happens immediately and can’t be responded to. It can’t be countered or stopped by cards like Phyrexian Revoker. For more information please see https://magic.wizards.com/en/articles/archive/news/june-1-2020-banned-and-restricted-announcement"}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Elemental", "Otter"], "supertypes": ["Legendary"], "text": "Companion — Each nonland card in your starting deck has a different name. (If this card is your chosen companion, you may put it into your hand from outside the game for {3} any time you could cast a sorcery.)\nFlash\nWhen Lutri, the Spellchaser enters the battlefield, if you cast it, copy target instant or sorcery spell you control. You may choose new targets for the copy.", "toughness": "2", "type": "Legendary Creature — Elemental Otter", "types": ["Creature"], "uuid": "92fafe55-7b77-5941-8c73-d69589d2988a"}