{"artist": "Martin de Diego Sádaba", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": [], "convertedManaCost": 4.0, "edhrecRank": 9233, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomId": "268654", "cardsphereId": "95923", "mtgjsonV4Id": "448d0c32-973e-5961-b498-a0fc068b496f", "multiverseId": "588562", "scryfallId": "98980aaa-2932-4513-af7e-ada537b899e3", "scryfallIllustrationId": "a2ed575b-efca-4384-a5c2-73c53a5b07f1", "scryfallOracleId": "64ebdd6f-acde-4aab-a86b-2798bad5f70c", "tcgplayerProductId": "452493"}, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}", "manaValue": 4.0, "name": "Machine God's Effigy", "number": "63", "originalText": "You may have Machine God's Effigy enter the battlefield as a copy of any creature on the battlefield, except it's an artifact and it has \"{T}: Add {U}.\" (It's not a creature.)\n{T}: Add {U}.", "originalType": "Artifact", "printings": ["BRC"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/bb792e61ef85b22d", "tcgplayer": "https://mtgjson.com/links/5ddd0c224d8c6f0b"}, "rarity": "rare", "rulings": [{"date": "2022-10-14", "text": "The ability of Machine God’s Effigy doesn’t target the creature."}, {"date": "2022-10-14", "text": "Except for its types and non-artifact subtypes, Machine God’s Effigy copies exactly what was printed on the original creature and nothing more (unless that creature is copying something else or is a token; see below), and it will have “{T}:Add {U}.” It doesn’t copy whether that creature is tapped or untapped, whether it has any counters on it or Auras attached to it, or any non-copy effects that have changed its types, color, and so on."}, {"date": "2022-10-14", "text": "Machine God’s Effigy will not copy any types (such as creature or enchantment) or non-artifact subtypes (such as Phyrexian or Elf) that creature had, but it will copy any supertypes, such as legendary, and artifact subtypes (such as Treasure or Vehicle). It also has the same name, so if you copy a legendary creature you control, you will need to choose one of them to put in your graveyard due to the legend rule."}, {"date": "2022-10-14", "text": "If Machine God’s Effigy copies a planeswalker that became a creature due to an effect, Machine God’s Effigy will have that planeswalker’s loyalty abilities but its only card type is artifact (it will still be legendary in most cases). Because it isn’t a planeswalker itself, it won’t enter the battlefield with any loyalty counters, but it also won’t die because due to not having any. Similarly, it can’t be attacked and damage can’t be dealt to it. You may activate only one loyalty ability of that permanent per turn. If it later becomes a creature and damage is dealt to it, that damage won’t remove any loyalty counters."}, {"date": "2022-10-14", "text": "If Machine God’s Effigy copies a Saga that has become a creature due to an effect, it will have that Saga’s chapter abilities, but it won’t get a lore counter every turn because it isn’t itself a Saga since its only card type is artifact. Unless it has the read ahead ability found on some Saga cards in the Dominaria United set, it also won’t enter the battlefield with any counters. If you do find a way to put lore counters on it, the appropriate ability or abilities will trigger. It will not be sacrificed after it has lore counters equal to its final chapter number."}, {"date": "2022-10-14", "text": "If Machine God’s Effigy copies a land with a basic land type that has become a creature due to an effect, it will not have any mana abilities that land had due to its land types (it will have the one it gives itself, though). For example, if a basic Forest became a creature due to some effect, and Machine God’s Effigy entered the battlefield as a copy of it, it would be a basic artifact named Forest and have “{T}: Add {U},” but not the intrinsic ability “{T}: Add {G}.”"}, {"date": "2022-10-14", "text": "If the copied creature has {X} in its mana cost, X is 0."}, {"date": "2022-10-14", "text": "If the chosen creature is copying something else, then Machine God’s Effigy enters the battlefield as whatever the chosen creature is copying (with the listed exceptions)."}, {"date": "2022-10-14", "text": "If the chosen creature is a token, Machine God’s Effigy copies the original characteristics of that token as stated by the effect that created the token, plus the listed exceptions. Machine God’s Effigy is not a token, even when copying one."}, {"date": "2022-10-14", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when Machine God’s Effigy enters the battlefield. Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities of the chosen creature will also work. Note that some of these effects may function correctly only if it is a creature, and will not do anything productive since the copy is an artifact, not a creature."}, {"date": "2022-10-14", "text": "If Machine God’s Effigy somehow enters the battlefield at the same time as another creature, it can’t become a copy of that creature. You may choose only a creature that’s already on the battlefield."}], "securityStamp": "oval", "setCode": "BRC", "subtypes": [], "supertypes": [], "text": "You may have Machine God's Effigy enter the battlefield as a copy of any creature on the battlefield, except it's an artifact and it has \"{T}: Add {U}.\" (It's not a creature.)\n{T}: Add {U}.", "type": "Artifact", "types": ["Artifact"], "uuid": "f1add38a-65cb-5fe3-a379-5a07efcaba7f", "variations": ["66bdfdf7-bd09-53c8-9d0f-f4ea23e7b8df"]}