{"artist": "Bartek Fedyczak", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["G", "R", "U"], "colors": ["G", "R", "U"], "convertedManaCost": 4.0, "edhrecRank": 7679, "finishes": ["foil"], "foreignData": [], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "265886", "mtgjsonV4Id": "8a9bfec0-4422-5286-ab35-650d78b94657", "multiverseId": "582572", "scryfallId": "419ac203-d8b9-46df-99a8-65dfcea07ff5", "scryfallIllustrationId": "801af481-bf3d-48a6-b671-7758ec84fee5", "scryfallOracleId": "ae9f5c80-bc96-4ab3-bb5b-e8bd470e9eab", "tcgplayerProductId": "285802"}, "keywords": ["Psychic Stimulus", "Spiritual Leader"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}{U}{R}", "manaValue": 4.0, "name": "Magus Lucea Kane", "number": "174", "originalText": "Spiritual Leader — At the beginning of combat on your turn, put a +1/+1 counter on target creature.\nPsychic Stimulus — {T}: Add {C}{C}. When you next cast a spell with {X} in its mana cost or activate an ability with {X} in its activation cost this turn, copy that spell or ability. You may choose new targets for the copy. (A copy of a permanent spell becomes a token.)", "originalType": "Legendary Creature — Human Tyranid Wizard", "power": "1", "printings": ["40K"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/cdb169b44d096ee8", "tcgplayer": "https://mtgjson.com/links/9337932f554e434c"}, "rarity": "mythic", "rulings": [{"date": "2022-10-07", "text": "Spells with additional costs that include {X} won’t be affected by Magus Lucea Kane. {X} must be in the spell’s mana cost."}, {"date": "2022-10-07", "text": "A spell or ability with a cost that includes X, but not the mana symbol {X}, won’t be copied."}, {"date": "2022-10-07", "text": "Activated abilities contain a colon. They’re generally written “[Cost]: [Effect].” Some keyword abilities are activated abilities and will have a colon in their reminder text. Triggered abilities (starting with “when,” “whenever,” or “at”) that ask a player to pay {X} aren’t copied."}, {"date": "2022-10-07", "text": "Magus Lucea Kane’s ability will copy any spell or activated ability whose mana cost or activation cost contains {X}, not just one with targets."}, {"date": "2022-10-07", "text": "The {C}{C} created by the mana ability doesn’t need to be spent on the next spell or ability with {X} in its cost in order to copy it. That spell or ability will be copied even if that mana is spent on something else or not spent on anything at all."}, {"date": "2022-10-07", "text": "A copy is created even if the spell or ability that caused the delayed triggered ability to trigger has been countered by the time that delayed triggered ability resolves. The copy resolves before the original spell."}, {"date": "2022-10-07", "text": "The copy will have the same targets as the spell or ability it’s copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If the spell is a permanent spell with targets, such as an Aura, you may also choose a new target for that spell. The new targets must be legal. If, for any target, you can’t choose a new legal target, then it remains unchanged (even if the current target is illegal)."}, {"date": "2022-10-07", "text": "The copy is created on the stack, so it’s not “cast” or “activated.” Creating the copy won’t cause abilities that trigger when a player casts a spell or activates an ability to trigger."}, {"date": "2022-10-07", "text": "The copy will resolve before the original spell or ability does."}, {"date": "2022-10-07", "text": "If the spell or ability that’s copied is modal (that is, it says “Choose one —” or the like), the copy will have the same mode or modes. You can’t choose different ones."}, {"date": "2022-10-07", "text": "The copy has the same value of X."}, {"date": "2022-10-07", "text": "You can’t choose to pay any additional costs for a copied spell. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too."}, {"date": "2022-10-07", "text": "If the spell or ability has damage divided as it was put onto the stack, the division can’t be changed, although the targets receiving that damage still can. The same is true of spells and abilities that distribute counters."}, {"date": "2022-10-07", "text": "Any choices made when the spell or ability resolves won’t have been made yet when it’s copied. Any such choices will be made separately when the copy resolves."}, {"date": "2022-10-07", "text": "If a permanent spell is copied, it’s put onto the battlefield as a token as the spell resolves rather than putting the copy of the spell onto the battlefield. The rules that apply to a permanent spell becoming a permanent apply to a copy of a spell becoming a token."}, {"date": "2022-10-07", "text": "The token that a resolving copy of a spell becomes isn’t said to have been “created.”"}], "securityStamp": "triangle", "setCode": "40K", "subtypes": ["Human", "Tyranid", "Wizard"], "supertypes": ["Legendary"], "text": "Spiritual Leader — At the beginning of combat on your turn, put a +1/+1 counter on target creature.\nPsychic Stimulus — {T}: Add {C}{C}. When you next cast a spell with {X} in its mana cost or activate an ability with {X} in its activation cost this turn, copy that spell or ability. You may choose new targets for the copy. (A copy of a permanent spell becomes a token.)", "toughness": "1", "type": "Legendary Creature — Human Tyranid Wizard", "types": ["Creature"], "uuid": "4f35dd26-5083-5e00-9bd1-4470589ce630", "variations": ["386dbb3a-efec-563a-ba5c-e121083081d3"]}