{"artist": "Izzy", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B", "R", "U"], "colors": ["B", "R", "U"], "convertedManaCost": 4.0, "edhrecRank": 10296, "finishes": ["foil"], "foreignData": [{"language": "German", "multiverseId": 433591, "name": "Mairsil der Täuscher", "text": "Wenn Mairsil der Täuscher ins Spiel kommt, kannst du eine Artefakt- oder Kreaturenkarte aus deiner Hand oder deinem Friedhof ins Exil schicken und eine Käfigmarke auf sie legen.\nMairsil der Täuscher hat alle aktivierten Fähigkeiten von Karten im Exil, die du besitzt und auf denen eine Käfigmarke liegt. Du kannst jede dieser Fähigkeiten nur einmal pro Zug aktivieren.", "type": "Legendäre Kreatur — Mensch, Zauberer"}, {"language": "Spanish", "multiverseId": 433900, "name": "Mairsil, el Usurpador", "text": "Cuando Mairsil, el Usurpador entre al campo de batalla, puedes exiliar una carta de artefacto o criatura de tu mano o cementerio y poner un contador de jaula sobre ella.\nMairsil, el Usurpador tiene todas las habilidades activadas de todas las cartas de las que eres propietario en el exilio con contadores de jaula sobre ellas. Puedes activar cada una de esas habilidades solo una vez cada turno.", "type": "Criatura legendaria — Hechicero humano"}, {"language": "French", "multiverseId": 434209, "name": "Mairsil, le prétendant", "text": "Quand Mairsil, le prétendant arrive sur le champ de bataille, vous pouvez exiler une carte d'artefact ou de créature depuis votre main ou votre cimetière et mettre un marqueur « cage » sur elle.\nMairsil, le prétendant a toutes les capacités activées de toutes les cartes que vous possédez en exil avec des marqueurs « cage » sur elles. Vous ne pouvez activer chacune de ces capacités qu'une seule fois par tour.", "type": "Créature légendaire : humain et sorcier"}, {"language": "Italian", "multiverseId": 434518, "name": "Mairsil, il Pretendente", "text": "Quando Mairsil, il Pretendente entra nel campo di battaglia, puoi esiliare una carta artefatto o creatura dalla tua mano o dal tuo cimitero e mettere un segnalino gabbia su di essa.\nMairsil, il Pretendente ha tutte le abilità attivate di tutte le carte che possiedi in esilio con segnalini gabbia. Puoi attivare ognuna di quelle abilità solo una volta per turno.", "type": "Creatura Leggendaria — Mago Umano"}, {"language": "Japanese", "multiverseId": 434827, "name": "偽善者、メアシル", "text": "偽善者、メアシルが戦場に出たとき、あなたはあなたの手札やあなたの墓地からアーティファクトかクリーチャーであるカード１枚を追放し、それの上に檻カウンターを１個置いてもよい。\n偽善者、メアシルは、追放領域にあってあなたがオーナーである、檻カウンターが置かれているカードすべての起動型能力をすべて持つ。あなたはそれらの各能力をそれぞれ、毎ターン１回のみ起動してもよい。", "type": "伝説のクリーチャー — 人間・ウィザード"}, {"language": "Portuguese (Brazil)", "multiverseId": 435136, "name": "Mairsil, o Impostor", "text": "Quando Mairsil, o Impostor, entra no campo de batalha, você pode exilar um card de artefato ou criatura de sua mão ou cemitério e colocar um marcador de jaula nele.\nMairsil, o Impostor, tem todas as habilidades ativadas de todos os cards que você possui no exílio com marcadores de jaula. Você pode ativar cada uma dessas habilidades apenas uma vez a cada turno.", "type": "Criatura Lendária — Humano Mago"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "213583", "cardsphereId": "50681", "mcmId": "300353", "mcmMetaId": "226537", "mtgjsonV4Id": "8fb1a596-47b9-5506-b804-34ab6f3b22ac", "multiverseId": "433282", "scryfallId": "87b71b08-668c-4b32-8243-8def1a9acf26", "scryfallIllustrationId": "44b1df40-ec5c-454a-aa8f-921f6402a6c9", "scryfallOracleId": "ed5fbae0-2dca-44a5-84dc-62674b3a92a6", "tcgplayerProductId": "139854"}, "isStarter": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}{B}{R}", "manaValue": 4.0, "name": "Mairsil, the Pretender", "number": "41", "originalText": "When Mairsil, the Pretender enters the battlefield, you may exile an artifact or creature card from your hand or graveyard and put a cage counter on it.\nMairsil, the Pretender has all activated abilities of all cards you own in exile with cage counters on them. You may activate each of those abilities only once each turn.", "originalType": "Legendary Creature — Human Wizard", "power": "4", "printings": ["C17"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/b9a66942f6eeb2fd", "cardmarket": "https://mtgjson.com/links/bbc9d7b38c9179e7", "tcgplayer": "https://mtgjson.com/links/898602f449b9973a"}, "rarity": "mythic", "rulings": [{"date": "2017-08-25", "text": "The exiled cards remain exiled with cage counters when Mairsil leaves the battlefield. If Mairsil returns to the battlefield, it will see all of those exiled cards with cage counters on them."}, {"date": "2017-08-25", "text": "If another player gains control of Mairsil, it will have the abilities of only cards that player owns in exile with cage counters on them."}, {"date": "2017-08-25", "text": "Activated abilities contain a colon. They’re generally written “[Cost]: [Effect].” Some keyword abilities (such as equip) are activated abilities and will have colons in their reminder text. Mairsil won’t gain triggered abilities (which start with “when,” “whenever,” or “at”)."}, {"date": "2017-08-25", "text": "If an activated ability of a card in exile with a cage counter on it references the card it’s printed on by name, treat Mairsil’s instance of that ability as though it referenced Mairsil by name instead. For instance, if Mairsil exiles Magus of the Mind, the cost to activate the ability includes sacrificing Mairsil, not sacrificing Magus of the Mind."}, {"date": "2017-08-25", "text": "If one of Mairsil’s abilities doesn’t resolve, most likely because its target became illegal before it resolved, it can’t be activated again in the same turn."}, {"date": "2017-08-25", "text": "If multiple cards exiled with cage counters on them have the same ability, Mairsil will have multiple instances of that ability. Each may be activated once each turn."}, {"date": "2017-08-25", "text": "If you have a creature enter the battlefield as a copy of Mairsil, its first ability triggers. You won’t be able to activate any abilities before the “legend rule” applies, but the triggered ability will still let you exile another card with a cage counter regardless of which Mairsil you keep."}, {"date": "2017-08-25", "text": "If Mairsil gains an activated ability that’s normally linked to a non-activated ability of the card it came from, the ability Mairsil has isn’t linked to any ability. For example, if Mairsil exiles Prototype Portal, the activated ability creates no tokens at all; it doesn’t create Prototype Portal tokens."}, {"date": "2017-08-25", "text": "If Mairsil gains an activated ability that’s normally linked to another activated ability of the card it came from, those two abilities Mairsil gains are linked for as long as Mairsil remains on the battlefield. For example, if Mairsil exiles Izzet Chemister, cards exiled with the first ability Mairsil gained from Izzet Chemister can be cast if you activate the second ability it gained that way. Izzet Chemister itself can’t be cast this way, and if Mairsil leaves the battlefield before activating that second ability, the cards exiled with that first ability are lost forever."}, {"date": "2017-08-25", "text": "If Mairsil has a crew ability, creatures can crew Mairsil. It’ll become an artifact creature, but its power and toughness remain unchanged."}, {"date": "2017-08-25", "text": "If Mairsil has an equip ability, activating it won’t cause anything to happen. Mairsil doesn’t become attached to a creature. They may remain friends."}], "securityStamp": "oval", "setCode": "C17", "subtypes": ["Human", "Wizard"], "supertypes": ["Legendary"], "text": "When Mairsil, the Pretender enters the battlefield, you may exile an artifact or creature card from your hand or graveyard and put a cage counter on it.\nMairsil, the Pretender has all activated abilities of all cards you own in exile with cage counters on them. You may activate each of those abilities only once each turn.", "toughness": "4", "type": "Legendary Creature — Human Wizard", "types": ["Creature"], "uuid": "83ac5cbb-a165-5972-82ee-c7f14429c376"}