{"artist": "Yeong-Hao Han", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 4710, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 484966, "name": "Manarefraktor", "text": "Der Manarefraktor kommt getappt ins Spiel.\nDer Manarefraktor hat alle aktivierten Fähigkeiten aller Länder im Spiel.\nUm die Aktivierungskosten von Fähigkeiten des Manarefraktors zu bezahlen, kannst du Mana ausgeben, als wäre es Mana beliebiger Farbe.", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 485017, "name": "Refractor del manaisaje", "text": "El Refractor del manaisaje entra al campo de batalla girado.\nEl Refractor del manaisaje tiene todas las habilidades activadas de todas las tierras en el campo de batalla.\nPuedes usar maná como si fuese maná de cualquier color para pagar los costes de activación de las habilidades del Refractor del manaisaje.", "type": "Artefacto"}, {"language": "French", "multiverseId": 485068, "name": "Réfracteur de panoramana", "text": "Le Réfracteur de panoramana arrive sur le champ de bataille engagé.\nLe Réfracteur de panoramana a toutes les capacités activées de tous les terrains sur le champ de bataille.\nVous pouvez dépenser du mana comme s'il s'agissait de mana de n'importe quelle couleur pour payer les coûts d'activation des capacités du Réfracteur de panoramana.", "type": "Artefact"}, {"language": "Italian", "multiverseId": 485119, "name": "Rifrattore del Manarama", "text": "Il Rifrattore del Manarama entra nel campo di battaglia TAPpato.\nIl Rifrattore del Manarama ha tutte le abilità attivate di tutte le terre sul campo di battaglia.\nPuoi spendere mana come se fosse mana di qualsiasi colore per pagare i costi di attivazione delle abilità del Rifrattore del Manarama.", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 485170, "name": "魔力景の屈折体", "text": "魔力景の屈折体はタップ状態で戦場に出る。\n魔力景の屈折体は、戦場にある土地すべての起動型能力をすべて持つ。\nあなたは魔力景の屈折体の能力の起動コストを支払うために、マナを望む色のマナであるかのように支払ってもよい。", "type": "アーティファクト"}, {"language": "Portuguese (Brazil)", "multiverseId": 485221, "name": "Refrator do Manorama", "text": "Refrator do Manorama entra no campo de batalha virado.\nRefrator do Manorama tem todas as habilidades ativadas de todos os terrenos no campo de batalha.\nVocê pode utilizar mana como se fosse mana de qualquer cor para pagar os custos de ativação das habilidades de Refrator do Manorama.", "type": "Artefato"}, {"language": "Russian", "multiverseId": 485272, "name": "Рефрактор Манасвода", "text": "Рефрактор Манасвода выходит на поле битвы повернутым.\nРефрактор Манасвода имеет все активируемые способности всех земель на поле битвы.\nВы можете тратить ману на оплату стоимости активации способностей Рефрактора Манасвода, как будто это мана любого цвета.", "type": "Артефакт"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "232336", "cardsphereId": "66369", "mcmId": "452248", "mtgjsonV4Id": "5110d446-dedf-5b7c-93a7-0c3164ace0a0", "mtgoId": "80717", "multiverseId": "484915", "scryfallId": "7f164226-99e4-474e-a67d-b3fbff015a64", "scryfallIllustrationId": "4178f227-7b46-4031-be2c-e47503d4fbfb", "scryfallOracleId": "ae3517db-bb96-4c29-91dc-5bd68683dced", "tcgplayerProductId": "212185"}, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Manascape Refractor", "number": "68", "originalText": "Manascape Refractor enters the battlefield tapped.\nManascape Refractor has all activated abilities of all lands on the battlefield.\nYou may spend mana as though it were mana of any color to pay the activation costs of Manascape Refractor's abilities.", "originalType": "Artifact", "printings": ["C20"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/02c280c449a1d77f", "tcgplayer": "https://mtgjson.com/links/7d039afc2dfe8ee1"}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "Activated abilities contain a colon. They’re generally written “[Cost]: [Effect].” Some keyword abilities are activated abilities and will have colons in their reminder text. Manascape Refractor won’t gain triggered abilities (which start with “when,” “whenever,” or “at”)."}, {"date": "2020-04-17", "text": "Lands with a basic land type have an intrinsic activated mana ability corresponding to their basic land type. Manascape Refractor has those abilities, too."}, {"date": "2020-04-17", "text": "If Manascape Refractor gains an activated ability that’s normally linked to a non-activated ability of the card it came from, the ability Manascape Refractor has isn’t linked to any ability."}, {"date": "2020-04-17", "text": "If Manascape Refractor gains an activated ability that’s normally linked to another activated ability of the card it came from, those two abilities Manascape Refractor gains are linked for as long as that card remains on the battlefield."}], "securityStamp": "oval", "setCode": "C20", "subtypes": [], "supertypes": [], "text": "Manascape Refractor enters the battlefield tapped.\nManascape Refractor has all activated abilities of all lands on the battlefield.\nYou may spend mana as though it were mana of any color to pay the activation costs of Manascape Refractor's abilities.", "type": "Artifact", "types": ["Artifact"], "uuid": "96912300-d1d4-50f6-960a-02379cda47a3"}