{"artist": "Chris Rallis", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 2.0, "edhrecRank": 5677, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 470852, "name": "Mandat des Friedens", "text": "Wirke diesen Zauberspruch nur während des Kampfes.\nDeine Gegner können in diesem Zug keine Zaubersprüche wirken.\nBeende die Kampfphase. (Entferne alle Angreifer und Blocker aus dem Kampf. Schicke alle Zaubersprüche und Fähigkeiten vom Stapel ins Exil, einschließlich dieses Zauberspruchs.)", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 471154, "name": "Mandato de paz", "text": "Lanza este hechizo solo durante el combate.\nTus oponentes no pueden lanzar hechizos este turno.\nTermina la fase de combate. (Remueve todas las atacantes y bloqueadoras del combate. Exilia todos los hechizos y habilidades de la pila, incluido este hechizo.)", "type": "Instantáneo"}, {"language": "French", "multiverseId": 471456, "name": "Mandat de paix", "text": "Ne lancez ce sort que pendant le combat.\nVos adversaires ne peuvent pas lancer de sorts ce tour-ci.\nTerminez la phase de combat. (Retirez tous les attaquants et tous les bloqueurs du combat. Exilez tous les sorts et toutes les capacités de la pile, y compris ce sort.)", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 471758, "name": "Mandato di Pace", "text": "Lancia questa magia solo durante il combattimento.\nI tuoi avversari non possono lanciare magie in questo turno.\nTermina la fase di combattimento. (Rimuovi tutte le creature attaccanti e bloccanti dal combattimento. Esilia tutte le magie e le abilità dalla pila, compresa questa magia.)", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 472060, "name": "平和の執行", "text": "この呪文は、戦闘中にのみ唱えられる。\nこのターン、対戦相手は呪文を唱えられない。\n戦闘フェイズを終了する。（攻撃クリーチャーとブロック・クリーチャーをすべて戦闘から取り除く。この呪文も含め、スタックから呪文や能力をすべて追放する。）", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 472362, "name": "Mandato de Paz", "text": "Conjure esta mágica somente durante o combate.\nSeus oponentes não podem conjurar mágicas neste turno.\nTermine a fase de combate. (Remova todos os atacantes e bloqueadores do combate. Exile todas as mágicas e habilidades da pilha, incluindo esta mágica.)", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 472664, "name": "Декрет о Мире", "text": "Разыгрывайте это заклинание только во время боя.\nВаши оппоненты не могут разыгрывать заклинания в этом ходу.\nЗакончите фазу боя. (Удалите всех атакующих и блокирующих из боя. Изгоните все заклинания и способности из стека, в том числе и это заклинание.)", "type": "Мгновенное заклинание"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "227102", "cardsphereId": "61274", "mcmId": "391512", "mcmMetaId": "278602", "mtgjsonV4Id": "833a9113-fa12-59be-ac67-c563528289e5", "mtgoId": "77062", "multiverseId": "470550", "scryfallId": "d243055f-892e-4042-9694-13d5e99e3550", "scryfallIllustrationId": "47d0d5b8-4e61-41d1-8609-b301853f27c7", "scryfallOracleId": "c309ec42-34a0-4083-a36c-7814643d7960", "tcgplayerProductId": "196613"}, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}", "manaValue": 2.0, "name": "Mandate of Peace", "number": "4", "originalText": "Cast this spell only during combat.\nYour opponents can't cast spells this turn.\nEnd the combat phase. (Remove all attackers and blockers from combat. Exile all spells and abilities from the stack, including this spell.)", "originalType": "Instant", "printings": ["C19"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2a7c06690a365257", "cardmarket": "https://mtgjson.com/links/24db1ee705ef0688", "tcgplayer": "https://mtgjson.com/links/b2e83e684e3758e6"}, "rarity": "rare", "rulings": [{"date": "2019-08-23", "text": "Though other spells and abilities that are exiled won’t get a chance to resolve, they don’t count as being countered."}, {"date": "2019-08-23", "text": "If any triggered abilities trigger during this process, they’re put onto the stack after the game skips to the appropriate phase or step."}, {"date": "2019-08-23", "text": "Any “at end of combat” triggered abilities won’t get the chance to trigger that combat because the end of combat step is skipped."}, {"date": "2019-08-23", "text": "If an effect allows or instructs you to cast Mandate of Peace outside of a combat phase, you can’t do so. Its restriction takes precedence over that permission. Similarly, once Mandate of Peace has resolved, your opponents can’t cast spells even if another effect allows or instructs one of them to cast a spell."}, {"date": "2019-08-23", "text": "Mandate of Peace doesn’t stop any player from casting spells in response to Mandate of Peace before it resolves."}, {"date": "2019-08-23", "text": "Your opponents can still activate abilities, including abilities of cards in their hand (such as cycling abilities), and can still play lands."}, {"date": "2019-08-23", "text": "Ending the combat phase this way means the following things happen in order: 1) All spells and abilities on the stack are exiled. This includes spells and abilities that can’t be countered. 2) State-based actions are checked. No player gets priority, and no triggered abilities are put onto the stack. 3) The current phase and step ends. The game skips straight to the postcombat main phase. As this happens, all attacking and blocking creatures are removed from combat and effects that last “until end of combat” expire."}, {"date": "2019-08-23", "text": "In the rare case that the postcombat main phase is skipped, the game skips to the end step of the ending phase. If that step is also skipped, the game skips straight to the turn’s cleanup step. The cleanup step can’t be skipped."}], "securityStamp": "oval", "setCode": "C19", "subtypes": [], "supertypes": [], "text": "Cast this spell only during combat.\nYour opponents can't cast spells this turn.\nEnd the combat phase. (Remove all attackers and blockers from combat. Exile all spells and abilities from the stack, including this spell.)", "type": "Instant", "types": ["Instant"], "uuid": "f6d6cadc-f08a-5ca7-ac58-36d19d8dbb8a"}