{"artist": "Iris Compiet", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 1.0, "edhrecRank": 1369, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "276f3054-4f4f-5b28-bc3b-6c471b1acff4", "mtgoId": "97927", "scryfallId": "c82a2c9a-3484-4dfa-936a-f01750220e54", "scryfallIllustrationId": "88dc03d0-c1d1-449f-81fa-488c7281d0fa", "scryfallOracleId": "debc69ea-372a-4720-838a-16856cd50b07"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{X}{U}", "manaValue": 1.0, "name": "March of Swirling Mist", "number": "97927", "originalReleaseDate": "2022-02-19", "printings": ["NEO", "PNEO", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2022-02-18", "text": "Phased out permanents are treated as though they don't exist. They can't be the target of spells or abilities, their static abilities have no effect on the game, their triggered abilities can't trigger, they can't attack or block, and so on."}, {"date": "2022-02-18", "text": "As a creature is phased out, Auras and Equipment attached to it also phase out at the same time. Those Auras and Equipment will phase in at the same time that creature does, and they'll phase in still attached to that creature."}, {"date": "2022-02-18", "text": "Permanents phase back in during their controller's untap step, immediately before that player untaps their permanents. Creatures that phase in this way are able to attack and pay a cost of {T} during that turn. If a permanent had counters on it when it phased out, it will have those counters when it phases back in."}, {"date": "2022-02-18", "text": "An attacking or blocking creature that phases out is removed from combat."}, {"date": "2022-02-18", "text": "Phasing out doesn't cause permanents to leave or re-enter the battlefield, so no “leaves the battlefield” or “enters the battlefield” abilities will trigger."}, {"date": "2022-02-18", "text": "Any continuous effects with a “for as long as” duration, such as that of Mind Flayer, ignore phased-out objects. If ignoring those objects causes the effect's conditions to no longer be met, the duration will expire."}, {"date": "2022-02-18", "text": "Choices made for permanents as they entered the battlefield are remembered when they phase in."}, {"date": "2022-02-18", "text": "If an opponent gains control of one of your creatures, that creature phases out, and the duration of the control-change effect expires before it phases back in, that creature phases in under your control as that opponent's next untap step begins. If they leave the game before their next untap step, it phases in as the next untap step begins after their turn would have begun."}, {"date": "2022-02-18", "text": "You may exile more cards than necessary for March of Swirling Mist's first ability, but you can't reduce the mana it costs to less than {U} this way."}, {"date": "2022-02-18", "text": "The mana value of March of Swirling Mist while it's on the stack is the value chosen for X plus 1, no matter how much mana you actually paid to cast it."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "As an additional cost to cast this spell, you may exile any number of blue cards from your hand. This spell costs {2} less to cast for each card exiled this way.\nUp to X target creatures phase out. (While they're phased out, they're treated as though they don't exist. Each one phases in before its controller untaps during their next untap step.)", "type": "Instant", "types": ["Instant"], "uuid": "6e07addf-754b-5562-8ae4-df6d55dbd183"}