{"artist": "Jason A. Engle", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 4.0, "edhrecRank": 554, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "fa8540d3-0692-5a54-9a1b-74d53e131e1a", "mtgoId": "88396", "scryfallId": "1f203c4d-3cdb-4b88-aa20-d424448fc80a", "scryfallIllustrationId": "beb74ef0-5b6d-429b-ac95-b50ad44910f8", "scryfallOracleId": "9b2cdbed-c733-409b-b0e4-2c8960c25111"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}", "manaValue": 4.0, "name": "Maskwood Nexus", "number": "88396", "originalReleaseDate": "2021-02-28", "printings": ["CLB", "KHM", "PKHM", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "Replacement effects that modify how creatures of a certain creature type enter the battlefield will apply after you apply the effect of Maskwood Nexus. For example, if you control Maskwood Nexus and an effect says that each Warrior you control enters the battlefield with an additional +1/+1 counter on it, any creature that enters the battlefield under your control will get that counter."}, {"date": "2021-02-05", "text": "The tokens created by the activated ability will continue to have all creature types if Maskwood Nexus leaves the battlefield because those tokens have changeling. Other creatures you control will revert to their usual creature types unless another relevant effect is affecting them."}, {"date": "2021-02-05", "text": "Changeling is a characteristic-defining ability. It functions in all zones, not only while a card that has it is on the battlefield."}, {"date": "2021-02-05", "text": "The subtype Shapeshifter that appears on the type line is mostly there to reinforce the flavor. A creature card with changeling is just as much an Elf, a Dwarf, a Sliver, a Goat, a Coward, and a Zombie as it is a Shapeshifter."}, {"date": "2021-02-05", "text": "If an effect causes a creature with changeling to become a new creature type, it will be only that new creature type. It will still have changeling; the effect making it all creature types will simply be overwritten."}, {"date": "2021-02-05", "text": "If an effect causes a creature with changeling to lose all abilities, it will remain all creature types, even though it will no longer have changeling. This is because changeling applies before the effect that removes it."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Creatures you control are every creature type. The same is true for creature spells you control and creature cards you own that aren't on the battlefield.\n{3}, {T}: Create a 2/2 blue Shapeshifter creature token with changeling. (It is every creature type.)", "type": "Artifact", "types": ["Artifact"], "uuid": "c18e28a9-66a3-5790-af88-21ce734d428d"}