{"artist": "Christopher Moeller", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 6.0, "edhrecRank": 7803, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 221645, "name": "Massen-Polymorph", "text": "Schicke alle Kreaturen, die du kontrollierst, ins Exil und decke dann so lange Karten oben von deiner Bibliothek auf, bis du ebenso viele Kreaturenkarten aufgedeckt hast. Bringe alle Kreaturenkarten, die auf diese Weise aufgedeckt wurden, ins Spiel, und mische dann den Rest der auf diese Weise aufgedeckten Karten in deine Bibliothek.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 224764, "name": "Transmutación masiva", "text": "Exilia todas las criaturas que controlas, luego muestra cartas de la parte superior de tu biblioteca hasta que muestres esa misma cantidad de cartas de criatura. Pon en el campo de batalla todas las cartas de criatura mostradas de esta manera, luego baraja el resto de las cartas mostradas en tu biblioteca.", "type": "Conjuro"}, {"language": "French", "multiverseId": 222215, "name": "Polymorphisme de masse", "text": "Exilez toutes les créatures que vous contrôlez, puis révélez les cartes du dessus de votre bibliothèque jusqu'à ce que vous révéliez autant de cartes de créature. Mettez toutes les cartes de créature révélées de cette manière sur le champ de bataille et mélangez ensuite le reste des cartes révélées ainsi dans votre bibliothèque.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 225511, "name": "Polimorfismo di Massa", "text": "Esilia tutte le creature che controlli, poi rivela carte dalla cima del tuo grimorio fino a che non riveli altrettante carte creatura. Metti sul campo di battaglia tutte le carte creatura rivelate in questo modo, poi rimescola le altre carte rivelate nel tuo grimorio.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 226258, "name": "集団変身", "text": "あなたがコントロールするすべてのクリーチャーを追放し、その後、あなたのライブラリーの一番上のカードを、その数に等しい枚数のクリーチャー・カードが公開されるまで公開し続ける。 これにより公開されたすべてのクリーチャー・カードを戦場に出し、その後残りの公開されたカードをあなたのライブラリーに加えて切り直す。", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 225013, "name": "Polimorfismo de Massa", "text": "Exile todas as criaturas que você controla, depois revele cards do topo de seu grimório até revelar uma quantidade equivalente de cards de criatura. Coloque todos os cards de criatura revelados dessa maneira no campo de batalha, depois embaralhe o restante dos cards revelados no seu grimório.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 225262, "name": "Массовый Полиморф", "text": "Изгоните все существа под вашим контролем, затем показывайте карты с верха вашей библиотеки до тех пор, пока вы не покажете столько же карт существ. Положите все карты существ, показанные таким образом, на поле битвы, затем втасуйте остальные показанные карты в вашу библиотеку.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 226009, "name": "全面型态转变", "text": "放逐所有由你操控的生物，然后从你牌库顶开始展示牌，直到你展示出该数量的生物牌为止。 将以此法展示出的所有生物牌放进战场，然后将其余展示的牌洗入你的牌库。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 225760, "name": "全面型態轉變", "text": "放逐所有由你操控的生物，然後從你牌庫頂開始展示牌，直到你展示出該數量的生物牌為止。 將以此法展示出的所有生物牌放進戰場，然後將其餘展示的牌洗入你的牌庫。", "type": "巫術"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "131853", "cardKingdomId": "131611", "cardsphereId": "26526", "mcmId": "241976", "mcmMetaId": "200463", "mtgjsonV4Id": "51b0f4fc-04e9-57c7-aded-6875975de71b", "mtgoFoilId": "37317", "mtgoId": "37316", "multiverseId": "204977", "scryfallId": "13ffe61f-e52e-4d62-854b-10ac9cfbadd3", "scryfallIllustrationId": "10fe70ee-609a-4325-bef5-fe699db0c957", "scryfallOracleId": "b133129d-1ffb-4b78-9f5b-852d163cc9b7", "tcgplayerProductId": "35580"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{5}{U}", "manaValue": 6.0, "name": "Mass Polymorph", "number": "64", "originalText": "Exile all creatures you control, then reveal cards from the top of your library until you reveal that many creature cards. Put all creature cards revealed this way onto the battlefield, then shuffle the rest of the revealed cards into your library.", "originalType": "Sorcery", "printings": ["M11"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/83010c246da713be", "cardKingdomFoil": "https://mtgjson.com/links/3f28247c54af08ed", "cardmarket": "https://mtgjson.com/links/32a598c930345aa1", "tcgplayer": "https://mtgjson.com/links/89ed80ca35bde43b"}, "rarity": "rare", "rulings": [{"date": "2010-08-15", "text": "The creatures you exile with Mass Polymorph remain exiled for the rest of the game."}, {"date": "2010-08-15", "text": "If the number of creatures you exile is greater than the number of creature cards remaining in your library, you’ll wind up revealing your entire library, putting all creature cards revealed that way onto the battlefield, then shuffling your library."}, {"date": "2010-08-15", "text": "All creatures you put onto the battlefield with Mass Polymorph enter the battlefield at the same time."}, {"date": "2010-08-15", "text": "Any abilities that trigger during the resolution of Mass Polymorph (such as a creature’s enters-the-battlefield ability) will wait to be put onto the stack until Mass Polymorph finishes resolving. The player whose turn it is will put all of their triggered abilities on the stack in any order, then each other player in turn order will do the same. (The last ability put on the stack will be the first one that resolves.)"}], "setCode": "M11", "subtypes": [], "supertypes": [], "text": "Exile all creatures you control, then reveal cards from the top of your library until you reveal that many creature cards. Put all creature cards revealed this way onto the battlefield, then shuffle the rest of the revealed cards into your library.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "961df276-5517-5fda-9cd6-324cdf77ef5c"}