{"artist": "Adam Paquette", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 2049, "finishes": ["nonfoil"], "flavorText": "\"Give me eight walkers, I'll give you the city.\"\n—Dovin Baan", "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "270068", "mcmId": "685609", "mcmMetaId": "224336", "mtgjsonV4Id": "bdfefd51-5f1f-5b8b-9772-fbd52abdf702", "scryfallId": "104ce943-6887-4ed8-bab0-d9bf65a6e53b", "scryfallIllustrationId": "eb2c4c21-c7c1-4ccf-8e38-b00805f1e089", "scryfallOracleId": "39d8406a-90c3-460c-b4e8-0f590573db51", "tcgplayerProductId": "454309"}, "isReprint": true, "keywords": ["Enchant"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{U}", "manaValue": 4.0, "name": "Mechanized Production", "number": "905", "originalReleaseDate": "2022-11-18", "printings": ["AER", "J22", "PAER", "PLIST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/a4d904a4121f6ec3", "cardmarket": "https://mtgjson.com/links/5f7a669e4c331d52", "tcgplayer": "https://mtgjson.com/links/973108734ec276db"}, "rarity": "mythic", "rulings": [{"date": "2017-02-09", "text": "Any abilities that trigger on the token being created won’t resolve until after Mechanized Production’s triggered ability has finished resolving entirely and performed its check for eight artifacts with the same name."}, {"date": "2017-02-09", "text": "The eight artifacts with the same name don’t have to have the same name as the enchanted artifact. For example, you win the game if you control eight Thopter artifact creature tokens as Mechanized Production’s ability resolves, even if Mechanized Production isn’t attached to a Thopter."}, {"date": "2017-02-09", "text": "All eight of the permanents sharing a name must be artifacts. If you control only seven artifacts with the same name and a nonartifact permanent with that same name, you won’t win the game."}, {"date": "2017-02-09", "text": "If you control eight or more artifacts that share a name while you control Mechanized Production, you won’t win the game yet. You’ll win the game while resolving its triggered ability during your upkeep."}, {"date": "2017-02-09", "text": "The token copies exactly what was printed on the original artifact and nothing else (unless that artifact is copying something else or is a token; see below). It doesn’t copy whether that artifact is tapped or untapped, whether it has any counters on it or Auras attached to it, or any non-copy effects that have changed its types, color, or so on."}, {"date": "2017-02-09", "text": "If the copied artifact has {X} in its mana cost, X is considered to be zero."}, {"date": "2017-02-09", "text": "If the copied artifact is copying something else (for example, if the copied artifact is a Sculpting Steel), then the token enters the battlefield as whatever that artifact copied."}, {"date": "2017-02-09", "text": "If the copied artifact is a token, the token that’s created copies the original characteristics of that token as stated by the effect that created it."}, {"date": "2017-02-09", "text": "Any enters-the-battlefield abilities of the copied artifact trigger when the artifact token enters the battlefield. The artifact token also has any “this enters the battlefield with” or “as this enters the battlefield” abilities that the copied artifact has."}, {"date": "2017-02-09", "text": "If Mechanized Production and the enchanted artifact leave the battlefield simultaneously in response to the triggered ability, then the effect creates a token that’s a copy of the artifact as it last existed on the battlefield."}, {"date": "2017-02-09", "text": "If the enchanted artifact leaves the battlefield in response to Mechanized Production’s triggered ability but Mechanized Production does not, Mechanized Production is put into its owner’s graveyard as a state-based action with no enchanted artifact. The triggered ability creates no token, but you can still win the game if you control enough artifacts with the same name."}], "securityStamp": "oval", "setCode": "PLIST", "subtypes": ["Aura"], "supertypes": [], "text": "Enchant artifact you control\nAt the beginning of your upkeep, create a token that's a copy of enchanted artifact. Then if you control eight or more artifacts with the same name as one another, you win the game.", "type": "Enchantment — Aura", "types": ["Enchantment"], "uuid": "f00c7998-9c0f-5470-aa2d-b8205d9189c2"}