{"artist": "Johann Bodin", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R", "U"], "colors": ["R", "U"], "convertedManaCost": 6.0, "edhrecRank": 3101, "finishes": ["foil"], "foreignData": [], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": false, "identifiers": {"mtgjsonV4Id": "17ea3e93-b398-5ff7-a28e-d5fb61c7072f", "mtgoId": "48578", "scryfallId": "1c9e32e4-da08-406d-9cf2-ef8a785a78b0", "scryfallIllustrationId": "a6bfa0fe-e4e5-4354-9d4a-c1562e8d988c", "scryfallOracleId": "095d9719-0db6-43de-8e4f-a0035a4c65ed"}, "isFullArt": true, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U}{R}", "manaValue": 6.0, "name": "Melek, Izzet Paragon", "number": "48578", "originalReleaseDate": "2014-10-17", "power": "2", "printings": ["C15", "C20", "DGM", "PDGM", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2013-04-15", "text": "Melek doesn’t affect the timing rules associated with when you can cast the card. If it’s a sorcery card, you can cast it only during your main phase when the stack is empty."}, {"date": "2013-04-15", "text": "You still pay all costs for that spell, including additional costs. You may also pay alternative costs, such as overload costs. Although you can’t pay additional costs for the copy that’s created, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too. For example, if a player sacrifices a 3/3 creature to cast Fling, and you copy it, the copy of Fling will also deal 3 damage to its target."}, {"date": "2013-04-15", "text": "Melek’s last ability will copy any instant or sorcery spell you cast from your library, not just one with targets."}, {"date": "2013-04-15", "text": "When the last ability resolves, it creates a copy of the spell. You control the copy. That copy is created on the stack, so it’s not “cast.” Abilities that trigger when a player casts a spell won’t trigger. The copy will then resolve like a normal spell, after players get a chance to cast spells and activate abilities."}, {"date": "2013-04-15", "text": "The copy will have the same targets as the spell it’s copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can’t choose a new legal target, then it remains unchanged (even if the current target is illegal)."}, {"date": "2013-04-15", "text": "If the spell being copied is modal (that is, it says “Choose one —” or the like), the copy will have the same mode. You can’t choose a different one."}, {"date": "2013-04-15", "text": "If the spell being copied has an X whose value was determined as it was cast (like Debt to the Deathless has), the copy has the same value of X."}, {"date": "2013-04-15", "text": "Instant and sorcery cards with miracle allow a player to cast a card immediately upon drawing it. If you cast a spell this way, you’re casting it from your hand, not your library. Melek’s ability won’t trigger."}, {"date": "2013-04-15", "text": "The top card of your library isn’t in your hand, so you can’t suspend it, cycle it, discard it, or activate any of its activated abilities."}, {"date": "2013-04-15", "text": "If the top card of your library changes while you’re casting a spell, playing a land, or activating an ability, the new top card won’t be revealed until you finish doing so."}, {"date": "2013-04-15", "text": "When playing with the top card of your library revealed, if an effect tells you to draw several cards, reveal each one before you draw it."}], "setCode": "PRM", "subtypes": ["Weird", "Wizard"], "supertypes": ["Legendary"], "text": "Play with the top card of your library revealed.\nYou may cast instant and sorcery spells from the top of your library.\nWhenever you cast an instant or sorcery spell from your library, copy it. You may choose new targets for the copy.", "toughness": "4", "type": "Legendary Creature — Weird Wizard", "types": ["Creature"], "uuid": "53e59424-e004-57f7-9aa8-9c972d9db496"}