{"artist": "Lake Hurwitz", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 4076, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "24c6432d-bd19-5d3b-8828-f3f860e11acc", "mtgoId": "93936", "scryfallId": "b50ef57b-1265-43a5-bce7-ec23b1b8bfaf", "scryfallIllustrationId": "e5fd4101-c2bc-46e7-afdb-1479c1fa39ca", "scryfallOracleId": "e6fd55f2-7e26-469c-a44a-ea2eb90e19a9"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Flashback"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{U}", "manaValue": 4.0, "name": "Memory Deluge", "number": "93936", "originalReleaseDate": "2022-01-28", "printings": ["DBL", "MID", "PMID", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-09-24", "text": "Memory Deluge cares about the mana you actually paid to cast it, not its mana cost. If you cast Memory Deluge for {2}{U}{U}, you will look at four cards. If you cast it with flashback for {5}{U}{U}, you will look at seven cards. Any effects that increase or decrease the cost to cast it will also be taken into account."}, {"date": "2021-09-24", "text": "If Memory Deluge is copied, no mana was spent to cast the copy, so X will be 0. The amount of mana spent to cast the original spell is not copied. You won't look at any cards from your library as Memory Deluge resolves."}, {"date": "2021-09-24", "text": "If an effect allows you to cast Memory Deluge without paying its mana cost, X will be 0. Memory Deluge will resolve, but you won't do anything."}, {"date": "2021-09-24", "text": "If an effect requires you to pay some amount of mana to prevent Memory Deluge from being countered, as Flip the Switch does, that mana wasn't spent to cast Memory Deluge and will not be taken into account."}, {"date": "2021-09-24", "text": "The effects of Might of the Old Ways happen in the listed order, so the +2/+2 bonus happens before you check the powers of creatures you control. For example, if you control two 2/2 creatures and a 5/5 creatures, choosing one of the 2/2 creatures as the target will allow you to draw a card. Conversely, if you control a 1/1 creature, a 3/3 creature, and a 5/5 creature, targeting either of the two smaller creatures will not allow you to draw a card."}, {"date": "2021-09-24", "text": "“Flashback [cost]” means “You may cast this card from your graveyard by paying [cost] rather than paying its mana cost” and “If the flashback cost was paid, exile this card instead of putting it anywhere else any time it would leave the stack.”"}, {"date": "2021-09-24", "text": "You must still follow any timing restrictions and permissions, including those based on the card's type. For instance, you can cast a sorcery using flashback only when you could normally cast a sorcery."}, {"date": "2021-09-24", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a flashback cost) you're paying, add any cost increases, then apply any cost reductions. The mana value of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2021-09-24", "text": "A spell cast using flashback will always be exiled afterward, whether it resolves, is countered, or leaves the stack in some other way."}, {"date": "2021-09-24", "text": "You can cast a spell using flashback even if it was somehow put into your graveyard without having been cast."}, {"date": "2021-09-24", "text": "If a card with flashback is put into your graveyard during your turn, you can cast it if it's legal to do so before any other player can take any actions."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Look at the top X cards of your library, where X is the amount of mana spent to cast this spell. Put two of them into your hand and the rest on the bottom of your library in a random order.\nFlashback {5}{U}{U} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", "type": "Instant", "types": ["Instant"], "uuid": "b6f92ba7-009c-5d57-98ff-4162f1388883"}