{"artist": "Karla Ortiz", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 8456, "finishes": ["foil"], "flavorText": "The king went off to find himself. Imagine his terror when he succeeded.", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"mtgjsonV4Id": "1bb36c60-097d-5fac-ab6c-d88ec3a69a9d", "mtgoId": "53826", "scryfallId": "2b27f030-b6ad-4ced-8558-11cd6e159244", "scryfallIllustrationId": "27f40c4f-37c4-4200-abf8-0a894af30f5e", "scryfallOracleId": "07d0bd24-7731-4abb-9dc6-912aa17943f2"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U}", "manaValue": 5.0, "name": "Mercurial Pretender", "number": "53826", "originalReleaseDate": "2015-03-30", "power": "0", "printings": ["M15", "PM15", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2014-07-18", "text": "Mercurial Pretender’s ability doesn’t target the chosen creature."}, {"date": "2014-07-18", "text": "The activated ability Mercurial Pretender gives itself becomes part of its copiable values. Unless the ability is overwritten by another copy effect, a creature that’s a copy of Mercurial Pretender will have that ability."}, {"date": "2014-07-18", "text": "Mercurial Pretender copies exactly what was printed on the original creature and nothing more (unless that creature is copying something else or is a token; see below). It doesn’t copy whether that creature is tapped or untapped, whether it has any counters on it or Auras attached to it, or any non-copy effects that have changed its power, toughness, types, color, etc. For example, if Mercurial Pretender enters the battlefield as a copy of a Profane Memento with Ensoul Artifact attached to it, Mercurial Pretender will be a noncreature Profane Memento with Mercurial Pretender’s added activated ability."}, {"date": "2014-07-18", "text": "If the chosen creature has {X} in its mana cost (such as Genesis Hydra), X is 0."}, {"date": "2014-07-18", "text": "If the chosen creature is copying something else (for example, if the chosen creature is another Mercurial Pretender), then Mercurial Pretender enters the battlefield as whatever the chosen creature is copying (plus any abilities it gained as part of the copying process, if applicable)."}, {"date": "2014-07-18", "text": "If the chosen creature is a token, Mercurial Pretender copies the original characteristics of that token as stated by the effect that put the token onto the battlefield. Mercurial Pretender is not a token, even when copying one."}, {"date": "2014-07-18", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when Mercurial Pretender enters the battlefield. Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities of the chosen creature will also work."}, {"date": "2014-07-18", "text": "If Mercurial Pretender somehow enters the battlefield at the same time as another creature, Mercurial Pretender can’t become a copy of that creature. You may choose only a creature that’s already on the battlefield."}, {"date": "2014-07-18", "text": "You can choose not to copy anything. In that case, Mercurial Pretender enters the battlefield as a 0/0 Shapeshifter creature, and is probably put into the graveyard immediately."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Shapeshifter"], "supertypes": [], "text": "You may have Mercurial Pretender enter the battlefield as a copy of a creature you control, except it has \"{2}{U}{U}: Return this creature to its owner's hand.\"", "toughness": "0", "type": "Creature — Shapeshifter", "types": ["Creature"], "uuid": "83da30db-ccd2-59ff-ba75-b3777b3d213c", "watermark": "set (M15)"}