{"artist": "Livia Prima", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 8904, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "220667", "cardsphereId": "56355", "mcmId": "360944", "mtgjsonV4Id": "b1c9681d-c46d-5e99-8428-e9c457052e43", "scryfallId": "e3e2218b-7472-49fa-8b85-590586f293bf", "scryfallIllustrationId": "e7aca183-1d87-4f1e-ba15-50bfce7834c6", "scryfallOracleId": "2518a4f2-607f-41bb-9389-2009138d6b09", "tcgplayerProductId": "169975"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Enchant"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Metamorphic Alteration", "number": "60s", "printings": ["M19", "PM19"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/cd55cf5249bbf4f0", "tcgplayer": "https://mtgjson.com/links/d72908d747c448fc"}, "rarity": "rare", "rulings": [{"date": "2018-07-13", "text": "You can choose only a creature on the battlefield."}, {"date": "2018-07-13", "text": "Metamorphic Alteration copies exactly what is printed on the chosen creature (unless that creature is copying something else or is a token; see below). It doesn’t copy whether that creature is tapped or untapped, whether it as any counters on it or any Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, or so on."}, {"date": "2018-07-13", "text": "The characteristics that will be copied are determined as Metamorphic Alteration’s effect first begins to apply. If the copiable values of the chosen creature change later, or if that creature leaves the battlefield, the enchanted creature’s characteristics are unaffected."}, {"date": "2018-07-13", "text": "If the chosen creature isn’t normally a creature (for example, if the chosen creature is an animated Treetop Village), the enchanted creature becomes a copy of that noncreature permanent. This causes Metamorphic Alteration to be illegally attached, and it’s put into its owner’s graveyard. The previously enchanted creature returns to being itself."}, {"date": "2018-07-13", "text": "If the chosen creature is copying something else (for example, if the chosen creature is enchanted by another Metamorphic Alteration), then the enchanted creature becomes a copy of whatever the chosen creature copied."}, {"date": "2018-07-13", "text": "If the chosen creature is a token, Metamorphic Alteration copies the original characteristics of that token as stated by the effect that put the token onto the battlefield. The enchanted creature doesn’t become a token in this case."}, {"date": "2018-07-13", "text": "The enchanted creature will be a copy of the chosen creature as it dies, so any “when this creature dies” abilities it gains from the copy effect will trigger. Any “when this creature dies” abilities it normally has will not trigger."}, {"date": "2018-07-13", "text": "If Metamorphic Alteration somehow enters the battlefield at the same time as another creature, it can’t have the enchanted creature become a copy of that creature. You may choose only a creature that’s already on the battlefield."}, {"date": "2018-07-13", "text": "Metamorphic Alteration can cause a creature to become a copy of itself. This generally has no effect, but if that creature has a pair of linked abilities, the new abilities it has from the copy effect aren’t linked to the abilities it had before."}, {"date": "2018-07-13", "text": "The copiable values granted by Metamorphic Alteration are locked in as the creature is chosen. The enchanted creature won’t change if the chosen creature’s copiable values change."}], "securityStamp": "oval", "setCode": "PM19", "subtypes": ["Aura"], "supertypes": [], "text": "Enchant creature\nAs Metamorphic Alteration enters the battlefield, choose a creature.\nEnchanted creature is a copy of the chosen creature.", "type": "Enchantment — Aura", "types": ["Enchantment"], "uuid": "97b14de7-5acb-532e-9e32-b904e7e9a6f6"}