{"artist": "Lucas Graciano", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 1.0, "edhrecRank": 14638, "finishes": ["nonfoil", "foil"], "flavorText": "\"Remember, students, if it's glowing, humming, or whirring, don't touch it!\"", "foreignData": [{"flavorText": "„Denkt immer daran, meine Schüler, falls es summt oder surrt: Nicht berühren!\"", "language": "German", "multiverseId": 583862, "name": "Akribische Ausgrabung", "text": "{2}{W}: Bringe eine bleibende Karte deiner Wahl, die du kontrollierst, auf die Hand ihres Besitzers zurück. Falls sie Exhumieren hat, schicke sie stattdessen ins Exil und bringe sie dann auf die Hand ihres Besitzers zurück. Aktiviere diese Fähigkeit nur während deines Zuges.", "type": "Verzauberung"}, {"flavorText": "\"Recuerden, alumnos: si brilla, zumba o chirría, ¡no lo toquen!\".", "language": "Spanish", "multiverseId": 584123, "name": "Excavación meticulosa", "text": "{2}{W}: Regresa el permanente objetivo que controlas a la mano de su propietario. Si tiene la habilidad de desenterrar, en vez de eso, exílialo. Luego, regresa esa carta a la mano de su propietario. Activa esto solo durante tu turno.", "type": "Encantamiento"}, {"flavorText": "« N'oubliez pas, chers étudiants. Si ça luit, si ça bourdonne ou si ça tourne, n'y touchez pas ! »", "language": "French", "multiverseId": 584384, "name": "Excavation méticuleuse", "text": "{2}{W} : Renvoyez un permanent ciblé que vous contrôlez dans la main de son propriétaire. S'il a l'exhumation, à la place exilez-le, puis renvoyez cette carte dans la main de son propriétaire. N'activez que pendant votre tour.", "type": "Enchantement"}, {"flavorText": "\"Ricordate, studenti: se s'illumina o emette un ronzio, non toccatelo!\"", "language": "Italian", "multiverseId": 584645, "name": "Scavo Meticoloso", "text": "{2}{W}: Fai tornare un permanente bersaglio che controlli in mano al suo proprietario. Se ha dissotterrare, invece esilialo, poi fai tornare quella carta in mano al suo proprietario. Attiva solo durante il tuo turno.", "type": "Incantesimo"}, {"flavorText": "「生徒諸君、光ったり、唸り音を立てていたりしたなら、触ってはならないぞ。忘れるな！」", "language": "Japanese", "multiverseId": 584906, "name": "行き届いた採掘", "text": "{2}{W}：あなたがコントロールしているパーマネント１つを対象とする。それをオーナーの手札に戻す。それが蘇生を持っているなら、代わりにそれを追放する。その後、そのカードをオーナーの手札に戻す。あなたのターン中にしか起動できない。", "type": "エンチャント"}, {"flavorText": "\"Lembrem-se, alunos, se brilhar, zumbir ou ranger, não toquem!\"", "language": "Portuguese (Brazil)", "multiverseId": 585167, "name": "Escavação Meticulosa", "text": "{2}{W}: Devolva a permanente alvo que você controla para a mão de seu dono. Se ela tiver desenterrar, em vez disso, exile-a e depois devolva aquele card para a mão de seu dono. Ative apenas durante seu turno.", "type": "Encantamento"}, {"flavorText": "「同学们切记，如果是发光、嗡响或啸叫的，千万别碰！」", "language": "Chinese Simplified", "multiverseId": 585428, "name": "细工掘古", "text": "{2}{W}：将目标由你操控的永久物移回其拥有者手上。如果它具有破坟异能，则改为将它放逐，然后将该牌移回其拥有者手上。只能于你的回合中起动。", "type": "结界"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "269154", "cardKingdomId": "268860", "cardsphereId": "95453", "mcmId": "683375", "mcmMetaId": "414080", "mtgArenaId": "82500", "mtgjsonV4Id": "9beefb8d-68b4-5c53-a862-cb349a551c36", "mtgoId": "104650", "multiverseId": "583601", "scryfallId": "e811461a-6a90-416f-940c-c9579659ae0c", "scryfallIllustrationId": "47141f80-43f8-4c62-8a87-cfdc9d320d9e", "scryfallOracleId": "6dff1d15-604f-4eea-9b7a-0c0ba6afbbac", "tcgplayerProductId": "453075"}, "isStorySpotlight": true, "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{W}", "manaValue": 1.0, "name": "Meticulous Excavation", "number": "16", "originalText": "{2}{W}: Return target permanent you control to its owner's hand. If it has unearth, instead exile it, then return that card to its owner's hand. Activate only during your turn.", "originalType": "Enchantment", "printings": ["BRO"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/255e798c9c6443d7", "cardKingdomFoil": "https://mtgjson.com/links/e7bc96a7125263d0", "cardmarket": "https://mtgjson.com/links/e965db90b5554a76", "tcgplayer": "https://mtgjson.com/links/3c16af8d37e71ff1"}, "rarity": "uncommon", "rulings": [{"date": "2022-10-14", "text": "If the target permanent has unearth and was put onto the battlefield using its unearth ability, this effect can still exile it and return it to its owner’s hand."}, {"date": "2022-10-14", "text": "If you activate a card’s unearth ability but that card is removed from your graveyard before the ability resolves, that unearth ability will do nothing as it resolves."}, {"date": "2022-10-14", "text": "Activating a card’s unearth ability isn’t the same as casting that card. The unearth ability is put on the stack, but the card is not. Spells and abilities that interact with activated abilities (such as Defabricate’s second mode) will interact with unearth, but spells and abilities that interact with spells (such as Scatter Ray) will not."}, {"date": "2022-10-14", "text": "At the beginning of the next end step, a permanent returned to the battlefield with unearth is exiled. This is a delayed triggered ability, and it can be countered by effects such as Defabricate that counter triggered abilities. If the ability is countered, the permanent will stay on the battlefield and the delayed triggered ability won’t trigger again. However, the replacement effect will still exile the permanent if it eventually leaves the battlefield."}, {"date": "2022-10-14", "text": "Unearth grants haste to the permanent that’s returned to the battlefield (even if it’s not a creature card). However, neither of the “exile” abilities is granted to that permanent. If that permanent loses all its abilities, it will still be exiled at the beginning of the next end step, and if it would leave the battlefield, it is still exiled instead."}, {"date": "2022-10-14", "text": "If a permanent returned to the battlefield with unearth would leave the battlefield for any reason, it’s exiled instead—unless the spell or ability that’s causing the permanent to leave the battlefield is actually trying to exile it! In that case, it succeeds at exiling it. If that spell or ability later returns the card to the battlefield (as Static Net might, for example), the permanent card will return to the battlefield as a new object with no relation to its previous existence. The unearth effects will no longer apply to it."}], "setCode": "BRO", "subtypes": [], "supertypes": [], "text": "{2}{W}: Return target permanent you control to its owner's hand. If it has unearth, instead exile it, then return that card to its owner's hand. Activate only during your turn.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "8c24486d-4d6b-5c3e-a78a-26057db06745"}