{"artist": "PINDURSKI", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U", "W"], "colors": ["U", "W"], "convertedManaCost": 4.0, "edhrecRank": 3985, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 531598, "name": "Mitternacht-Pfadleuchter", "text": "Kreaturen, die du kontrollierst, können nicht geblockt werden, außer von legendären Kreaturen.\nImmer wenn eine oder mehrere Kreaturen, die du kontrollierst, einem Spieler Kampfschaden zufügen, wage dich ins Gewölbe.", "type": "Kreatur — Mensch, Zauberer"}, {"language": "Spanish", "multiverseId": 531654, "name": "Alumbrasendas de medianoche", "text": "Las criaturas que controlas no pueden ser bloqueadas excepto por criaturas legendarias.\nSiempre que una o más criaturas que controlas hagan daño de combate a un jugador, adéntrate en la mazmorra.", "type": "Criatura — Hechicero humano"}, {"language": "French", "multiverseId": 531710, "name": "Éclaireur de chemin de minuit", "text": "Les créatures que vous contrôlez ne peuvent pas être bloquées excepté par des créatures légendaires.\nÀ chaque fois qu'au moins une créature que vous contrôlez inflige des blessures de combat à un joueur, aventurez-vous dans le donjon.", "type": "Créature : humain et sorcier"}, {"language": "Italian", "multiverseId": 531766, "name": "Rischiarasentieri di Mezzanotte", "text": "Le creature che controlli non possono essere bloccate tranne che da creature leggendarie.\nOgniqualvolta una o più creature che controlli infliggono danno da combattimento a un giocatore, esplora il dungeon.", "type": "Creatura — Mago Umano"}, {"language": "Japanese", "multiverseId": 531822, "name": "真夜中の道照らし", "text": "あなたがコントロールしているすべてのクリーチャーは伝説のクリーチャーによってしかブロックされない。\nあなたがコントロールしている１体以上のクリーチャーがプレイヤー１人に戦闘ダメージを与えるたび、ダンジョン探索をする。", "type": "クリーチャー — 人間・ウィザード"}], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "249375", "cardsphereId": "80246", "mcmId": "572675", "mtgjsonV4Id": "a0f3db18-6106-59ba-9d4d-753f3e193757", "multiverseId": "531542", "scryfallId": "35f06354-f2ea-48c3-bcbc-b5555f83787e", "scryfallIllustrationId": "4642406d-7e43-42ff-9a53-fefaff9ee2bc", "scryfallOracleId": "e49228d6-6488-4cbc-aa53-303afd3a549b", "tcgplayerProductId": "244258"}, "keywords": ["Venture into the dungeon"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}{U}", "manaValue": 4.0, "name": "Midnight Pathlighter", "number": "322", "originalText": "Creatures you control can't be blocked except by legendary creatures.\nWhenever one or more creatures you control deal combat damage to a player, venture into the dungeon.", "originalType": "Creature — Human Wizard", "power": "2", "printings": ["AFC"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6db01588bf44e3bf", "tcgplayer": "https://mtgjson.com/links/abb898e863019404"}, "rarity": "rare", "rulings": [{"date": "2021-07-23", "text": "Unblocked creatures with double strike deal damage twice, which will cause Midnight Pathlighter's last ability to trigger twice."}, {"date": "2021-07-23", "text": "To venture into the dungeon, a player moves their venture marker into the next room of the dungeon they are currently in. If they aren't currently in a dungeon, that player instead chooses a dungeon card from outside the game, puts it into the command zone, and moves their venture marker onto the first room."}, {"date": "2021-07-23", "text": "Moving into a dungeon room will cause its room ability to trigger."}, {"date": "2021-07-23", "text": "Once you resolve the last room ability of a dungeon, that dungeon is now completed and is removed from the game."}, {"date": "2021-07-23", "text": "A player may only have one dungeon in the command zone at a time."}, {"date": "2021-07-23", "text": "The player venturing into the dungeon chooses which dungeon they will venture into. They may choose a dungeon that they have already completed this game."}, {"date": "2021-07-23", "text": "Dungeon cards are not part of a player's deck or sideboard. In both constructed and limited formats, players can use any dungeon card when they venture into the dungeon."}, {"date": "2021-07-23", "text": "You can only move forward (well, downward) in a dungeon, never backwards or sideways."}, {"date": "2021-07-23", "text": "Dungeons are removed from the game as a state-based action."}, {"date": "2021-07-23", "text": "If you somehow venture into the dungeon while a room's ability is on the stack, you will continue on in the dungeon. If you're already in the last room, complete that dungeon and start a new one."}, {"date": "2021-07-23", "text": "Choosing the dungeon or room to venture into is part of resolving the venture into the dungeon keyword action. Once that choice is made, players may not respond until after the appropriate room ability has triggered."}], "securityStamp": "oval", "setCode": "AFC", "subtypes": ["Human", "Wizard"], "supertypes": [], "text": "Creatures you control can't be blocked except by legendary creatures.\nWhenever one or more creatures you control deal combat damage to a player, venture into the dungeon. (Enter the first room or advance to the next room.)", "toughness": "3", "type": "Creature — Human Wizard", "types": ["Creature"], "uuid": "e8d1b353-29a0-5dc1-a3da-783aa2a1f0de", "variations": ["f4332202-71a8-56d8-8a80-fc83ef4b751e"]}