{"artist": "Dan Scott", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 20530, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 117769, "name": "Massennachbau", "text": "Reproduktion {3}{U} (Wenn du diesen Zauber spielst, kopiere ihn so oft, wie du seine Reproduktionskosten bezahlst. Du kannst neue Ziele für die Kopien bestimmen.)\nBestimme eine bleibende Karte deiner Wahl, die ein Gegner kontrolliert. Durchsuche die Bibliothek dieses Spielers nach einer Karte mit demselben Namen und bringe sie unter deiner Kontrolle ins Spiel. Dieser Spieler mischt dann seine Bibliothek.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 118759, "name": "Mimeofactura", "text": "Reproducir {3}{U} (Cuando juegues este hechizo, cópialo por cada vez que pagaste su coste de reproducir. Puedes elegir nuevos objetivos para la copia.)\nElige un permanente objetivo que controle un oponente. Busca en la biblioteca de ese jugador una carta con el mismo nombre y ponla en juego bajo tu control. Luego ese jugador baraja su biblioteca.", "type": "Conjuro"}, {"language": "French", "multiverseId": 117934, "name": "Ronéofabrication", "text": "Duplication {3}{U} (Quand vous jouez ce sort, copiez-le pour chaque fois que vous avez payé son coût de duplication. Vous pouvez choisir de nouvelles cibles pour ces copies.)\nChoisissez un permanent ciblé contrôlé par un adversaire. Cherchez dans la bibliothèque de ce joueur une carte du même nom et mettez-la en jeu sous votre contrôle. Ce joueur mélange ensuite sa bibliothèque.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 118099, "name": "Mimofattura", "text": "Replicare {3}{U} (Quando giochi questa magia, copiala ogni volta che paghi il suo costo di replica. Puoi scegliere nuovi bersagli per le copie.)\nScegli un permanente bersaglio controllato da un avversario. Passa in rassegna il grimorio di quel giocatore, scegli una carta con lo stesso nome e mettila in gioco sotto il tuo controllo. Poi quel giocatore rimescola il proprio grimorio.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 118264, "name": "複写作成", "text": "複製 {3}{U} （あなたがこの呪文をプレイするとき、あなたが複製コストを支払った回数に等しい数だけそれをコピーする。 あなたはそのコピーの新しい対象を選んでもよい。）\nいずれかの対戦相手がコントロールするパーマネント１つを対象とする。 そのプレイヤーのライブラリーからそれと同じ名前のカードを１枚探し、それをあなたのコントロール下で場に出す。 その後、そのプレイヤーは自分のライブラリーを切り直す。", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 118429, "name": "Mimeotização", "text": "Replicar {3}{U} (Quando você jogar esta mágica, faça uma cópia dela para cada vez que tiver pago seu custo de replicação. Você pode escolher novos alvos para as cópias.)\nEscolha a permanente alvo que um oponente controla. Procure no grimório daquele jogador por um card com o mesmo nome e coloque-o em jogo sob o seu controle. Depois, aquele jogador embaralha seu próprio grimório.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 118594, "name": "Мимикфактура", "text": "Копия {3}{U} (Когда вы разыгрываете это заклинание, копируйте его каждый раз, когда вы уплатили стоимость его копирования. Для копий можно выбирать новые цели.)\nВыберите целевой перманент, который контролирует ваш оппонент. Найдите в библиотеке этого игрока карту с таким же названием и введите его в игру под своим контролем. Затем этот игрок тасует свою библиотеку.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 117604, "name": "摹刻", "text": "覆诵{3}{U}（当你使用此咒语时，每支付一次覆诵费用，就可以将它复制一次。 你可以为每个复制品选择新的目标。）\n选择目标由对手操控的永久物。 从该牌手的牌库中搜寻一张与该永久物同名的牌，并在你的操控下放置进场。 然后该牌手将其牌库洗牌。", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "119824", "cardKingdomId": "119659", "cardsphereId": "19654", "mcmId": "13212", "mcmMetaId": "7792", "mtgjsonV4Id": "0b3a0114-af88-5de2-a121-7b26bacdce47", "mtgoFoilId": "23874", "mtgoId": "23873", "multiverseId": "106568", "scryfallId": "f4ada33a-5b7c-426a-8416-4ce01bccaa5c", "scryfallIllustrationId": "33e96e26-7f53-4e6b-9e19-25402820bf0b", "scryfallOracleId": "79b978b8-44c8-4ca8-bdd5-10490145398d", "tcgplayerProductId": "13730"}, "keywords": ["Replicate"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Mimeofacture", "number": "30", "originalText": "Replicate {3}{U} (When you play this spell, copy it for each time you paid its replicate cost. You may choose new targets for the copies.)\nChoose target permanent an opponent controls. Search that player's library for a card with the same name and put it into play under your control. Then that player shuffles his or her library.", "originalType": "Sorcery", "printings": ["GPT"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/524ac79d1d3959a2", "cardKingdomFoil": "https://mtgjson.com/links/ec707acae915565c", "cardmarket": "https://mtgjson.com/links/efee6f7805dcc394", "tcgplayer": "https://mtgjson.com/links/b85510d341c5a59e"}, "rarity": "rare", "rulings": [], "setCode": "GPT", "subtypes": [], "supertypes": [], "text": "Replicate {3}{U} (When you cast this spell, copy it for each time you paid its replicate cost. You may choose new targets for the copies.)\nChoose target permanent an opponent controls. Search that player's library for a card with the same name and put it onto the battlefield under your control. Then that player shuffles.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "4dedf69b-dd50-56b8-abf9-7ee1d03c4ed3", "watermark": "izzet"}