{"artist": "Matt Cavotta", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 838, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 231219, "name": "Bottich der Nachäffung", "text": "Einprägen — Immer wenn eine Kreatur außer einem Spielstein aus dem Spiel auf einen Friedhof gelegt wird, kannst du jene Karte ins Exil schicken. Falls du dies tust, lege alle anderen Karten, die du mit dem Bottich der Nachäffung ins Exil geschickt hast, auf den Friedhof ihrer Besitzer zurück.\n{3}, {T}: Bringe einen Spielstein ins Spiel, der eine Kopie der ins Exil geschickten Karte ist. Er hat Eile. Schicke ihn zu Beginn des nächsten Endsegments ins Exil.", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 232713, "name": "Tanque mímico", "text": "Estampa — Siempre que una criatura que no sea ficha vaya a un cementerio desde el campo de batalla, puedes exiliar esa carta. Si lo haces, regresa cada otra carta exiliada con el Tanque mímico al cementerio de su propietario.\n{3}, {T}: Pon en el campo de batalla una ficha que es una copia de la carta exiliada. Gana la habilidad de prisa. Exíliala al comienzo del próximo paso final.", "type": "Artefacto"}, {"language": "French", "multiverseId": 231966, "name": "Cuve de mimétisme", "text": "Empreinte — À chaque fois qu'une créature non-jeton est mise dans un cimetière depuis le champ de bataille, vous pouvez exiler cette carte. Si vous faites ainsi, renvoyez dans le cimetière de son propriétaire chaque autre carte exilée avec la Cuve de mimétisme.\n{3}, {T} : Mettez sur le champ de bataille un jeton qui est une copie de la carte exilée. Il acquiert la célérité. Exilez-le au début de la prochaine étape de fin.", "type": "Artefact"}, {"language": "Italian", "multiverseId": 232962, "name": "Vasca del Mimic", "text": "Imprimere — Ogniqualvolta una creatura non pedina viene messa in un cimitero dal campo di battaglia, puoi esiliare quella carta. Se lo fai, fai tornare ogni altra carta esiliata con la Vasca del Mimic nel cimitero del suo proprietario.\n{3}, {T}: Metti sul campo di battaglia una pedina che è una copia della carta esiliata. Ha rapidità. Esiliala all'inizio della prossima sottofase finale.", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 231717, "name": "ミミックの大桶", "text": "刻印 ― トークンでないクリーチャーが１体戦場からいずれかの墓地に置かれるたび、あなたはそのカードを追放してもよい。そうした場合、ミミックの大桶により追放された他の各カードをオーナーの墓地に戻す。\n{3}, {T}：その追放されているカードのコピーであるトークンを１体戦場に出す。それは速攻を得る。 次の終了ステップの開始時に、それを追放する。", "type": "アーティファクト"}, {"language": "Portuguese (Brazil)", "multiverseId": 230970, "name": "Barril de Mímica", "text": "Estampar — Toda vez que uma criatura que não seja ficha for colocada num cemitério vinda do campo de batalha, você poderá exilar aquele card. Se fizer isso, devolva cada card exilado com Barril de Mímica ao cemitério do seu dono.\n{3}, {T}: Coloque uma ficha no campo de batalha que seja uma cópia do card exilado. Ela ganha ímpeto. Exile-a no início da próxima etapa final.", "type": "Artefato"}, {"language": "Russian", "multiverseId": 231468, "name": "Чан Подражания", "text": "Отпечаток — Каждый раз когда не являющееся фишкой существо попадает с поля битвы на кладбище, вы можете изгнать ту карту. Если вы это делаете, верните каждую другую карту, изгнанную Чаном Подражания, на кладбище ее владельца.\n{3}, {T}: положите на поле битвы фишку, которая является копией изгнанной карты. Она получает Ускорение. Изгоните ее в начале следующего заключительного шага.", "type": "Артефакт"}, {"language": "Chinese Simplified", "multiverseId": 232464, "name": "拟态缸", "text": "压印～每当一个非衍生物的生物从战场进入坟墓场时，你可以放逐该牌。若你如此作，则将其他以拟态缸放逐的牌移回其拥有者的坟墓场。\n{3}，{T}：将一个衍生物放进战场，此衍生物为所放逐的牌之复制品。它获得敏捷。 在下一个结束步骤开始时，将它放逐。", "type": "神器"}, {"language": "Chinese Traditional", "multiverseId": 232215, "name": "擬態缸", "text": "壓印～每當一個非衍生物的生物從戰場進入墳墓場時，你可以放逐該牌。若你如此作，則將其他以擬態缸放逐的牌移回其擁有者的墳墓場。\n{3}，{T}：將一個衍生物放進戰場，此衍生物為所放逐的牌之複製品。它獲得敏捷。 在下一個結束步驟開始時，將它放逐。", "type": "神器"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "132493", "cardKingdomId": "132259", "cardsphereId": "40463", "mcmId": "242828", "mcmMetaId": "200886", "mtgjsonV4Id": "a8cc0dca-5271-5cf4-91d0-81f21fd0a805", "mtgoFoilId": "38192", "mtgoId": "38191", "multiverseId": "207883", "scryfallId": "736fff86-2417-4a77-b8eb-be2d1d142a9f", "scryfallIllustrationId": "1c8456ea-589e-4252-a425-cea66dff59ca", "scryfallOracleId": "6ebdc9f3-6b23-4716-8011-48f00d7e30c8", "tcgplayerProductId": "36514"}, "keywords": ["Imprint"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Mimic Vat", "number": "175", "originalText": "Imprint — Whenever a nontoken creature is put into a graveyard from the battlefield, you may exile that card. If you do, return each other card exiled with Mimic Vat to its owner's graveyard.\n{3}, {T}: Put a token onto the battlefield that's a copy of the exiled card. It gains haste. Exile it at the beginning of the next end step.", "originalType": "Artifact", "printings": ["C18", "C19", "C20", "MB1", "NCC", "SOM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/dfc46d7bb3c0739e", "cardKingdomFoil": "https://mtgjson.com/links/eca3230ed2846b2a", "cardmarket": "https://mtgjson.com/links/8c99cdab45d3be18", "tcgplayer": "https://mtgjson.com/links/f06bb4688822c421"}, "rarity": "rare", "rulings": [{"date": "2011-01-01", "text": "If multiple nontoken creatures are put into their owners' graveyards from the battlefield at the same time, the imprint ability will trigger that many times. You put the triggered abilities on the stack in any order, so you'll determine in which order they resolve. However, since exiling those cards is optional, and choosing to exile a card this way causes the previously exiled cards to return to their owners' graveyards, the order generally doesn't matter: You'll wind up with at most one of those cards exiled, and the rest will be in the appropriate graveyards."}, {"date": "2011-01-01", "text": "You may exile a noncreature card with Mimic Vat's first ability. For example, if a nontoken artifact that's become a creature is put into a graveyard from the battlefield, Mimic Vat's first ability triggers and you may exile that card."}, {"date": "2011-01-01", "text": "The token created by the second ability will be a copy of whatever card is exiled with Mimic Vat at the time the ability resolves. This might not be the same card that was exiled with Mimic Vat at the time the ability was activated. It also might not be a creature card."}, {"date": "2011-01-01", "text": "If the token is a copy of a noncreature card, it will still have haste, though that won't matter unless that token somehow becomes a creature."}, {"date": "2011-01-01", "text": "You may activate the second ability even if no card has been exiled with Mimic Vat. If no card has been exiled with Mimic Vat by the time the ability resolves, no token will be created."}, {"date": "2011-01-01", "text": "The imprint ability will trigger whenever a nontoken creature is put into any graveyard from the battlefield, not just your graveyard."}, {"date": "2011-01-01", "text": "Any enters-the-battlefield abilities of the exiled card will trigger when the token is put onto the battlefield. Any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities of the exiled card will also work."}, {"date": "2011-01-01", "text": "The token is exiled at the beginning of the next end step regardless of who controls it at that time, whether the exiled card is still exiled at that time, or whether Mimic Vat is still on the battlefield at that time."}, {"date": "2011-01-01", "text": "If Mimic Vat's second ability is activated during a turn's end step, the token will be exiled at the beginning of the following turn's end step."}, {"date": "2011-01-01", "text": "If the token isn't exiled when the delayed triggered ability resolves (due to Stifle, perhaps), it remains on the battlefield indefinitely. It continues to have haste."}, {"date": "2011-01-01", "text": "If the exiled card has {X} in its mana cost (such as Protean Hydra), X is considered to be 0."}, {"date": "2011-01-01", "text": "Exiling the card as the first ability resolves is optional. If you choose not to exile it, or you can't exile it because the card has somehow left the graveyard before the ability resolves, the ability simply doesn't do anything as it resolves. Any card currently exiled by Mimic Vat remains exiled."}, {"date": "2016-07-13", "text": "If a melded permanent dies and triggers Mimic Vat's triggered ability, both of its component cards are exiled. As Mimic Vat's second ability resolves, its controller chooses one of those cards to make a token copy of."}, {"date": "2018-07-13", "text": "If the creature that dies is an instant or sorcery card that's been manifested, Mimic Vat may have a nonpermanent card exiled. You can't create a token that's a copy of a nonpermanent card. No token is created in this case."}], "setCode": "SOM", "subtypes": [], "supertypes": [], "text": "Imprint — Whenever a nontoken creature dies, you may exile that card. If you do, return each other card exiled with Mimic Vat to its owner's graveyard.\n{3}, {T}: Create a token that's a copy of a card exiled with Mimic Vat. It gains haste. Exile it at the beginning of the next end step.", "type": "Artifact", "types": ["Artifact"], "uuid": "09d82b86-d60b-5efe-a4d0-d4c157314185", "watermark": "mirran"}