{"artist": "Antonio José Manzanedo", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 6.0, "edhrecRank": 4869, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 484942, "name": "Verstandabsauger", "text": "Mutation {4}{B} (Falls du diesen Zauberspruch für seine Mutationskosten wirkst, lege ihn auf oder unter eine Nicht-Mensch-Kreatur deiner Wahl, die du besitzt. Sie mutieren zur oben liegenden Kreatur, die zusätzlich alle Fähigkeiten der darunter liegenden hat.)\nFliegend\nImmer wenn diese Kreatur mutiert, schicke die oberste Karte der Bibliothek jedes Gegners verdeckt ins Exil. Du kannst die Karten anschauen und spielen, solange sie im Exil bleiben.", "type": "Kreatur — Nachtmahr"}, {"language": "Spanish", "multiverseId": 484993, "name": "Mentejuela", "text": "Mutación {4}{B}. (Si lanzas este hechizo pagando su coste de mutación, ponlo sobre o bajo la criatura objetivo que no sea Humano de la cual eres propietario. Estas mutan en la criatura de la parte superior más todas las habilidades de debajo.)\nVuela.\nSiempre que esta criatura mute, exilia boca abajo la primera carta de la biblioteca de cada oponente. Puedes mirar y jugar esas cartas mientras permanezcan exiliadas.", "type": "Criatura — Pesadilla"}, {"language": "French", "multiverseId": 485044, "name": "Sangsucéphale", "text": "Mutation {4}{B} (Si vous lancez ce sort pour son coût de mutation, mettez-le au-dessus ou au-dessous d'une créature non-Humain ciblée que vous possédez. La créature mutante est la créature du dessus, avec toutes les capacités des cartes au-dessous.)\nVol\nÀ chaque fois que cette créature subit une mutation, exilez la carte du dessus de la bibliothèque de chaque adversaire face cachée. Vous pouvez regarder et jouer ces cartes tant qu'elles restent exilées.", "type": "Créature : cauchemar"}, {"language": "Italian", "multiverseId": 485095, "name": "Risucchiamente", "text": "Mutazione {4}{B} (Se lanci questa magia per il suo costo di mutazione, mettila sopra o sotto una creatura non Umano bersaglio che possiedi. Muta nella creatura sopra, con anche le abilità di quelle sotto.)\nVolare\nOgniqualvolta questa creatura muta, esilia a faccia in giù la prima carta del grimorio di ogni avversario. Puoi guardare e giocare quelle carte fintanto che rimangono esiliate.", "type": "Creatura — Incubo"}, {"language": "Japanese", "multiverseId": 485146, "name": "精神吸い", "text": "変容{4}{B}（あなたがこの呪文をこれの変容コストで唱えるなら、あなたがオーナーであり人間でないクリーチャー１体を対象とし、これをそれの上か下に置く。これらは、一番上のクリーチャーに、その下にある能力すべてを加えたものに変容する。）\n飛行\nこのクリーチャーが変容するたび、各対戦相手のライブラリーの一番上のカードをそれぞれ裏向きに追放する。それらのカードが追放され続けているかぎり、あなたはそれらを見てもよいしプレイしてもよい。", "type": "クリーチャー — ナイトメア"}, {"language": "Portuguese (Brazil)", "multiverseId": 485197, "name": "Mentessuga", "text": "Mutação {4}{B} (Se você conjurar esta mágica pelo custo de mutação, coloque-a sobre ou sob a criatura alvo que você possui que não seja um Humano. Elas sofrem uma mutação que resulta na criatura de cima com todas as habilidades das criaturas de baixo.)\nVoar\nToda vez que esta criatura sofrer mutação, exile com a face voltada para baixo o card do topo do grimório de cada oponente. Você pode olhar e jogar aqueles cards enquanto eles permanecerem exilados.", "type": "Criatura — Pesadelo"}, {"language": "Russian", "multiverseId": 485248, "name": "Пиявка Разума", "text": "Мутация {4}{B} (Если вы разыграли это заклинание за его стоимость Мутации, положите его сверху или снизу целевого принадлежащего вам существа, не являющегося Человеком. Они мутируют в существо сверху, которому добавляются все способности снизу.)\nПолет\nКаждый раз, когда это существо мутирует, изгоните верхнюю карту библиотеки каждого оппонента рубашкой вверх. Вы можете смотреть и разыгрывать те карты, пока они остаются в изгнании.", "type": "Существо — Кошмар"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "232280", "cardsphereId": "66332", "mcmId": "452068", "mtgjsonV4Id": "f2069798-cf72-5b60-9f13-d42fac3f0553", "mtgoId": "80669", "multiverseId": "484891", "scryfallId": "2bf6b21a-8e18-400c-a39c-d693e487e47b", "scryfallIllustrationId": "bbe3ef3c-4b1d-4608-b908-a6d01aa91d5d", "scryfallOracleId": "4864cc98-4fde-4010-81e9-ea4944347e7e", "tcgplayerProductId": "212147"}, "isStarter": true, "keywords": ["Flying", "Mutate"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{B}{B}", "manaValue": 6.0, "name": "Mindleecher", "number": "44", "originalText": "Mutate {4}{B} (If you cast this spell for its mutate cost, put it over or under target non-Human creature you own. They mutate into the creature on top plus all abilities from under it.)\nFlying\nWhenever this creature mutates, exile the top card of each opponent's library face down. You may look at and play those cards for as long as they remain exiled.", "originalType": "Creature — Nightmare", "power": "5", "printings": ["C20"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/07adb21722ff53cb", "tcgplayer": "https://mtgjson.com/links/aebe890df2e9fabb"}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "You may look at and play those cards even if Mindleecher leaves the battlefield. If another player gains control of Mindleecher, that player can’t look at or play the cards, and you still can."}, {"date": "2020-04-17", "text": "You can play lands this way only if you have remaining land plays available for the turn."}, {"date": "2020-04-17", "text": "You pay the costs for the exiled cards if you cast them. You may pay alternative costs such as mutate rather than a card’s mana cost."}, {"date": "2020-04-17", "text": "Mindleecher doesn’t change when you can cast the exiled cards. For example, if you exile a creature card without flash, you can cast it only during your main phase when the stack is empty."}, {"date": "2020-04-17", "text": "Casting the card causes it to leave exile. You can’t cast it multiple times."}, {"date": "2020-04-17", "text": "In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. If you leave the game, any spells or permanents you control from Mindleecher are exiled, and any cards remaining in exile remain face down indefinitely. No player may look at them."}], "securityStamp": "oval", "setCode": "C20", "subtypes": ["Nightmare"], "supertypes": [], "text": "Mutate {4}{B} (If you cast this spell for its mutate cost, put it over or under target non-Human creature you own. They mutate into the creature on top plus all abilities from under it.)\nFlying\nWhenever this creature mutates, exile the top card of each opponent's library face down. You may look at and play those cards for as long as they remain exiled.", "toughness": "5", "type": "Creature — Nightmare", "types": ["Creature"], "uuid": "6d5548dd-ceaa-5eea-9583-0f895659fe2f"}