{"artist": "Robbie Trevino", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 5837, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "4ea61185-fc89-5a9f-8166-31069efe494c", "mtgoId": "97921", "scryfallId": "541bb1ef-5aa7-48fa-a102-7b6e52179112", "scryfallIllustrationId": "935df888-910d-4b13-8a43-1fadd234aa29", "scryfallOracleId": "009a4073-5946-4131-928c-c5c373745344"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Crew", "Flying"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}", "manaValue": 3.0, "name": "Mindlink Mech", "number": "97921", "originalReleaseDate": "2022-02-19", "power": "4", "printings": ["NEO", "PNEO", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2022-02-18", "text": "Mindlink Mech's second ability triggers as its crew ability resolves for the first time each turn."}, {"date": "2022-02-18", "text": "Mindlink Mech's triggered ability can target only a creature that was tapped to pay its crew cost this turn."}, {"date": "2022-02-18", "text": "If a continuous effect that isn't a copy effect is modifying Mindlink Mech's power, toughness, or types, that effect will continue to apply to it after it becomes a copy."}, {"date": "2022-02-18", "text": "Mindlink Mech copies exactly what was printed on the original creature (unless that creature is copying something else or is a token; see below), except that it also has Mindlink Mech's types and is 4/3. It doesn't copy whether that creature is tapped or untapped, whether it has any counters on it or any Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, or so on."}, {"date": "2022-02-18", "text": "If Mindlink Mech becomes a copy of a creature that is copying something else, it becomes a copy of whatever that creature is a copy of."}, {"date": "2022-02-18", "text": "If the creature is a token, Mindlink Mech copies the original characteristics of that token as stated by the effect that put the token onto the battlefield. It doesn't become a token."}, {"date": "2022-02-18", "text": "If a player crews Mindlink Mech with a nonlegendary permanent that is not normally a creature or Vehicle, the resulting permanent Mindlink Mech becomes is a 0/0 artifact creature and will usually be put into its owner's graveyard. This is because a copy effect can't set the power and toughness of a permanent if being a creature isn't part of that permanent's copiable characteristics. The crew effect is then applied after the copy effect, and it becomes a creature with no defined power or toughness, so both are set to 0."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Vehicle"], "supertypes": [], "text": "Flying\nWhenever Mindlink Mech becomes crewed for the first time each turn, until end of turn, Mindlink Mech becomes a copy of target nonlegendary creature that crewed it this turn, except it's 4/3, it's a Vehicle artifact in addition to its other types, and it has flying.\nCrew 1", "toughness": "3", "type": "Artifact — Vehicle", "types": ["Artifact"], "uuid": "24a30025-052f-56d8-b7e8-e651f35c2c10"}