{"artist": "Mark Tedin", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 5.0, "edhrecRank": 9098, "finishes": ["nonfoil", "foil"], "flavorText": "To crack a mirror is to provide an opening for the reflection to escape.", "foreignData": [{"flavorText": "Einen Spiegel zu zerbrechen bedeutet, eine Öffnung zu schaffen, durch die das Spiegelbild entweichen kann.", "language": "German", "multiverseId": 187678, "name": "Lakaienreflektor", "text": "Immer wenn eine Kreatur unter deiner Kontrolle ins Spiel kommt, die kein Spielstein ist, kannst du {2} bezahlen. Falls du dies tust, bringe einen Spielstein ins Spiel, der eine Kopie dieser Kreatur ist. Dieser Spielstein hat Eile und „Opfere am Ende des Zuges diese bleibende Karte\".", "type": "Artefakt"}, {"flavorText": "Quebrar un espejo es darle al reflejo una salida.", "language": "Spanish", "multiverseId": 187927, "name": "Reflector del sicario", "text": "Siempre que una criatura que no sea una ficha entre en juego bajo tu control, puedes pagar {2}. Si lo haces, pon en juego una ficha que es una copia de esa criatura. Esa ficha tiene la habilidad de prisa y \"Al final del turno, sacrifica este permanente\".", "type": "Artefacto"}, {"flavorText": "Briser un miroir, c'est permettre au reflet de s'échapper.", "language": "French", "multiverseId": 188674, "name": "Réflecteur de mignon", "text": "À chaque fois qu'une créature non-jeton arrive en jeu sous votre contrôle, vous pouvez payer {2}. Si vous faites ainsi, mettez en jeu un jeton qui est une copie de cette créature. Ce jeton a la célérité et « À la fin du tour, sacrifiez ce permanent. »", "type": "Artefact"}, {"flavorText": "Rompere uno specchio è fornire un varco perché il riflesso riesca a fuggire.", "language": "Italian", "multiverseId": 188425, "name": "Servitore Riflettente", "text": "Ogniqualvolta una creatura non pedina entra in gioco sotto il tuo controllo, puoi pagare {2}. Se lo fai, metti in gioco una pedina che è una copia di quella creatura. Quella pedina ha rapidità e \"Alla fine del turno, sacrifica questo permanente\".", "type": "Artefatto"}, {"flavorText": "鏡を砕けば、反射が逃げるための道が現れる。", "language": "Japanese", "multiverseId": 187180, "name": "下僕の反射鏡", "text": "トークンでないクリーチャーが１体あなたのコントロール下で場に出るたび、あなたは{2}を支払ってもよい。 そうした場合、そのクリーチャーのコピーであるトークンを１体場に出す。 そのトークンは速攻と「ターン終了時に、このパーマネントを生け贄に捧げる。」を持つ。", "type": "アーティファクト"}, {"flavorText": "Quebrar um espelho é proporcionar uma abertura para que o reflexo escape.", "language": "Portuguese (Brazil)", "multiverseId": 188176, "name": "Refletor do Assecla", "text": "Toda vez que uma criatura que não seja ficha entra em jogo sob seu controle, você pode pagar {2}. Se fizer isso, coloque uma ficha em jogo que seja uma cópia daquela criatura. Aquela ficha tem ímpeto e \"No final do turno, sacrifique esta permanente.\"", "type": "Artefato"}, {"flavorText": "Трещина в зеркале это лазейка, через которую может ускользнуть отражение.", "language": "Russian", "multiverseId": 188923, "name": "Отражатель Приспешников", "text": "Каждый раз, когда не являющееся фишкой существо входит в игру под вашим контролем, вы можете заплатить {2}. Если вы это делаете, положите в игру одну фишку, являющуюся копией того существа. Та фишка имеет Ускорение и способность «В конце хода пожертвуйте этот перманент».", "type": "Артефакт"}, {"flavorText": "若打破镜子，就会给里面的映影开个出口逃离。", "language": "Chinese Simplified", "multiverseId": 187429, "name": "仆从映镜", "text": "每当一个非衍生物的生物在你的操控下进场时，你可以支付{2}。 若你如此作，则将一个衍生物放置进场，且是该生物的复制。 该衍生物具有敏捷异能及「在回合结束时，牺牲此永久物。」", "type": "神器"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "126069", "cardKingdomId": "125834", "cardsphereId": "42501", "mcmId": "19947", "mcmMetaId": "10258", "mtgjsonV4Id": "fdc0f66b-f476-57d8-9624-a85a0143c815", "mtgoFoilId": "30876", "mtgoId": "30875", "multiverseId": "174796", "scryfallId": "5d2a48f9-4f14-4d19-b3dc-3bf3fafac32d", "scryfallIllustrationId": "166b4370-1976-4e2a-b032-0ae3261c9dd0", "scryfallOracleId": "0124977f-06e6-430a-a874-f7d05883a97c", "tcgplayerProductId": "27733"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{5}", "manaValue": 5.0, "name": "Minion Reflector", "number": "211", "originalText": "Whenever a nontoken creature comes into play under your control, you may pay {2}. If you do, put a token into play that's a copy of that creature. That token has haste and \"At end of turn, sacrifice this permanent.\"", "originalType": "Artifact", "printings": ["ALA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/3f322e31f1c393cb", "cardKingdomFoil": "https://mtgjson.com/links/e50bbf891767112e", "cardmarket": "https://mtgjson.com/links/e37a00ecec539377", "tcgplayer": "https://mtgjson.com/links/3ad4901f0ae440c5"}, "rarity": "rare", "rulings": [{"date": "2008-10-01", "text": "As the token is created, it checks the printed values of the creature it’s copying, as well as any copy effects that have been applied to it. It won’t copy counters on the creature, nor will it copy other effects that have changed the creature’s power, toughness, types, color, and so on."}, {"date": "2008-10-01", "text": "The copiable values of the token’s characteristics are the same as the copiable values of the characteristics of the creature it’s copying, plus haste and “At end of turn, sacrifice this permanent.” That means if something becomes a copy of the token, it will also have haste and it will also have to be sacrificed at the end of the turn."}, {"date": "2008-10-01", "text": "If the creature that caused Minion Reflector’s ability to trigger has already left the battlefield by the time the ability resolves, you can still pay {2}. If you do, you’ll still put a token onto the battlefield. That token has the copiable values of the characteristics of that nontoken creature as it last existed on the battlefield."}], "setCode": "ALA", "subtypes": [], "supertypes": [], "text": "Whenever a nontoken creature enters the battlefield under your control, you may pay {2}. If you do, create a token that's a copy of that creature, except it has haste and \"At the beginning of the end step, sacrifice this permanent.\"", "type": "Artifact", "types": ["Artifact"], "uuid": "bf059961-8133-5dd1-83e0-98ee903310d8"}