{"artist": "Craig J Spearing", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 763, "finishes": ["foil"], "flavorText": "Most mirrors show your reflection. Others show your potential.", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "213450", "cardsphereId": "50531", "mcmId": "299005", "mtgjsonV4Id": "d8b91fa0-9772-59fb-90b2-915ef164a034", "scryfallId": "9fad1d74-6149-4e3e-841b-d0569e1431e9", "scryfallIllustrationId": "0bf38e0c-8214-499d-a9fc-1de0b473e812", "scryfallOracleId": "6a84eda1-7e72-4b5a-849f-b6e177565aeb", "tcgplayerProductId": "137151"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Mirage Mirror", "number": "165s", "printings": ["AKR", "HOU", "NEC", "PHOU"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/0ea0ef9f090c0685", "tcgplayer": "https://mtgjson.com/links/4fe1bd8d7fae4180"}, "rarity": "rare", "rulings": [{"date": "2017-07-14", "text": "Once Mirage Mirror's ability resolves, it no longer has that ability."}, {"date": "2017-07-14", "text": "Mirage Mirror copies the printed values of the target permanent, plus any copy effects that have been applied to it. It won't copy counters on that permanent or effects that have changed its power, toughness, types, color, or so on. Notably, it won't copy effects that made the target permanent become a creature."}, {"date": "2017-07-14", "text": "If Mirage Mirror copies a permanent that's copying something else, it will become whatever the target is copying."}, {"date": "2017-07-14", "text": "If you activate Mirage Mirror's ability multiple times in a turn in response to itself, then each time one of those abilities resolves, it will overwrite whatever Mirage Mirror is copying. Mirage Mirror will wind up as a copy of the permanent targeted by the last ability to resolve. When the turn ends, all instances of the ability will wear off at the same time."}, {"date": "2017-07-14", "text": "If an effect begins to apply to Mirage Mirror before it becomes a copy of another permanent, that effect will continue to apply. For example, if Mirage Mirror is activated twice in response to itself targeting first Rampaging Hippo then Frilled Sandwalla, the ability it has while it's a copy of Frilled Sandwalla can be activated and its effect will continue to apply while Mirage Mirror is a copy of Rampaging Hippo."}, {"date": "2017-07-14", "text": "If Mirage Mirror becomes a creature the same turn it enters the battlefield, you can't attack with it or use any of its {T} abilities (if it gains any) unless it has haste."}, {"date": "2017-07-14", "text": "If Mirage Mirror becomes a copy of a legendary permanent you control, you'll put one of them into your graveyard."}, {"date": "2017-07-14", "text": "If Mirage Mirror becomes a copy of an Aura, it's put into its owner's graveyard unless it's somehow attached to an appropriate object or player already. If it becomes a copy of an Equipment and is attached to a creature, it'll become unattached when it becomes a non-Equipment artifact again."}], "securityStamp": "oval", "setCode": "PHOU", "subtypes": [], "supertypes": [], "text": "{2}: Mirage Mirror becomes a copy of target artifact, creature, enchantment, or land until end of turn.", "type": "Artifact", "types": ["Artifact"], "uuid": "76ba175e-94da-59cc-ae49-02727b327afc", "variations": ["028e8f97-a808-5fd6-ba22-0c191443b7c1"]}