{"artist": "Ryan Alexander Lee", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 7817, "finishes": ["nonfoil", "foil"], "flavorText": "Who you are constantly runs toward who you will be.", "foreignData": [{"flavorText": "Dein Ich nähert sich immer mehr deinem zukünftigen Ich.", "language": "German", "multiverseId": 395417, "name": "Hohn des Spiegelbilds", "text": "Verzaubert eine Kreatur\nImmer wenn die verzauberte Kreatur angreift, kannst du einen Spielstein ins Spiel bringen, der eine Kopie dieser Kreatur ist. Schicke den Spielstein am Ende des Kampfes ins Exil.", "type": "Verzauberung — Aura"}, {"flavorText": "La persona que eres avanza sin cesar hacia aquella que serás.", "language": "Spanish", "multiverseId": 397265, "name": "Burla del espejo", "text": "Encantar criatura.\nSiempre que la criatura encantada ataque, puedes poner en el campo de batalla una ficha que es una copia de esa criatura. Exilia esa ficha al final del combate.", "type": "Encantamiento — Aura"}, {"flavorText": "Votre moi présent tente constamment de rattraper votre moi futur.", "language": "French", "multiverseId": 395681, "name": "Affront miroir", "text": "Enchanter : créature\nÀ chaque fois que la créature enchantée attaque, vous pouvez mettre sur le champ de bataille un jeton qui est une copie de cette créature. Exilez ce jeton à la fin du combat.", "type": "Enchantement : aura"}, {"flavorText": "Il tuo io presente rincorre costantemente il tuo io futuro.", "language": "Italian", "multiverseId": 395945, "name": "Scherno del Riflesso", "text": "Incanta creatura\nOgniqualvolta la creatura incantata attacca, puoi mettere sul campo di battaglia una pedina che è una copia di quella creatura. Esilia quella pedina alla fine del combattimento.", "type": "Incantesimo — Aura"}, {"flavorText": "現実の自分は、なるべき自分に向かって常に走っている。", "language": "Japanese", "multiverseId": 396209, "name": "嘲る映し身", "text": "エンチャント（クリーチャー）\nエンチャントされているクリーチャーが攻撃するたび、あなたはそのクリーチャーのコピーであるトークンを１体戦場に出してもよい。戦闘終了時に、そのトークンを追放する。", "type": "エンチャント — オーラ"}, {"flavorText": "현재 너의 모습이 너의 미래를 비추는 거울이다.", "language": "Korean", "multiverseId": 396473, "name": "거울 장난", "text": "생물에게 부여\n부여된 생물이 공격할 때마다, 당신은 그 생물의 복사본 토큰을 전장에 놓을 수 있다. 전투종료에 그 토큰을 추방한다.", "type": "부여마법 — 마법진"}, {"flavorText": "A pessoa que você é corre constantemente na direção daquela que você será.", "language": "Portuguese (Brazil)", "multiverseId": 396737, "name": "Deboche do Reflexo", "text": "Encantar criatura\nToda vez que a criatura encantada ataca, você pode colocar uma ficha no campo de batalha que seja uma cópia daquela criatura. Exile aquela ficha no final do combate.", "type": "Encantamento — Aura"}, {"flavorText": "Тот, кем ты являешься, без остановки бежит к тому, кем ты станешь.", "language": "Russian", "multiverseId": 397001, "name": "Насмешка Отражения", "text": "Зачаровать существо\nКаждый раз, когда зачарованное существо атакует, вы можете положить на поле битвы одну фишку, являющуюся копией того существа. Изгоните ту фишку в конце боя.", "type": "Чары — Аура"}, {"flavorText": "现在的你终究会成为将来的模样。", "language": "Chinese Simplified", "multiverseId": 394889, "name": "模仿嘲弄", "text": "结附于生物\n每当所结附的生物攻击时，你可以将一个衍生物放进战场，此衍生物为该生物的复制品。在战斗结束时放逐该衍生物。", "type": "结界～灵气"}, {"flavorText": "現在的你終究會成為將來的模樣。", "language": "Chinese Traditional", "multiverseId": 395153, "name": "模仿嘲弄", "text": "結附於生物\n每當所結附的生物攻擊時，你可以將一個衍生物放進戰場，此衍生物為該生物的複製品。在戰鬥結束時放逐該衍生物。", "type": "結界～靈氣"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "199781", "cardKingdomId": "199357", "cardsphereId": "13837", "mcmId": "273184", "mcmMetaId": "211200", "mtgjsonV4Id": "8861a2e2-57a2-5c82-b271-e1545e903fbe", "mtgoFoilId": "56365", "mtgoId": "56364", "multiverseId": "394625", "scryfallId": "f837b050-70a6-46f0-963d-4badb37a42a1", "scryfallIllustrationId": "792bd2ba-e815-42d5-b366-276f88103752", "scryfallOracleId": "6a802318-9123-4058-8554-5023eace33f4", "tcgplayerProductId": "96514"}, "keywords": ["Enchant"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Mirror Mockery", "number": "62", "originalText": "Enchant creature\nWhenever enchanted creature attacks, you may put a token onto the battlefield that's a copy of that creature. Exile that token at end of combat.", "originalType": "Enchantment — Aura", "printings": ["DTK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/f4d77f27279f2ffa", "cardKingdomFoil": "https://mtgjson.com/links/d4668eee809b28e4", "cardmarket": "https://mtgjson.com/links/07bd8db6faf1f3ac", "tcgplayer": "https://mtgjson.com/links/038b9581e147eb1c"}, "rarity": "rare", "rulings": [{"date": "2015-02-25", "text": "Notably, the token won’t be attacking."}, {"date": "2015-02-25", "text": "If Mirror Mockery enchants a creature you don’t control, and you are the defending player, you can block with the token."}, {"date": "2015-02-25", "text": "The ability that exiles the token will trigger at end of combat no matter what happens to the original creature or to Mirror Mockery."}, {"date": "2015-02-25", "text": "If Mirror Mockery is no longer on the battlefield as its triggered ability resolves, its ability makes a copy of the creature it was enchanting when it left the battlefield. If it left the battlefield because it was no longer enchanting a legal creature, it makes a copy of the creature it was most recently enchanting before it left the battlefield."}, {"date": "2015-02-25", "text": "If Mirror Mockery’s ability creates multiple tokens (due to an effect such as the one Doubling Season creates), all such tokens will be exiled by the delayed triggered ability."}, {"date": "2015-02-25", "text": "A token that enters the battlefield as a copy of a face-down creature is a face-up colorless 2/2 creature with no name, abilities, or creature types."}, {"date": "2015-02-25", "text": "The token copies exactly what was printed on the original creature and nothing else (unless that permanent is copying something else or is a token; see below). It doesn’t copy whether that creature is tapped or untapped, whether it has any counters on it or Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, and so on."}, {"date": "2015-02-25", "text": "If the copied creature has {X} in its mana cost, X is considered to be zero."}, {"date": "2015-02-25", "text": "If the copied creature is copying something else, then the token enters the battlefield as whatever that creature copied."}, {"date": "2015-02-25", "text": "If the copied creature is a token, the token created by Mirror Mockery copies the original characteristics of that token as stated by the effect that put the token onto the battlefield."}, {"date": "2015-02-25", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when the token enters the battlefield. Any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities of the copied creature will also work."}], "securityStamp": "oval", "setCode": "DTK", "subtypes": ["Aura"], "supertypes": [], "text": "Enchant creature\nWhenever enchanted creature attacks, you may create a token that's a copy of that creature. Exile that token at end of combat.", "type": "Enchantment — Aura", "types": ["Enchantment"], "uuid": "2f7b8b4c-bf93-5cdd-af42-36ccd4f9ef8a"}