{"artist": "Kieran Yanner", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 2.0, "edhrecRank": 5471, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "cd22efe7-08ad-51ba-910e-ed5642c420df", "mtgoId": "65751", "scryfallId": "7af172c3-03ed-4586-9fb4-490a069d9d3f", "scryfallIllustrationId": "71cbf9f0-1978-4a49-a6e4-4bc728ca6818", "scryfallOracleId": "9eaeb54b-73a8-43cc-b4d8-ed8b5eb19646"}, "isOnlineOnly": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}", "manaValue": 2.0, "name": "Mirror of the Forebears", "number": "65751", "printings": ["C17", "PZ2"], "purchaseUrls": {}, "rarity": "uncommon", "rulings": [{"date": "2017-08-25", "text": "Once the second ability of Mirror of the Forebears resolves, it no longer has that ability."}, {"date": "2017-08-25", "text": "Mirror of the Forebears copies the printed values of the target creature, plus any copy effects that have been applied to it. It won’t copy counters on that creature or effects that have changed its power, toughness, types, color, or so on. Notably, it won’t copy effects that made the target creature become a creature."}, {"date": "2017-08-25", "text": "Mirror of the Forebears becomes an artifact in addition to its other types. This is a copiable value that other effects may copy."}, {"date": "2017-08-25", "text": "If Mirror of the Forebears copies a creature that’s copying something else, it will become whatever the target is copying."}, {"date": "2017-08-25", "text": "If you activate the second ability of Mirror of the Forebears multiple times in a turn in response to itself, then each time one of those abilities resolves, it will overwrite whatever Mirror of the Forebears is copying. Mirror of the Forebears will wind up as a copy of the permanent targeted by the last ability to resolve. When the turn ends, all instances of the ability will wear off at the same time."}, {"date": "2017-08-25", "text": "If an effect begins to apply to Mirror of the Forebears before it becomes a copy of another permanent, that effect will continue to apply. For example, if Mirror of the Forebears is activated twice in response to itself targeting first Spirit of the Hearth then Temur Sabertooth, the ability it has while it’s a copy of Temur Sabertooth can be activated and its effect will continue to apply while Mirror of the Forebears is a copy of Spirit of the Hearth."}, {"date": "2017-08-25", "text": "If Mirror of the Forebears becomes a creature the same turn it enters the battlefield, you can’t attack with it or use any of its {T} abilities (if it gains any) unless it has haste."}, {"date": "2017-08-25", "text": "If Mirror of the Forebears becomes a copy of a legendary creature you control, you’ll put one of them into your graveyard."}, {"date": "2017-08-25", "text": "If you somehow control a Mirror of the Forebears with no chosen creature type, its activated ability can’t be activated."}, {"date": "2017-08-25", "text": "If Mirror of the Forebears becomes a copy of a creature that itself has an ability that asks you to choose a creature type as it enters the battlefield and another ability that references “the chosen creature type,” that ability won’t have a choice made for it. You won’t use the type chosen for Mirror of the Forebears."}, {"date": "2017-08-25", "text": "You must choose an existing creature type, such as Vampire or Cat. Card types such as “artifact” can’t be chosen."}, {"date": "2017-08-25", "text": "You can’t choose multiple creature types, such as “Cat Warrior.” A Cat Warrior is both a Cat and a Warrior. It’s affected by anything that affects either type and unaffected by things that affect non-Cat or non-Warrior creatures."}], "setCode": "PZ2", "subtypes": [], "supertypes": [], "text": "As Mirror of the Forebears enters the battlefield, choose a creature type.\n{1}: Until end of turn, Mirror of the Forebears becomes a copy of target creature you control of the chosen type, except it's an artifact in addition to its other types.", "type": "Artifact", "types": ["Artifact"], "uuid": "2050d738-d2f7-556e-bc90-393d962d43e1"}