{"artist": "Cliff Childs", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "edhrecRank": 2628, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "205701", "cardsphereId": "37338", "mcmId": "287637", "mtgjsonV4Id": "98a7978f-ff92-529f-baca-0ff11321f365", "scryfallId": "e4665319-bb92-4e09-8d15-9047a5f826c1", "scryfallIllustrationId": "e22150e9-c635-40ae-b793-bc12ea8cc50b", "scryfallOracleId": "57b86d5c-3269-44bc-a838-3c5439d820d9", "tcgplayerProductId": "111254"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaValue": 0.0, "name": "Mirrorpool", "number": "174s", "printings": ["OGW", "PLIST", "POGW"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/52ccecbc3b9a7bc2", "tcgplayer": "https://mtgjson.com/links/e88cc8152e9639dc"}, "rarity": "mythic", "rulings": [{"date": "2016-01-22", "text": "Mirrorpool’s third ability can target (and copy) any instant or sorcery spell, not just one with targets."}, {"date": "2016-01-22", "text": "The copy is created on the stack, so it’s not cast. Abilities that trigger when a player casts a spell won’t trigger. The copy will then resolve like a normal spell, after players get a chance to cast spells and activate abilities."}, {"date": "2016-01-22", "text": "The copy will have the same targets as the spell it’s copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can’t choose a new legal target, then it remains unchanged (even if the current target is illegal)."}, {"date": "2016-01-22", "text": "If the copied spell is modal (that is, it says “Choose one —” or the like), the copy will have the same modes. You can’t choose different ones."}, {"date": "2016-01-22", "text": "If the copied spell has an X whose value was determined as it was cast (like Fall of the Titans does), the copy has the same value of X."}, {"date": "2016-01-22", "text": "You can’t choose to pay any additional costs for the copy. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy, too. For example, if a player sacrifices a 3/3 creature to cast Fling, and you copy it, the copy of Fling will also deal 3 damage to its target."}, {"date": "2016-01-22", "text": "For Mirrorpool’s last ability, the token copies exactly what’s printed on the original creature and nothing else (unless that creature is copying something else; see below). It doesn’t copy whether that creature is tapped or untapped, whether it has any counters on it or Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, and so on."}, {"date": "2016-01-22", "text": "For example, if a token copies a Plains that’s been affected by a spell with awaken, the token will be just a land, even though the object being copied is currently a land creature. The same is true if the land has an ability that animates it."}, {"date": "2016-01-22", "text": "If the copied creature has {X} in its mana cost, X is 0."}, {"date": "2016-01-22", "text": "If the copied creature is copying something else when the ability resolves, then the token enters the battlefield as a copy of whatever that creature is copying."}, {"date": "2016-01-22", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when the token enters the battlefield. Any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities of the copied creature will also work."}], "securityStamp": "oval", "setCode": "POGW", "subtypes": [], "supertypes": [], "text": "Mirrorpool enters the battlefield tapped.\n{T}: Add {C}.\n{2}{C}, {T}, Sacrifice Mirrorpool: Copy target instant or sorcery spell you control. You may choose new targets for the copy.\n{4}{C}, {T}, Sacrifice Mirrorpool: Create a token that's a copy of target creature you control.", "type": "Land", "types": ["Land"], "uuid": "a4c31e97-001e-546e-a5b3-cb9ca6d370b9"}