{"artist": "Volkan Baǵa", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 818, "finishes": ["foil"], "flavorText": "\"Share your darkest secret and the Mirror will reveal your soul's essence.\"\n—Ceri, royal mirrorkeeper", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "228115", "cardsphereId": "62455", "mcmId": "403399", "mtgjsonV4Id": "beed01a2-c94d-5181-bec3-69bfddfe4603", "scryfallId": "cf5f9a65-1b69-4372-9bb9-2f43560c59d1", "scryfallIllustrationId": "4e2e17d1-2f4e-432a-965f-e062e36b7976", "scryfallOracleId": "79a71fe5-38ce-4bb5-aea0-c9b9a856d397", "tcgplayerProductId": "199889"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}{U}", "manaValue": 3.0, "name": "Mirrormade", "number": "55s", "printings": ["ELD", "PELD"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/f99b63c16469cbfd", "tcgplayer": "https://mtgjson.com/links/a3d6aa2cbdd75c1c"}, "rarity": "rare", "rulings": [{"date": "2019-10-04", "text": "Mirrormade copies exactly what was printed on the original permanent (unless that permanent is copying something else or is a token; see below). It doesn't copy whether that permanent is tapped or untapped, whether it has any counters on it or any Auras attached to it, or any non-copy effects that have changed its types, color, or so on. Notably, if Mirrormade copies an artifact creature or enchantment creature that's normally not a creature (such as one affected by Bring to Life), Mirrormade won't be a creature."}, {"date": "2019-10-04", "text": "If the chosen permanent has {X} in its mana cost, X is considered to be 0."}, {"date": "2019-10-04", "text": "If the chosen permanent is copying something else (for example, if the chosen permanent is another Mirrormade), then Mirrormade enters the battlefield as whatever the chosen permanent copied."}, {"date": "2019-10-04", "text": "If the chosen permanent is a token, Mirrormade copies the original characteristics of that token as stated by the effect that created the token. Mirrormade doesn't become a token in this case."}, {"date": "2019-10-04", "text": "Any enters-the-battlefield abilities of the copied permanent will trigger when Mirrormade enters the battlefield. Any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities of the chosen permanent will also work."}, {"date": "2019-10-04", "text": "If Mirrormade somehow enters the battlefield at the same time as another artifact or enchantment, it can't become a copy of that permanent. You may choose only a permanent that's already on the battlefield."}, {"date": "2019-10-04", "text": "If Mirrormade copies an Aura this way, you choose what the Aura will enchant just before it enters the battlefield. You can't choose any permanent cards entering the battlefield at the same time as that Aura. This doesn't target the player or permanent it will enchant, so an opponent's permanent with hexproof may be chosen this way. The chosen recipient must be able to legally be enchanted by the Aura, so a player or permanent with protection from one of the Aura's qualities can't be chosen this way. If there's nothing legal for Mirrormade to enchant, it stays in its current zone (unless it's a spell, in which case it's put into its owner's graveyard)."}], "securityStamp": "oval", "setCode": "PELD", "subtypes": [], "supertypes": [], "text": "You may have Mirrormade enter the battlefield as a copy of any artifact or enchantment on the battlefield.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "db8403d1-3343-5977-9951-13ee9467b7b8", "variations": ["9f7cd66e-3158-5a6c-bcaa-6f0a59ed7140"]}