{"artist": "Min Yum", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 5.0, "edhrecRank": 5427, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "207981", "cardsphereId": "37339", "mcmId": "291267", "mtgjsonV4Id": "235a489e-e7c9-59b8-bb07-1dd64244f124", "scryfallId": "b8105382-07f1-40b6-9927-bbcd05fba190", "scryfallIllustrationId": "936c9b6e-aa09-4e6a-8916-1e79002b462c", "scryfallOracleId": "9ea14a03-c6a2-49ec-953d-4249a2c27e1d", "tcgplayerProductId": "120747"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}{R}", "manaValue": 5.0, "name": "Mirrorwing Dragon", "number": "136s", "power": "4", "printings": ["EMN", "PEMN"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/4c7604a6e80922fe", "tcgplayer": "https://mtgjson.com/links/2f9c402f67df20e2"}, "rarity": "mythic", "rulings": [{"date": "2016-07-13", "text": "The copies are only created targeting creatures that the spell’s controller controls. Copies are not created for all creatures on the battlefield, and the affected creatures may be controlled by a different player than the controller of Mirrorwing Dragon. Notably, if you cast Murder targeting your opponent’s Mirrorwing Dragon, your creatures will each get a Murder, not your opponent’s."}, {"date": "2016-07-13", "text": "The ability triggers whenever a player casts an instant or sorcery spell that targets only Mirrorwing Dragon and no other object or player."}, {"date": "2016-07-13", "text": "If a player casts an instant or sorcery spell that has multiple targets and Mirrorwing Dragon is chosen as the target in each instance, Mirrorwing Dragon’s ability will trigger. Each of the copies will similarly be targeting only one of the player’s other creatures."}, {"date": "2016-07-13", "text": "Any creature the player controls that couldn’t be targeted by the original spell (due to shroud, protection abilities, targeting restrictions, or any other reason) is just ignored by Mirrorwing Dragon’s ability. If the spell has multiple targets, a given creature must be a legal target for all of them or else a copy won’t be created for that creature."}, {"date": "2016-07-13", "text": "The player who cast the original spell controls all the copies. That player chooses the order the copies are put onto the stack. The original spell will be on the stack beneath those copies and will resolve last."}, {"date": "2016-07-13", "text": "The copies that the ability creates are created on the stack, so they’re not cast. Abilities that trigger when a player casts a spell (like Mirrorwing Dragon’s ability itself) won’t trigger."}, {"date": "2016-07-13", "text": "If the spell that’s copied is modal (that is, it says “Choose one —” or the like), the copies will have the same mode. A different mode cannot be chosen."}, {"date": "2016-07-13", "text": "If the spell that’s copied has an X whose value was determined as it was cast (like Burn from Within does), the copies have the same value of X."}, {"date": "2016-07-13", "text": "The controller of a copy can’t choose to pay any alternative or additional costs for the copy. However, effects based on any alternative or additional costs that were paid for the original spell are copied as though those same costs were paid for the copy."}], "securityStamp": "oval", "setCode": "PEMN", "subtypes": ["Dragon"], "supertypes": [], "text": "Flying\nWhenever a player casts an instant or sorcery spell that targets only Mirrorwing Dragon, that player copies that spell for each other creature they control that the spell could target. Each copy targets a different one of those creatures.", "toughness": "5", "type": "Creature — Dragon", "types": ["Creature"], "uuid": "ee6c6b5f-b6ec-5197-b6aa-7d9ed1cbeaab"}