{"artist": "Steve Prescott", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 6.0, "edhrecRank": 10582, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "19d85436-4f22-585c-8e21-c3d81cf11f78", "mtgoId": "59167", "scryfallId": "9309cfc2-7d5f-422f-8efa-d0843dbd5ca7", "scryfallIllustrationId": "2f7fe931-f0ce-4a95-be71-4d119623ad15", "scryfallOracleId": "1f0883f8-89c9-4620-9837-72a2909e0599"}, "isOnlineOnly": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U}{U}", "manaValue": 6.0, "name": "Mirror Match", "number": "29", "printings": ["C15", "PZ1"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2015-11-04", "text": "A token created by Mirror Match will be blocking the creature it’s copying even if that creature can’t be blocked or has an ability that would stop the token creature from blocking it (such as menace or protection). This is also true even if the token creature has an ability that would stop it from being declared as a blocker."}, {"date": "2015-11-04", "text": "Although the tokens enter the battlefield blocking, they were never declared as blockers. Abilities that trigger whenever a creature blocks won’t trigger. If there are any costs to have a creature block, those costs won’t apply to the tokens."}, {"date": "2015-11-04", "text": "If the tokens aren’t creatures (perhaps because the attacking creature was an animated land), they’ll enter the battlefield but they won’t be blocking. Attacking creatures that weren’t otherwise blocked will remain unblocked."}, {"date": "2015-11-04", "text": "The delayed triggered ability that exiles the tokens will trigger at end of combat no matter what happens to the original creature."}, {"date": "2015-11-04", "text": "If Mirror Match creates more than one token for any given attacking creature (due to an effect such as the one Doubling Season creates), each of those tokens will enter the battlefield blocking the creature it’s a copy of. All of those tokens will be exiled by the delayed triggered ability."}, {"date": "2015-11-04", "text": "Each token copies exactly what was printed on the original creature and nothing else (unless that permanent is copying something else or is a token; see below). It doesn’t copy whether that creature is tapped or untapped, whether it has any counters on it or Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, and so on."}, {"date": "2015-11-04", "text": "If the copied creature has {X} in its mana cost, X is 0."}, {"date": "2015-11-04", "text": "If the copied creature is copying something else, then the token enters the battlefield as whatever that creature copied."}, {"date": "2015-11-04", "text": "If the copied creature is a token, the token created by Mirror Match copies the original characteristics of that token as stated by the effect that put the token onto the battlefield."}, {"date": "2015-11-04", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when the token enters the battlefield. Any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities of the copied creature will also work."}], "securityStamp": "oval", "setCode": "PZ1", "subtypes": [], "supertypes": [], "text": "Cast this spell only during the declare blockers step.\nFor each creature attacking you or a planeswalker you control, create a token that's a copy of that creature and that's blocking that creature. Exile those tokens at end of combat.", "type": "Instant", "types": ["Instant"], "uuid": "87deb5e4-c41c-5e30-b377-27310bbae5dd"}