{"artist": "Bram Sels", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 1436, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 464260, "name": "Mirrodins Belagerung", "text": "Sowie Mirrodins Belagerung ins Spiel kommt, wähle Mirraner oder Phyrexianer.\n• Mirraner — Immer wenn du einen Artefaktzauber wirkst, erzeuge einen 1/1 farblosen Myr-Artefaktkreaturenspielstein.\n• Phyrexianer — Ziehe zu Beginn deines Endsegments eine Karte und wirf dann eine Karte ab. Falls dann fünfzehn oder mehr Artefaktkarten in deinem Friedhof sind, verliert ein Gegner deiner Wahl die Partie.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 464514, "name": "Mirrodin sitiado", "text": "En cuanto Mirrodin sitiado entre al campo de batalla, elige mirrodianos o pirexianos.\n• Mirrodianos — Siempre que lances un hechizo de artefacto, crea una ficha de criatura artefacto Myr incolora 1/1.\n• Pirexianos — Al comienzo de tu paso final, roba una carta, luego descarta una carta. Luego, si hay quince o más cartas de artefacto en tu cementerio, el oponente objetivo pierde el juego.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 464768, "name": "Mirrodin assiégé", "text": "Au moment où Mirrodin assiégé arrive sur le champ de bataille, choisissez Mirran ou Phyrexian.\n• Mirran — À chaque fois que vous lancez un sort d'artefact, créez un jeton de créature-artefact 1/1 incolore Myr.\n• Phyrexian — Au début de votre étape de fin, piochez une carte, puis défaussez-vous d'une carte. Ensuite, s'il y a au moins quinze cartes d'artefact dans votre cimetière, l'adversaire ciblé perd la partie.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 465022, "name": "Mirrodin Assediato", "text": "Mentre Mirrodin Assediato entra nel campo di battaglia, scegli Mirran o Phyrexian.\n• Mirran — Ogniqualvolta lanci una magia artefatto, crea una pedina creatura artefatto Myr 1/1 incolore.\n• Phyrexian — All'inizio della tua sottofase finale, pesca una carta, poi scarta una carta. Poi, se ci sono quindici o più carte artefatto nel tuo cimitero, un avversario bersaglio perde la partita.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 465276, "name": "ミラディン包囲戦", "text": "ミラディン包囲戦が戦場に出るに際し、ミラディン軍かファイレクシア軍を選ぶ。\n• ミラディン軍 ― あなたがアーティファクト・呪文を唱えるたび、無色の１/１のマイア・アーティファクト・クリーチャー・トークンを１体生成する。\n• ファイレクシア軍 ― あなたの終了ステップの開始時に、対戦相手１人を対象とする。あなたは、カードを１枚引き、カード１枚を捨てる。その後、あなたの墓地にアーティファクト・カードが15枚以上あるなら、そのプレイヤーはこのゲームに敗北する。", "type": "エンチャント"}, {"language": "Korean", "multiverseId": 465530, "name": "미로딘 포위전", "text": "미로딘 포위전이 전장에 들어올 때, 미로딘 또는 피렉시아를 선택한다.\n• 미로딘 — 당신이 마법물체 주문을 발동할 때마다, 1/1 무색 미르 마법물체 생물 토큰 한 개를 만든다.\n• 피렉시아 — 당신의 종료단 시작에, 카드 한 장을 뽑은 후, 카드 한 장을 버린다. 그 후 당신의 무덤에 마법물체 카드가 열다섯 장 이상 있다면, 상대를 목표로 정한다. 그 상대는 게임에서 패배한다.", "type": "부여마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 465784, "name": "Mirrodin Sitiada", "text": "Conforme Mirrodin Sitiada entrar no campo de batalha, escolha Mirraniano ou Phyrexiano.\n• Mirraniano — Toda vez que você conjurar uma mágica de artefato, crie uma ficha de criatura artefato incolor 1/1 do tipo Myr.\n• Phyrexiano — No início da sua etapa final, compre um card e depois descarte um card. Em seguida, se houver quinze ou mais cards de artefato em seu cemitério, o oponente alvo perde o jogo.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 466038, "name": "Осада Мирродина", "text": "При выходе Осады Мирродина на поле битвы выберите мирродинцев или фирексийцев.\n• Мирродинцы — Каждый раз, когда вы разыгрываете заклинание артефакта, создайте одну фишку артефакта существа 1/1 бесцветный Миэр.\n• Фирексийцы — В начале вашего заключительного шага возьмите карту, затем сбросьте карту. Затем, если на вашем кладбище есть пятнадцать или больше карт артефактов, целевой оппонент проигрывает партию.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 466292, "name": "围攻秘罗地", "text": "于围攻秘罗地进战场时，选择秘罗地或非瑞克西亚。\n•秘罗地～每当你施放神器咒语时，派出一个1/1无色秘耳衍生神器生物。\n•非瑞克西亚～在你的结束步骤开始时，抓一张牌，然后弃一张牌。然后若你坟墓场中有十五张或更多神器牌，则目标对手输掉这盘游戏。", "type": "结界"}, {"language": "Chinese Traditional", "multiverseId": 466546, "name": "圍攻秘羅地", "text": "於圍攻秘羅地進戰場時，選擇秘羅地或非瑞克西亞。\n•秘羅地～每當你施放神器咒語時，派出一個1/1無色秘耳衍生神器生物。\n•非瑞克西亞～在你的結束步驟開始時，抽一張牌，然後棄一張牌。然後如果你墳墓場中有十五張或更多神器牌，則目標對手輸掉這盤遊戲。", "type": "結界"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "225335", "cardKingdomId": "225060", "cardsphereId": "60033", "mcmId": "375411", "mcmMetaId": "271476", "mtgjsonV4Id": "24d51f85-3ccc-5632-bf22-c7180de0cfd5", "mtgoId": "72486", "multiverseId": "464006", "scryfallId": "d8423d8d-744a-4bbe-a853-8ad756451bdb", "scryfallIllustrationId": "e12abd9d-3fcf-44ec-be4f-7b4a1a483f1f", "scryfallOracleId": "674e2683-31c0-4fee-95fb-98b1201e41e7", "tcgplayerProductId": "191559"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}", "manaValue": 3.0, "name": "Mirrodin Besieged", "number": "57", "originalText": "As Mirrodin Besieged enters the battlefield, choose Mirran or Phyrexian.\n• Mirran — Whenever you cast an artifact spell, create a 1/1 colorless Myr artifact creature token.\n• Phyrexian — At the beginning of your end step, draw a card, then discard a card. Then if there are fifteen or more artifact cards in your graveyard, target opponent loses the game.", "originalType": "Enchantment", "printings": ["MH1"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/de58273b783bc74c", "cardKingdomFoil": "https://mtgjson.com/links/a2b734f61ede7cb7", "cardmarket": "https://mtgjson.com/links/0ee8e60383708ac9", "tcgplayer": "https://mtgjson.com/links/931681734f8f6ad8"}, "rarity": "rare", "rulings": [{"date": "2019-06-14", "text": "If you support the Mirrans, Mirrodin Besieged’s ability resolves before the spell that caused it to trigger. It resolves even if that spell is countered."}, {"date": "2019-06-14", "text": "If you support the Phyrexians, you must choose a target opponent as your end step begins. Whether that player loses the game is determined only as the ability resolves. This means that the card you discard may be the fifteenth artifact card that causes the target player to lose the game, but it also means that if there is no legal target opponent, you won’t draw or discard."}, {"date": "2019-06-14", "text": "If you somehow control Mirrodin Besieged and no choice was made for it, it has neither of the two triggered abilities."}, {"date": "2019-06-14", "text": "In a Two-Headed Giant game, if one player on a team loses the game, that team loses the game."}], "securityStamp": "oval", "setCode": "MH1", "subtypes": [], "supertypes": [], "text": "As Mirrodin Besieged enters the battlefield, choose Mirran or Phyrexian.\n• Mirran — Whenever you cast an artifact spell, create a 1/1 colorless Myr artifact creature token.\n• Phyrexian — At the beginning of your end step, draw a card, then discard a card. Then if there are fifteen or more artifact cards in your graveyard, target opponent loses the game.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "0ebdbff9-e756-511f-a17d-43951169d0ea"}