{"artist": "Chris Rahn", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 6.0, "edhrecRank": 12673, "finishes": ["nonfoil", "foil"], "flavorText": "\"If I had many lives, I would give them all for Bant.\"", "foreignData": [{"flavorText": "„Hätte ich viele Leben, würde ich sie alle für Bant geben.\"", "language": "German", "multiverseId": 193115, "name": "Spiegelsiegel-Feldwebel", "text": "Verursacht Trampelschaden\nFalls du zu Beginn deines Versorgungssegments eine blaue bleibende Karte kontrollierst, kannst du einen Spielstein ins Spiel bringen, der eine Kopie des Spiegelsiegel-Feldwebels ist.", "type": "Kreatur — Nashorn, Soldat"}, {"flavorText": "\"Si tuviera varias vidas, las daría todas por Bant.\"", "language": "Spanish", "multiverseId": 192245, "name": "Sargento del sello espejado", "text": "Arrolla.\nAl comienzo de tu mantenimiento, si controlas un permanente azul, puedes poner en juego una ficha que es una copia del Sargento del sello espejado.", "type": "Criatura — Soldado rinoceronte"}, {"flavorText": "« Si j'avais plusieurs vies, je les donnerais toutes pour sauver Bant. »", "language": "French", "multiverseId": 192390, "name": "Sergent au sigille-miroir", "text": "Piétinement\nAu début de votre entretien, si vous contrôlez un permanent bleu, vous pouvez mettre en jeu un jeton qui est une copie du Sergent au sigille-miroir.", "type": "Créature : rhinocéros et soldat"}, {"flavorText": "\"Anche se avessi più e più vite a disposizione, le sacrificherei tutte per Bant.\"", "language": "Italian", "multiverseId": 192535, "name": "Sergente del Sigillo a Specchio", "text": "Travolgere\nAll'inizio del tuo mantenimento, se controlli un permanente blu, puoi mettere in gioco una pedina che è una copia del Sergente del Sigillo a Specchio.", "type": "Creatura — Soldato Rinoceronte"}, {"flavorText": "「私にたくさんの命があるなら、その全てをバントのために捧げるものを。」", "language": "Japanese", "multiverseId": 192970, "name": "鏡印章の兵長", "text": "トランプル\nあなたのアップキープの開始時に、あなたが青のパーマネントをコントロールしている場合、あなたは鏡印章の兵長のコピーであるトークンを１体場に出してもよい。", "type": "クリーチャー — サイ・兵士"}, {"flavorText": "\"Se eu tivesse muitas vidas, ofereceria todas em nome de Bant.\"", "language": "Portuguese (Brazil)", "multiverseId": 193260, "name": "Sargento da Insígnia Espelhada", "text": "Atropelar\nNo início de sua manutenção, se você controlar uma permanente azul, poderá colocar uma ficha em jogo que seja uma cópia de Sargento da Insígnia Espelhada.", "type": "Criatura — Rinoceronte Soldado"}, {"flavorText": "«Если бы у меня было много жизней, я бы с радостью отдал их все за Бэнт».", "language": "Russian", "multiverseId": 192825, "name": "Сержант Зеркальных Медалей", "text": "Пробивной удар\nВ начале вашего шага поддержки, если под вашим контролем есть синий перманент, вы можете положить в игру фишку, являющуюся копией Сержанта Зеркальных Медалей.", "type": "Существо — Носорог Солдат"}, {"flavorText": "「如果我有好几条命，也会全奉献给班特。」", "language": "Chinese Simplified", "multiverseId": 192680, "name": "镜印士官", "text": "践踏\n在你的维持开始时，若你操控蓝色永久物，你可以将一个衍生物放置进场，且为镜印士官之复制。", "type": "生物～犀牛／士兵"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "126464", "cardKingdomId": "126306", "cardsphereId": "11145", "mcmId": "20655", "mcmMetaId": "10283", "mtgjsonV4Id": "93327c22-c515-5d23-9899-2b285c11b4fa", "mtgoFoilId": "31694", "mtgoId": "31693", "multiverseId": "158598", "scryfallId": "e94b3eec-7420-45fa-8750-7f01028836d3", "scryfallIllustrationId": "3a42af26-cbec-4685-9981-dfa14099018e", "scryfallOracleId": "c021c808-dc58-4386-8758-68b858badbd5", "tcgplayerProductId": "28573"}, "keywords": ["Trample"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{5}{W}", "manaValue": 6.0, "name": "Mirror-Sigil Sergeant", "number": "12", "originalText": "Trample\nAt the beginning of your upkeep, if you control a blue permanent, you may put a token into play that's a copy of Mirror-Sigil Sergeant.", "originalType": "Creature - Rhino Soldier", "power": "4", "printings": ["CON"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d43a764e480a0e2c", "cardKingdomFoil": "https://mtgjson.com/links/36000c0bf86db224", "cardmarket": "https://mtgjson.com/links/44f1ce322de00e74", "tcgplayer": "https://mtgjson.com/links/a5110176a3584dc7"}, "rarity": "mythic", "rulings": [{"date": "2009-02-01", "text": "The “intervening ‘if’ clause” means that (1) the ability won’t trigger at all unless you control a permanent of the specified color, and (2) the ability will do nothing unless you control a permanent of the specified color at the time it resolves."}, {"date": "2009-02-01", "text": "Normally, when a token is created by this ability, it will simply be a Mirror-Sigil Sergeant, so it’ll also have the token-creating ability. (See the other ruling for weird exceptions.) At the beginning of your next upkeep, if you still control the original Sergeant, the token copy, and a blue permanent, you’ll get two more token copies; the turn after that you’ll get four; then eight; and so on."}, {"date": "2009-02-01", "text": "Here’s the detailed version of what happens. As the token is created, it checks the printed values of the Mirror-Sigil Sergeant it’s copying — or, if the Mirror-Sigil Sergeant whose ability triggered was itself a token, the original characteristics of that token as stated by the effect that put it onto the battlefield — as well as any copy effects that have been applied to it. It won’t copy counters on the Mirror-Sigil Sergeant, nor will it copy other effects that have changed Mirror-Sigil Sergeant’s power, toughness, types, color, or so on."}, {"date": "2009-02-01", "text": "If Mirror-Sigil Sergeant has left the battlefield by the time its triggered ability resolves, you’ll still put a token onto the battlefield. That token has the copiable values of the characteristics of Mirror-Sigil Sergeant as it last existed on the battlefield."}, {"date": "2009-02-01", "text": "Here are the weird exceptions. If any copy effects have affected the Mirror-Sigil Sergeant whose ability triggered, they're taken into account when the token is created. For example: -- If Mirror-Sigil Sergeant's ability triggers, then Mirror-Sigil Sergeant temporarily becomes a copy of another creature before its ability resolves (due to Mirrorweave, perhaps), the token will be a copy of whatever creature the Mirror-Sigil Sergeant is currently a copy of. After the turn ends, the Mirrorweaved Mirror-Sigil Sergeant reverts back to what it was, but the token will stay as it is. -- If the copy ability of a creature (such as Cemetery Puca, perhaps) makes it become a copy of Mirror-Sigil Sergeant and gain another ability, the token created by this creature at the beginning of your upkeep will be a Mirror-Sigil Sergeant with that additional ability."}], "setCode": "CON", "subtypes": ["Rhino", "Soldier"], "supertypes": [], "text": "Trample\nAt the beginning of your upkeep, if you control a blue permanent, you may create a token that's a copy of Mirror-Sigil Sergeant.", "toughness": "4", "type": "Creature — Rhino Soldier", "types": ["Creature"], "uuid": "fbc8fc63-d6a7-57fd-9c64-12f819b41e8a"}