{"artist": "Joseph Meehan", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 5.0, "edhrecRank": 7400, "finishes": ["nonfoil"], "flavorText": "It has witnessed history's most significant events, one incarnation after another.", "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "270089", "mcmId": "686297", "mcmMetaId": "239457", "mtgjsonV4Id": "e0b45269-64fc-55fb-8538-cd98789e8312", "scryfallId": "8e7c5008-46b9-4c84-a0aa-934f73de9476", "scryfallIllustrationId": "84e0d6fa-2945-4009-9e0e-5843bff1765f", "scryfallOracleId": "5546d127-a961-4e33-bbc9-06ee14b0cb04", "tcgplayerProductId": "454675"}, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{5}", "manaValue": 5.0, "name": "Mishra's Self-Replicator", "number": "947", "originalReleaseDate": "2022-11-18", "power": "2", "printings": ["DOM", "PDOM", "PLIST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/e64cbe11361d3b22", "cardmarket": "https://mtgjson.com/links/e546e62947517dd7", "tcgplayer": "https://mtgjson.com/links/4b16aaa172d421ed"}, "rarity": "rare", "rulings": [{"date": "2018-04-27", "text": "The token will have Mishra’s Self-Replicator’s ability. It will also be able to create copies of itself."}, {"date": "2018-04-27", "text": "While resolving the triggered ability of Mishra’s Self-Replicator, you can’t pay {1} multiple times to create more than one token. However, if you control more than one Mishra’s Self-Replicator, you can pay {1} for each of their abilities."}, {"date": "2018-04-27", "text": "The token won’t copy counters or damage marked on Mishra’s Self-Replicator, nor will it copy other effects that have changed Mishra’s Self-Replicator’s power, toughness, types, color, and so on. Normally, this means the token will simply be a Mishra’s Self-Replicator, but if any copy effects have affected that Mishra’s Self-Replicator, they’re taken into account."}, {"date": "2018-04-27", "text": "If Mishra’s Self-Replicator leaves the battlefield before its triggered ability resolves, the token will still enter the battlefield as a copy of Mishra’s Self-Replicator, using Mishra’s Self-Replicator’s copiable values from when it was last on the battlefield."}, {"date": "2018-04-27", "text": "A card, spell, or permanent is historic if it has the legendary supertype, the artifact card type, or the Saga subtype. Having two of those qualities doesn’t make an object more historic than another or provide an additional bonus—an object either is historic or it isn’t."}, {"date": "2018-04-27", "text": "Some abilities trigger “whenever you cast a historic spell.” Such an ability resolves before the spell that caused it to trigger. It resolves even if that spell is countered."}, {"date": "2018-04-27", "text": "An ability that triggers “whenever you cast a historic spell” doesn’t trigger if a historic card is put onto the battlefield without being cast."}, {"date": "2018-04-27", "text": "Lands are never cast, so abilities that trigger “whenever you cast a historic spell” won’t trigger if you play a legendary land. They also won’t trigger if a card on the battlefield transforms into a legendary land, as the Ixalan and Rivals of Ixalan double-faced cards do."}], "securityStamp": "oval", "setCode": "PLIST", "subtypes": ["Assembly-Worker"], "supertypes": [], "text": "Whenever you cast a historic spell, you may pay {1}. If you do, create a token that's a copy of Mishra's Self-Replicator. (Artifacts, legendaries, and Sagas are historic.)", "toughness": "2", "type": "Artifact Creature — Assembly-Worker", "types": ["Artifact", "Creature"], "uuid": "56ba9486-9a8c-532c-abba-a84de4ae4aa7"}