{"artist": "Cosmin Podar", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B", "R"], "colors": ["B", "R"], "convertedManaCost": 5.0, "edhrecRank": 9101, "finishes": ["nonfoil", "foil"], "flavorText": "\"With the Brotherhood of Gix whispering in his ear, Mishra's drive to prove himself was slowly twisted into an insatiable hunger for power.\"\n@-The Antiquities War", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "8dc159e1-7540-5431-8eda-14e45b30a939", "mtgoId": "105778", "scryfallId": "6ddc1ee3-c021-43e3-8342-a81db57790d5", "scryfallIllustrationId": "9e408420-329a-41f3-8f30-4d634cc63800", "scryfallOracleId": "3be40d81-9be5-4f39-8ce4-920c26cf2748"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}{R}", "manaValue": 5.0, "name": "Mishra, Tamer of Mak Fawa", "number": "105778", "originalReleaseDate": "2022-11-18", "power": "4", "printings": ["BRO", "PBRO", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2022-10-14", "text": "Despite the appearance of the reminder text, the unearth abilities that Mishra, Tamer of Mak Fawa grants are activated abilities of each individual artifact card in your graveyard. They’re not activated abilities of Mishra."}, {"date": "2022-10-14", "text": "If you activate a card’s unearth ability but that card is removed from your graveyard before the ability resolves, that unearth ability will do nothing as it resolves."}, {"date": "2022-10-14", "text": "Activating a card’s unearth ability isn’t the same as casting that card. The unearth ability is put on the stack, but the card is not. Spells and abilities that interact with activated abilities (such as Defabricate’s second mode) will interact with unearth, but spells and abilities that interact with spells (such as Scatter Ray) will not."}, {"date": "2022-10-14", "text": "At the beginning of the next end step, a permanent returned to the battlefield with unearth is exiled. This is a delayed triggered ability, and it can be countered by effects such as Defabricate that counter triggered abilities. If the ability is countered, the permanent will stay on the battlefield and the delayed triggered ability won’t trigger again. However, the replacement effect will still exile the permanent if it eventually leaves the battlefield."}, {"date": "2022-10-14", "text": "Unearth grants haste to the permanent that’s returned to the battlefield (even if it’s not a creature card). However, neither of the “exile” abilities is granted to that permanent. If that permanent loses all its abilities, it will still be exiled at the beginning of the next end step, and if it would leave the battlefield, it is still exiled instead."}, {"date": "2022-10-14", "text": "If a permanent returned to the battlefield with unearth would leave the battlefield for any reason, it’s exiled instead—unless the spell or ability that’s causing the permanent to leave the battlefield is actually trying to exile it! In that case, it succeeds at exiling it. If that spell or ability later returns the card to the battlefield (as Static Net might, for example), the permanent card will return to the battlefield as a new object with no relation to its previous existence. The unearth effects will no longer apply to it."}], "setCode": "PRM", "subtypes": ["Human", "Artificer"], "supertypes": ["Legendary"], "text": "Permanents you control have \"Ward—Sacrifice a permanent.\"\nEach artifact card in your graveyard has unearth {1}{B}{R}. ({1}{B}{R}: Return the card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.)", "toughness": "4", "type": "Legendary Creature — Human Artificer", "types": ["Creature"], "uuid": "c28bbf6c-5f20-5d63-a510-f61e1a3aceff"}