{"artist": "Chris Rahn", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B", "R"], "colorIndicator": ["B", "R"], "colors": ["B", "R"], "convertedManaCost": 7.0, "edhrecRank": 22897, "faceName": "Mishra, Lost to Phyrexia", "finishes": ["foil"], "foreignData": [], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"mtgjsonV4Id": "66e8cc06-dcfb-597c-9e8f-efb747751c5d", "scryfallId": "75544351-dbb0-46d3-bddd-627c40753e8d", "scryfallIllustrationId": "42a0eb70-23c1-4064-8441-3a1d9e71f703", "scryfallOracleId": "3989308a-4c0f-493a-b38f-cb4f5019dfe7"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "meld", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaValue": 7.0, "name": "Mishra, Lost to Phyrexia", "number": "163bs", "otherFaceIds": ["f5847627-6c09-5d51-83a3-317589c9cf5c", "9d5458c4-8b58-57b1-b979-c97f5352b24b", "39f6e32c-708b-5a0c-9764-e9a0e0fb5561", "1e8d7892-0b0b-5237-9cd3-e3bcdd98d77c"], "power": "9", "printings": ["BRO", "PBRO"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2022-10-14", "text": "When a pair of cards are melded, the result is a single creature that’s represented by two cards. If the melded creature dies, both cards are put into your graveyard. As it leaves the battlefield, both of those cards are turned face up again. If the cards are put on the top or bottom of your library, you choose their relative order."}, {"date": "2022-10-14", "text": "One card in each pair of meld cards has an ability that instructs you to exile the two cards and meld them. If you control more than one object with one of those names, you select one object with that name to exile."}, {"date": "2022-10-14", "text": "When two cards are exiled and melded, they each leave the battlefield, then return together as one new object with no relation to either of the objects that left the battlefield. Counters, Auras, Equipment, and other effects that affected those two cards don’t affect the melded permanent."}, {"date": "2022-10-14", "text": "Only two cards belonging to the same meld pair can be melded. Tokens, cards that aren’t meld cards, or meld cards that don’t form a meld pair can’t be melded. If an effect instructs a player to meld cards that can’t be melded, those cards remain in exile."}, {"date": "2022-10-14", "text": "While a meld card is in any zone other than the battlefield, it has only the characteristics of its front face. The same is true while it’s on the battlefield with its front face up."}, {"date": "2022-10-14", "text": "While a melded permanent is on the battlefield, it has only the characteristics of its combined back face. Any effects that modify how the new object enters the battlefield will consider only the combined back face."}, {"date": "2022-10-14", "text": "Note that the permanent represented by the combined back faces has a color indicator."}, {"date": "2022-10-14", "text": "The mana value of a melded permanent is the sum of the mana values of its front faces. A creature that becomes a copy of a melded permanent has only the characteristics of that combined back face, and its mana value is 0."}, {"date": "2022-10-14", "text": "A player prompted to name a card may name the combined back face, and each player has the right to know that combined back face’s characteristics at all times."}, {"date": "2022-10-14", "text": "If an effect moves a melded permanent to a new zone and then affects “that card,” it affects both cards."}, {"date": "2022-10-14", "text": "In the Commander variant, a meld card’s color identity is determined only by the mana costs and mana symbols in the rules text of its front face. No symbols or rules text of the permanent it melds into are considered."}, {"date": "2022-10-14", "text": "If you activate a card’s unearth ability but that card is removed from your graveyard before the ability resolves, that unearth ability will do nothing as it resolves."}, {"date": "2022-10-14", "text": "Activating a card’s unearth ability isn’t the same as casting that card. The unearth ability is put on the stack, but the card is not. Spells and abilities that interact with activated abilities (such as Defabricate’s second mode) will interact with unearth, but spells and abilities that interact with spells (such as Scatter Ray) will not."}, {"date": "2022-10-14", "text": "At the beginning of the next end step, a permanent returned to the battlefield with unearth is exiled. This is a delayed triggered ability, and it can be countered by effects such as Defabricate that counter triggered abilities. If the ability is countered, the permanent will stay on the battlefield and the delayed triggered ability won’t trigger again. However, the replacement effect will still exile the permanent if it eventually leaves the battlefield."}, {"date": "2022-10-14", "text": "Unearth grants haste to the permanent that’s returned to the battlefield (even if it’s not a creature card). However, neither of the “exile” abilities is granted to that permanent. If that permanent loses all its abilities, it will still be exiled at the beginning of the next end step, and if it would leave the battlefield, it is still exiled instead."}, {"date": "2022-10-14", "text": "If a permanent returned to the battlefield with unearth would leave the battlefield for any reason, it’s exiled instead—unless the spell or ability that’s causing the permanent to leave the battlefield is actually trying to exile it! In that case, it succeeds at exiling it. If that spell or ability later returns the card to the battlefield (as Static Net might, for example), the permanent card will return to the battlefield as a new object with no relation to its previous existence. The unearth effects will no longer apply to it."}, {"date": "2022-10-14", "text": "Powerstone tokens are a kind of predefined token. Each one has the artifact subtype “Powerstone” and the ability “{T}: Add {C}. This mana can’t be spent to cast a nonartifact spell.”"}, {"date": "2022-10-14", "text": "You can use the {C} added by a Powerstone token on anything that isn’t a nonartifact spell. This includes paying costs to activate abilities of both artifact and nonartifact permanents, paying ward costs, and so on."}, {"date": "2022-10-14", "text": "Although all the cards in The Brothers’ War that create Powerstone tokens create a tapped Powerstone token, entering the battlefield tapped isn’t part of the token’s definition. Notably, if you create a token that is a copy of a Powerstone token, the token copy won’t enter the battlefield tapped."}], "setCode": "PBRO", "side": "b", "subtypes": ["Phyrexian", "Artificer"], "supertypes": ["Legendary"], "text": "Whenever Mishra, Lost to Phyrexia enters the battlefield or attacks, choose three —\n• Target opponent discards two cards.\n• Mishra deals 3 damage to any target.\n• Destroy target artifact or planeswalker.\n• Creatures you control gain menace and trample until end of turn.\n• Creatures you don't control get -1/-1 until end of turn.\n• Create two tapped Powerstone tokens.", "toughness": "9", "type": "Legendary Artifact Creature — Phyrexian Artificer", "types": ["Artifact", "Creature"], "uuid": "f82813e4-128b-5091-b1ec-5f309d85e152", "variations": ["b609dadc-44d5-5482-bc5c-b252ff5a0de9"]}