{"artist": "Cliff Childs", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R", "U"], "colors": ["R", "U"], "convertedManaCost": 4.0, "edhrecRank": 4768, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "e01bb00f-be9e-5d83-8ae2-6172a02c7db3", "mtgoId": "59135", "scryfallId": "f45f0149-6cc3-468e-ac6b-3450d14525e9", "scryfallIllustrationId": "f14d0383-bdf9-443b-880e-650fd30156d8", "scryfallOracleId": "f787c6cf-a4ff-487b-a7b0-0f516e68510a"}, "isOnlineOnly": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{R}", "manaValue": 4.0, "name": "Mizzix of the Izmagnus", "number": "116", "power": "2", "printings": ["2X2", "C15", "OC15", "PJ21", "PLIST", "PZ1"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2015-11-04", "text": "You finish casting a spell, including paying its costs, before Mizzix’s first ability triggers. The ability that gives you the experience counter will resolve before the spell that caused it to trigger."}, {"date": "2015-11-04", "text": "Mizzix’s last ability doesn’t change the mana cost or converted mana cost of any spell. It changes only the total cost you pay."}, {"date": "2015-11-04", "text": "Mizzix’s last ability can’t reduce the amount of colored mana you pay for a spell. It reduces only the generic component of that cost."}, {"date": "2015-11-04", "text": "If there are additional costs to cast a spell, or if the cost to cast a spell is increased by an effect (such as the one created by Thalia, Guardian of Thraben’s ability), apply those increases before applying cost reductions."}, {"date": "2015-11-04", "text": "The cost reduction can apply to alternative costs such as flashback costs."}, {"date": "2015-11-04", "text": "If an instant or sorcery spell you cast has {X} in its mana cost, you choose the value of X before calculating the spell’s total cost. For example, if that spell’s mana cost is {X}{R} and you have one experience counter, you could choose 5 as the value of X and pay {4}{R} to cast the spell."}, {"date": "2015-11-04", "text": "Experience counters are the second kind of counters a player can have, joining poison."}, {"date": "2015-11-04", "text": "All experience counters are identical, no matter how you got them. For example, the last ability will count experience counters that you got from the first ability, from another ability, from proliferating, and so on."}, {"date": "2015-11-04", "text": "Each game pack includes a card labeled “Experience” with the suggestion “Place your experience counters here.” This card isn’t required for play. It’s simply a convenient spot to put your experience counters, which can be represented with dice, glass beads, or other small items."}], "securityStamp": "oval", "setCode": "PZ1", "subtypes": ["Goblin", "Wizard"], "supertypes": ["Legendary"], "text": "Whenever you cast an instant or sorcery spell with mana value greater than the number of experience counters you have, you get an experience counter.\nInstant and sorcery spells you cast cost {1} less to cast for each experience counter you have.", "toughness": "2", "type": "Legendary Creature — Goblin Wizard", "types": ["Creature"], "uuid": "cf8de327-90b2-58d6-8f2f-e44e020469ab"}