{"artist": "John Avon", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R", "U"], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 14289, "finishes": ["nonfoil", "foil"], "flavorText": "\"What is it? Um . . . what do you *want* it to be?\"\n—Juzba, Izzet tinker", "foreignData": [{"flavorText": "„Was es ist? Hmmm ... was soll es denn sein?\" —Juzba, Izzet-Bastler", "language": "German", "multiverseId": 117770, "name": "Mizzium-Selbstumwandler", "text": "{3}: Der Mizzium-Selbstumwandler wird bis zum Ende des Zuges zu einer Kopie eines Artefakts deiner Wahl.\n{1}{U}{R}: Der Mizzium-Selbstumwandler wird zu einer Kopie eines Artefakts deiner Wahl und erhält diese Fähigkeit.", "type": "Artefakt"}, {"flavorText": "\"¿Que qué es? Veamos . . . ¿que quieres que sea?\" —Juzba, hojalatero ízzet", "language": "Spanish", "multiverseId": 118760, "name": "Transrelicario Mízzium", "text": "{3}: El Transrelicario Mízzium se convierte en una copia del artefacto objetivo hasta el final del turno.\n{1}{U}{R}: El Transrelicario Mízzium se convierte en una copia del artefacto objetivo y gana esta habilidad.", "type": "Artefacto"}, {"flavorText": "« Ce que c'est ? Euhh . . . qu'est-ce que vous voulez que ce soit ? » —Juzba, rétameur izzet", "language": "French", "multiverseId": 117935, "name": "Transrelique en mizzium", "text": "{3} : La Transrelique en mizzium devient une copie de l'artefact ciblé jusqu'à la fin du tour.\n{1}{U}{R} : La Transrelique en mizzium devient une copie de l'artefact ciblé et acquiert cette capacité.", "type": "Artefact"}, {"flavorText": "\"Cos'è? Um. . . cosa vorresti che fosse?\" —Juzba, riparatore Izzet", "language": "Italian", "multiverseId": 118100, "name": "Transreliquia Mizzium", "text": "{3}: La Transreliquia Mizzium diventa una copia di un artefatto bersaglio fino alla fine del turno.\n{1}{U}{R}: La Transreliquia Mizzium diventa una copia di un artefatto bersaglio e guadagna questa abilità.", "type": "Artefatto"}, {"flavorText": "それが何だと？ ふむ … … お前はこれを何にしたいと思っておるのだ？ ――イゼットの修繕士、ジュズバ", "language": "Japanese", "multiverseId": 118265, "name": "ミジウムの変成体", "text": "{3}：アーティファクト１つを対象とする。ミジウムの変成体はターン終了時までそれのコピーになる。\n{1}{U}{R}：アーティファクト１つを対象とする。ミジウムの変成体はそれのコピーになり、この能力を得る。", "type": "アーティファクト"}, {"flavorText": "\"O que é? Bem . . . o que você quer que seja?\" —Juzba, latoeiro Izzet", "language": "Portuguese (Brazil)", "multiverseId": 118430, "name": "Transrelicário Mizzium", "text": "{3}: Transrelicário Mizzium torna-se uma cópia do artefato alvo até o final do turno.\n{1}{U}{R}: Transrelicário Mizzium torna-se uma cópia do artefato alvo e recebe esta habilidade.", "type": "Artefato"}, {"flavorText": "\"Это что такое? Ээээ . . . а чем вы хотите это видеть?\" — Юзба, мыслитель Иззетов", "language": "Russian", "multiverseId": 118595, "name": "Миззиумный трансреликварий", "text": "{3}: Миззиумный трансреликварий становится копией целевого артефакта до конца хода.\n{1}{U}{R}: Миззиумный трансреликварий становится копией целевого артефакта и получает эту способность.", "type": "Артефакт"}, {"flavorText": "「这是什么？ 嗯. . . 你要他是什么？」 ～伊捷修补匠裘巴", "language": "Chinese Simplified", "multiverseId": 117605, "name": "米捷摹态械", "text": "{3}：米捷摹态械成为目标神器的复制直到回合结束。\n{1}{U}{R}：米捷摹态械成为目标神器的复制，且获得此异能。", "type": "神器"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "119825", "cardKingdomId": "119660", "cardsphereId": "19656", "mcmId": "13213", "mcmMetaId": "7793", "mtgjsonV4Id": "990d5e6c-002a-50d3-8945-a07d18e05b71", "mtgoFoilId": "23892", "mtgoId": "23891", "multiverseId": "107096", "scryfallId": "d29c3bf9-d37c-4e0a-ac44-15d47770ed44", "scryfallIllustrationId": "7c026201-618b-48e3-914d-da19aa50e474", "scryfallOracleId": "a1f73421-cda5-4029-9bcf-f2baee179e5c", "tcgplayerProductId": "13731"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Mizzium Transreliquat", "number": "153", "originalText": "{3}: Mizzium Transreliquat becomes a copy of target artifact until end of turn.\n{1}{U}{R}: Mizzium Transreliquat becomes a copy of target artifact and gains this ability.", "originalType": "Artifact", "printings": ["GPT"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/515e4f64942c2697", "cardKingdomFoil": "https://mtgjson.com/links/fdff0b015ca3c321", "cardmarket": "https://mtgjson.com/links/59cfc1675cba3bbd", "tcgplayer": "https://mtgjson.com/links/51ab1f5d86c16fe1"}, "rarity": "rare", "rulings": [{"date": "2006-02-01", "text": "If you use the first ability, Mizzium Transreliquat loses both of its copy abilities until the effect wears off (unless it copied itself or another Mizzium Transreliquat). When it wears off, Mizzium Transreliquat loses all abilities it gained this way and goes back to being what it was before."}, {"date": "2006-02-01", "text": "The second ability doesn’t wear off. If you use it, Mizzium Transreliquat becomes a copy of target artifact permanently and gains the {1}{U}{R} ability. It no longer has the {3} ability (unless it copied itself or another Mizzium Transreliquat)."}, {"date": "2006-02-01", "text": "An artifact’s “copiable values” are those printed on it, as modified by other copy effects, plus any values set by “enters the battlefield as” abilities. Counters and other effects aren’t copied. For example, if you copy a Gruul War Plow that’s been turned into an artifact creature, the result will be just an artifact."}, {"date": "2006-02-01", "text": "The results of all copy effects are copied. If Mizzium Transreliquat is copied, the copy will be a Mizzium Transreliquat after applying all copy effects currently affecting the original. For example, Copy Artifact copying a Transreliquat that’s using its first ability to copy an Izzet Signet will be an Izzet Signet. The effect won’t wear off at the end of the turn; rather, the Copy Artifact will remain an Izzet Signet for the rest of the game."}, {"date": "2006-02-01", "text": "If you use Mizzium Transreliquat’s abilities multiple times in a turn in response to one another, then each time one of those abilities resolves, it will overwrite whatever the permanent was copying. The Transreliquat will wind up as a copy of the artifact targeted by the last ability to resolve. When the turn ends, all instances of its first ability will wear off at the same time. If one of those was the last copy ability to resolve, the Transreliquat will become what it was before those abilities resolved. This will likely be either the original Mizzium Transreliquat or whatever it copied with the last instance of its second ability to resolve."}], "setCode": "GPT", "subtypes": [], "supertypes": [], "text": "{3}: Mizzium Transreliquat becomes a copy of target artifact until end of turn.\n{1}{U}{R}: Mizzium Transreliquat becomes a copy of target artifact, except it has this ability.", "type": "Artifact", "types": ["Artifact"], "uuid": "1d03635b-50b1-597c-9ff9-7d8f4f8c0250", "watermark": "izzet"}