{"artist": "Clint Cearley", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "U"], "colors": ["B", "U"], "convertedManaCost": 3.0, "edhrecRank": 2368, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 453198, "name": "Verrat der Erinnerung", "text": "Schicke alle Karten aus allen Friedhöfen deiner Gegner ins Exil. Du kannst jene Karten in diesem Zug wirken und um sie zu wirken, kannst du Mana ausgeben, als wäre es Mana eines beliebigen Typs. Zu Beginn des nächsten Endsegments und falls sich noch mindestens eine jener Karten im Exil befindet, bringe sie auf die Friedhöfe ihrer Besitzer zurück.\nSchicke den Verrat der Erinnerung ins Exil.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 453457, "name": "Traición mnemónica", "text": "Exilia todas las cartas de los cementerios de todos los oponentes. Puedes lanzar esas cartas este turno, y puedes gastar maná como si fuera maná de cualquier tipo para lanzar esos hechizos. Al comienzo de tu próximo paso final, si cualesquiera de esas cartas permanecen exiliadas, regrésalas a los cementerios de sus propietarios.\nExilia la Traición mnemónica.", "type": "Conjuro"}, {"language": "French", "multiverseId": 453716, "name": "Trahison mnémonique", "text": "Exilez toutes les cartes des cimetières de tous les adversaires. Vous pouvez lancer ces cartes ce tour-ci, et vous pouvez dépenser du mana comme s'il s'agissait de mana de n'importe quel type pour lancer ces sorts. Au début de la prochaine étape de fin, si certaines de ces cartes restent exilées, renvoyez-les dans les cimetières de leurs propriétaires.\nExilez la Trahison mnémonique.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 453975, "name": "Tradimento Mnemonico", "text": "Esilia tutte le carte dai cimiteri di tutti gli avversari. Puoi lanciare quelle carte in questo turno e puoi spendere mana come se fosse mana di qualsiasi tipo per lanciarle. All'inizio della prossima sottofase finale, se un qualsiasi numero di quelle carte è ancora in esilio, rimettile nei cimiteri dei rispettivi proprietari.\nEsilia il Tradimento Mnemonico.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 454234, "name": "記憶の裏切り", "text": "対戦相手すべての墓地からカードをすべて追放する。このターン、あなたはそれらのカードを唱えてもよい。あなたは、それらの呪文を唱えるために、任意のマナを望むタイプのマナであるかのように支払ってもよい。次の終了ステップの開始時に、それらのカードのうちいくつかが追放されたままになっていた場合、それらをオーナーの墓地に戻す。\n記憶の裏切りを追放する。", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 454493, "name": "학습된 배신", "text": "모든 상대의 무덤에 있는 모든 카드를 추방한다. 당신은 이번 턴에 그 카드들을 발동할 수 있으며, 그 주문들의 발동비용을 지불하기 위한 마나는 당신이 원하는 유형의 마나인 것처럼 사용할 수 있다. 다음 종료단 시작에, 그 카드들이 여전히 추방된 채로 남아있다면, 그 카드들을 소유자의 무덤으로 되돌린다.\n학습된 배신을 추방한다.", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 454752, "name": "Traição Mnemônica", "text": "Exile todos os cards dos cemitérios de todos os oponentes. Você pode conjurar aqueles cards neste turno e gastar mana como se fosse de qualquer tipo para conjurar aquelas mágicas. No início da próxima etapa final, se quaisquer daqueles cards permanecerem exilados, devolva-os aos cemitérios de seus donos.\nExile Traição Mnemônica.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 455011, "name": "Предательство Памяти", "text": "Изгоните все карты из кладбищ всех оппонентов. Вы можете разыгрывать находящиеся среди них карты заклинаний в этом ходу, и вы можете тратить ману на разыгрывание тех заклинаний, как если бы это была мана любого типа. В начале следующего заключительного шага, если какие-то из тех карт остаются в изгнании, верните их на кладбища их владельцев.\nИзгоните Предательство Памяти.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 455270, "name": "记忆叛离", "text": "放逐所有对手坟墓场中的所有牌。本回合中，你可以施放这些牌，且你可以将法术力视同任意种类的法术力来支付施放这些咒语的费用。在下一个结束步骤开始时，若仍有被持续放逐的这类牌，则将它们移回其拥有者的坟墓场。\n放逐记忆叛离。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 455529, "name": "記憶叛離", "text": "放逐所有對手墳墓場中的所有牌。本回合中，你可以施放這些牌，且你可以將魔法力視同任意種類的魔法力來支付施放這些咒語的費用。在下一個結束步驟開始時，若仍有被持續放逐的這類牌，則將它們移回其擁有者的墳墓場。\n放逐記憶叛離。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "221881", "cardKingdomId": "221614", "cardsphereId": "57149", "mcmId": "364224", "mcmMetaId": "265428", "mtgArenaId": "68650", "mtgjsonV4Id": "061a7529-c7d1-57fd-862a-e3135dad94e8", "mtgoId": "69751", "multiverseId": "452939", "scryfallId": "a5cf45aa-ed34-4add-a2ec-fc11f8c15ffa", "scryfallIllustrationId": "5d055be3-b7ae-44a3-ad5f-df59a80fecf4", "scryfallOracleId": "aa41e0e6-d04e-48d6-8450-02b972dd0bb1", "tcgplayerProductId": "176839"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}{B}", "manaValue": 3.0, "name": "Mnemonic Betrayal", "number": "189", "originalText": "Exile all cards from all opponents' graveyards. You may cast those cards this turn, and you may spend mana as though it were mana of any type to cast those spells. At the beginning of the next end step, if any of those cards remain exiled, return them to their owners' graveyards.\nExile Mnemonic Betrayal.", "originalType": "Sorcery", "printings": ["GRN"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1fe4e1f491c84423", "cardKingdomFoil": "https://mtgjson.com/links/bcd406b772992d53", "cardmarket": "https://mtgjson.com/links/81f2d7e70bd14952", "tcgplayer": "https://mtgjson.com/links/0bf10c11949af688"}, "rarity": "mythic", "rulings": [{"date": "2018-10-05", "text": "You can’t play land cards exiled this way."}, {"date": "2018-10-05", "text": "Mnemonic Betrayal doesn’t change when you can cast the exiled cards. For example, if you exile a sorcery card, you can cast it only during your main phase when the stack is empty."}, {"date": "2018-10-05", "text": "If you cast a spell this way and that card is exiled, it’s considered a new object. Mnemonic Betrayal no longer allows you to cast it. It remains in exile when Mnemonic Betrayal’s delayed triggered ability resolves."}, {"date": "2018-10-05", "text": "Only the cards that remain in exile are returned to their owners’ graveyards. For example, a permanent spell cast this way will remain on the battlefield."}, {"date": "2018-10-05", "text": "In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. If you leave the game, any spells or permanents you control from Mnemonic Betrayal’s effect are exiled. If you leave the game before Mnemonic Betrayal’s delayed triggered ability resolves, the cards remain exiled."}], "securityStamp": "oval", "setCode": "GRN", "subtypes": [], "supertypes": [], "text": "Exile all opponents' graveyards. You may cast spells from among those cards this turn, and you may spend mana as though it were mana of any type to cast those spells. At the beginning of the next end step, if any of those cards remain exiled, return them to their owners' graveyards.\nExile Mnemonic Betrayal.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "1799b591-fd2a-5241-8fc0-7dc2d0364a0b", "watermark": "dimir"}