{"artist": "Igor Grechanyi", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 7308, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 567260, "name": "Spottende Doppelgängerin", "text": "Aufblitzen\nDu kannst die Spottende Doppelgängerin als Kopie einer Kreatur, die ein Gegner kontrolliert, ins Spiel kommen lassen, außer dass sie „Andere Kreaturen mit demselben Namen wie diese Kreatur sind angestachelt\" hat. (Sie greifen in jedem Kampf an, falls möglich, und greifen einen anderen Spieler als dich an, falls möglich.)", "type": "Kreatur — Gestaltwandler"}, {"language": "Spanish", "multiverseId": 567288, "name": "Doppelganger burlona", "text": "Destello.\nPuedes hacer que la Doppelganger burlona entre al campo de batalla como una copia de una criatura que controla un oponente, excepto que tiene \"Las otras criaturas con el mismo nombre que esta criatura están incitadas\". (Atacan cada combate si pueden y atacan a un jugador que no seas tú si pueden.)", "type": "Criatura — Metamorfo"}, {"language": "French", "multiverseId": 567316, "name": "Doppelganger moqueur", "text": "Flash\nVous pouvez faire que le Doppelganger moqueur arrive sur le champ de bataille comme une copie d'une créature qu'un adversaire contrôle, excepté qu'il a « Les autres créatures ayant le même nom que cette créature sont incitées. » (Elles attaquent à chaque combat si possible et attaquent un joueur autre que vous si possible.)", "type": "Créature : changeforme"}, {"language": "Italian", "multiverseId": 567344, "name": "Doppelganger Beffarda", "text": "Lampo\nPuoi far entrare nel campo di battaglia la Doppelganger Beffarda come una copia di una creatura controllata da un avversario, tranne che ha \"Le altre creature con lo stesso nome di questa creatura sono spronate\". (Attaccano in ogni combattimento un giocatore diverso da te, se possono farlo.)", "type": "Creatura — Polimorfo"}, {"language": "Japanese", "multiverseId": 567372, "name": "嘲笑するドッペルゲンガー", "text": "瞬速\n嘲笑するドッペルゲンガーを、これが「このクリーチャーと同じ名前を持ちこれでないすべてのクリーチャーは使嗾される。」を持つことを除き、対戦相手がコントロールしているクリーチャー１体のコピーとして戦場に出してもよい。（それらは各戦闘で、可能なら攻撃し、可能ならあなたでないプレイヤーを攻撃する。）", "type": "クリーチャー — 多相の戦士"}, {"language": "Portuguese (Brazil)", "multiverseId": 567400, "name": "Dúplice Debochada", "text": "Lampejo\nVocê pode fazer com que Dúplice Debochada entre no campo de batalha como cópia de uma criatura que um oponente controla, exceto por ter \"As outras criaturas com o mesmo nome que esta criatura são atiçadas\". (Elas atacam a cada combate se estiverem aptas e atacam um jogador que não seja você se estiverem aptas.)", "type": "Criatura — Metamorfo"}, {"language": "Russian", "multiverseId": 567428, "name": "Ехидный Доппельгангер", "text": "Миг\nВы можете заставить Ехидного Доппельгангера выйти на поле битвы в качестве копии существа под контролем оппонента, но при этом он имеет способность «Другие существа с таким же именем, как у этого существа, разъярены». (Они атакуют в каждом бою, если могут, и атакуют не вас, а другого игрока, если могут.)", "type": "Существо — Имитатор"}, {"language": "Chinese Simplified", "multiverseId": 567456, "name": "嘲讽变形怪", "text": "闪现\n你可以使嘲讽变形怪当成任一由对手操控之生物的复制品来进入战场，但它具有「与此生物同名的其他生物均已煽惑。」（它们每次战斗若能攻击，则必须攻击，且若能攻击除你以外的牌手，则必须如此作。）", "type": "生物 ～变形兽"}, {"language": "Chinese Traditional", "multiverseId": 567484, "name": "嘲諷變形怪", "text": "閃現\n你可以使嘲諷變形怪當成任一由對手操控之生物的複製品來進入戰場，但它具有「與此生物同名的其他生物均已煽惑。」（它們每次戰鬥若能攻擊，則必須攻擊，且若能攻擊除你以外的玩家，則必須如此作。）", "type": "生物 ～變形獸"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "261964", "mcmId": "661293", "mtgjsonV4Id": "9d548d05-a340-5dfd-94e2-7a31cb19c3a0", "multiverseId": "567232", "scryfallId": "6c5f81d8-b189-4f6e-872f-a237bb872aa9", "scryfallIllustrationId": "a271ae95-0bc6-4d6b-8dce-cafa8eb637bc", "scryfallOracleId": "3b8eb602-01e8-432e-8dfc-8fdb62c3aa43", "tcgplayerProductId": "273534"}, "keywords": ["Flash", "Goad"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Mocking Doppelganger", "number": "667", "originalText": "Flash\nYou may have Mocking Doppelganger enter the battlefield as a copy of a creature an opponent controls, except it has \"Other creatures with the same name as this creature are goaded.\" (They attack each combat if able and attack a player other than you if able.)", "originalType": "Creature — Shapeshifter", "power": "0", "printings": ["CLB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/42e8729f21673a3b", "tcgplayer": "https://mtgjson.com/links/d974db6305ddf608"}, "rarity": "rare", "rulings": [{"date": "2022-06-10", "text": "Except for the added ability, Mocking Doppelganger copies exactly what was printed on the original creature (unless that creature is copying something else or is a token; see below). It doesn't copy whether that creature is tapped or untapped, whether it has any counters on it, whether it has any Auras and/or Equipment attached to it, or any non-copy effects that changed its power, toughness, types, color, and so on."}, {"date": "2022-06-10", "text": "If the chosen creature has {X} in its mana cost, X is considered to be 0."}, {"date": "2022-06-10", "text": "If the chosen creature is a token, Mocking Doppelganger copies the original characteristics of that token, except for the added ability. Mocking Doppelganger doesn't become a token in this case."}, {"date": "2022-06-10", "text": "If the chosen creature is copying something else, Mocking Doppelganger will use the copiable values of the chosen creature. In most cases, it will be a copy of whatever the chosen creature is copying."}, {"date": "2022-06-10", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when Mocking Doppelganger enters the battlefield. Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities of the chosen creature will also work."}, {"date": "2022-06-10", "text": "If Mocking Doppelganger somehow enters the battlefield at the same time as another creature an opponent controls, it can't become a copy of that creature. You may choose only a creature that's already on the battlefield."}], "securityStamp": "oval", "setCode": "CLB", "subtypes": ["Shapeshifter"], "supertypes": [], "text": "Flash\nYou may have Mocking Doppelganger enter the battlefield as a copy of a creature an opponent controls, except it has \"Other creatures with the same name as this creature are goaded.\" (They attack each combat if able and attack a player other than you if able.)", "toughness": "0", "type": "Creature — Shapeshifter", "types": ["Creature"], "uuid": "f2ea2b35-2781-52e6-a376-b5aa88d926aa", "variations": ["289f657d-c064-5f6f-a614-49f26781148a"]}