{"artist": "Zoltan Boros", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 1467, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 545880, "name": "Geschmolzene Echos", "text": "Sowie die Geschmolzenen Echos ins Spiel kommen, bestimme einen Kreaturentyp.\nImmer wenn eine Nichtspielsteinkreatur des bestimmten Typs unter deiner Kontrolle ins Spiel kommt, erzeuge einen Spielstein, der eine Kopie jener Kreatur ist. Der Spielstein erhält Eile. Schicke ihn zu Beginn des nächsten Endsegments ins Exil.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 545992, "name": "Ecos fundidos", "text": "En cuanto los Ecos fundidos entren al campo de batalla, elige un tipo de criatura.\nSiempre que una criatura que no sea ficha del tipo elegido entre al campo de batalla bajo tu control, crea una ficha que es una copia de esa criatura. Esa ficha gana la habilidad de prisa. Exíliala al comienzo del próximo paso final.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 546104, "name": "Échos en fusion", "text": "Au moment où les Échos en fusion arrivent sur le champ de bataille, choisissez un type de créature.\nÀ chaque fois qu'une créature non-jeton du type choisi arrive sur le champ de bataille sous votre contrôle, créez un jeton qui est une copie de cette créature. Ce jeton acquiert la célérité. Exilez-le au début de la prochaine étape de fin.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 546216, "name": "Echi Incandescenti", "text": "Mentre gli Echi Incandescenti entrano nel campo di battaglia, scegli un tipo di creatura.\nOgniqualvolta una creatura non pedina del tipo scelto entra nel campo di battaglia sotto il tuo controllo, crea una pedina che è una copia di quella creatura. Quella pedina ha rapidità. Esiliala all'inizio della prossima sottofase finale.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 546328, "name": "溶鉄の残響", "text": "溶鉄の残響が戦場に出るに際し、クリーチャー・タイプ１つを選ぶ。\nその選ばれたタイプでありトークンでないクリーチャー１体があなたのコントロール下で戦場に出るたび、そのクリーチャーのコピーであるトークン１体を生成する。そのトークンは速攻を得る。次の終了ステップの開始時に、それを追放する。", "type": "エンチャント"}, {"language": "Portuguese (Brazil)", "multiverseId": 546440, "name": "Ecos Derretidos", "text": "Conforme Ecos Derretidos entrar no campo de batalha, escolha um tipo de criatura.\nToda vez que uma criatura não ficha do tipo escolhido entrar no campo de batalha sob seu controle, crie uma ficha que seja uma cópia daquela criatura. Aquela ficha ganha ímpeto. Exile-a no início da próxima etapa final.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 546552, "name": "Расплавленное Эхо", "text": "При выходе Расплавленного Эха на поле битвы выберите тип существа.\nКаждый раз, когда не являющееся фишкой существо выбранного типа выходит на поле битвы под вашим контролем, создайте одну фишку, являющуюся копией того существа. Та фишка получает Ускорение. Изгоните ее в начале следующего заключительного шага.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 546664, "name": "热熔应和", "text": "于热熔应和进战场时，选择一种生物类别。\n每当一个非衍生物的该类别生物在你的操控下进战场时，派出一个衍生物，此衍生物为该生物的复制品。该衍生物获得敏捷异能。在下一个结束步骤开始时，将它放逐。", "type": "结界"}, {"language": "Chinese Traditional", "multiverseId": 546776, "name": "熱熔應和", "text": "於熱熔應和進戰場時，選擇一種生物類別。\n每當一個非衍生物的該類別生物在你的操控下進戰場時，派出一個衍生物，此衍生物為該生物的複製品。該衍生物獲得敏捷異能。在下一個結束步驟開始時，將它放逐。", "type": "結界"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "253467", "cardsphereId": "82487", "mcmId": "584128", "mtgjsonV4Id": "5082411c-42aa-5907-b194-343f3d13aba3", "multiverseId": "545768", "scryfallId": "461d9f1c-53a4-48a6-bafb-0e70099f276c", "scryfallIllustrationId": "664e0e77-0a71-4c95-9777-5bd953eafb3c", "scryfallOracleId": "26486a42-4dc6-472b-9a9b-3c3ca78cc3b5", "tcgplayerProductId": "254425"}, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}{R}", "manaValue": 4.0, "name": "Molten Echoes", "number": "148", "originalText": "As Molten Echoes enters the battlefield, choose a creature type.\nWhenever a nontoken creature of the chosen type enters the battlefield under your control, create a token that's a copy of that creature. That token gains haste. Exile it at the beginning of the next end step.", "originalType": "Enchantment", "printings": ["C20", "VOC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/dafdfd9859272319", "tcgplayer": "https://mtgjson.com/links/9a3f0e68f5bb9a40"}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "You must choose an existing creature type, such as Human or Warrior. Card types such as artifact and supertypes such as legendary can't be chosen."}, {"date": "2020-04-17", "text": "If the nontoken creature leaves the battlefield before Molten Echoes's triggered ability resolves, the token that's created uses the creature's last known information from before it left."}, {"date": "2020-04-17", "text": "The token copies exactly what is printed on the creature and nothing else (unless that creature is copying something else; see below). It doesn't copy whether that creature is tapped or untapped, whether it has any counters on it or Auras and/or Equipment attached to it, or any non-copy effects that changed its power, toughness, types, color, and so on."}, {"date": "2020-04-17", "text": "If the copied creature is copying something else, the token enters the battlefield as whatever that creature is copying."}, {"date": "2020-04-17", "text": "If the copied creature has {X} in its mana cost, X is 0."}, {"date": "2020-04-17", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when the token enters the battlefield. Any “As [this creature] enters the battlefield” or “[This creature] enters the battlefield with” abilities of the copied creature will also work."}], "securityStamp": "oval", "setCode": "VOC", "subtypes": [], "supertypes": [], "text": "As Molten Echoes enters the battlefield, choose a creature type.\nWhenever a nontoken creature of the chosen type enters the battlefield under your control, create a token that's a copy of that creature. That token gains haste. Exile it at the beginning of the next end step.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "34905399-1dbc-5c80-83a1-656945ee27b4"}