{"artist": "Christopher Rush", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 5.0, "edhrecRank": 15399, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 85957, "name": "Mondring-Spiegel", "text": "Immer wenn du eine Karte ziehst, entferne die oberste Karte deiner Bibliothek verdeckt ganz aus dem Spiel.\nDu kannst zu Beginn deines Versorgungssegments die Karten auf deiner Hand verdeckt ganz aus dem Spiel entfernen. Falls du dies tust, nimm alle anderen Karten, die du besitzt und die mit dem Mondring-Spiegel ganz aus dem Spiel entfernt wurden, auf deine Hand.", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 87185, "name": "Espejo de anillo lunar", "text": "Siempre que robes una carta, remueve del juego la carta de la parte superior de tu biblioteca boca abajo.\nAl comienzo de tu mantenimiento, puedes remover del juego tu mano boca abajo. Si lo haces, pon en tu mano todas las otras cartas que poseas removidas del juego con el Espejo de anillo lunar.", "type": "Artefacto"}, {"language": "French", "multiverseId": 85650, "name": "Miroir anneau de lune", "text": "À chaque fois que vous piochez une carte, retirez de la partie la carte du dessus de votre bibliothèque, face cachée.\nAu début de votre entretien, vous pouvez retirer de la partie votre main, face cachée. Si vous faites ainsi, mettez toutes les autres cartes retirées de la partie avec le Miroir anneau de lune dans votre main.", "type": "Artefact"}, {"language": "Italian", "multiverseId": 86264, "name": "Specchio dell'Anello Lunare", "text": "Ogniqualvolta peschi una carta, rimuovi dal gioco a faccia in giù la prima carta del tuo grimorio.\nAll'inizio del tuo mantenimento, puoi rimuovere dal gioco a faccia in giù la tua mano. Se lo fai, prendi in mano tutte le altre carte che possiedi rimosse dal gioco con lo Specchio dell'Anello Lunare.", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 86571, "name": "月輪の鏡", "text": "あなたがカードを引くたび、あなたのライブラリーの一番上のカードを１枚、裏向きにゲームから取り除く。\nあなたのアップキープの開始時に、あなたは自分の手札を裏向きにゲームから取り除いてもよい。そうした場合、それらのカード以外で月輪の鏡によって取り除かれたあなたがオーナーであるすべてのカードをあなたの手札に加える。", "type": "アーティファクト"}, {"language": "Portuguese (Brazil)", "multiverseId": 86878, "name": "Espelho de Aro Lunar", "text": "Toda vez que comprar um card, remova de jogo com a face para baixo o card do topo de seu grimório.\nNo início de sua manutenção, você pode remover de jogo a sua mão com a face voltada para baixo. Se o fizer, coloque em sua mão todos os seus outros cards que foram removidos de jogo por Espelho de Aro Lunar.", "type": "Artefato"}, {"language": "Chinese Simplified", "multiverseId": 85343, "name": "月轮明镜", "text": "每当你抓一张牌时，将你牌库顶牌面朝下地移出对战。\n在你的维持开始时，你可以将你的手牌面朝下地移出对战。若你如此作，将由你拥有，且以月轮明镜移出对战的所有其它牌置于你手上。", "type": "神器"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "112214", "cardKingdomId": "111915", "cardsphereId": "8084", "mcmId": "12114", "mcmMetaId": "7083", "mtgjsonV4Id": "b5f35943-b310-57f2-9360-ca2fb7bb7507", "mtgoFoilId": "21104", "mtgoId": "21103", "multiverseId": "73907", "scryfallId": "8d36357a-97f6-4b2f-abbf-43f84c29609d", "scryfallIllustrationId": "fd7969f0-517f-4fec-8f98-5154919aee33", "scryfallOracleId": "037c49e4-39ca-4d72-8f5c-9adc5687601b", "tcgplayerProductId": "12095"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{5}", "manaValue": 5.0, "name": "Moonring Mirror", "number": "262", "originalText": "Whenever you draw a card, remove the top card of your library from the game face down.\nAt the beginning of your upkeep, you may remove your hand from the game face down. If you do, put into your hand all other cards you own removed from the game with Moonring Mirror.", "originalType": "Artifact", "printings": ["CHK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/0468bfab35e3d14d", "cardKingdomFoil": "https://mtgjson.com/links/2ba32390d0f4f8b3", "cardmarket": "https://mtgjson.com/links/e3f18e8ee4a2f03e", "tcgplayer": "https://mtgjson.com/links/45fbfd1c3315b003"}, "rarity": "rare", "rulings": [{"date": "2004-12-01", "text": "Note that Moonring Mirror’s first ability is not a replacement effect."}, {"date": "2004-12-01", "text": "If you choose to use Moonring Mirror’s second ability, you return all the cards you own exiled by both of its abilities, but not any of the cards you just exiled from your hand."}], "setCode": "CHK", "subtypes": [], "supertypes": [], "text": "Whenever you draw a card, exile the top card of your library face down.\nAt the beginning of your upkeep, you may exile all cards from your hand face down. If you do, put all other cards you own exiled with Moonring Mirror into your hand.", "type": "Artifact", "types": ["Artifact"], "uuid": "b9de8479-b8ac-5fde-a3d0-f1053b08034a"}