{"artist": "Poison Project", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G", "U"], "colors": ["G", "U"], "convertedManaCost": 5.0, "edhrecRank": 3224, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "cf82cc8c-787c-5968-bcca-fdee44daf62b", "mtgoId": "88392", "scryfallId": "2a8564ad-5cae-4158-af79-46c1595a38b1", "scryfallIllustrationId": "793ef515-6e56-4cce-b059-c90eec78cd92", "scryfallOracleId": "78699161-fc14-4a44-8a15-0f7c08be0343"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Changeling"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}{U}{U}", "manaValue": 5.0, "name": "Moritte of the Frost", "number": "88392", "originalReleaseDate": "2021-02-28", "power": "0", "printings": ["KHM", "PRM"], "purchaseUrls": {}, "rarity": "uncommon", "rulings": [{"date": "2021-02-05", "text": "Moritte copies exactly what was printed on the original permanent (unless that permanent is copying something else or is a token; see below). It doesn’t copy whether that permanent is tapped or untapped, whether it has any counters on it, whether it has any Auras and/or Equipment attached to it, or any non-copy effects that changed its power, toughness, types, color, and so on."}, {"date": "2021-02-05", "text": "If Moritte copies a nonlegendary permanent, you’ll control two permanents with same name, but only one of them (Moritte) will be legendary. You won’t put any of them into their owner’s graveyard."}, {"date": "2021-02-05", "text": "If the chosen permanent has {X} in its mana cost, X is considered to be 0."}, {"date": "2021-02-05", "text": "If the chosen permanent is a token, Moritte copies the original characteristics of that token as stated by the effect that created the token. Moritte doesn’t become a token in this case."}, {"date": "2021-02-05", "text": "If the chosen permanent is copying something else, Moritte will use the copiable values of the chosen permanent. In most cases, it will be a copy of whatever the chosen permanent is copying. If it’s copying a permanent or card with {X} in its mana cost, X is 0."}, {"date": "2021-02-05", "text": "Any enters-the-battlefield abilities of the copied permanent will trigger when Moritte enters the battlefield. Any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities of the chosen permanent will also work."}, {"date": "2021-02-05", "text": "If Moritte copies a creature, it enters with two +1/+1 counters on it, plus any counters that will be put on it by abilities it copied or abilities of other objects."}, {"date": "2021-02-05", "text": "If the copied permanent is affected by a type-changing effect, Moritte may enter the battlefield with different permanent types than the copied permanent currently has. Use the characteristics of Moritte as it enters the battlefield, not of the copied permanent, to determine whether it enters with an additional counter on it. Notably, if Moritte copies a permanent that’s normally not a creature but has been made a creature by another effect, Moritte enters as a noncreature permanent that doesn’t get +1/+1 counters or have changeling."}, {"date": "2021-02-05", "text": "If Moritte somehow enters the battlefield at the same time as another permanent, it can’t become a copy of that permanent. You may choose only a permanent that’s already on the battlefield."}, {"date": "2021-02-05", "text": "Snow is a supertype, not a card type. It has no rules meaning or function by itself, but spells and abilities may refer to it."}, {"date": "2021-02-05", "text": "The {S} symbol is a generic mana symbol. It represents a cost that can be paid by one mana that was produced by a snow source. That mana can be any color or colorless."}, {"date": "2021-02-05", "text": "Snow isn’t a type of mana. If an effect says you may spend mana as though it were any type, you can’t pay for {S} using mana that wasn’t produced by a snow source."}, {"date": "2021-02-05", "text": "Some cards have additional effects for each {S} spent to cast them. You can cast these spells even if you don’t spend any snow mana to cast them; their additional effects simply won’t do anything."}, {"date": "2021-02-05", "text": "The Kaldheim set doesn’t have any cards with mana costs that include {S}, but some previous sets do. If an effect says such a spell costs {1} less to cast, that reduction doesn’t apply to any {S} costs. This is also true for activated abilities that include {S} in their activation costs and effects that reduce those costs."}, {"date": "2021-02-05", "text": "Changeling is a characteristic-defining ability. It functions in all zones, not only while a card that has it is on the battlefield."}, {"date": "2021-02-05", "text": "The subtype Shapeshifter that appears on the type line is mostly there to reinforce the flavor. A creature card with changeling is just as much an Elf, a Dwarf, a Sliver, a Goat, a Coward, and a Zombie as it is a Shapeshifter."}, {"date": "2021-02-05", "text": "If an effect causes a creature with changeling to become a new creature type, it will be only that new creature type. It will still have changeling; the effect making it all creature types will simply be overwritten."}, {"date": "2021-02-05", "text": "If an effect causes a creature with changeling to lose all abilities, it will remain all creature types, even though it will no longer have changeling. This is because changeling applies before the effect that removes it."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Shapeshifter"], "supertypes": ["Legendary", "Snow"], "text": "Changeling (This card is every creature type.)\nYou may have Moritte of the Frost enter the battlefield as a copy of a permanent you control, except it's legendary and snow in addition to its other types and, if it's a creature, it enters with two additional +1/+1 counters on it and has changeling.", "toughness": "0", "type": "Legendary Snow Creature — Shapeshifter", "types": ["Creature"], "uuid": "f3aafaac-a0c5-5993-9ef5-52388d8a231e"}