{"artist": "Brandon Kitkouski", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210213", "mcmId": "294398", "mtgjsonV4Id": "312092c9-96b9-59f5-8255-0faef594b344", "multiverseId": "423584", "scryfallId": "54327aa2-319d-4430-a266-03cadeed6146", "scryfallIllustrationId": "4fa395ac-c03a-414e-999d-331594553dd2", "scryfallOracleId": "302e4ac2-522b-4a0a-850a-d856639ea2a4", "tcgplayerProductId": "125605"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Morphic Tide", "number": "3", "originalText": "When you encounter Morphic Tide, each player shuffles all permanents he or she owns into his or her library, then reveals that many cards from the top of his or her library. Each player puts all artifact, creature, land, and planeswalker cards revealed this way onto the battlefield, then does the same for enchantment cards, then puts all cards revealed this way that weren't put onto the battlefield on the bottom of his or her library in any order. (Then planeswalk away from this phenomenon.)", "originalType": "Phenomenon", "printings": ["OPC2", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/4954759610762d5d", "tcgplayer": "https://mtgjson.com/links/b5d0490deb49a874"}, "rarity": "common", "rulings": [{"date": "2012-06-01", "text": "This ability is very similar to that of Warp World, but note that planeswalkers are put onto the battlefield."}, {"date": "2012-06-01", "text": "Taking it slowly, here's what happens when Morphic Tide's ability resolves: 1) Each player counts the number of permanents they own. 2) Each player shuffles those permanents into their library. 3) Each player reveals cards from the top of their library equal to the number that player counted. 4) Each player puts all artifact, creature, land, and planeswalker cards revealed this way onto the battlefield. All of these cards enter the battlefield at the same time. 5) Each player puts all enchantment cards revealed this way onto the battlefield. An Aura put onto the battlefield this way can enchant an artifact, creature, land, or planeswalker that was already put onto the battlefield, but can't enchant an enchantment that's being put onto the battlefield at the same time as it. If multiple players have Auras to put onto the battlefield, the player whose turn it is announces what their Auras will enchant, then each other player in turn order does the same, then all enchantments (both Auras and non-Auras) enter the battlefield at the same time. 6) Each player puts all of their other revealed cards (instants, sorceries, and Auras that can't enchant anything) on the bottom of their library in any order."}, {"date": "2012-06-01", "text": "Cards such as Sakashima’s Student that can enter the battlefield as a copy of another permanent won’t be able to enter the battlefield as a copy of a permanent that’s entering the battlefield at the same time."}, {"date": "2012-06-01", "text": "After all permanents are put onto the battlefield and you planeswalk away from Morphic Tide, any abilities that triggered from those permanents entering the battlefield, from the previous generation of permanents leaving the battlefield, and from the new plane or phenomenon will be put onto the stack. You’ll put all of your triggered abilities on the stack in any order, then each other player in turn order will do the same. (The last ability put on the stack will be the first one that resolves.)"}, {"date": "2012-06-01", "text": "The permanents will enter the battlefield while Morphic Tide is face up. This means the game won’t be on any plane when determining if any abilities trigger because those permanents entered the battlefield, for example. However, you’ll planeswalk away from Morphic Tide before any such abilities are put on the stack. After you turn the next card of the planar deck face up, any abilities that triggered during the resolution of Morphic Tide (including any abilities that triggered because you encountered another phenomenon or planeswalked to the next plane) will be put on the stack. The planar controller will put their abilities on the stack in any order, followed by each other player in turn order. The last ability put on the stack will be the first one to resolve."}, {"date": "2012-06-01", "text": "Token permanents a player owns will count toward the number of cards that player reveals. They’ll be shuffled into that player’s library and subsequently cease to exist. A token’s owner is the player under whose control it first entered the battlefield."}], "setCode": "OPCA", "subtypes": [], "supertypes": [], "text": "When you encounter Morphic Tide, each player shuffles all permanents they own into their library, then reveals that many cards from the top of their library. Each player puts all artifact, creature, land, and planeswalker cards revealed this way onto the battlefield, then does the same for enchantment cards, then puts all cards revealed this way that weren't put onto the battlefield on the bottom of their library in any order. (Then planeswalk away from this phenomenon.)", "type": "Phenomenon", "types": ["Phenomenon"], "uuid": "4d8e3f9e-a22a-543b-a092-62d5f609910c"}