{"artist": "Ryan Pancoast", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "edhrecRank": 3219, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 464429, "name": "Tantalitmox", "text": "Aussetzen 3 — {0} (Statt diese Karte aus deiner Hand zu wirken, bezahle {0}, schicke sie ins Exil und lege drei Zeitmarken auf sie. Entferne zu Beginn deines Versorgungssegments eine Zeitmarke von ihr. Wenn die letzte Zeitmarke entfernt wird, wirke die Karte, ohne ihre Manakosten zu bezahlen.)\n{T}: Erzeuge ein Mana einer beliebigen Farbe.", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 464683, "name": "Mox de tantalita", "text": "Suspender 3 — {0}. (En lugar de lanzar esta carta de tu mano, paga {0} y exíliala con tres contadores de tiempo sobre ella. Al comienzo de tu mantenimiento, remueve un contador de tiempo. Cuando remuevas el último, lánzala sin pagar su coste de maná.)\n{T}: Agrega un maná de cualquier color.", "type": "Artefacto"}, {"language": "French", "multiverseId": 464937, "name": "Mox de tantalite", "text": "Suspension 3 — {0} (Plutôt que lancer cette carte depuis votre main, payez {0} et exilez-la avec trois marqueurs « temps » sur elle. Au début de votre entretien, retirez un marqueur « temps ». Quand le dernier marqueur est retiré, lancez cette carte sans payer son coût de mana.)\n{T} : Ajoutez un mana de la couleur de votre choix.", "type": "Artefact"}, {"language": "Italian", "multiverseId": 465191, "name": "Mox di Tantalite", "text": "Sospendere 3—{0} (Invece di lanciare questa carta dalla tua mano, paga {0} ed esiliala con tre segnalini tempo su di essa. All'inizio del tuo mantenimento, rimuovi un segnalino tempo. Quando l'ultimo viene rimosso, lancia la carta senza pagare il suo costo di mana.)\n{T}: Aggiungi un mana di un qualsiasi colore.", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 465445, "name": "モックス・タンタライト", "text": "待機３―{0}（あなたはあなたの手札からこのカードを唱えるのではなく、{0}を支払い、時間カウンターを３個置いた状態でこれを追放してもよい。あなたのアップキープの開始時に、時間カウンターを１個取り除く。最後の１個を取り除いたとき、これをこれのマナ・コストを支払うことなく唱える。）\n{T}：好きな色１色のマナ１点を加える。", "type": "アーティファクト"}, {"language": "Korean", "multiverseId": 465699, "name": "목스 탄탈라이트", "text": "유예 3—{0} (이 카드를 손에서 발동하는 대신에 {0}를 지불하여 시간 카운터 세 개를 올려놓고 추방한다. 당신의 유지단 시작에, 시간 카운터 한 개를 제거한다. 마지막 카운터가 제거됐을 때, 마나 비용을 지불하지 않고 이 카드를 발동한다.)\n{T}: 원하는 색의 마나 한 개를 추가한다.", "type": "마법물체"}, {"language": "Portuguese (Brazil)", "multiverseId": 465953, "name": "Mox de Tantalita", "text": "Suspender 3—{0} (Em vez de conjurar este card da sua mão, você pode pagar {0} e exilá-lo com três marcadores temporais. No início de sua manutenção, remova um marcador temporal. Quando o último for removido, conjure-o sem pagar seu custo de mana.)\n{T}: Adicione um mana de qualquer cor.", "type": "Artefato"}, {"language": "Russian", "multiverseId": 466207, "name": "Танталитовый Мокс", "text": "Отсрочка 3 — {0} (Вместо того, чтобы разыграть эту карту из вашей руки, заплатите {0} и изгоните ее с тремя временными жетонами на ней. В начале вашего шага поддержки удалите один временной жетон. Когда удален последний временной жетон, разыграйте эту карту без уплаты ее мана-стоимости.)\n{T}: добавьте одну ману любого цвета.", "type": "Артефакт"}, {"language": "Chinese Simplified", "multiverseId": 466461, "name": "钽铁玛珂", "text": "延缓3～{0}（除了从你手上施放此牌，你能支付{0}并将它放逐，且上面有三个计时指示物。在你的维持开始时，从其上移去一个计时指示物。当移去最后一个时，则施放它且不需支付其法术力费用。）\n{T}：加一点任意颜色的法术力。", "type": "神器"}, {"language": "Chinese Traditional", "multiverseId": 466715, "name": "鉭鐵瑪珂", "text": "延緩3～{0}（除了從你手上施放此牌，你能支付{0}並將它放逐，且上面有三個計時指示物。在你的維持開始時，從其上移去一個計時指示物。當移去最後一個時，則施放它且不需支付其魔法力費用。）\n{T}：加一點任意顏色的魔法力。", "type": "神器"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "225246", "cardKingdomId": "224942", "cardsphereId": "60045", "mcmId": "374694", "mcmMetaId": "271032", "mtgjsonV4Id": "05714bde-856b-5ea0-bec9-31e3e6cbc38f", "mtgoId": "72824", "multiverseId": "464175", "scryfallId": "dcd05b01-dc73-4dd2-970a-32ec6e153c86", "scryfallIllustrationId": "149a70f9-06f9-42a8-b8ec-0407a3313eb2", "scryfallOracleId": "cc319819-68f9-4c1e-8d60-25a5e3e50669", "tcgplayerProductId": "190981"}, "keywords": ["Suspend"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "vintage": "Legal"}, "manaValue": 0.0, "name": "Mox Tantalite", "number": "226", "originalText": "Suspend 3—{0} (Rather than cast this card from your hand, pay {0} and exile it with three time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost.)\n{T}: Add one mana of any color.", "originalType": "Artifact", "printings": ["MH1"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/8a33e0903b380544", "cardKingdomFoil": "https://mtgjson.com/links/023ff2557240d038", "cardmarket": "https://mtgjson.com/links/64585e99d2811603", "tcgplayer": "https://mtgjson.com/links/d1e17fb64817c0f8"}, "rarity": "mythic", "rulings": [{"date": "2021-06-18", "text": "Suspend is a keyword that represents three abilities. The first is a static ability that allows you to exile the card from your hand with the specified number of time counters (the number before the dash) on it by paying its suspend cost (listed after the dash). The second is a triggered ability that removes a time counter from the suspended card at the beginning of each of your upkeeps. The third is a triggered ability that causes you to cast the card when the last time counter is removed. If you cast a creature spell this way, it gains haste until you lose control of that creature (or, in rare cases, you lose control of the creature spell while it’s on the stack)."}, {"date": "2021-06-18", "text": "You can exile a card in your hand using suspend any time you could cast that card. Consider its card type, any effects that modify when you could cast it (such as flash) and any other effects that stop you from casting it (such as from Meddling Mage’s ability) to determine if and when you can do this. Whether you could actually complete all steps in casting the card is irrelevant. For example, you can exile a card with suspend that has no mana cost or that requires a target even if no legal targets are available at that time."}, {"date": "2021-06-18", "text": "Cards exiled with suspend are exiled face up."}, {"date": "2021-06-18", "text": "Exiling a card with suspend isn’t casting that card. This action doesn’t use the stack and can’t be responded to."}, {"date": "2021-06-18", "text": "If the spell requires any targets, those targets are chosen when the spell is finally cast, not when it’s exiled."}, {"date": "2021-06-18", "text": "If an effect refers to a “suspended card,” that means a card that (1) has suspend, (2) is in exile, and (3) has one or more time counters on it."}, {"date": "2021-06-18", "text": "If the first triggered ability of suspend (the one that removes time counters) is countered, no time counter is removed. The ability will trigger again at the beginning of the card’s owner’s next upkeep."}, {"date": "2021-06-18", "text": "When the last time counter is removed, the second triggered ability of suspend (the one that lets you cast the card) triggers. It doesn’t matter why the last time counter was removed or what effect removed it."}, {"date": "2021-06-18", "text": "If the second triggered ability is countered, the card can’t be cast. It remains exiled with no time counters on it, and it’s no longer suspended."}, {"date": "2021-06-18", "text": "As the second triggered ability resolves, you must cast the card if able. You must do so even if it requires targets and the only legal targets are ones that you really don’t want to target. Timing permissions based on the card’s type are ignored."}, {"date": "2021-06-18", "text": "If you can’t cast the card, perhaps because there are no legal targets available, it remains exiled with no time counters on it, and it’s no longer suspended."}, {"date": "2021-06-18", "text": "If you cast a card “without paying its mana cost,” such as with suspend, you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those if you want to cast the card."}, {"date": "2021-06-18", "text": "You are never forced to activate mana abilities to pay costs, so if there is a mandatory additional mana cost (such as from Thalia, Guardian of Thraben), you can decline to activate mana abilities to pay for it and hence fail to cast the suspended card, leaving it in exile."}, {"date": "2021-06-18", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2021-06-18", "text": "The mana value of a spell cast without paying its mana cost is determined by its mana cost, even though that cost wasn’t paid."}, {"date": "2021-06-18", "text": "A card with no mana cost can’t be cast normally; you’ll need a way to cast it for an alternative cost or without paying its mana cost, such as by suspending it."}, {"date": "2021-06-18", "text": "If a card with no mana cost is given an alternative cost equal to its mana cost (by Snapcaster Mage, for example), that cost cannot be paid and the card cannot be cast this way."}], "securityStamp": "oval", "setCode": "MH1", "subtypes": [], "supertypes": [], "text": "Suspend 3—{0} (Rather than cast this card from your hand, pay {0} and exile it with three time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost.)\n{T}: Add one mana of any color.", "type": "Artifact", "types": ["Artifact"], "uuid": "f5d3dba6-3294-5966-85b2-3a9469050829"}