{"artist": "Jung Park", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210267", "mcmId": "294448", "mtgjsonV4Id": "63332c93-685b-5c74-931b-c9343bbe1e16", "multiverseId": "423634", "scryfallId": "46daa243-7c4e-4b0c-8ec2-e70cba8e72c3", "scryfallIllustrationId": "8e53e26f-9988-4659-8a47-0e0297ee3d26", "scryfallOracleId": "07cc253d-e23c-450c-bfaf-5cb6a3a588ce", "tcgplayerProductId": "125607"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Murasa", "number": "53", "originalText": "Whenever a nontoken creature enters the battlefield, its controller may search his or her library for a basic land card, put it onto the battlefield tapped, then shuffle his or her library.\nWhenever you roll {Chaos}, target land becomes a 4/4 creature that's still a land.", "originalType": "Plane — Zendikar", "printings": ["OHOP", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/bfa8b3d2b1868d64", "tcgplayer": "https://mtgjson.com/links/6afff79fc58c8043"}, "rarity": "common", "rulings": [{"date": "2009-10-01", "text": "A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"}, {"date": "2009-10-01", "text": "A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."}, {"date": "2009-10-01", "text": "The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."}, {"date": "2009-10-01", "text": "If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}, {"date": "2009-10-01", "text": "The effect of the chaos ability has no duration. The affected land will remain a creature until the end of the game, it leaves the battlefield, or some other effect changes its card types, whichever comes first. It doesn’t matter whether Murasa remains the face-up plane card."}], "setCode": "OPCA", "subtypes": ["Zendikar"], "supertypes": [], "text": "Whenever a nontoken creature enters the battlefield, its controller may search their library for a basic land card, put it onto the battlefield tapped, then shuffle.\nWhenever you roll {CHAOS}, target land becomes a 4/4 creature that's still a land.", "type": "Plane — Zendikar", "types": ["Plane"], "uuid": "98ed1511-7286-5e6b-8518-a17fb1ad96e5"}