{"artist": "Chase Stone", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": [], "convertedManaCost": 4.0, "edhrecRank": 16789, "finishes": ["nonfoil", "foil"], "flavorText": "If you can see it, it's too late.", "foreignData": [{"flavorText": "Wenn du ihn sehen kannst, ist es bereits zu spät.", "language": "German", "multiverseId": 402862, "name": "Trübnisschreiter", "text": "Fahl (Diese Karte hat keine Farbe.)Wenn der Trübnisschreiter ins Spiel kommt, kannst du eine Karte, die ein Gegner besitzt, aus dem Exil auf den Friedhof dieses Spielers legen. Falls du dies tust, bringe eine Kreatur deiner Wahl auf die Hand ihres Besitzers zurück.", "type": "Kreatur — Eldrazi, Verwerter"}, {"flavorText": "Si puedes verlo, ya es demasiado tarde.", "language": "Spanish", "multiverseId": 404955, "name": "Zancudo lóbrego", "text": "Vacío. (Esta carta no tiene ningún color.)Cuando el Zancudo lóbrego entre al campo de batalla, puedes poner en el cementerio de un oponente una carta del exilio de la que ese jugador sea propietario. Si lo haces, regresa la criatura objetivo a la mano de su propietario.", "type": "Criatura — Metabolizador eldrazi"}, {"flavorText": "Si vous le voyez, c'est qu'il est déjà trop tard.", "language": "French", "multiverseId": 403161, "name": "Enjambeur des eaux troubles", "text": "Carence (Cette carte n'a pas de couleur.)Quand l'Enjambeur des eaux troubles arrive sur le champ de bataille, vous pouvez mettre une carte qu'un adversaire possède dans le cimetière de ce joueur depuis l'exil. Si vous faites ainsi, renvoyez une créature ciblée dans la main de son propriétaire.", "type": "Créature : eldrazi et convertisseur"}, {"flavorText": "Se riesci a vederlo, è troppo tardi.", "language": "Italian", "multiverseId": 403460, "name": "Ramingo dell'Oscurità", "text": "Vacuità (Questa carta non ha colore.)Quando il Ramingo dell'Oscurità entra nel campo di battaglia, puoi mettere una carta posseduta da un avversario dall'esilio nel cimitero di quel giocatore. Se lo fai, fai tornare una creatura bersaglio in mano al suo proprietario.", "type": "Creatura — Metabolizzatore Eldrazi"}, {"flavorText": "それが見えた時は、すでに手遅れだ。", "language": "Japanese", "multiverseId": 403759, "name": "霞の徘徊者", "text": "欠色（このカードは無色である。）霞の徘徊者が戦場に出たとき、クリーチャー１体を対象とする。あなたは追放領域から対戦相手がオーナーであるカードを１枚そのプレイヤーの墓地に置いてもよい。そうしたなら、そのクリーチャーをオーナーの手札に戻す。", "type": "クリーチャー — エルドラージ・昇華者"}, {"flavorText": "그것을 볼 수 있다면, 이미 늦은 것이다.", "language": "Korean", "multiverseId": 404058, "name": "수렁 보행자", "text": "결여 (이 카드는 무색이다.)수렁 보행자가 전장에 들어올 때, 당신은 추방 영역에서 상대가 소유한 카드 한 장을 그 플레이어의 무덤에 넣을 수 있다. 그렇게 한다면, 생물을 목표로 정한다. 그 생물을 소유자의 손으로 되돌린다.", "type": "생물 — 엘드라지 처리자"}, {"flavorText": "Se você consegue vê-lo, é tarde demais.", "language": "Portuguese (Brazil)", "multiverseId": 404357, "name": "Andarilho do Lodo", "text": "Desprovido (Este card não tem cor.)Quando Andarilho do Lodo entra no campo de batalha, você pode colocar um card exilado de um oponente no cemitério dele. Se fizer isso, devolva a criatura alvo para a mão de seu dono.", "type": "Criatura — Eldrazi Processador"}, {"flavorText": "Если вы ее видите, то уже слишком поздно.", "language": "Russian", "multiverseId": 404656, "name": "Мракомерка", "text": "Лишение (У этой карты нет цвета.)Когда Мракомерка выходит на поле битвы, вы можете положить принадлежащую оппоненту карту из изгнания на кладбище того игрока. Если вы это делаете, верните целевое существо в руку владельца.", "type": "Существо — Эльдрази Переработчик"}, {"flavorText": "你能看到它时，就已经太迟了。", "language": "Chinese Simplified", "multiverseId": 402264, "name": "暗沼神行体", "text": "虚色（此牌没有颜色。）当暗沼神行体进战场时，你可以将一张由对手拥有的牌从放逐区置入该玩家的坟墓场。若你如此作，则将目标生物移回其拥有者手上。", "type": "生物～奥札奇／噬体"}, {"flavorText": "你能看到它時，就已經太遲了。", "language": "Chinese Traditional", "multiverseId": 402563, "name": "暗沼神行體", "text": "虛色（此牌沒有顏色。）當暗沼神行體進戰場時，你可以將一張由對手擁有的牌從放逐區置入該玩家的墳墓場。若你如此作，則將目標生物移回其擁有者手上。", "type": "生物～奧札奇／噬體"}], "frameEffects": ["devoid"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "202956", "cardKingdomId": "202615", "cardsphereId": "6680", "mcmId": "284780", "mcmMetaId": "220723", "mtgjsonV4Id": "dbc0d5ea-9e50-5d47-8fda-5b743609d13b", "mtgoFoilId": "58548", "mtgoId": "58547", "multiverseId": "401965", "scryfallId": "130849ba-3893-490d-bfb0-51c76e53cf62", "scryfallIllustrationId": "c6460afc-e338-4ef3-bb82-6902c14aae2e", "scryfallOracleId": "386b8c1f-620c-4561-a9d5-d01e2eb5f12a", "tcgplayerProductId": "105374"}, "keywords": ["Devoid"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Murk Strider", "number": "62", "originalText": "Devoid (This card has no color.)\nWhen Murk Strider enters the battlefield, you may put a card an opponent owns from exile into that player's graveyard. If you do, return target creature to its owner's hand.", "originalType": "Creature — Eldrazi Processor", "power": "3", "printings": ["BFZ"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/c62fe3cefbcdbd89", "cardKingdomFoil": "https://mtgjson.com/links/5f68a969c7f2ab5a", "cardmarket": "https://mtgjson.com/links/189c2d6d46619294", "tcgplayer": "https://mtgjson.com/links/4337d9ba60f2baff"}, "rarity": "common", "rulings": [{"date": "2015-08-25", "text": "If the target creature becomes illegal before the triggered ability resolves, it won’t resolve and none of its effects will happen. You won’t “process” a card in exile."}, {"date": "2015-08-25", "text": "Players can respond to the triggered ability, but once it starts resolving and you decide whether to put a card from exile into the player’s graveyard, it’s too late for anyone to respond."}, {"date": "2015-08-25", "text": "Cards with devoid use frames that are variations of the transparent frame traditionally used for Eldrazi. The top part of the card features some color over a background based on the texture of the hedrons that once imprisoned the Eldrazi. This coloration is intended to aid deckbuilding and game play."}, {"date": "2015-08-25", "text": "A card with devoid is just colorless. It’s not colorless and the colors of mana in its mana cost."}, {"date": "2015-08-25", "text": "Other cards and abilities can give a card with devoid color. If that happens, it’s just the new color, not that color and colorless."}, {"date": "2015-08-25", "text": "Devoid works in all zones, not just on the battlefield."}, {"date": "2015-08-25", "text": "If a card loses devoid, it will still be colorless. This is because effects that change an object’s color (like the one created by devoid) are considered before the object loses devoid."}, {"date": "2015-08-25", "text": "If a spell or ability requires that you put more than one exiled card into the graveyard, you may choose cards owned by different opponents. Each card chosen will be put into its owner’s graveyard."}, {"date": "2015-08-25", "text": "If a replacement effect will cause cards that would be put into a graveyard from anywhere to be exiled instead (such as the one created by Anafenza, the Foremost), you can still put an exiled card into its opponent’s graveyard. The card becomes a new object and remains in exile. In this situation, you can’t use a single exiled card if required to put more than one exiled card into the graveyard. Conversely, you could use the same card in this situation if two separate spells or abilities each required you to put a single exiled card into its owner’s graveyard."}, {"date": "2015-08-25", "text": "You can’t look at face-down cards in exile unless an effect allows you to."}, {"date": "2015-08-25", "text": "Face-down cards in exile are grouped using two criteria: what caused them to be exiled face down and when they were exiled face down. If you want to put a face-down card in exile into its owner’s graveyard, you must first choose one of these groups and then choose a card from within that group at random. For example, say an artifact causes your opponent to exile their hand of three cards face down. Then on a later turn, that artifact causes your opponent to exile another two cards face down. If you use Wasteland Strangler to put one of those cards into their graveyard, you would pick the first or second pile and put a card chosen at random from that pile into the graveyard."}], "setCode": "BFZ", "subtypes": ["Eldrazi", "Processor"], "supertypes": [], "text": "Devoid (This card has no color.)\nWhen Murk Strider enters the battlefield, you may put a card an opponent owns from exile into that player's graveyard. If you do, return target creature to its owner's hand.", "toughness": "2", "type": "Creature — Eldrazi Processor", "types": ["Creature"], "uuid": "9294216c-a013-5a6c-940d-f225529856da"}