{"artist": "Ryan Pancoast", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 8976, "finishes": ["nonfoil", "foil"], "flavorText": "\"We will ingest and remake this world in our image, not unlike some admirable designs I have seen here.\"\n—Vorinclex, Voice of Hunger", "foreignData": [{"flavorText": "„Wir werden diese Welt einnehmen und nach unserem Bild neu erschaffen, wobei wir sicher einige bewundernswerte Details übernehmen werden.\" —Vorinclex, Stimme des Hungers", "language": "German", "multiverseId": 231226, "name": "Myr-Verbreiter", "text": "{3}, {T}: Bringe einen Spielstein ins Spiel, der eine Kopie des Myr-Verbreiters ist.", "type": "Artefaktkreatur — Myr"}, {"flavorText": "\"Devoraremos y reconstruiremos este mundo a nuestra imagen, no tan distinta de algunos diseños admirables que he visto aquí.\" —Vórinclex, la Voz del Ansia", "language": "Spanish", "multiverseId": 232720, "name": "Propagador myr", "text": "{3}, {T}: Pon en el campo de batalla una ficha que es una copia del Propagador myr.", "type": "Criatura artefacto — Myr"}, {"flavorText": "« Nous absorberons et nous recréerons ce monde à notre image, un peu comme ces créatures admirables que j'ai vues ici. » —Vorinclex, Voix de la Voracité", "language": "French", "multiverseId": 231973, "name": "Propagateur myr", "text": "{3}, {T} : Mettez sur le champ de bataille un jeton qui est une copie du Propagateur myr.", "type": "Créature-artefact : myr"}, {"flavorText": "\"Ingeriremo e rifaremo questo mondo a nostra immagine, non molto diverso da alcuni modelli ammirevoli che ho visto qui.\" —Vorinclex, Voce della Fame", "language": "Italian", "multiverseId": 232969, "name": "Myr Propagatore", "text": "{3}, {T}: Metti sul campo di battaglia una pedina che è una copia del Myr Propagatore.", "type": "Creatura Artefatto — Myr"}, {"flavorText": "「この賞賛に値する設計図にあるように、我々はこの世界を想像通りに作り直すのだ。」 ――飢餓の声、ヴォリンクレックス", "language": "Japanese", "multiverseId": 231724, "name": "マイアの繁殖者", "text": "{3}, {T}：マイアの繁殖者のコピーであるトークンを１体戦場に出す。", "type": "アーティファクト・クリーチャー — マイア"}, {"flavorText": "\"Nós vamos ingerir e refazer este mundo à nossa imagem, não muito diferente dos admiráveis designs que pude ver aqui.\" — Vorinclex, Voz da Fome", "language": "Portuguese (Brazil)", "multiverseId": 230977, "name": "Propagador Myr", "text": "{3}, {T}: Coloque no campo de batalha uma ficha que seja uma cópia de Propagador Myr.", "type": "Criatura Artefato — Myr"}, {"flavorText": "«Мы поглотим и переделаем этот мир по нашему образу, чем-то похожему на отдельные достойные образцы, которые мне здесь уже повстречались». — Воринклекс, Голос Голода", "language": "Russian", "multiverseId": 231475, "name": "Распространитель Миэров", "text": "{3}, {T}: положите на поле битвы фишку, являющуюся копией Распространителя Миэров.", "type": "Артефактное Существо — Миэр"}, {"flavorText": "「我们将吸收这世界，并以我们的形象再造，与此地某些可敬设计没有太大不同。」 ～饥饿之声弗霖凯", "language": "Chinese Simplified", "multiverseId": 232471, "name": "繁衍秘耳", "text": "{3}，{T}：将一个衍生物放进战场，该衍生物为繁衍秘耳之复制品。", "type": "神器生物～秘耳"}, {"flavorText": "「我們將吸收這世界，並以我們的形象再造，與此地某些可敬設計沒有太大不同。」 ～飢餓之聲弗霖凱", "language": "Chinese Traditional", "multiverseId": 232222, "name": "繁衍秘耳", "text": "{3}，{T}：將一個衍生物放進戰場，該衍生物為繁衍秘耳之複製品。", "type": "神器生物～秘耳"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "132426", "cardKingdomId": "132192", "cardsphereId": "40491", "mcmId": "242680", "mcmMetaId": "200785", "mtgjsonV4Id": "7e8f7540-7683-5fa0-b5e7-b05e43a684b5", "mtgoFoilId": "38412", "mtgoId": "38411", "multiverseId": "215069", "scryfallId": "837e4b25-d70b-48d8-aaad-9622ad93e154", "scryfallIllustrationId": "944c5701-bd1e-46a0-af47-c81c55d06590", "scryfallOracleId": "d071e2fc-3be8-4168-afa9-ba34edad18b9", "tcgplayerProductId": "36418"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Myr Propagator", "number": "182", "originalText": "{3}, {T}: Put a token that's a copy of Myr Propagator onto the battlefield.", "originalType": "Artifact Creature — Myr", "power": "1", "printings": ["SOM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/154dd0f710fc46a2", "cardKingdomFoil": "https://mtgjson.com/links/3165187c90b58c9e", "cardmarket": "https://mtgjson.com/links/f94f5a7c430cf71a", "tcgplayer": "https://mtgjson.com/links/8e2150990543f8a5"}, "rarity": "rare", "rulings": [{"date": "2011-01-01", "text": "Normally, when a token is created by this ability, it will simply be a Myr Propagator, so it’ll also have the token-creating ability. (See below for weird exceptions.)"}, {"date": "2011-01-01", "text": "Here’s the detailed version of what happens. As the token is created, it checks the printed values of the Myr Propagator it’s copying — or, if the Myr Propagator whose ability was activated was itself a token, the original characteristics of that token as stated by the effect that put it onto the battlefield — as well as any copy effects that have been applied to it. It won’t copy counters on the Myr Propagator, nor will it copy other effects that have changed Myr Propagator’s power, toughness, types, color, or so on."}, {"date": "2011-01-01", "text": "If Myr Propagator has left the battlefield by the time its ability resolves, you’ll still put a token onto the battlefield. That token has the copiable values of the characteristics of Myr Propagator as it last existed on the battlefield."}, {"date": "2011-01-01", "text": "Here are the weird exceptions promised above. If any copy effects have affected the Myr Propagator whose ability was activated, they’re taken into account when the token is created. For example: If Myr Propagator’s ability is activated, then Myr Propagator temporarily becomes a copy of another creature before its ability resolves (due to Cytoshape, perhaps), the token will be a copy of whatever creature the Myr Propagator is currently a copy of. After the turn ends, the Cytoshaped Myr Propagator reverts back to what it was, but the token will stay as it is. Also, if the copy ability of a creature (such as Cemetery Puca, perhaps) makes it become a copy of Myr Propagator and gain another ability, the token created by this creature’s ability will be a Myr Propagator with that additional ability."}], "setCode": "SOM", "subtypes": ["Myr"], "supertypes": [], "text": "{3}, {T}: Create a token that's a copy of Myr Propagator.", "toughness": "1", "type": "Artifact Creature — Myr", "types": ["Artifact", "Creature"], "uuid": "ebed48ca-6199-54e7-b14f-b59155316b5e", "watermark": "mirran"}