{"artist": "YW Tang", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 1160, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "1d944d6f-1d70-56da-b042-96dd0943e171", "mtgoId": "88250", "scryfallId": "4aa0c2ad-bdb1-434c-ad84-6838adaefa2f", "scryfallIllustrationId": "aec14483-b6e6-4547-8c93-72cce380cd4b", "scryfallOracleId": "491dc110-b459-412e-8a0b-45e5744ee8d1"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Foretell"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Mystic Reflection", "number": "88250", "originalReleaseDate": "2021-02-28", "printings": ["KHM", "PKHM", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "If more than one Mystic Reflection applies to the same permanent entering the battlefield, the controller of that permanent chooses the order of those copy effects. The copy effect they apply last will determine which creature the entering permanent copies."}, {"date": "2021-02-05", "text": "In most cases, the copiable values of the target creature won’t change between Mystic Reflection resolving and the next time one or more creatures or planeswalkers enter the battlefield. In some unusual cases, they might, and if they do, use the copiable values of the creature at the time the permanents enter the battlefield."}, {"date": "2021-02-05", "text": "If Mystic Reflection resolves, but the target creature leaves the battlefield before the next time one or more creatures or planeswalkers enter the battlefield, use the copiable values of the target creature as it last existed on the battlefield to determine what the entering permanents copy."}, {"date": "2021-02-05", "text": "The entering permanents don’t copy whether the target creature is tapped or untapped, whether it has any counters on it, whether it has any Auras and/or Equipment attached to it, or any non-copy effects that changed its power, toughness, types, color, and so on."}, {"date": "2021-02-05", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when the permanents enter the battlefield. Any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities of the target creature will also work."}, {"date": "2021-02-05", "text": "Replacement effects that modify how a creature enters the battlefield are applied in the following order: first, control-changing effects (such as Gather Specimens), then copy effects (such as the abilities of Mystic Reflection and Clone), then all other effects."}, {"date": "2021-02-05", "text": "If a creature such as Clone is entering the battlefield under your control, there will be two copy effects to apply: the creature’s own and Mystic Reflection’s. No matter which order these effects are applied in, the creature will be a copy of the target creature when it enters the battlefield."}, {"date": "2021-02-05", "text": "Other enters-the-battlefield replacement abilities printed on the creatures entering the battlefield won’t be applied because those permanents will already be copies of the target creature at that point (and therefore they won’t have those abilities). External abilities may still affect how those permanents enter the battlefield. For example, if another effect says, “Creatures enter the battlefield tapped,” the permanents will enter as tapped copies of the target creature."}, {"date": "2021-02-05", "text": "Because exiling a card with foretell from your hand is a special action, you can do so any time you have priority during your turn, including in response to spells and abilities. Once you announce you’re taking the action, no other player can respond by trying to remove the card from your hand."}, {"date": "2021-02-05", "text": "Casting a foretold card from exile follows the timing rules for that card. If you foretell an instant card, you can cast it as soon as the next player’s turn. In most cases, if you foretell a card that isn’t an instant (or doesn’t have flash), you’ll have to wait until your next turn to cast it."}, {"date": "2021-02-05", "text": "If you’re casting a foretold card from exile for its foretell cost, you can’t choose to cast it for any other alternative costs. You can, however, pay additional costs, such as kicker costs. If the card has any mandatory additional costs, those must be paid to cast the spell."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Choose target nonlegendary creature. The next time one or more creatures or planeswalkers enter the battlefield this turn, they enter as copies of the chosen creature.\nForetell {U} (During your turn, you may pay {2} and exile this card from your hand face down. Cast it on a later turn for its foretell cost.)", "type": "Instant", "types": ["Instant"], "uuid": "0826d120-c995-5f03-bb3b-8bb17dddb245", "watermark": "foretell"}