{"artist": "Matt Stewart", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 5.0, "edhrecRank": 7922, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 376778, "name": "Mystische Barriere", "text": "Wenn die Mystische Barriere ins Spiel kommt oder zu Beginn deines Versorgungssegments, bestimme Links oder Rechts.Jeder Spieler kann nur den Gegner angreifen, der ihm in der bestimmten Richtung am nächsten sitzt, sowie Planeswalker, die dieser Spieler kontrolliert.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 378202, "name": "Barrera mística", "text": "Cuando la Barrera mística entre al campo de batalla o al comienzo de tu mantenimiento, elige izquierda o derecha.Cada jugador solo puede atacar al oponente que se siente junto a él en la última dirección elegida y a los planeswalkers controlados por ese jugador.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 377134, "name": "Barrière mystique", "text": "Quand la Barrière mystique arrive sur le champ de bataille ou au début de votre entretien, choisissez gauche ou droite.Chaque joueur peut uniquement attaquer l'adversaire assis le plus près de lui dans la dernière direction choisie et les planeswalkers contrôlés par ce joueur.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 377490, "name": "Barriera Mistica", "text": "Quando la Barriera Mistica entra nel campo di battaglia o all'inizio del tuo mantenimento, scegli sinistra o destra.Ogni giocatore può attaccare solo l'avversario seduto più vicino a lui nell'ultima direzione scelta e i planeswalker controllati da quel giocatore.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 377846, "name": "神秘の障壁", "text": "神秘の障壁が戦場に出たとき、またはあなたのアップキープの開始時に、「左」か「右」のいずれかを選ぶ。各プレイヤーは、最後に選ばれた方向で一番近い席に座っている対戦相手およびそのプレイヤーがコントロールしているプレインズウォーカーにのみ攻撃できる。", "type": "エンチャント"}], "frameVersion": "2003", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "191817", "cardsphereId": "9698", "mcmId": "264724", "mcmMetaId": "208874", "mtgjsonV4Id": "c781ade9-dabe-53c6-bbfa-948756d53e13", "mtgoFoilId": "51343", "mtgoId": "51342", "multiverseId": "376422", "scryfallId": "ffb70bd4-e876-4242-b5b4-bb7493710f0f", "scryfallIllustrationId": "7b7e1985-cd93-4ab5-9fde-ee7e1b2d80d9", "scryfallOracleId": "0caf42f5-abff-48aa-9bbf-df6cba169ef3", "tcgplayerProductId": "71867"}, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{W}", "manaValue": 5.0, "name": "Mystic Barrier", "number": "18", "originalText": "When Mystic Barrier enters the battlefield or at the beginning of your upkeep, choose left or right.\nEach player may attack only the opponent seated nearest him or her in the last chosen direction and planeswalkers controlled by that player.", "originalType": "Enchantment", "printings": ["C13"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2e9c859c05a3d506", "cardmarket": "https://mtgjson.com/links/624778603704f0e7", "tcgplayer": "https://mtgjson.com/links/10fca06e2dd925cf"}, "rarity": "rare", "rulings": [{"date": "2013-10-17", "text": "Mystic Barrier affects only what players and planeswalkers each player may attack with creatures they control. It doesn’t affect what players may be targeted by spells or abilities or other interactions."}, {"date": "2013-10-17", "text": "Mystic Barrier doesn’t affect creatures that enter the battlefield attacking."}, {"date": "2013-10-17", "text": "In some formats, you may need to disregard teammates sitting between you and the opponent seated nearest you in the chosen direction. In formats like Emperor, other rules may prohibit you from attacking that player."}, {"date": "2013-10-17", "text": "If two Mystic Barriers are on the battlefield with two different chosen directions, you may not attack a player or planeswalker unless that player or the controller of that planeswalker is the opponent seated nearest you in both directions. (This happens most often in two-player games.)"}], "setCode": "C13", "subtypes": [], "supertypes": [], "text": "When Mystic Barrier enters the battlefield or at the beginning of your upkeep, choose left or right.\nEach player may attack only the nearest opponent in the last chosen direction and planeswalkers controlled by that opponent.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "7db35452-5e6d-5848-8024-dcc19db5ffcd"}