{"artist": "Seb McKinnon", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G", "R", "U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 5544, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "0b331d09-113e-5776-957b-db9ec8a7be3a", "mtgoId": "80833", "scryfallId": "bf66157d-38d4-4719-b77e-298a3196a78e", "scryfallIllustrationId": "eb388b73-317c-4c4d-bb70-8c5630d07659", "scryfallOracleId": "42b10f0f-19cd-45d2-a2db-d5463ddc5e5b"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Fight"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{U}", "manaValue": 4.0, "name": "Mythos of Illuna", "number": "80833", "originalReleaseDate": "2020-04-30", "printings": ["IKO", "PIKO", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "The token copies exactly what is printed on the permanent and nothing else (unless that permanent is copying something else or is a token; see below). It doesn’t copy whether that permanent is tapped or untapped, whether it has any counters on it or Auras and/or Equipment attached to it, or any non-copy effects that changed its power, toughness, types, color, and so on."}, {"date": "2020-04-17", "text": "If the copied permanent has {X} in its mana cost, X is 0."}, {"date": "2020-04-17", "text": "If the copied permanent is copying something else, the token enters the battlefield as whatever that permanent is copying."}, {"date": "2020-04-17", "text": "If the copied permanent is itself a token, the token created by Mythos of Illuna copies the original characteristics of that token as stated by the effect that created it."}, {"date": "2020-04-17", "text": "Any enters-the-battlefield abilities of the copied permanent will trigger when the token enters the battlefield. Any “As [this permanent] enters the battlefield” or “[This permanent] enters the battlefield with” abilities of the copied permanent will also work."}, {"date": "2020-04-17", "text": "If an Aura is put onto the battlefield without being cast, such as by being created as a token, the Aura’s controller-to-be chooses what it will enchant as it enters the battlefield. An Aura put onto the battlefield this way doesn’t target anything (so it could be attached to an opponent’s permanent with hexproof, for example), but the Aura’s enchant ability restricts what it can be attached to. If an Aura token can’t legally be attached to anything, it isn’t created."}, {"date": "2020-04-17", "text": "If {R}{G} was spent to cast the spell, the token has the extra ability. If something copies the token later, the copy will also have that ability."}, {"date": "2020-04-17", "text": "If the token isn’t a creature immediately after it enters the battlefield, the granted ability won’t trigger. You can’t take actions to make that token into a creature after it has entered the battlefield."}, {"date": "2020-04-17", "text": "If the target creature is an illegal target or if the token is no longer a creature when the token’s granted ability tries to resolve, the ability doesn’t resolve. If it’s a legal target but the token is no longer on the battlefield when the ability resolves, the target creature won’t deal or be dealt damage."}, {"date": "2020-04-17", "text": "The abilities of the Mythos check what colors of mana were spent to cast the spell. It’s not an alternative cost to cast the spell."}, {"date": "2020-04-17", "text": "If an effect copies the Mythos spell, no mana was spent to cast the copy, so the copy won’t receive the bonus."}, {"date": "2020-04-17", "text": "The ability checks what mana was actually spent to cast a spell. If an effect allows you to spend mana “as though it were mana” of any color or type, that allows you to spend mana you couldn’t otherwise spend, but it doesn’t change what mana you spent to cast the spell."}, {"date": "2020-04-17", "text": "If an effect allows you to cast a spell without paying its mana cost, you can’t choose to cast it and pay unless another rule or effect allows you to cast that spell for a cost. Similarly, you can’t waive a cost reduction unless that effect says you may."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Create a token that's a copy of target permanent. If {R}{G} was spent to cast this spell, instead create a token that's a copy of that permanent, except the token has \"When this permanent enters the battlefield, if it's a creature, it fights up to one target creature you don't control.\"", "type": "Sorcery", "types": ["Sorcery"], "uuid": "80f6c9ed-27e6-5a25-8cbe-c6d762599bd2"}