{"artist": "Seb McKinnon", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B", "R", "W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 2680, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "8302264a-63e6-535b-9ada-5d454ea7c9f3", "mtgoId": "80829", "scryfallId": "08ee8e0e-85af-4b34-9c8a-512dfa4fd7d7", "scryfallIllustrationId": "00cc1642-a581-4304-836a-886c39f331b6", "scryfallOracleId": "4b0b4d16-1d2b-497e-a1ae-bfb89eece665"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}{W}", "manaValue": 4.0, "name": "Mythos of Snapdax", "number": "80829", "originalReleaseDate": "2020-04-30", "printings": ["IKO", "PIKO", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "If you control a permanent with more than one type, you may choose it for each of those types. For example, you could choose an artifact creature as the artifact you keep and also as the creature you keep."}, {"date": "2020-04-17", "text": "If you’re choosing the permanents for each player, your choices must still be legal. For example, you can’t decline to choose a creature a player will keep if that player controls a creature."}, {"date": "2020-04-17", "text": "As Mythos of Snapdax resolves, first you choose which permanents you control won’t be sacrificed, then each other player in turn order does the same, knowing the choices made before them. Then each nonland permanent not chosen is sacrificed at the same time."}, {"date": "2020-04-17", "text": "Lands with another permanent type can’t be chosen and won’t be sacrificed."}, {"date": "2020-04-17", "text": "The abilities of the Mythos check what colors of mana were spent to cast the spell. It’s not an alternative cost to cast the spell."}, {"date": "2020-04-17", "text": "If an effect copies the Mythos spell, no mana was spent to cast the copy, so the copy won’t receive the bonus."}, {"date": "2020-04-17", "text": "The ability checks what mana was actually spent to cast a spell. If an effect allows you to spend mana “as though it were mana” of any color or type, that allows you to spend mana you couldn’t otherwise spend, but it doesn’t change what mana you spent to cast the spell."}, {"date": "2020-04-17", "text": "If an effect allows you to cast a spell without paying its mana cost, you can’t choose to cast it and pay unless another rule or effect allows you to cast that spell for a cost. Similarly, you can’t waive a cost reduction unless that effect says you may."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Each player chooses an artifact, a creature, an enchantment, and a planeswalker from among the nonland permanents they control, then sacrifices the rest. If {B}{R} was spent to cast this spell, you choose the permanents for each player instead.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "ba495777-1e96-5d0b-8d69-a8f2ee034693"}