{"artist": "Seb McKinnon", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R", "U", "W"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 14672, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "0009a8ee-c6cf-5fbf-a03f-0422407d79f5", "mtgoId": "80831", "scryfallId": "24beae37-e941-4518-a06a-2fae8d256198", "scryfallIllustrationId": "d07afd39-bdf6-497b-9a12-151e29a9152a", "scryfallOracleId": "0b72fdeb-80b2-4691-93b9-8df5307b4641"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}{R}", "manaValue": 4.0, "name": "Mythos of Vadrok", "number": "80831", "originalReleaseDate": "2020-04-30", "printings": ["IKO", "PIKO", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "Each chosen target must receive at least 1 damage."}, {"date": "2020-04-17", "text": "If some of the targets become illegal for Mythos of Vadrok, the original division of damage still applies, but the damage that would have been dealt to illegal targets isn’t dealt at all."}, {"date": "2020-04-17", "text": "Activated abilities contain a colon. They’re generally written “[Cost]: [Effect].” Some keyword abilities are activated abilities and will have colons in their reminder text. Triggered abilities (starting with “when,” “whenever,” or “at”) are unaffected by Mythos of Vadrok."}, {"date": "2020-04-17", "text": "The target creatures and planeswalkers will be unable to attack, block, or have their abilities activated even if the damage that would be dealt to them is prevented. However, if one of those permanents becomes an illegal target, it will be able to attack, block, and have its abilities activated."}, {"date": "2020-04-17", "text": "The abilities of the Mythos check what colors of mana were spent to cast the spell. It’s not an alternative cost to cast the spell."}, {"date": "2020-04-17", "text": "If an effect copies the Mythos spell, no mana was spent to cast the copy, so the copy won’t receive the bonus."}, {"date": "2020-04-17", "text": "The ability checks what mana was actually spent to cast a spell. If an effect allows you to spend mana “as though it were mana” of any color or type, that allows you to spend mana you couldn’t otherwise spend, but it doesn’t change what mana you spent to cast the spell."}, {"date": "2020-04-17", "text": "If an effect allows you to cast a spell without paying its mana cost, you can’t choose to cast it and pay unless another rule or effect allows you to cast that spell for a cost. Similarly, you can’t waive a cost reduction unless that effect says you may."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Mythos of Vadrok deals 5 damage divided as you choose among any number of target creatures and/or planeswalkers. If {W}{U} was spent to cast this spell, until your next turn, those permanents can't attack or block and their activated abilities can't be activated.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "de424793-4f06-5f1f-993d-051cc6080d50"}