{"artist": "Ryan Alexander Lee", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 5062, "finishes": ["foil"], "flavorText": "\"Perfect. Now do it again.\"", "foreignData": [], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "218386", "cardsphereId": "54774", "mcmId": "355693", "mtgjsonV4Id": "b566aba7-51a3-5abc-ae2a-99c896a5c23f", "scryfallId": "9efb7b9a-a288-49fb-b89b-c3b21154f759", "scryfallIllustrationId": "bf308140-9fc4-4c52-8ba6-04f0890fae29", "scryfallOracleId": "cffb9b7f-d52c-43e0-a4a6-b06dea83eb53", "tcgplayerProductId": "165576"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Naban, Dean of Iteration", "number": "58s", "power": "2", "printings": ["DOM", "PDOM"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/679af9af1619ccd7", "tcgplayer": "https://mtgjson.com/links/c5155dc3bc04a8b3"}, "rarity": "rare", "rulings": [{"date": "2018-04-27", "text": "Naban affects a Wizard’s own enters-the-battlefield triggered abilities as well as other triggered abilities that trigger when that Wizard enters the battlefield. Such triggered abilities start with “when” or “whenever.”"}, {"date": "2018-04-27", "text": "Replacement effects are unaffected by Naban’s first ability. For example, a Wizard that enters the battlefield with one +1/+1 counter on it won’t receive an additional +1/+1 counter."}, {"date": "2018-04-27", "text": "Abilities that apply “as [this creature] enters the battlefield,” such as choosing a card name with Meddling Mage, are unaffected."}, {"date": "2018-04-27", "text": "Naban’s effect doesn’t copy the triggered ability; it just causes the ability to trigger twice. Any choices made as you put the ability onto the stack, such as modes and targets, are made separately for each instance of the ability. Any choices made on resolution, such as whether to put counters on a permanent, are also made individually."}, {"date": "2018-04-27", "text": "The trigger event doesn’t have to specifically refer to “Wizards.” For example, an ability that triggers “whenever a creature enters the battlefield under your control” would trigger twice if the entering creature is a Wizard."}, {"date": "2018-04-27", "text": "Look at each permanent as it exists on the battlefield, taking into account continuous effects, to determine whether any triggered abilities will trigger multiple times. For example, if you control Arcane Adaptation with Wizard as the chosen creature type, a Runeclaw Bear entering the battlefield will cause any abilities it triggers to trigger an additional time."}, {"date": "2018-04-27", "text": "If you somehow control two Nabans, a Wizard entering the battlefield causes abilities to trigger three times, not four. A third Naban causes abilities to trigger four times, a fourth causes abilities to trigger five times, and so on."}, {"date": "2018-04-27", "text": "If a Wizard entering the battlefield at the same time as Naban (including Naban itself) causes a triggered ability of a permanent you control to trigger, that ability triggers an additional time."}, {"date": "2018-04-27", "text": "If a triggered ability is linked to a second ability, additional instances of that triggered ability are also linked to that second ability. If the second ability refers to “the exiled card,” it refers to all cards exiled by instances of the triggered ability."}, {"date": "2018-04-27", "text": "In some cases involving linked abilities, an ability requires information about “the exiled card.” When this happens, the ability gets multiple answers. If these answers are being used to determine the value of a variable, the sum is used. For example, if Elite Arcanist’s enters-the-battlefield ability triggers twice, two cards are exiled. The value of X in the activation cost of Elite Arcanist’s other ability is the sum of the two cards’ converted mana costs. As the ability resolves, you create copies of both cards and can cast none, one, or both of the copies in any order."}], "securityStamp": "oval", "setCode": "PDOM", "subtypes": ["Human", "Wizard"], "supertypes": ["Legendary"], "text": "If a Wizard entering the battlefield under your control causes a triggered ability of a permanent you control to trigger, that ability triggers an additional time.", "toughness": "1", "type": "Legendary Creature — Human Wizard", "types": ["Creature"], "uuid": "3d0e9379-2f2e-5cfe-903e-6f6baf21ddb1"}