{"artist": "James Kei", "availability": ["paper"], "borderColor": "white", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 6.0, "edhrecRank": 5861, "finishes": ["nonfoil"], "foreignData": [{"language": "Italian", "name": "Branco Guerresco di Nacatl"}], "frameVersion": "2003", "hasFoil": false, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "620ef547-3178-523c-9050-f91e15b9d54c", "scryfallId": "6baf21f8-75d2-4733-9d1f-4767b7f50d54", "scryfallIllustrationId": "ed0e2781-1821-4a9b-8550-f0acc6867ca0", "scryfallOracleId": "692fdca7-0eff-4d2d-b744-213b6f6e18fb"}, "isReprint": true, "language": "Italian", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{G}{G}{G}", "manaValue": 6.0, "name": "Nacatl War-Pride", "number": "L38", "power": "3", "printings": ["FUT", "PSAL"], "promoTypes": ["mediainsert"], "purchaseUrls": {}, "rarity": "uncommon", "rulings": [{"date": "2007-05-01", "text": "If it’s impossible for Nacatl War-Pride to be blocked by exactly one creature, then the defending player may block it with multiple creatures or may leave it unblocked."}, {"date": "2007-05-01", "text": "If Nacatl War-Pride has left the battlefield by the time the triggered ability resolves, the tokens will still enter the battlefield as copies of Nacatl War-Pride."}, {"date": "2007-05-01", "text": "If Nacatl War-Pride becomes a copy of something else after the ability triggers but before it resolves, the tokens will enter the battlefield as copies of whatever the ex-Nacatl War-Pride is now. If Nacatl War-Pride became a copy of something else and then left the battlefield, the tokens will enter the battlefield as copies of whatever it was copying when it last existed on the battlefield."}, {"date": "2007-05-01", "text": "The tokens enter the battlefield attacking, even if the attack couldn’t legally be declared."}, {"date": "2007-05-01", "text": "Putting an attacking creature onto the battlefield doesn’t trigger “When this creature attacks” abilities. It also won’t check attacking restrictions, costs, or requirements."}, {"date": "2007-05-01", "text": "In a multiplayer game in which you’re allowed to attack only one player each combat, the new creatures will be attacking the same player as Nacatl War-Pride. In a multiplayer game in which you may attack multiple players, you choose the player each new creature is attacking. It must be a player you’re allowed to attack."}], "setCode": "PSAL", "subtypes": ["Cat", "Warrior"], "supertypes": [], "text": "Nacatl War-Pride must be blocked by exactly one creature if able.\nWhenever Nacatl War-Pride attacks, create X tokens that are copies of Nacatl War-Pride and that are tapped and attacking, where X is the number of creatures defending player controls. Exile the tokens at the beginning of the next end step.", "toughness": "3", "type": "Creature — Cat Warrior", "types": ["Creature"], "uuid": "0f72c1c0-8672-5e4b-ae95-cd4d4bba8d35"}