{"artist": "Aleksi Briclot", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R", "W"], "colors": ["R", "W"], "convertedManaCost": 4.0, "edhrecRank": 4142, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 411002, "name": "Nahiri, Vorbotin des Unheils", "text": "+2: Du kannst eine Karte abwerfen. Falls du dies tust, ziehe eine Karte.\n−2: Schicke eine Verzauberung, ein getapptes Artefakt oder eine getappte Kreatur deiner Wahl ins Exil.\n−8: Durchsuche deine Bibliothek nach einer Artefakt- oder Kreaturenkarte, bringe sie ins Spiel und mische danach deine Bibliothek. Sie erhält Eile. Bringe sie zu Beginn des nächsten Endsegments auf deine Hand zurück.", "type": "Planeswalker — Nahiri"}, {"language": "Spanish", "multiverseId": 413312, "name": "Nahiri, la Adalid", "text": "+2: Puedes descartar una carta. Si lo haces, roba una carta.\n−2: Exilia el encantamiento, artefacto girado o criatura girada objetivo.\n−8: Busca en tu biblioteca una carta de artefacto o de criatura, ponla en el campo de batalla y luego baraja tu biblioteca. Gana la habilidad de prisa. Regrésala a tu mano al comienzo del próximo paso final.", "type": "Planeswalker — Nahiri"}, {"language": "French", "multiverseId": 411332, "name": "Nahiri, l'annonciatrice", "text": "+2 : Vous pouvez vous défausser d'une carte. Si vous faites ainsi, piochez une carte.\n-2 : Exilez l'enchantement ciblé, l'artefact engagé ciblé ou la créature engagée ciblée.\n-8 : Cherchez dans votre bibliothèque une carte d'artefact ou de créature, mettez-la sur le champ de bataille, puis mélangez votre bibliothèque. Elle acquiert la célérité. Renvoyez-la dans votre main au début de la prochaine étape de fin.", "type": "Planeswalker : Nahiri"}, {"language": "Italian", "multiverseId": 411662, "name": "Nahiri, l'Araldo", "text": "+2: Puoi scartare una carta. Se lo fai, pesca una carta.\n-2: Esilia un incantesimo, un artefatto TAPpato o una creatura TAPpata bersaglio.\n-8: Passa in rassegna il tuo grimorio per una carta artefatto o creatura, mettila sul campo di battaglia, poi rimescola il tuo grimorio. Ha rapidità. Riprendila in mano all'inizio della prossima sottofase finale.", "type": "Planeswalker — Nahiri"}, {"language": "Japanese", "multiverseId": 411992, "name": "先駆ける者、ナヒリ", "text": "＋２：あなたはカード１枚を捨ててもよい。そうしたなら、カードを１枚引く。\n－２：エンチャント１つかタップ状態のアーティファクト１つかタップ状態のクリーチャー１体を対象とし、それを追放する。\n－８：あなたのライブラリーからアーティファクト・カード１枚かクリーチャー・カード１枚を探し、それを戦場に出し、その後あなたのライブラリーを切り直す。それは速攻を得る。次の終了ステップの開始時に、それをあなたの手札に戻す。", "type": "プレインズウォーカー — ナヒリ"}, {"language": "Korean", "multiverseId": 412322, "name": "예지자 나히리", "text": "+2: 당신은 카드 한 장을 버릴 수 있다. 그렇게 한다면, 카드 한 장을 뽑는다.\n−2: 부여마법, 탭된 마법물체 또는 탭된 생물을 목표로 정한다. 그 목표를 추방한다.\n−8: 당신의 서고에서 마법물체 또는 생물 카드 한 장을 찾아 전장에 놓는다. 그러고 나서 당신의 서고를 섞는다. 그 지속물은 신속을 얻는다. 다음 종료단 시작에, 그 지속물을 당신의 손으로 되돌린다.", "type": "플레인즈워커 — 나히리"}, {"language": "Portuguese (Brazil)", "multiverseId": 412652, "name": "Nahiri, a Anunciadora", "text": "+2: Você pode descartar um card. Se fizer isso, compre um card.\n−2: Exile o encantamento, artefato virado ou criatura virada alvo.\n−8: Procure em seu grimório um card de artefato ou criatura, coloque-o no campo de batalha e, depois, embaralhe seu grimório. Ele ganha ímpeto. Devolva-o para a sua mão no início da próxima etapa final.", "type": "Planeswalker — Nahiri"}, {"language": "Russian", "multiverseId": 412982, "name": "Нахири, Предвестница", "text": "+2: вы можете сбросить карту. Если вы это делаете, возьмите карту.\n−2: изгоните целевые(-ой, -ое) чары, повернутый артефакт или повернутое существо.\n−8: найдите в вашей библиотеке карту артефакта или существа, положите ее на поле битвы, затем перетасуйте вашу библиотеку. То существо или артефакт получает Ускорение. Верните его в вашу руку в начале следующего заключительного шага.", "type": "Planeswalker — Нахири"}, {"language": "Chinese Simplified", "multiverseId": 410342, "name": "先兆娜希丽", "text": "+2：你可以弃一张牌。如果你如此作，则抓一张牌。\n−2：放逐目标结界，已横置的神器或已横置的生物。\n−8：从你的牌库中搜寻一张神器或生物牌，将之放进战场，然后将你的牌库洗牌。它获得敏捷异能。在下一个结束步骤开始时，将它移回你手上。", "type": "鹏洛客～娜希丽"}, {"language": "Chinese Traditional", "multiverseId": 410672, "name": "先兆娜希麗", "text": "+2：你可以棄一張牌。如果你如此作，則抽一張牌。\n−2：放逐目標結界，已橫置的神器或已橫置的生物。\n−8：從你的牌庫中搜尋一張神器或生物牌，將之放進戰場，然後將你的牌庫洗牌。它獲得敏捷異能。在下一個結束步驟開始時，將它移回你手上。", "type": "鵬洛客～娜希麗"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "206066", "cardKingdomId": "205583", "cardsphereId": "41973", "mcmId": "288921", "mcmMetaId": "222157", "mtgjsonV4Id": "6855fed7-5105-594d-879b-a54b36dac479", "mtgoFoilId": "59925", "mtgoId": "59924", "multiverseId": "410012", "scryfallId": "84d70487-21d1-4897-ac20-2a996e893b5b", "scryfallIllustrationId": "823b275d-6dec-4bf0-bdfb-31f41b580f46", "scryfallOracleId": "d492eb9a-1f3b-4bf2-9a5d-0f4a4433f33f", "tcgplayerProductId": "115277"}, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "loyalty": "4", "manaCost": "{2}{R}{W}", "manaValue": 4.0, "name": "Nahiri, the Harbinger", "number": "247", "originalText": "+2: You may discard a card. If you do, draw a card.\n−2: Exile target enchantment, tapped artifact, or tapped creature.\n−8: Search your library for an artifact or creature card, put it onto the battlefield, then shuffle your library. It gains haste. Return it to your hand at the beginning of the next end step.", "originalType": "Planeswalker — Nahiri", "printings": ["C20", "MED", "PSOI", "SOI"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/35cac249a828c0c7", "cardKingdomFoil": "https://mtgjson.com/links/f2feab819741be14", "cardmarket": "https://mtgjson.com/links/a5e44de33375e191", "tcgplayer": "https://mtgjson.com/links/58760807b4c724bc"}, "rarity": "mythic", "rulings": [{"date": "2016-04-08", "text": "You can activate Nahiri’s first ability with no intention of discarding a card just to add loyalty to Nahiri."}, {"date": "2016-04-08", "text": "If you find a noncreature artifact with Nahiri’s third ability, it will still gain haste, even though it won’t be meaningful unless that artifact becomes a creature."}, {"date": "2016-04-08", "text": "If the artifact or creature put onto the battlefield with Nahiri’s third ability leaves the battlefield before the next end step, it won’t be returned to your hand from its new zone."}], "securityStamp": "oval", "setCode": "SOI", "subtypes": ["Nahiri"], "supertypes": ["Legendary"], "text": "[+2]: You may discard a card. If you do, draw a card.\n[−2]: Exile target enchantment, tapped artifact, or tapped creature.\n[−8]: Search your library for an artifact or creature card, put it onto the battlefield, then shuffle. It gains haste. Return it to your hand at the beginning of the next end step.", "type": "Legendary Planeswalker — Nahiri", "types": ["Planeswalker"], "uuid": "eb5412a6-f19e-5d32-867f-ec08447f21d3"}