{"artist": "Magali Villeneuve", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U", "W"], "colors": ["U", "W"], "convertedManaCost": 4.0, "edhrecRank": 3379, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 395425, "name": "Narset die Erleuchtete", "text": "+1: Schaue dir die oberste Karte deiner Bibliothek an. Falls die Karte weder eine Länderkarte noch eine Kreaturenkarte ist, kannst du sie offen vorzeigen und auf deine Hand nehmen.\n−2: Wenn du in diesem Zug deinen nächsten Spontanzauber oder deine nächste Hexerei aus deiner Hand wirkst, erhält er bzw. sie Abprall.\n−9: Du erhältst ein Emblem mit „Deine Gegner können keine Nichtkreatur-Zaubersprüche wirken.\"", "type": "Planeswalker — Narset"}, {"language": "Spanish", "multiverseId": 397273, "name": "Narset trascendente", "text": "+1: Mira la primera carta de tu biblioteca. Si es una carta que no sea de criatura ni de tierra, puedes mostrarla y ponerla en tu mano.\n-2: Cuando lances tu próximo hechizo de instantáneo o de conjuro de tu mano este turno, gana la habilidad de rebote.\n−9: Obtienes un emblema con \"Tus oponentes no pueden lanzar hechizos que no sean de criatura\".", "type": "Planeswalker — Narset"}, {"language": "French", "multiverseId": 395689, "name": "Narset transcendante", "text": "+1 : Regardez la carte du dessus de votre bibliothèque. Si c'est une carte non-créature non-terrain, vous pouvez la révéler et la mettre dans votre main.\n−2 : Quand vous lancez votre prochain sort d'éphémère ou de rituel depuis votre main ce tour-ci, il acquiert le rebond.\n−9 : Vous gagnez un emblème avec « Vos adversaires ne peuvent pas lancer de sorts non-créature. »", "type": "Planeswalker : Narset"}, {"language": "Italian", "multiverseId": 395953, "name": "Narset Trascendente", "text": "+1: Guarda la prima carta del tuo grimorio. Se è una carta non creatura e non terra, puoi rivelarla e aggiungerla alla tua mano.\n−2: Quando lanci la tua prossima magia istantaneo o stregoneria dalla tua mano in questo turno, ha ripresa.\n−9: Ottieni un emblema con \"I tuoi avversari non possono lanciare magie non creatura\".", "type": "Planeswalker — Narset"}, {"language": "Japanese", "multiverseId": 396217, "name": "卓絶のナーセット", "text": "＋１：あなたのライブラリーの一番上のカードを見る。それがクリーチャーでも土地でもないカードであるなら、あなたはそれを公開してあなたの手札に加えてもよい。\n－２：このターン、あなたが次にあなたの手札からインスタント・呪文かソーサリー・呪文を唱えたとき、それは反復を得る。\n－９：あなたは「あなたの対戦相手はクリーチャーでない呪文を唱えられない。」を持つ紋章を得る。", "type": "プレインズウォーカー — ナーセット"}, {"language": "Korean", "multiverseId": 396481, "name": "초월자 나르셋", "text": "+1: 당신의 서고 맨 위의 카드를 본다. 만약 그 카드가 생물이 아니고 대지가 아닌 카드라면, 당신은 그 카드를 공개하고 손으로 가져갈 수 있다.\n-2: 이 턴에 다음으로 당신이 순간마법이나 집중마법을 손에서 발동할 때, 그 주문은 반동을 얻는다.\n−9: 당신은 \"당신의 상대들은 생물이 아닌 주문들을 발동할 수 없다.\"를 가진 휘장을 얻는다.", "type": "플레인즈워커 — 나르셋"}, {"language": "Portuguese (Brazil)", "multiverseId": 396745, "name": "Narset Transcendente", "text": "+1: Olhe o card do topo de seu grimório. Se for um card que não seja de criatura nem de terreno, você poderá revelá-lo e colocá-lo em sua mão.\n−2: Quando você conjurar sua próxima mágica instantânea ou feitiço da sua mão neste turno, ela ganhará rebote.\n-9: Você recebe um emblema com \"Seus oponentes não podem conjurar mágicas que não sejam de criatura.\"", "type": "Planeswalker — Narset"}, {"language": "Russian", "multiverseId": 397009, "name": "Нарсет, Превзошедшая", "text": "+1: посмотрите верхнюю карту вашей библиотеки. Если эта карта не является ни существом, ни землей, вы можете показать ее и положить в вашу руку.\n-2: когда вы будете разыгрывать ваше следующее мгновенное заклинание или заклинание волшебства из вашей руки в этом ходу, то заклинание получает Отскок.\n−9: вы получаете эмблему со способностью «Ваши оппоненты не могут разыгрывать не являющиеся существами заклинания».", "type": "Planeswalker — Нарсет"}, {"language": "Chinese Simplified", "multiverseId": 394897, "name": "入圣娜尔施", "text": "+1：检视你的牌库顶牌。如果该牌为非生物且非地的牌，你可以展示该牌并置于你手上。\n−2：本回合中，当你从你手上施放下一个瞬间或法术咒语时，它获得弹回异能。\n−9：你获得具有「所有对手都不能施放非生物咒语」的徽记。", "type": "鹏洛客～娜尔施"}, {"language": "Chinese Traditional", "multiverseId": 395161, "name": "入聖娜爾施", "text": "+1：檢視你的牌庫頂牌。如果該牌為非生物且非地的牌，你可以展示該牌並置於你手上。\n−2：本回合中，當你從你手上施放下一個瞬間或巫術咒語時，它獲得彈回異能。\n−9：你獲得具有「所有對手都不能施放非生物咒語」的徽記。", "type": "鵬洛客～娜爾施"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "199734", "cardKingdomId": "199304", "cardsphereId": "13855", "mcmId": "273106", "mcmMetaId": "211149", "mtgjsonV4Id": "ec2876c5-e12a-5272-a19c-4594d70fc6ec", "mtgoFoilId": "56077", "mtgoId": "56076", "multiverseId": "394633", "scryfallId": "4816d092-e34b-4397-8599-43d8e85a8f39", "scryfallIllustrationId": "3545cdc5-1b10-411f-b428-97a6cd2714ae", "scryfallOracleId": "e1de0c94-0ecc-425a-9b92-27c2745d07e7", "tcgplayerProductId": "96450"}, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "loyalty": "6", "manaCost": "{2}{W}{U}", "manaValue": 4.0, "name": "Narset Transcendent", "number": "225", "originalText": "+1: Look at the top card of your library. If it's a noncreature, nonland card, you may reveal it and put it into your hand.\n−2: When you cast your next instant or sorcery spell from your hand this turn, it gains rebound.\n−9: You get an emblem with \"Your opponents can't cast noncreature spells.\"", "originalType": "Planeswalker — Narset", "printings": ["DTK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/77feaa89af13f6a8", "cardKingdomFoil": "https://mtgjson.com/links/6a20782f43d71f2c", "cardmarket": "https://mtgjson.com/links/374213e43eb1b513", "tcgplayer": "https://mtgjson.com/links/1630103ce779e6bf"}, "rarity": "mythic", "rulings": [{"date": "2015-02-25", "text": "When resolving Narset’s first ability, if the top card of your library is a creature or a land card, or if you don’t wish to put it into your hand, it isn’t revealed."}, {"date": "2015-02-25", "text": "If a spell that exiles itself as part of its own resolution, such as Volcanic Vision, gains rebound, the ability that lets you cast the spell again won’t be created. The spell will simply be exiled."}], "securityStamp": "oval", "setCode": "DTK", "subtypes": ["Narset"], "supertypes": ["Legendary"], "text": "[+1]: Look at the top card of your library. If it's a noncreature, nonland card, you may reveal it and put it into your hand.\n[−2]: When you cast your next instant or sorcery spell from your hand this turn, it gains rebound. (Exile the spell as it resolves. At the beginning of your next upkeep, you may cast that card from exile without paying its mana cost.)\n[−9]: You get an emblem with \"Your opponents can't cast noncreature spells.\"", "type": "Legendary Planeswalker — Narset", "types": ["Planeswalker"], "uuid": "c32d309f-650c-5fae-8bd5-0b22b9aa5951"}