{"artist": "Brian Valeza", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 9865, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 484934, "name": "Werdender Körperwandler", "text": "Immer wenn der Werdende Körperwandler angreift oder blockt, deckt ein Gegner deiner Wahl Karten oben von seiner Bibliothek auf, bis er eine Kreaturenkarte aufdeckt. Der Werdende Körperwandler wird bis zum Ende des Zuges zu einer Kopie jener Karte. Dann legt jener Spieler alle Karten, die auf diese Weise aufgedeckt wurden, in zufälliger Reihenfolge unter seine Bibliothek.", "type": "Kreatur — Gestaltwandler"}, {"language": "Spanish", "multiverseId": 484985, "name": "Metamorfo recién nacido", "text": "Siempre que el Metamorfo recién nacido ataque o bloquee, el oponente objetivo muestra cartas de la parte superior de su biblioteca hasta que muestre una carta de criatura. El Metamorfo recién nacido se convierte en una copia de esa carta hasta el final del turno. Luego, ese jugador pone todas las cartas mostradas de esta manera en el fondo de su biblioteca en un orden aleatorio.", "type": "Criatura — Metamorfo"}, {"language": "French", "multiverseId": 485036, "name": "Métamorphe naissant", "text": "À chaque fois que le Métamorphe naissant attaque ou bloque, l'adversaire ciblé révèle les cartes du dessus de sa bibliothèque jusqu'à ce qu'il révèle une carte de créature. Le Métamorphe naissant devient une copie de cette carte jusqu'à la fin du tour. Ce joueur met ensuite toutes les cartes révélées de cette manière au-dessous de sa bibliothèque dans un ordre aléatoire.", "type": "Créature : changeforme"}, {"language": "Italian", "multiverseId": 485087, "name": "Metamorfo Nascente", "text": "Ogniqualvolta il Metamorfo Nascente attacca o blocca, un avversario bersaglio rivela carte dalla cima del suo grimorio finché non rivela una carta creatura. Il Metamorfo Nascente diventa una copia di quella carta fino alla fine del turno. Poi quel giocatore mette tutte le carte rivelate in questo modo in fondo al suo grimorio in ordine casuale.", "type": "Creatura — Polimorfo"}, {"language": "Japanese", "multiverseId": 485138, "name": "初期変化", "text": "初期変化が攻撃するかブロックするたび、対戦相手１人を対象とする。そのプレイヤーは、クリーチャー・カードが公開されるまで、自分のライブラリーの一番上からカードを１枚ずつ公開する。ターン終了時まで、初期変化はそのカードのコピーになる。その後、そのプレイヤーはこれにより公開したカードをすべて自分のライブラリーの一番下に無作為の順番で置く。", "type": "クリーチャー — 多相の戦士"}, {"language": "Portuguese (Brazil)", "multiverseId": 485189, "name": "Metamorfo Nascente", "text": "Toda vez que Metamorfo Nascente ataca ou bloqueia, o oponente alvo revela cards do topo do próprio grimório até revelar um card de criatura. Metamorfo Nascente torna-se uma cópia daquele card até o final do turno. Em seguida, aquele jogador coloca todos os cards revelados dessa forma no fundo do próprio grimório em ordem aleatória.", "type": "Criatura — Metamorfo"}, {"language": "Russian", "multiverseId": 485240, "name": "Зарождающийся Метаморф", "text": "Каждый раз, когда Зарождающийся Метаморф атакует или блокирует, целевой оппонент показывает карты с верха своей библиотеки до тех пор, пока не покажет карту существа. Зарождающийся Метаморф становится копией той карты до конца хода. Затем тот игрок кладет все показанные таким образом карты в низ своей библиотеки в случайном порядке.", "type": "Существо — Имитатор"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "232305", "cardsphereId": "66343", "mcmId": "452143", "mtgjsonV4Id": "99ea2199-212f-53a2-8b71-52c50668652c", "mtgoId": "80653", "multiverseId": "484883", "scryfallId": "61e7984b-8c20-4867-8045-4fb52cd6e2d4", "scryfallIllustrationId": "9de76d80-8806-46be-83ce-5b19864b6c06", "scryfallOracleId": "68f34b1c-e06b-4859-b7c0-62148341e38c", "tcgplayerProductId": "212159"}, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Nascent Metamorph", "number": "36", "originalText": "Whenever Nascent Metamorph attacks or blocks, target opponent reveals cards from the top of their library until they reveal a creature card. Nascent Metamorph becomes a copy of that card until end of turn. Then that player puts all cards revealed this way on the bottom of their library in a random order.", "originalType": "Creature — Shapeshifter", "power": "1", "printings": ["C20"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/afbb4633690ac720", "tcgplayer": "https://mtgjson.com/links/c3223b87e6ddcae1"}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "The creature card that Nascent Metamorph becomes a copy of is put onto the bottom of the library along with any other cards."}, {"date": "2020-04-17", "text": "If the target opponent has no creature cards in their library, Nascent Metamorph doesn’t become a copy of anything. The cards are returned to that library in a random order."}, {"date": "2020-04-17", "text": "If another permanent becomes a copy of Nascent Metamorph, it will become whatever Nascent Metamorph is copying. It remains a copy when Nascent Metamorph’s effect ends."}, {"date": "2020-04-17", "text": "If an effect begins to apply to Nascent Metamorph before it becomes a copy, that effect will continue to apply."}, {"date": "2020-04-17", "text": "If Nascent Metamorph becomes a copy of a legendary card with the same name as a legendary permanent you control, you’ll put one of them into its owner’s graveyard."}, {"date": "2020-04-17", "text": "If Nascent Metamorph becomes a copy of an object with a set of linked abilities (for example, one ability that exiles a card and another that refers to the card “exiled with” the object), that link only lasts as long as Nascent Metamorph is copying that object. If it stops being a copy of that object and then becomes a copy again later, the link is lost."}], "securityStamp": "oval", "setCode": "C20", "subtypes": ["Shapeshifter"], "supertypes": [], "text": "Whenever Nascent Metamorph attacks or blocks, target opponent reveals cards from the top of their library until they reveal a creature card. Nascent Metamorph becomes a copy of that card until end of turn. Then that player puts all cards revealed this way on the bottom of their library in a random order.", "toughness": "1", "type": "Creature — Shapeshifter", "types": ["Creature"], "uuid": "373f075b-0160-501b-9cc7-61e21a3fdbcc"}