{"artist": "Death Burger", "availability": ["paper"], "borderColor": "borderless", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 3.0, "edhrecRank": 2154, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameEffects": ["legendary", "inverted"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "268806", "cardKingdomId": "268805", "mtgjsonV4Id": "87f6af72-75e7-52a4-9561-73ebea95d551", "scryfallId": "aedf907b-7d8e-4c6d-b3da-2aae1b327ee1", "scryfallIllustrationId": "25f97bfb-2408-4e43-903c-ce0d7606b4eb", "scryfallOracleId": "d04b6c2c-50fc-464d-9991-230efec70d2b", "tcgplayerProductId": "451210"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Ninjutsu"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{1}{B}{B}", "manaValue": 3.0, "name": "Nashi, Moon Sage's Scion", "number": "2022", "power": "3", "printings": ["NEO", "PNEO", "PRM", "SLC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/689161cc19a6d485", "cardKingdomFoil": "https://mtgjson.com/links/1c3d9d0150611533", "tcgplayer": "https://mtgjson.com/links/0558af1b4e67638b"}, "rarity": "mythic", "rulings": [{"date": "2022-02-18", "text": "You may only cast a spell this way by paying the appropriate amount of life. You may not pay its normal cost and may not pay any other alternative costs. You may still pay for additional costs, such as kicker costs. If the spell has mandatory additional costs, you must pay those."}, {"date": "2022-02-18", "text": "You must follow all normal timing rules when casting a spell or playing a land this way. For example, you cannot normally play a land card this way if you have already played a land this turn."}, {"date": "2022-02-18", "text": "If you cast a spell with {X} in its mana cost this way, the only legal choice for X is 0."}, {"date": "2022-02-18", "text": "The ninjutsu ability can be activated only after blockers have been declared. Before then, attacking creatures are neither blocked nor unblocked."}, {"date": "2022-02-18", "text": "As you activate a ninjutsu ability, you reveal the Ninja card in your hand and return the attacking creature. The Ninja card stays revealed and isn't put onto the battlefield until the ability resolves. If it leaves your hand before then, it won't enter the battlefield at all."}, {"date": "2022-02-18", "text": "The creature with ninjutsu enters the battlefield attacking the same player or planeswalker that the returned creature was attacking. This is a rule specific to ninjutsu; in other cases, when a creature is put onto the battlefield attacking, that creature's controller chooses which player or planeswalker it's attacking."}, {"date": "2022-02-18", "text": "Although the Ninja is attacking, it was never declared as an attacking creature (for purposes of abilities that trigger whenever a creature attacks, for example)."}, {"date": "2022-02-18", "text": "The ninjutsu ability can be activated during the declare blockers step, combat damage step, or end of combat step. In most cases (see below), if you wait until the combatdamage step or end of combat step, it will be after combat damage has been dealt, so the Ninja won't deal combat damage."}, {"date": "2022-02-18", "text": "If a creature in combat has first strike or double strike, you can activate the ninjutsu ability during the first-strike combat damage step. The Ninja will deal combat damage during the regular combat damage step, even if it has first strike."}, {"date": "2022-02-18", "text": "Puff of smoke not included."}], "securityStamp": "oval", "setCode": "SLC", "subtypes": ["Rat", "Ninja"], "supertypes": ["Legendary"], "text": "Ninjutsu {3}{B} ({3}{B}, Return an unblocked attacker you control to hand: Put this card onto the battlefield from your hand tapped and attacking.)\nWhenever Nashi, Moon Sage's Scion deals combat damage to a player, exile the top card of each player's library. Until end of turn, you may play one of those cards. If you cast a spell this way, pay life equal to its mana value rather than paying its mana cost.", "toughness": "2", "type": "Legendary Creature — Rat Ninja", "types": ["Creature"], "uuid": "73fd1bcc-1f31-5a37-ae00-22ab0e87cded"}