{"artist": "Wayne Reynolds", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 5.0, "edhrecRank": 18354, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 154634, "name": "Naths Elitekrieger", "text": "Alle Kreaturen, die Naths Elitekrieger blocken können, tun dies.\nWenn Naths Elitekrieger ins Spiel kommen, befehde dich mit einem Gegner. Falls du die Fehde gewinnst, lege eine +1/+1-Marke auf Naths Elitekrieger. (Jeder Spieler in einer Fehde deckt die oberste Karte seiner Bibliothek auf und legt diese Karte dann auf oder unter seine Bibliothek. Ein Spieler gewinnt die Fehde, wenn seine Karte die höheren umgewandelten Manakosten hat.)", "type": "Kreatur — Elf, Krieger"}, {"language": "Spanish", "multiverseId": 156751, "name": "Élite de Nath", "text": "Todas las criaturas que puedan bloquear a la Élite de Nath lo hacen.\nCuando la Élite de Nath entre en juego, enfréntate con un oponente. Si ganas, pon un contador +1/+1 sobre la Élite de Nath. (Cada jugador enfrentado muestra la primera carta de su biblioteca, luego pone esa carta en la parte superior o inferior. Gana el jugador cuya carta tenga el mayor coste de maná convertido.)", "type": "Criatura — Guerrero elfo"}, {"language": "French", "multiverseId": 155547, "name": "Élite de Narth", "text": "Toutes les créatures capables de bloquer l'Élite de Narth le font.\nQuand l'Élite de Narth arrive en jeu, confrontez un adversaire. Si vous gagnez, mettez un marqueur +1/+1 sur l'Élite de Narth. (Chaque joueur impliqué dans la confrontation révèle la carte du dessus de sa bibliothèque et met ensuite cette carte au-dessus ou au-dessous de celle-ci. Un joueur gagne si sa carte a un coût converti de mana plus élevé.)", "type": "Créature : elfe et guerrier"}, {"language": "Italian", "multiverseId": 155848, "name": "Elite di Nath", "text": "Tutte le creature in grado di bloccare l'Elite di Nath lo fanno.\nQuando l'Elite di Nath entra in gioco, scontrati con un avversario. Se vinci, metti un segnalino +1/+1 sull'Elite di Nath. (Ogni giocatore che si scontra rivela la prima carta del suo grimorio, poi la mette in cima o in fondo. Un giocatore vince se la sua carta aveva un costo di mana convertito maggiore.)", "type": "Creatura — Guerriero Elfo"}, {"language": "Japanese", "multiverseId": 156149, "name": "ナースの精鋭", "text": "ナースの精鋭をブロックできるすべてのクリーチャーは、それをブロックする。\nナースの精鋭が場に出たとき、いずれかの対戦相手と激突を行う。 あなたが勝った場合、ナースの精鋭の上に＋１/＋１カウンターを１個置く。 （激突を行う各プレイヤーは、自分のライブラリーの一番上のカードを公開し、そのカードを一番上か一番下に置く。 自分のカードの点数で見たマナ・コストの方が大きいプレイヤーが勝つ。）", "type": "クリーチャー — エルフ・戦士"}, {"language": "Portuguese (Brazil)", "multiverseId": 157052, "name": "Elite de Nath", "text": "Todas as criaturas aptas a bloquear Elite de Nath o fazem.\nQuando Elite de Nath entra em jogo, confronte um oponente. Se você vencer, coloque um marcador +1/+1 sobre Elite de Nath. (Cada jogador confrontante revela o card do topo de seu próprio grimório, e então coloca aquele card no topo ou no fundo deste. Vence o jogador que tiver o card com o maior custo de mana convertido.)", "type": "Criatura — Elfo Guerreiro"}, {"language": "Russian", "multiverseId": 156450, "name": "Элита Ната", "text": "Все существа, способные блокировать Элиту Ната, блокируют ее.\nКогда Элита Ната входит в игру, столкнитесь с оппонентом. Если вы выиграли, положите жетон +1/+1 на Элиту Ната. (Каждый сталкивающийся игрок показывает верхнюю карту своей библиотеки, затем кладет ту карту на верх или в низ своей библиотеки. Выигрывает тот игрок, чья карта имела большую конвертированную мана-стоимость.)", "type": "Существо — Эльф Воин"}, {"language": "Chinese Simplified", "multiverseId": 154935, "name": "纳斯精兵", "text": "所有能够阻挡纳斯精兵的生物皆须阻挡之。\n当纳斯精兵进场时，与一位对手比点。 若你赢，则在纳斯精兵上放置一个+1/+1指示物。 （参与比点的牌手各展示其牌库顶牌，然后将该牌置于牌库顶部或底部。 所展示的牌之总法术力费用比较高的牌手赢得比点。）", "type": "生物～地精／战士"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "123801", "cardKingdomId": "123730", "cardsphereId": "25501", "mcmId": "17972", "mcmMetaId": "9342", "mtgjsonV4Id": "36e7ad37-1f4b-5367-be90-47783580e5bf", "mtgoFoilId": "28680", "mtgoId": "28679", "multiverseId": "145990", "scryfallId": "f2a2b029-02ba-46b0-88a2-99025727cc56", "scryfallIllustrationId": "5bdcc35c-3d02-4455-b44b-5103504e04c0", "scryfallOracleId": "2445fb97-a9c9-4078-8a8e-64b8c3951c4a", "tcgplayerProductId": "15585"}, "keywords": ["Clash"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{G}", "manaValue": 5.0, "name": "Nath's Elite", "number": "231", "originalText": "All creatures able to block Nath's Elite do so.\nWhen Nath's Elite comes into play, clash with an opponent. If you win, put a +1/+1 counter on Nath's Elite. (Each clashing player reveals the top card of his or her library, then puts that card on the top or bottom. A player wins if his or her card had a higher converted mana cost.)", "originalType": "Creature - Elf Warrior", "power": "4", "printings": ["LRW"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/cd682e095efc0178", "cardKingdomFoil": "https://mtgjson.com/links/a5758fc9c20819a0", "cardmarket": "https://mtgjson.com/links/4f22eee8cbb70d9e", "tcgplayer": "https://mtgjson.com/links/0d89fe9eed8977e0"}, "rarity": "common", "rulings": [], "setCode": "LRW", "subtypes": ["Elf", "Warrior"], "supertypes": [], "text": "All creatures able to block Nath's Elite do so.\nWhen Nath's Elite enters the battlefield, clash with an opponent. If you win, put a +1/+1 counter on Nath's Elite. (Each clashing player reveals the top card of their library, then puts that card on the top or bottom. A player wins if their card had a higher mana value.)", "toughness": "2", "type": "Creature — Elf Warrior", "types": ["Creature"], "uuid": "73e5001f-771a-5180-aa52-53112fb717f7"}