{"artist": "John Matson", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2003", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "131286", "mcmId": "240634", "mtgjsonV4Id": "9da06f0e-31b3-53d7-898d-d4c7cd0a7c73", "multiverseId": "212601", "scryfallId": "88bb31fb-e7df-47e2-88dc-18a29ea8ee98", "scryfallIllustrationId": "8b8aeac2-ba8d-48af-8a3d-02a37add6ece", "scryfallOracleId": "041edb3a-e7f3-4118-9974-99b622d18b09", "tcgplayerProductId": "37195"}, "isOversized": true, "isStarter": true, "language": "English", "layout": "scheme", "legalities": {}, "manaValue": 0.0, "name": "Nature Demands an Offering", "number": "31★", "originalText": "When you set this scheme in motion, target opponent chooses a creature you don't control and puts it on top of its owner's library, then repeats this process for an artifact, an enchantment, and a land. Then the owner of each permanent chosen this way shuffles his or her library.", "originalType": "Scheme", "printings": ["OARC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/06c05867674efe7a", "tcgplayer": "https://mtgjson.com/links/5ed504b52c3872f1"}, "rarity": "common", "rulings": [{"date": "2010-06-15", "text": "The targeted opponent may choose a creature they control, or may choose a creature one of your other opponents controls. The same is true for each of the other permanent types listed."}, {"date": "2010-06-15", "text": "The four permanents are put on top of their owners’ libraries in sequence. That means that a single artifact creature, for example, can’t be chosen as both the creature and as the artifact."}, {"date": "2010-06-15", "text": "If there are no applicable choices for one of the permanent types, it’s simply skipped. The process is still repeated for the other listed permanent types."}, {"date": "2010-06-15", "text": "If a player owns multiple permanents chosen this way, that player shuffles their library just once."}, {"date": "2010-06-15", "text": "The owner of a token permanent chosen this way still shuffles their library, even though the token ceases to exist."}, {"date": "2010-06-15", "text": "If one of the chosen permanents is controlled by an opponent but owned by you, you’ll wind up shuffling your library."}], "setCode": "OARC", "subtypes": [], "supertypes": [], "text": "When you set this scheme in motion, target opponent chooses a creature you don't control and puts it on top of its owner's library, then repeats this process for an artifact, an enchantment, and a land. Then the owner of each permanent chosen this way shuffles.", "type": "Scheme", "types": ["Scheme"], "uuid": "9ec0076d-8e93-5ad4-89a5-01d7d1d4601c"}