{"artist": "Pete Venters", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 3.0, "edhrecRank": 953, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "name": "Schwarze Kunst", "text": "Du kannst die Schwarze Kunst auch als Spontanzauber spielen. Wenn Du dies tust, begrabe sie am Ende des Zuges.\nWenn Du die Schwarze Kunst sprichst, wähle eine Zielkreaturenkarte aus einem Friedhof. Wenn die Schwarze Kunst ins Spiel kommt, bringe diese Kreatur direkt ins Spiel, als ob sie gerade gesprochen worden wäre, und die Schwarze Kunst wird zu einer Kreaturen-verzauberung, die auf diese Kreatur zielt. Wenn die Schwarze Kunst das Spiel verlässt, begrabe diese Kreatur.", "type": "Verzaubere Kreatur"}, {"language": "Spanish", "name": "Nigromancia"}, {"language": "French", "name": "Nécromancie"}, {"language": "Italian", "name": "Necromanzia"}, {"language": "Japanese", "name": "ネクロマンシー"}, {"language": "Portuguese (Brazil)", "name": "Necromancia"}], "frameVersion": "1997", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "32089", "cardsphereId": "46916", "mcmId": "8415", "mcmMetaId": "3858", "mtgjsonV4Id": "5c9d7f77-90f3-5ac2-b2cd-c827e66df4cb", "mtgoFoilId": "7650", "mtgoId": "7649", "multiverseId": "3621", "scryfallId": "311a6257-dd77-4bb6-81cb-c8e7862350f3", "scryfallIllustrationId": "d7ca189c-49b0-4fe2-b375-c86356d85030", "scryfallOracleId": "699b192c-f3f2-4ac5-9ca9-e35bcf08ad8a", "tcgplayerProductId": "5890"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}", "manaValue": 3.0, "name": "Necromancy", "number": "64", "originalText": "You may choose to play Necromancy as an instant; if you do, bury it at end of turn.\nWhen you play Necromancy, choose target creature card in any graveyard. When Necromancy comes into play, put that creature into play as though it were just played and Necromancy becomes a creature enchantment that targets the creature. If Necromancy leaves play, bury the creature.", "originalType": "Enchantment", "printings": ["PLIST", "VIS"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7ec3eae103589862", "cardmarket": "https://mtgjson.com/links/f304e28797337e43", "tcgplayer": "https://mtgjson.com/links/aeb2ecef0dcbe580"}, "rarity": "uncommon", "rulings": [{"date": "2004-10-04", "text": "The bringing of the creature onto the battlefield and then putting Necromancy on it is all done as part of the resolution."}, {"date": "2004-10-04", "text": "When putting a card onto the battlefield that requires a definition for its value or some other choice, you do what is needed to define the value or make the choice."}, {"date": "2005-08-01", "text": "Necromancy enters the battlefield as an enchantment and then becomes an Enchant Creature Aura as a triggered ability upon entering the battlefield. It follows all the rules for Auras from then on."}, {"date": "2008-04-01", "text": "If the creature card put onto the battlefield has protection from black (or anything that prevents this from legally being attached), this won’t be able to attach to it. Then this will go to the graveyard as a state-based action, causing the creature to be sacrificed."}, {"date": "2009-10-01", "text": "The sacrifice occurs only if you cast it using its own ability. If you cast it using some other effect (for instance, if it gained flash from Vedalken Orrery), then it won’t be sacrificed."}], "setCode": "VIS", "subtypes": [], "supertypes": [], "text": "You may cast Necromancy as though it had flash. If you cast it any time a sorcery couldn't have been cast, the controller of the permanent it becomes sacrifices it at the beginning of the next cleanup step.\nWhen Necromancy enters the battlefield, if it's on the battlefield, it becomes an Aura with \"enchant creature put onto the battlefield with Necromancy.\" Put target creature card from a graveyard onto the battlefield under your control and attach Necromancy to it. When Necromancy leaves the battlefield, that creature's controller sacrifices it.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "c7896b11-1cb7-5702-bb03-765517477212"}