{"artist": "Ryan Pancoast", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 6.0, "edhrecRank": 18371, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 210620, "name": "Nemesis-Falle", "text": "Falls eine weiße Kreatur angreift, kannst du {B}{B} bezahlen, anstatt die Manakosten der Nemesis-Falle zu bezahlen.\nSchicke eine angreifende Kreatur deiner Wahl ins Exil. Bringe einen Kreaturen-Spielstein ins Spiel, der eine Kopie dieser Kreatur ist. Schicke ihn zu Beginn des nächsten Endsegments ins Exil.", "type": "Spontanzauber — Falle"}, {"language": "Spanish", "multiverseId": 211635, "name": "Trampa de némesis", "text": "Si una criatura blanca está atacando, puedes pagar {B}{B} en lugar de pagar el coste de maná de la Trampa de némesis.\nExilia la criatura atacante objetivo. Pon en el campo de batalla una ficha de criatura que es una copia de esa criatura. Exíliala al comienzo del próximo paso final.", "type": "Instantáneo — Trampa"}, {"language": "French", "multiverseId": 211345, "name": "Piège à némésis", "text": "Si une créature blanche attaque, vous pouvez payer {B}{B} à la place du coût de mana du Piège à némésis.\nExilez la créature attaquante ciblée. Mettez sur le champ de bataille un jeton de créature qui est une copie de cette créature. Exilez-le au début de la prochaine étape de fin.", "type": "Éphémère : piège"}, {"language": "Italian", "multiverseId": 211200, "name": "Trappola della Nemesi", "text": "Se una creatura bianca sta attaccando, puoi pagare {B}{B} invece di pagare il costo di mana della Trappola della Nemesi.\nEsilia una creatura attaccante bersaglio. Metti sul campo di battaglia una pedina creatura che è una copia di quella creatura. Esiliala all'inizio della prossima sottofase finale.", "type": "Istantaneo — Trappola"}, {"language": "Japanese", "multiverseId": 210765, "name": "応報の罠", "text": "いずれかの白のクリーチャーが攻撃している場合、あなたは応報の罠のマナ・コストを支払うのではなく、{B}{B}を支払ってもよい。\n攻撃クリーチャー１体を対象とし、それを追放する。 そのクリーチャーのコピーであるクリーチャー・トークンを１体戦場に出す。 次の終了ステップの開始時に、それを追放する。", "type": "インスタント — 罠"}, {"language": "Portuguese (Brazil)", "multiverseId": 210910, "name": "Armadilha de Nêmesis", "text": "Se houver uma criatura branca atacando, você poderá pagar {B}{B} em vez de pagar o custo de mana de Armadilha de Nêmesis.\nExile a criatura alvo atacante. Coloque no campo de batalha uma ficha de criatura que seja uma cópia daquela criatura. Exile-a no início da próxima etapa final.", "type": "Mágica Instantânea — Armadilha"}, {"language": "Russian", "multiverseId": 211490, "name": "Западня Заклятого Врага", "text": "Если атакует белое существо, вы можете заплатить {B}{B} вместо уплаты мана-стоимости Западни Заклятого Врага.\nИзгоните целевое атакующее существо. Положите на поле битвы фишку существа, являющуюся копией того существа. Изгоните ее в начале следующего заключительного шага.", "type": "Мгновенное заклинание — Ловушка"}, {"language": "Chinese Simplified", "multiverseId": 211055, "name": "报应陷阱", "text": "如果白色生物进行攻击，你可以支付{B}{B}，而不支付报应陷阱的法术力费用。\n放逐目标进行攻击的生物。 将一个衍生物放进战场，此衍生物为该生物之复制。 在下一个结束步骤开始时，将它放逐。", "type": "瞬间～陷阱"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "130293", "cardKingdomId": "130146", "cardsphereId": "47491", "mcmId": "22226", "mcmMetaId": "11062", "mtgjsonV4Id": "625c4d86-4757-5a3c-a42e-486367f2e63e", "mtgoFoilId": "35564", "mtgoId": "35563", "multiverseId": "197836", "scryfallId": "20a9f5cb-3139-4c6e-a2d4-69e1659b8db2", "scryfallIllustrationId": "48968632-3d86-4971-bd9a-379882f3053f", "scryfallOracleId": "1c6f95fd-f8d0-4d22-aa21-29e5c70b2f85", "tcgplayerProductId": "34406"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{B}{B}", "manaValue": 6.0, "name": "Nemesis Trap", "number": "61", "originalText": "If a white creature is attacking, you may pay {B}{B} rather than pay Nemesis Trap's mana cost.\nExile target attacking creature. Put a creature token that's a copy of that creature onto the battlefield. Exile it at the beginning of the next end step.", "originalType": "Instant — Trap", "printings": ["CMD", "WWK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/b5606704008d67da", "cardKingdomFoil": "https://mtgjson.com/links/2bec80b658530237", "cardmarket": "https://mtgjson.com/links/15dcf15330704865", "tcgplayer": "https://mtgjson.com/links/0d56d4a68771a1de"}, "rarity": "uncommon", "rulings": [{"date": "2010-03-01", "text": "If you cast Nemesis Trap for {B}{B}, you may still target any attacking creature, not just the white attacking creature."}, {"date": "2010-03-01", "text": "An “attacking creature” is one that has been declared as an attacker this combat, or one that was put onto the battlefield attacking this combat. Unless that creature leaves combat, it continues to be an attacking creature through the end of combat step, even if the player it was attacking has left the game, or the planeswalker it was attacking has left combat."}, {"date": "2010-03-01", "text": "If you cast Nemesis Trap during your opponent’s declare attackers step, you’ll put the token onto the battlefield before the declare blockers step begins and you can block with it this combat. If you cast Nemesis Trap later in the combat phase a, you won’t be able to block with the token."}, {"date": "2010-03-01", "text": "The token you put onto the battlefield copies exactly what was printed on the exiled creature and nothing more (unless it was copying something else or it was a token; see below). It doesn’t copy whether the exiled creature was tapped or untapped, whether it had any counters on it or Auras attached to it, or any non-copy effects that changed its power, toughness, types, color, or so on. For example, if Nemesis Trap targets an animated Celestial Colonnade, the token you put onto the battlefield will be a Celestial Colonnade that’s just a land. (Because of this, Nemesis Trap has received minor errata to specify that you put a token, not a “creature token,” onto the battlefield.)"}, {"date": "2010-03-01", "text": "If the exiled creature was copying something else (for example, if it was a Jwari Shapeshifter), then your token enters the battlefield as a copy of whatever the exiled creature was copying."}, {"date": "2010-03-01", "text": "If the exiled creature was a token, your token copies the original characteristics of that token as stated by the effect that put it onto the battlefield."}, {"date": "2010-03-01", "text": "If the exiled creature has {X} in its mana cost (such as Protean Hydra), X is considered to be zero."}, {"date": "2010-03-01", "text": "Any enters-the-battlefield abilities of the exiled creature will trigger when the token is put onto the battlefield. Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities of the chosen creature will also work."}, {"date": "2010-03-01", "text": "If the targeted creature is an illegal target by the time Nemesis Trap resolves, the entire spell doesn’t resolve. You won’t get a token."}], "setCode": "WWK", "subtypes": ["Trap"], "supertypes": [], "text": "If a white creature is attacking, you may pay {B}{B} rather than pay this spell's mana cost.\nExile target attacking creature. Create a token that's a copy of that creature. Exile it at the beginning of the next end step.", "type": "Instant — Trap", "types": ["Instant"], "uuid": "20bd9b73-8f79-5da7-bbab-f10773cca8c2"}