{"artist": "Bram Sels", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G", "U"], "colors": ["G", "U"], "convertedManaCost": 2.0, "edhrecRank": 1057, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 461397, "name": "Neuformung", "text": "Opfere eine Kreatur als zusätzliche Kosten, um diesen Zauberspruch zu wirken.\nDurchsuche deine Bibliothek nach einer Kreaturenkarte mit umgewandelten Manakosten von 1 plus den umgewandelten Manakosten der geopferten Kreatur, bringe sie mit einer zusätzlichen +1/+1-Marke ins Spiel und mische dann deine Bibliothek.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 461661, "name": "Neoforma", "text": "Como coste adicional para lanzar este hechizo, sacrifica una criatura.\nBusca en tu biblioteca una carta de criatura con coste de maná convertido igual a 1 más el coste de maná convertido de la criatura sacrificada, pon esa carta en el campo de batalla con un contador +1/+1 adicional sobre ella y luego baraja tu biblioteca.", "type": "Conjuro"}, {"language": "French", "multiverseId": 461925, "name": "Néoforme", "text": "En tant que coût supplémentaire pour lancer ce sort, sacrifiez une créature.\nCherchez dans votre bibliothèque une carte de créature avec un coût converti de mana égal à 1 plus le coût converti de mana de la créature sacrifiée, mettez cette carte sur le champ de bataille avec un marqueur +1/+1 supplémentaire sur elle, puis mélangez votre bibliothèque.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 462189, "name": "Neoforma", "text": "Come costo addizionale per lanciare questa magia, sacrifica una creatura.\nPassa in rassegna il tuo grimorio per una carta creatura con costo di mana convertito pari a 1 più il costo di mana convertito della creatura sacrificata, metti sul campo di battaglia quella carta con un segnalino +1/+1 addizionale, poi rimescola il tuo grimorio.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 462453, "name": "新生化", "text": "この呪文を唱えるための追加コストとして、クリーチャー１体を生け贄に捧げる。\nあなたのライブラリーから、その生け贄に捧げたクリーチャーの点数で見たマナ・コストに１を足した値に等しい点数で見たマナ・コストを持つクリーチャー・カード１枚を探し、そのカードを＋１/＋１カウンターが追加で１個置かれた状態で戦場に出し、その後あなたのライブラリーを切り直す。", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 462717, "name": "신형상", "text": "이 주문을 발동하기 위한 추가비용으로, 생물 한 개를 희생한다.\n당신의 서고에서 전환마나비용이 희생한 생물의 전환마나비용에 1을 더한 비용과 같은 생물 카드 한 장을 찾아, 그 카드에 +1/+1 카운터 한 개를 올려놓은 채로 전장에 놓은 후, 당신의 서고를 섞는다.", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 462981, "name": "Neoformar", "text": "Como custo adicional para conjurar esta mágica, sacrifique uma criatura.\nProcure em seu grimório um card de criatura com custo de mana convertido igual a 1 mais o custo de mana convertido da criatura sacrificada, coloque aquele card no campo de batalha com um marcador +1/+1 adicional e depois embaralhe seu grimório.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 463245, "name": "Неоформа", "text": "В качестве дополнительной стоимости разыгрывания этого заклинания пожертвуйте существо.\nНайдите в вашей библиотеке карту существа с конвертированной мана-стоимостью, равной сумме 1 и конвертированной мана-стоимости пожертвованного существа, положите ту карту на поле битвы с одним дополнительным жетоном +1/+1 на ней, затем перетасуйте вашу библиотеку.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 463509, "name": "形体一新", "text": "牺牲一个生物，以作为施放此咒语的额外费用。\n从你的牌库中搜寻一张生物牌，且此牌之总法术力费用须等同于所牺牲之生物的总法术力费用加1，将之放进战场且上面额外有一个+1/+1指示物，然后将你牌库洗牌。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 463773, "name": "形體一新", "text": "犧牲一個生物，以作為施放此咒語的額外費用。\n從你的牌庫中搜尋一張生物牌，且此牌之總魔法力費用須等同於所犧牲之生物的總魔法力費用加1，將之放進戰場且上面額外有一個+1/+1指示物，然後將你牌庫洗牌。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "224454", "cardKingdomId": "224142", "cardsphereId": "59381", "mcmId": "371981", "mcmMetaId": "269397", "mtgArenaId": "69655", "mtgjsonV4Id": "593a9610-500d-513b-b3e9-576478ff180c", "mtgoId": "72018", "multiverseId": "461133", "scryfallId": "92d8f67e-4f2f-4a1f-b190-7c3f39e477e4", "scryfallIllustrationId": "0f266ad6-409a-4e22-bfe3-27198e336a39", "scryfallOracleId": "420c6dcf-966d-4a4c-a0ef-23037ab8b325", "tcgplayerProductId": "188217"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{G}{U}", "manaValue": 2.0, "name": "Neoform", "number": "206", "originalText": "As an additional cost to cast this spell, sacrifice a creature.\nSearch your library for a creature card with converted mana cost equal to 1 plus the sacrificed creature's converted mana cost, put that card onto the battlefield with an additional +1/+1 counter on it, then shuffle your library.", "originalType": "Sorcery", "printings": ["WAR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/609edb9baf23e7ca", "cardKingdomFoil": "https://mtgjson.com/links/c60a3d1cf55605f2", "cardmarket": "https://mtgjson.com/links/7730c77f957a46d0", "tcgplayer": "https://mtgjson.com/links/986f5cdec1c22f41"}, "rarity": "uncommon", "rulings": [{"date": "2019-05-03", "text": "You must sacrifice exactly one creature to cast this spell; you can’t cast it without sacrificing one, and you can’t sacrifice additional creatures."}, {"date": "2019-05-03", "text": "Players can respond to Neoform only after it’s been cast and all its costs have been paid. No one can try to destroy the creature you sacrificed to stop you from casting this spell."}, {"date": "2019-05-03", "text": "If a creature or a creature card in your library has {X} in its mana cost, X is considered to be 0."}, {"date": "2019-05-03", "text": "Tokens that aren’t a copy of something else don’t have a mana cost. Anything without a mana cost normally has a converted mana cost of 0."}, {"date": "2019-05-03", "text": "A creature put onto the battlefield this way enters the battlefield with one +1/+1 counter if it would otherwise enter with no +1/+1 counters."}], "setCode": "WAR", "subtypes": [], "supertypes": [], "text": "As an additional cost to cast this spell, sacrifice a creature.\nSearch your library for a creature card with mana value equal to 1 plus the sacrificed creature's mana value, put that card onto the battlefield with an additional +1/+1 counter on it, then shuffle.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "01e31b26-7b7f-5c89-9099-ba2df6f2d343"}