{"artist": "Yeong-Hao Han", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "edhrecRank": 2111, "finishes": ["nonfoil"], "flavorText": "Dappled coats become armored hides. Soft jaws become razor tusks. Nestling play becomes the fight for survival.", "foreignData": [{"flavorText": "Scheckige Pelze werden zu gepanzerten Häuten. Weiche Kiefer werden zu messerscharfen Stoßzähnen. Friedliches Spiel wird zum Kampf ums Überleben.", "language": "German", "multiverseId": 560247, "name": "Brutgründe", "text": "{T}: Erzeuge {C}.\n{1}, {T}: Bewege eine Marke von einer bleibenden Karte deiner Wahl, die du kontrollierst, auf eine andere bleibende Karte deiner Wahl. Aktiviere diese Fähigkeit wie eine Hexerei.", "type": "Land"}, {"flavorText": "Los pelajes veteados se convierten en pieles blindadas. Las fauces suaves, en colmillos afilados. Los juegos de los polluelos, en luchas por sobrevivir.", "language": "Spanish", "multiverseId": 560504, "name": "Tierras de anidación", "text": "{T}: Agrega {C}.\n{1}, {T}: Mueve un contador del permanente objetivo que controlas a otro permanente objetivo. Activa esto solo como un conjuro.", "type": "Tierra"}, {"flavorText": "Les pelages tachetés deviennent d'épaisses cuirasses. Les mâchoires inoffensives deviennent des défenses tranchantes. Les jeux innocents deviennent une lutte pour la survie.", "language": "French", "multiverseId": 560761, "name": "Terrains de nidification", "text": "{T} : Ajoutez {C}.\n{1}, {T} : Déplacez un marqueur d'un permanent ciblé que vous contrôlez sur un autre permanent ciblé. N'activez que lorsque vous pourriez lancer un rituel.", "type": "Terrain"}, {"flavorText": "Piumaggi maculati diventano mantelli corazzati. Dentature delicate diventano fauci affilate. I giochi nel nido diventano una lotta per la sopravvivenza.", "language": "Italian", "multiverseId": 561018, "name": "Territorio di Nidificazione", "text": "{T}: Aggiungi {C}.\n{1}, {T}: Sposta un segnalino da un permanente bersaglio che controlli a un altro permanente bersaglio. Attiva solo come una stregoneria.", "type": "Terra"}, {"flavorText": "まだら模様の毛は強固な毛皮となる。弱い歯は鋭い牙となる。仔の遊びは生の戦いとなる。", "language": "Japanese", "multiverseId": 561275, "name": "巣ごもりの地", "text": "{T}：{C}を加える。\n{1}, {T}：あなたがコントロールしているパーマネント１つと、それでないパーマネント１つを対象とする。その前者の上からカウンター１個を、その後者の上に動かす。起動はソーサリーとしてのみ行う。", "type": "土地"}, {"flavorText": "As pelugens malhadas tornam-se couraças. As mandíbulas delicadas tornam-se presas pontiagudas. As brincadeiras do ninho tornam-se uma luta pela sobrevivência.", "language": "Portuguese (Brazil)", "multiverseId": 561532, "name": "Zona de Nidificação", "text": "{T}: Adicione {C}.\n{1}, {T}: Mova um marcador de uma permanente alvo que você controla para outra permanente alvo. Ative somente como um feitiço.", "type": "Terreno"}, {"flavorText": "Пестрый мех сменяется на бронированную шкуру. Ленивые челюсти превращаются в острые как бритва клыки. Игры детенышей становятся битвой за выживание.", "language": "Russian", "multiverseId": 561789, "name": "Край Гнездовий", "text": "{T}: добавьте {C}.\n{1}, {T}: переместите один жетон с целевого перманента под вашим контролем на другой целевой перманент. Активируйте только как волшебство.", "type": "Земля"}, {"flavorText": "花斑细绒成为厚实皮毛。软弱小嘴长出尖锐獠牙。窝中嬉闹变作生存竞争。", "language": "Chinese Simplified", "multiverseId": 562046, "name": "筑巢栖地", "text": "{T}：加{C}。\n{1}，{T}：将一个指示物从目标由你操控的永久物移到另一个目标永久物上。只能于法术时机起动。", "type": "地"}, {"flavorText": "花斑細絨成為厚實皮毛。軟弱小嘴長出尖銳獠牙。窩中嬉鬧變作生存競爭。", "language": "Chinese Traditional", "multiverseId": 562303, "name": "築巢棲地", "text": "{T}：加{C}。\n{1}，{T}：將一個指示物從目標由你操控的永久物移到另一個目標永久物上。只能於巫術時機起動。", "type": "地"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "259353", "cardsphereId": "87261", "mcmId": "653002", "mtgjsonV4Id": "f2e6646a-6c4c-5888-95d6-26141c0b69b9", "multiverseId": "559990", "scryfallId": "eff98f9d-ec73-4e77-b639-17da8f833852", "scryfallIllustrationId": "ec040253-a7f1-4ca2-8f87-0a396c0f82e2", "scryfallOracleId": "d27bb97d-286b-4947-8d7b-443e4df93319", "tcgplayerProductId": "269416"}, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaValue": 0.0, "name": "Nesting Grounds", "number": "418", "originalText": "{T}: Add {C}.\n{1}, {T}: Move a counter from target permanent you control onto another target permanent. Activate only as a sorcery.", "originalType": "Land", "printings": ["C20", "NCC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/acd1661500ddd5e8", "tcgplayer": "https://mtgjson.com/links/bab9a846f3d64dae"}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "You choose the two target permanents as Nesting Grounds's second ability is put onto the stack. You choose which kind of counter to move as that ability resolves."}, {"date": "2020-04-17", "text": "To move a counter from one creature to another, the counter is removed from the first permanent and put on the second. Any abilities that care about a counter being removed from or put onto a permanent will apply."}, {"date": "2020-04-17", "text": "If either permanent becomes an illegal target, no counter is removed or put."}, {"date": "2020-04-17", "text": "The two target permanents don't have to share a type, which can result in some counters on permanents that would not occur normally, such as loyalty counters on creatures or +1/+1 counters on lands. Keyword counters will grant the permanent that keyword even if it's meaningless (such as trample on an enchantment); +1/+1 counters won't affect the permanent unless it's a creature; and many named counters (such as soul counters) won't have an effect unless the recipient permanent refers to them in some way."}], "securityStamp": "oval", "setCode": "NCC", "subtypes": [], "supertypes": [], "text": "{T}: Add {C}.\n{1}, {T}: Move a counter from target permanent you control onto another target permanent. Activate only as a sorcery.", "type": "Land", "types": ["Land"], "uuid": "bd1f6844-abb2-550c-a2c3-fc489897dc4a"}