{"artist": "Christopher Rush", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "white", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 2.0, "edhrecRank": 13781, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "1993", "hasFoil": false, "hasNonFoil": true, "identifiers": {"mcmId": "16776", "mtgjsonV4Id": "0abba2ac-439f-5b4b-a762-6567fa9d7088", "scryfallId": "793656ed-acbe-4fec-bac5-96778f234e72", "scryfallIllustrationId": "d7cc7160-b159-428a-9160-2d98be0fe5fa", "scryfallOracleId": "c358b9e2-524c-434b-b3fa-74d2aa6d1df7", "tcgplayerProductId": "211821"}, "isReprint": true, "keywords": ["Haste"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "oldschool": "Legal", "paupercommander": "Restricted", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{B}{B}", "manaValue": 2.0, "name": "Nether Shadow", "number": "118", "power": "1", "printings": ["2ED", "30A", "3ED", "4BB", "4ED", "5ED", "CED", "CEI", "FBB", "LEA", "LEB", "ME1", "OLEP", "SUM"], "purchaseUrls": {"tcgplayer": "https://mtgjson.com/links/44f4bf7b84171f77"}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "Note that bringing the Shadow back onto the battlefield from the graveyard is not a spell, it is an ability. It can’t be countered with something that counters spells."}, {"date": "2004-10-04", "text": "Since it enters the battlefield due to triggering at the beginning of upkeep, it is not possible to get an infinite loop with four Nether Shadows."}, {"date": "2008-10-01", "text": "Players may not rearrange the cards in their graveyards."}, {"date": "2008-10-01", "text": "The last thing that happens to a resolving instant or sorcery spell is that it’s put into its owner’s graveyard. Example: You cast Wrath of God. All creatures on the battlefield are destroyed. You arrange all the cards put into your graveyard this way in any order you want. The other players in the game do the same to the cards that are put into their graveyards. Then you put Wrath of God into your graveyard, on top of the other cards."}, {"date": "2008-10-01", "text": "Say you’re the owner of both a permanent and an Aura that’s attached to it. If both the permanent and the Aura are destroyed at the same time (by Akroma’s Vengeance, for example), you decide the order they’re put into your graveyard. If just the enchanted permanent is destroyed, it’s put into your graveyard first. Then, after state-based actions are checked, the Aura (which is no longer attached to anything) is put into your graveyard on top of it."}, {"date": "2008-10-01", "text": "A card is “above” another card in your graveyard if it was put into that graveyard later."}, {"date": "2008-10-01", "text": "If an effect or rule puts two or more cards into the same graveyard at the same time, the owner of those cards may arrange them in any order."}], "setCode": "SUM", "subtypes": ["Spirit"], "supertypes": [], "text": "Haste\nAt the beginning of your upkeep, if Nether Shadow is in your graveyard with three or more creature cards above it, you may put Nether Shadow onto the battlefield.", "toughness": "1", "type": "Creature — Spirit", "types": ["Creature"], "uuid": "7afd61d4-4505-593e-a82a-42344d6240d3"}