{"artist": "Lucas Graciano", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 2.0, "edhrecRank": 4186, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 531586, "name": "Niewinter-Hydra", "text": "Sowie die Niewinter-Hydra ins Spiel kommt, würfle X W6. Sie kommt mit so vielen +1/+1-Marken ins Spiel, wie dem Gesamtergebnis entspricht.\nVerursacht Trampelschaden\nAbwehr {4}", "type": "Kreatur — Hydra"}, {"language": "Spanish", "multiverseId": 531642, "name": "Hidra de Nuncainvierno", "text": "En cuanto la Hidra de Nuncainvierno entre al campo de batalla, tira Xd6. Entra con una cantidad de contadores +1/+1 sobre ella igual al total de esos resultados.\nArrolla.\nRebatir {4}.", "type": "Criatura — Hidra"}, {"language": "French", "multiverseId": 531698, "name": "Hydre de Padhiver", "text": "Au moment où l'Hydre de Padhiver arrive sur le champ de bataille, lancez X d6. Elle arrive avec, sur elle, un nombre de marqueurs +1/+1 égal au total de ces résultats.\nPiétinement\nParade {4}", "type": "Créature : hydre"}, {"language": "Italian", "multiverseId": 531754, "name": "Idra di Neverwinter", "text": "Mentre l'Idra di Neverwinter entra nel campo di battaglia, tira X d6. Entra con un numero di segnalini +1/+1 pari al totale di quei risultati.\nTravolgere\nEgida {4}", "type": "Creatura — Idra"}, {"language": "Japanese", "multiverseId": 531810, "name": "ネヴァーウィンターのハイドラ", "text": "ネヴァーウィンターのハイドラが戦場に出るに際し、d6をX回振る。これはそれらの出目の合計に等しい数の＋１/＋１カウンターが置かれた状態で戦場に出る。\nトランプル\n護法{4}", "type": "クリーチャー — ハイドラ"}], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "249363", "cardsphereId": "80273", "mcmId": "572663", "mtgjsonV4Id": "d727458d-049d-5662-bdef-c21754eb5d9b", "multiverseId": "531530", "scryfallId": "49f615ff-c8c7-496e-98fe-4793a6cd5807", "scryfallIllustrationId": "ef5f0510-a54f-4858-847c-bff94e45bfa0", "scryfallOracleId": "e71e7a68-d96e-4ebb-8d4f-9c45ff8b8b66", "tcgplayerProductId": "244246"}, "keywords": ["Trample", "Ward"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{X}{X}{G}{G}", "manaValue": 2.0, "name": "Neverwinter Hydra", "number": "310", "originalText": "As Neverwinter Hydra enters the battlefield, roll X d6. It enters with a number of +1/+1 counters on it equal to the total of those results.\nTrample\nWard {4}", "originalType": "Creature — Hydra", "power": "0", "printings": ["AFC"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/c1d2331d65379454", "tcgplayer": "https://mtgjson.com/links/c7cb8dbd51daa594"}, "rarity": "rare", "rulings": [{"date": "2021-07-23", "text": "Dice are identified by the number of faces each one has. For example, a d20 is a twenty-sided die."}, {"date": "2021-07-23", "text": "Dice used must have equally likely outcomes and the roll must be fair. Although physical dice are recommended, digital substitutes are allowed, provided they have the same number of equally likely outcomes as specified in the original roll instruction."}, {"date": "2021-07-23", "text": "An ability that tells you to roll a die will also specify what to do with the result of that roll. Most often, this is in the form of a “results table” in the card text."}, {"date": "2021-07-23", "text": "The instruction to roll a die and the effect that occurs because of the result are all part of the same ability. Players do not get the chance to respond to the ability after knowing the result of the roll."}, {"date": "2021-07-23", "text": "An effect that says “choose a target, then roll a d20” or similar still uses the normal process of putting an ability on the stack and resolving it. Choosing targets is part of putting the ability on the stack and rolling the d20 happens later, as the ability resolves."}, {"date": "2021-07-23", "text": "Some effects may modify the result of a die roll. This may be part of the instruction to roll a die or it may come from other cards. Anything that references the “result” of a die roll is looking for the result after these modifications. Anything that is looking for the “natural result” is looking for the number shown on the face of the die before these modifications."}, {"date": "2021-07-23", "text": "Some abilities, like that of Pixie Guide and Barbarian Class, replace rolling a die with rolling extra dice and ignoring the lowest roll. The ignored rolls are not considered for the effect that instructed you to roll a die, and do not cause abilities to trigger. For all intents and purposes, once you determine which dice count, any extra dice were never rolled."}, {"date": "2021-07-23", "text": "Some effects instruct you to roll again. This uses the same number and type of dice as the original roll, and that roll will use the same set of possible outcomes."}, {"date": "2021-07-23", "text": "While playing Planechase, rolling the planar die will cause any ability that triggers whenever a player rolls one or more dice to trigger. However, any effect that refers to a numerical result will ignore the rolling of the planar die."}, {"date": "2021-07-23", "text": "Tournament events have more specific rules regarding dice and die-rolling. For more information, please see the most recent version of the Magic Tournament Rules at https://wpn.wizards.com/en/document/magic-gathering-tournament-rules."}, {"date": "2021-07-23", "text": "If a player casts a spell that targets multiple permanents their opponent controls with ward, each of those ward abilities will trigger. If that player doesn't pay for all of them, the spell will be countered."}], "securityStamp": "oval", "setCode": "AFC", "subtypes": ["Hydra"], "supertypes": [], "text": "As Neverwinter Hydra enters the battlefield, roll X d6. It enters with a number of +1/+1 counters on it equal to the total of those results.\nTrample\nWard {4} (Whenever this creature becomes the target of a spell or ability an opponent controls, counter it unless that player pays {4}.)", "toughness": "0", "type": "Creature — Hydra", "types": ["Creature"], "uuid": "6208b89b-3484-5ec1-928a-515906d9e249", "variations": ["e7f2cb68-9a5b-54d7-a456-1c5ef4c8995c"]}