{"artist": "Howard Lyon", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 4034, "finishes": ["nonfoil"], "flavorText": "\"Now isn't that better?\"\n—Olivia Voldaren", "foreignData": [{"flavorText": "„Willkommen.\" —Olivia Voldaren", "language": "German", "multiverseId": 433569, "name": "Frisches Blut", "text": "Tappe als zusätzliche Kosten, um Frisches Blut zu wirken, einen ungetappten Vampir, den du kontrollierst.\nÜbernimm die Kontrolle über eine Kreatur deiner Wahl. Verändere den Text jener Kreatur, indem du alle Vorkommen eines Kreaturentyps durch Vampir ersetzt.", "type": "Hexerei"}, {"flavorText": "\"¿No te sientes mejor ahora?\" —Olivia Voldaren", "language": "Spanish", "multiverseId": 433878, "name": "Sangre fresca", "text": "Como coste adicional para lanzar Sangre fresca, gira un Vampiro enderezado que controlas.\nGana el control de la criatura objetivo. Cambia el texto de esta criatura reemplazando todas las menciones de un tipo de criatura por Vampiro.", "type": "Conjuro"}, {"flavorText": "« N'est-ce pas mieux ainsi ? » —Olivia Voldaren", "language": "French", "multiverseId": 434187, "name": "Sang neuf", "text": "En tant que coût supplémentaire pour lancer le Sang neuf, engagez un vampire dégagé que vous contrôlez.\nAcquérez le contrôle de la créature ciblée. Changez le texte de cette créature en remplaçant toutes les occurrences d'un type de créature par vampire.", "type": "Rituel"}, {"flavorText": "\"È decisamente meglio, vero?\" —Olivia Voldaren", "language": "Italian", "multiverseId": 434496, "name": "Sangue Nuovo", "text": "Come costo addizionale per lanciare il Sangue Nuovo, TAPpa un Vampiro STAPpato che controlli.\nPrendi il controllo di una creatura bersaglio. Cambia il testo di quella creatura sostituendo tutte le istanze di un tipo di creatura con Vampiro.", "type": "Stregoneria"}, {"flavorText": "「前より気分がいいでしょ？」 ――オリヴィア・ヴォルダーレン", "language": "Japanese", "multiverseId": 434805, "name": "新たな血族", "text": "新たな血族を唱えるための追加コストとして、あなたがコントロールするアンタップ状態の吸血鬼１体をタップする。\nクリーチャー１体を対象とし、それのコントロールを得る。そのクリーチャーに書かれたクリーチャー・タイプ１種類をすべて吸血鬼に置き換える。", "type": "ソーサリー"}, {"flavorText": "\"É muito melhor assim, não é?\" — Olivia Voldaren", "language": "Portuguese (Brazil)", "multiverseId": 435114, "name": "Sangue Novo", "text": "Como custo adicional para conjurar Sangue Novo, vire um Vampiro desvirado que você controla.\nGanhe o controle da criatura alvo. Altere o texto daquela criatura substituindo todas as ocorrências de um tipo de criatura por Vampiro.", "type": "Feitiço"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "213572", "cardsphereId": "50629", "mcmId": "300343", "mcmMetaId": "226528", "mtgjsonV4Id": "72c21e4f-c793-5195-9f4a-22c9622a162e", "multiverseId": "433260", "scryfallId": "f6b44503-7978-4c9e-a8a1-fd38c76d3545", "scryfallIllustrationId": "2891a16c-dbd5-495e-a15a-4272f45cd45b", "scryfallOracleId": "021d654e-b731-40d0-a18e-eaff43f9fdb9", "tcgplayerProductId": "139825"}, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}{B}", "manaValue": 4.0, "name": "New Blood", "number": "19", "originalText": "As an additional cost to cast New Blood, tap an untapped Vampire you control.\nGain control of target creature. Change the text of that creature by replacing all instances of one creature type with Vampire.", "originalType": "Sorcery", "printings": ["C17"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/a957086d3f672320", "cardmarket": "https://mtgjson.com/links/4cb8eebe372b9691", "tcgplayer": "https://mtgjson.com/links/b486b7d6623a5f6f"}, "rarity": "rare", "rulings": [{"date": "2017-08-25", "text": "To pay the additional cost of New Blood, you may tap any untapped Vampire you control, including one you haven’t controlled continuously since the beginning of your most recent turn. (Note that tapping the creature doesn’t use {T} [the tap symbol].)"}, {"date": "2017-08-25", "text": "New Blood changes the creature type each time it appears in the creature’s type line and/or rules text. It doesn’t change the name of the card or any instances of the word being used as part of a card’s name."}, {"date": "2017-08-25", "text": "You choose what word you’re changing as New Blood resolves. You don’t have to choose a word that appears in the creature’s text."}, {"date": "2017-08-25", "text": "The creature you gain control of won’t be a Vampire if you don’t choose a creature type in that creature’s type line as one to replace."}, {"date": "2017-08-25", "text": "New Blood’s effect changes only the text printed on the creature. It can’t change words found in abilities it’s been granted. For example, if you change Rat to Vampire on Hungry Lynx, your Cats will have protection from Vampires; but if instead you change Rat to Vampire on Phantom Nishoba while you control a Hungry Lynx, Phantom Nishoba will have protection from Rats."}, {"date": "2017-08-25", "text": "The type-changing effect can change part of a word (such as “non-Human”) if the part of the word is being used to refer to a creature type."}, {"date": "2017-08-25", "text": "You must choose an existing creature type, such as Vampire or Cat. Card types such as “artifact” can’t be chosen."}, {"date": "2017-08-25", "text": "You can’t choose multiple creature types, such as “Cat Warrior.” A Cat Warrior is both a Cat and a Warrior. It’s affected by anything that affects either type and unaffected by things that affect non-Cat or non-Warrior creatures."}], "securityStamp": "oval", "setCode": "C17", "subtypes": [], "supertypes": [], "text": "As an additional cost to cast this spell, tap an untapped Vampire you control.\nGain control of target creature. Change the text of that creature by replacing all instances of one creature type with Vampire.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "4960055f-489b-57ab-bb6c-34afce6eed98"}