{"artist": "Svetlin Velinov", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B", "R", "U"], "colorIndicator": ["B", "R", "U"], "colors": ["B", "R", "U"], "convertedManaCost": 4.0, "edhrecRank": 2941, "faceConvertedManaCost": 0.0, "faceManaValue": 0.0, "faceName": "Nicol Bolas, the Arisen", "finishes": ["foil"], "foreignData": [], "frameEffects": ["originpwdfc", "legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardsphereId": "56358", "mcmId": "361002", "mtgjsonV4Id": "b3e7195f-100c-55ec-8430-80d22593bc3e", "scryfallId": "6ab66344-4959-4c7b-8828-b1a89b274e0b", "scryfallIllustrationId": "98df1d4c-6b8a-4336-8df3-7bc560a5d2c0", "scryfallOracleId": "55e4b27e-5447-4fc2-8cae-a03e344600c6", "tcgplayerProductId": "170020"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "transform", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "loyalty": "7", "manaValue": 4.0, "name": "Nicol Bolas, the Ravager // Nicol Bolas, the Arisen", "number": "218s", "otherFaceIds": ["3e3e497e-79bf-5e37-afd4-a4424c9b55d6"], "printings": ["M19", "PJ21", "PM19"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"tcgplayer": "https://mtgjson.com/links/108f2606f8cf538d"}, "rarity": "mythic", "rulings": [{"date": "2018-07-13", "text": "When Nicol Bolas’s enters-the-battlefield triggered ability resolves, first the next opponent in turn order (or, if it’s an opponent’s turn, that opponent) chooses a card in their hand without revealing it, then each other opponent in turn order does the same. Then all the chosen cards are discarded at the same time."}, {"date": "2018-07-13", "text": "If Nicol Bolas leaves the battlefield after his creature face’s activated ability has been activated but before it resolves, the card remains in whichever zone it moves to. It won’t be exiled or return transformed."}, {"date": "2018-07-13", "text": "Each face of a double-faced card has its own set of characteristics: name, types, subtypes, abilities, and so on. While a double-faced card is on the battlefield, consider only the characteristics of the face that’s currently up. The other set of characteristics is ignored."}, {"date": "2018-07-13", "text": "While a double-faced card isn’t on the battlefield, consider only the characteristics of its front face. For example, Nicol Bolas has the characteristics of its creature face in the graveyard, even if it was a planeswalker on the battlefield before it was put into the graveyard."}, {"date": "2018-07-13", "text": "A double-faced card enters the battlefield with its front face up by default, unless a spell or ability instructs you to put it onto the battlefield transformed, in which case it enters with its back face up. The back face of a double-faced card can’t be played."}, {"date": "2018-07-13", "text": "If another permanent that isn’t a double-faced card (such as Mirror Image) becomes a copy of Nicol Bolas, the Ravager, activating the ability to exile it and return it transformed will only exile it. It won’t return to the battlefield at all."}, {"date": "2018-07-13", "text": "In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. If you leave the game, any permanents you control from Nicol Bolas’s third loyalty ability that came from other players’ graveyards are exiled."}, {"date": "2018-07-13", "text": "The converted mana cost of a double-faced card is the converted mana cost of its front face, even while it’s on the battlefield with its back face up. For example, the converted mana cost of Nicol Bolas, the Arisen is 4."}, {"date": "2018-07-13", "text": "Nicol Bolas, the Arisen has a color indicator on its typeline. This color indicator means that it’s a blue, black, and red permanent."}, {"date": "2018-07-13", "text": "You can activate one of the planeswalker’s loyalty abilities the turn it enters the battlefield."}, {"date": "2018-07-13", "text": "In some rare cases, a spell or ability may cause Nicol Bolas to transform while it’s a creature on the battlefield. If this happens, the resulting planeswalker won’t have any loyalty counters on it and will subsequently be put into its owner’s graveyard."}], "securityStamp": "oval", "setCode": "PM19", "side": "b", "subtypes": ["Bolas"], "supertypes": ["Legendary"], "text": "[+2]: Draw two cards.\n[−3]: Nicol Bolas, the Arisen deals 10 damage to target creature or planeswalker.\n[−4]: Put target creature or planeswalker card from a graveyard onto the battlefield under your control.\n[−12]: Exile all but the bottom card of target player's library.", "type": "Legendary Planeswalker — Bolas", "types": ["Planeswalker"], "uuid": "cea35a1c-6daf-5b5f-9a35-8850a6f04a50"}