{"artist": "Dave Allsop", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 6.0, "edhrecRank": 9331, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 143951, "name": "Nihilith", "text": "Verursacht Furcht\n Aussetzen 7 {1}{B}\n Immer wenn eine Karte von irgendwoher auf den Friedhof eines Gegners gelegt wird, kannst du eine Zeitmarke vom Nihilithen entfernen, falls der Nihilith ausgesetzt ist.", "type": "Kreatur — Schrecken"}, {"language": "Spanish", "multiverseId": 144384, "name": "Nihilit", "text": "Inspirar temor.\u2028Suspender 7—{1}{B}. \u2028Siempre que una carta vaya al cementerio de un oponente desde cualquier parte, si el Nihilit está suspendido, puedes remover un contador de tiempo de él.", "type": "Criatura — Horror"}, {"language": "French", "multiverseId": 145689, "name": "Nihilithe", "text": "Peur\nSuspension 7 — {1}{B}\nÀ chaque fois qu'une carte est mise dans le cimetière d'un adversaire d'où qu'elle vienne, si le Nihilithe est en suspension, vous pouvez retirer un marqueur « temps » du Nihilithe.", "type": "Créature : horreur"}, {"language": "Italian", "multiverseId": 145590, "name": "Nihilith", "text": "Paura\nSospendere 7—{1}{B}\nOgniqualvolta una carta viene messa nel cimitero di un avversario da qualsiasi zona, se il Nihilith è sospeso, puoi rimuovere un segnalino tempo dal Nihilith.", "type": "Creatura — Orrore"}, {"language": "Japanese", "multiverseId": 145788, "name": "ニヒリス", "text": "畏怖\n 待機 7―{1}{B}\n いずれかのカードがあらゆる領域からいずれかの対戦相手の墓地に置かれるたび、ニヒリスが待機状態である場合、あなたはニヒリスの時間カウンターを１個取り除いてもよい。", "type": "クリーチャー — ホラー"}, {"language": "Portuguese (Brazil)", "multiverseId": 144582, "name": "Annihilo", "text": "Amedrontar\n Suspender 7 {1}{B}\n Toda vez que um card é colocado no cemitério do oponente vindo de qualquer lugar, se Annihilo estiver suspenso, você pode remover um marcador temporal dele.", "type": "Criatura — Horror"}, {"language": "Russian", "multiverseId": 144483, "name": "Нигилит", "text": "Страх\nОтсрочка 7—{1}{B}\nКаждый раз, когда карта откуда-либо попадает на кладбище оппонента, и если Нигилит отсрочен, вы можете удалить один временной жетон с Нигилита.", "type": "Существо — Ужас"}, {"language": "Chinese Simplified", "multiverseId": 144085, "name": "凝虚姿", "text": "恐惧\n延缓7～{1}{B}\n每当一张牌从任何区域置入对手的坟墓场时，若凝虚姿已延缓，则你可以从凝虚姿上移去一个计时指示物。", "type": "生物～惊惧兽"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "122589", "cardKingdomId": "122409", "cardsphereId": "18756", "mcmId": "15064", "mcmMetaId": "8993", "mtgjsonV4Id": "38a8cec5-5e58-5c96-8894-40270d6caff4", "mtgoFoilId": "26897", "mtgoId": "26896", "multiverseId": "136206", "scryfallId": "11a431fa-e98c-434a-9138-b4bcc86edde8", "scryfallIllustrationId": "4601f6de-c21c-45a7-80f3-40d22b957e33", "scryfallOracleId": "c235fda2-1a8d-4ac7-9a23-784529a520f0", "tcgplayerProductId": "14949"}, "keywords": ["Fear", "Suspend"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{B}{B}", "manaValue": 6.0, "name": "Nihilith", "number": "72", "originalText": "Fear\nSuspend 7—{1}{B}\nWhenever a card is put into an opponent's graveyard from anywhere, if Nihilith is suspended, you may remove a time counter from Nihilith.", "originalType": "Creature - Horror", "power": "4", "printings": ["CLB", "FUT"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/91f60270e652f1c1", "cardKingdomFoil": "https://mtgjson.com/links/08c19833bafd5db2", "cardmarket": "https://mtgjson.com/links/bc3621829d19310f", "tcgplayer": "https://mtgjson.com/links/c50c0cf99f6a2fae"}, "rarity": "rare", "rulings": [{"date": "2007-05-01", "text": "If a token is put into an opponent's graveyard from the battlefield, or a copy of a spell is put into an opponent's graveyard from the stack, Nihilith's ability will not trigger, because the ability references “a card.”"}, {"date": "2021-06-18", "text": "A creature cast using suspend will enter the battlefield with haste. It will have haste until another player gains control of it. (In some rare cases, another player may gain control of the creature spell itself. If this happens, the creature won't enter the battlefield with haste.)"}, {"date": "2021-06-18", "text": "Suspend is a keyword that represents three abilities. The first is a static ability that allows you to exile the card from your hand with the specified number of time counters (the number before the dash) on it by paying its suspend cost (listed after the dash). The second is a triggered ability that removes a time counter from the suspended card at the beginning of each of your upkeeps. The third is a triggered ability that causes you to cast the card when the last time counter is removed. If you cast a creature spell this way, it gains haste until you lose control of that creature (or, in rare cases, you lose control of the creature spell while it's on the stack)."}, {"date": "2021-06-18", "text": "You can exile a card in your hand using suspend any time you could cast that card. Consider its card type, any effects that modify when you could cast it (such as flash) and any other effects that stop you from casting it (such as from Meddling Mage's ability) to determine if and when you can do this. Whether you could actually complete all steps in casting the card is irrelevant. For example, you can exile a card with suspend that has no mana cost or that requires a target even if no legal targets are available at that time."}, {"date": "2021-06-18", "text": "Cards exiled with suspend are exiled face up."}, {"date": "2021-06-18", "text": "Exiling a card with suspend isn't casting that card. This action doesn't use the stack and can't be responded to."}, {"date": "2021-06-18", "text": "If the spell requires any targets, those targets are chosen when the spell is finally cast, not when it's exiled."}, {"date": "2021-06-18", "text": "If an effect refers to a “suspended card,” that means a card that (1) has suspend, (2) is in exile, and (3) has one or more time counters on it."}, {"date": "2021-06-18", "text": "If the first triggered ability of suspend (the one that removes time counters) is countered, no time counter is removed. The ability will trigger again at the beginning of the card's owner's next upkeep."}, {"date": "2021-06-18", "text": "When the last time counter is removed, the second triggered ability of suspend (the one that lets you cast the card) triggers. It doesn't matter why the last time counter was removed or what effect removed it."}, {"date": "2021-06-18", "text": "If the second triggered ability is countered, the card can't be cast. It remains exiled with no time counters on it, and it's no longer suspended."}, {"date": "2021-06-18", "text": "As the second triggered ability resolves, you must cast the card if able. You must do so even if it requires targets and the only legal targets are ones that you really don't want to target. Timing permissions based on the card's type are ignored."}, {"date": "2021-06-18", "text": "If you can't cast the card, perhaps because there are no legal targets available, it remains exiled with no time counters on it, and it's no longer suspended."}, {"date": "2021-06-18", "text": "If you cast a card “without paying its mana cost,” such as with suspend, you can't choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those if you want to cast the card."}, {"date": "2021-06-18", "text": "You are never forced to activate mana abilities to pay costs, so if there is a mandatory additional mana cost (such as from Thalia, Guardian of Thraben), you can decline to activate mana abilities to pay for it and hence fail to cast the suspended card, leaving it in exile."}, {"date": "2021-06-18", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2021-06-18", "text": "The mana value of a spell cast without paying its mana cost is determined by its mana cost, even though that cost wasn't paid."}], "setCode": "FUT", "subtypes": ["Horror"], "supertypes": [], "text": "Fear (This creature can't be blocked except by artifact creatures and/or black creatures.)\nSuspend 7—{1}{B} (Rather than cast this card from your hand, you may pay {1}{B} and exile it with seven time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost. It has haste.)\nWhenever a card is put into an opponent's graveyard from anywhere, if Nihilith is suspended, you may remove a time counter from Nihilith.", "toughness": "4", "type": "Creature — Horror", "types": ["Creature"], "uuid": "c309fc53-571c-5e03-b81b-b0a9805ab77b"}