{"artist": "Grzegorz Rutkowski", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 3.0, "edhrecRank": 5768, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 484730, "name": "Nikara die Höhlenplünderin", "text": "Partner von Yannik, plündernder Wächter (Wenn diese Kreatur ins Spiel kommt, kann ein Spieler deiner Wahl Yannik aus seiner Bibliothek auf seine Hand nehmen und danach mischen.)\nBedrohlich\nImmer wenn eine andere Kreatur, die du kontrollierst, das Spiel verlässt und falls mindestens eine Marke auf ihr lag, ziehst du eine Karte und verlierst 1 Lebenspunkt.", "type": "Legendäre Kreatur — Mensch, Kleriker"}, {"language": "Spanish", "multiverseId": 484750, "name": "Nikara, saqueadora de guaridas", "text": "Camarada de Yánnik, centinela saqueadora (Cuando esta criatura entre al campo de batalla, el jugador objetivo puede poner a Yánnik en su mano desde su biblioteca y luego barajar.)\nAmenaza.\nSiempre que otra criatura que controlas deje el campo de batalla, si tenía uno o más contadores sobre ella, robas una carta y pierdes 1 vida.", "type": "Criatura legendaria — Clérigo humano"}, {"language": "French", "multiverseId": 484770, "name": "Nikara, charognarde des tanières", "text": "Partenariat avec Yannik, sentinelle nécrophage (Quand cette créature arrive sur le champ de bataille, le joueur ciblé peut mettre Yannik dans sa main depuis sa bibliothèque, puis mélanger.)\nMenace\nÀ chaque fois qu'une autre créature que vous contrôlez quitte le champ de bataille, si elle avait au moins un marqueur sur elle, vous piochez une carte et vous perdez 1 point de vie.", "type": "Créature légendaire : humain et clerc"}, {"language": "Italian", "multiverseId": 484790, "name": "Nikara, Predona delle Tane", "text": "Partner di Yannik, Sentinella Predatrice (Quando questa creatura entra nel campo di battaglia, un giocatore bersaglio può aggiungere Yannik alla sua mano dal suo grimorio, poi rimescolare.)\nMinacciare\nOgniqualvolta un'altra creatura che controlli lascia il campo di battaglia, se aveva uno o più segnalini, peschi una carta e perdi 1 punto vita.", "type": "Creatura Leggendaria — Chierico Umano"}, {"language": "Japanese", "multiverseId": 484810, "name": "巣穴あさり、ニカーラ", "text": "物あさりの見張り役、ヤーンニックとの共闘（このクリーチャーが戦場に出たとき、プレイヤー１人を対象とする。そのプレイヤーは「自分のライブラリーから物あさりの見張り役、ヤーンニックを自分の手札に加え、その後切り直す。」を選んでもよい。）\n威迫\n他の、あなたがコントロールしているクリーチャーが１体戦場を離れるたび、それの上にカウンターが１個以上置かれていた場合、あなたはカードを１枚引き、あなたは１点のライフを失う。", "type": "伝説のクリーチャー — 人間・クレリック"}, {"language": "Portuguese (Brazil)", "multiverseId": 484830, "name": "Nikara, Necrófaga dos Covis", "text": "Parceira de Yannik, Sentinela Necrófaga (Quando esta criatura entra no campo de batalha, o jogador alvo pode colocar Yannik na própria mão do próprio grimório e, em seguida, embaralhar.)\nAmeaçar\nToda vez que outra criatura que você controla deixa o campo de batalha, se ela tinha um ou mais marcadores, você compra um card e perde 1 ponto de vida.", "type": "Criatura Lendária — Humano Clérigo"}, {"language": "Russian", "multiverseId": 484850, "name": "Никара, Обирающая Гнезда", "text": "Партнер с Янником, Сторожевым Грабителем (Когда это существо выходит на поле битвы, целевой игрок может положить Янника в свою руку из своей библиотеки, затем перетасовать ее.)\nУгроза\nКаждый раз, когда другое существо под вашим контролем покидает поле битвы, если на нем был один или несколько жетонов, то вы берете карту и теряете 1 жизнь.", "type": "Легендарное Существо — Человек Священник"}], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "233242", "cardKingdomId": "232320", "cardsphereId": "66380", "mcmId": "452358", "mtgjsonV4Id": "52f26724-0c4c-5f36-80d6-5c496a9db68d", "mtgoId": "80729", "multiverseId": "484710", "scryfallId": "00b9ac91-51e4-4653-ac2a-da166a894f2a", "scryfallIllustrationId": "224b31fb-21e9-4de8-a0c2-7cc60217e714", "scryfallOracleId": "2a2376b8-6962-4f9e-ba36-fd7de87dc77d", "tcgplayerProductId": "212202"}, "isStarter": true, "keywords": ["Menace", "Partner", "Partner with"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}", "manaValue": 3.0, "name": "Nikara, Lair Scavenger", "number": "3", "originalText": "Partner with Yannik, Scavenging Sentinel (When this creature enters the battlefield, target player may put Yannik into their hand from their library, then shuffle.)\nMenace\nWhenever another creature you control leaves the battlefield, if it had one or more counters on it, you draw a card and you lose 1 life.", "originalType": "Legendary Creature — Human Cleric", "power": "2", "printings": ["C20"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/04bf1d0001e8c491", "cardKingdomFoil": "https://mtgjson.com/links/d5562c499d1597af", "tcgplayer": "https://mtgjson.com/links/71fc977a5716c0c5"}, "rarity": "mythic", "rulings": [{"date": "2020-04-17", "text": "Nikara’s last ability causes you to draw only one card and lose only 1 life, no matter how many counters or kinds of counters that creature had on it."}, {"date": "2020-04-17", "text": "If a creature with +1/+1 counters on it receives an equal number of -1/-1 counters and this causes it to be destroyed by lethal damage or put into its owner’s graveyard for having 0 or less toughness, Nikara’s last ability triggers. That’s because the ability checks the creature as it last existed on the battlefield, and it still had those counters on it at that point."}, {"date": "2020-04-17", "text": "If a creature with counters on it leaves the battlefield at the same time as Nikara, Nikara’s ability triggers for that creature."}, {"date": "2020-04-17", "text": "“Partner with [name]” represents two abilities. The first is a triggered ability: “When this permanent enters the battlefield, target player may search their library for a card named [name], reveal it, put it into their hand, then shuffle their library.”"}, {"date": "2020-04-17", "text": "Note that the target player searches their library (which may be affected by effects such as that of Stranglehold) and that the card they find is revealed, even though these words aren’t included in the ability’s reminder text."}, {"date": "2020-04-17", "text": "The second ability represented by the “partner with [name]” keyword modifies the rules for deck construction in the Commander variant and has no function outside of that variant. If a legendary creature card with “partner with [name]” is designated as your commander, the named legendary creature card can also be designated as your commander."}, {"date": "2020-04-17", "text": "If your Commander deck has two commanders, you can only include cards whose own color identities are also found in your commanders’ combined color identities. If Haldan and Pako are your commanders, your deck may contain cards with blue, red, and/or green in their color identity, but not cards with white or black."}, {"date": "2020-04-17", "text": "Both commanders start in the command zone, and the remaining 98 cards of your deck are shuffled to become your library."}, {"date": "2020-04-17", "text": "A creature with a “partner with” ability can’t partner with any creature other than its designated partner. Losing a partner ability during the game doesn’t cause either to cease to be your commander."}, {"date": "2020-04-17", "text": "Once the game begins, your two commanders are tracked separately. If you cast one, you won’t have to pay an additional {2} the first time you cast the other. A player loses the game after having been dealt 21 damage from one of them, not from both of them combined. Command Beacon’s effect puts one into your hand from the command zone, not both."}, {"date": "2020-04-17", "text": "The triggered ability of the “partner with” keyword still triggers in a Commander game. If your other commander has somehow ended up in your library, you can find it. You can also target another player who might have that card in their library."}, {"date": "2020-04-17", "text": "If Yannik leaves the battlefield before its triggered ability resolves, you won’t exile any creature you control. Yannik’s reflexive triggered ability won’t trigger."}, {"date": "2020-04-17", "text": "Auras attached to the exiled creature will be put into their owners’ graveyards. Any Equipment will become unattached and remain on the battlefield. Any counters on the exiled creature will cease to exist. When the card returns to the battlefield, it will be a new object with no connection to the card that was exiled."}, {"date": "2020-04-17", "text": "If a token is exiled this way, it will cease to exist and won’t return to the battlefield. It will still let the ability distribute counters."}, {"date": "2020-04-17", "text": "Yannik’s triggered ability doesn’t target the creature you control. That creature is chosen as the triggered ability resolves. After it’s exiled, the reflexive triggered ability triggers and targets are chosen to receive the counters."}, {"date": "2020-04-17", "text": "Use the power of the creature as it last existed on the battlefield to determine how many +1/+1 counters to distribute."}, {"date": "2020-04-17", "text": "You choose how the counters will be distributed as you put the reflexive triggered ability onto the stack. Each target creature must be assigned at least one counter."}, {"date": "2020-04-17", "text": "You may choose zero target creatures for Yannik’s reflexive triggered ability. If you do, no creature receives +1/+1 counters."}, {"date": "2020-04-17", "text": "If one of the target creatures becomes an illegal target in response to the reflexive triggered ability, the +1/+1 counters that would have been put on that creature are lost. They can’t be put on another legal target."}, {"date": "2020-04-17", "text": "Yannik can be the target of its own reflexive triggered ability."}], "securityStamp": "oval", "setCode": "C20", "subtypes": ["Human", "Cleric"], "supertypes": ["Legendary"], "text": "Partner with Yannik, Scavenging Sentinel (When this creature enters the battlefield, target player may put Yannik into their hand from their library, then shuffle.)\nMenace\nWhenever another creature you control leaves the battlefield, if it had one or more counters on it, you draw a card and you lose 1 life.", "toughness": "2", "type": "Legendary Creature — Human Cleric", "types": ["Creature"], "uuid": "ca349d4d-57be-5383-a448-1bc9e66986b8"}