{"artist": "Caio Monteiro", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 8824, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 495689, "name": "Geschickter Fallensucher", "text": "Der Geschickte Fallensucher kann nicht geblockt werden, falls in diesem Zug ein anderer Kleriker, Krieger, Räuber oder Zauberer unter deiner Kontrolle ins Spiel gekommen ist.\nZu Beginn des Kampfes in deinem Zug und falls du eine vollständige Abenteurergruppe hast, erhalten Kreaturen, die du kontrollierst, bis zum Ende des Zuges „Immer wenn diese Kreatur einem Spieler Kampfschaden zufügt, ziehe eine Karte.\"", "type": "Kreatur — Mensch, Räuber"}, {"language": "French", "multiverseId": 495764, "name": "Pistrappeur agile", "text": "Le Pistrappeur agile ne peut pas être bloqué si vous avez fait arriver un autre clerc, gredin, guerrier ou sorcier sur le champ de bataille sous votre contrôle ce tour-ci.\nAu début du combat pendant votre tour, si vous avez un groupe complet, les créatures que vous contrôlez acquièrent « À chaque fois que cette créature inflige des blessures de combat à un joueur, piochez une carte » jusqu'à la fin du tour.", "type": "Créature : humain et gredin"}, {"language": "Japanese", "multiverseId": 495839, "name": "敏捷な罠探し", "text": "あなたがこのターンに他のウィザードやクレリックや戦士やならず者をあなたのコントロール下で戦場に出していたなら、敏捷な罠探しはブロックされない。\nあなたのターンの戦闘の開始時に、あなたのパーティーが全員そろっている場合、ターン終了時まで、あなたがコントロールしているクリーチャーは「このクリーチャーがプレイヤー１人に戦闘ダメージを与えるたび、カードを１枚引く。」を得る。", "type": "クリーチャー — 人間・ならず者"}], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "237569", "cardKingdomId": "237441", "cardsphereId": "71235", "mcmId": "496850", "mcmMetaId": "317220", "mtgjsonV4Id": "4d9ae083-1161-5afb-9e69-9d52595ced74", "multiverseId": "495614", "scryfallId": "ccdc085a-8d97-45fe-86bf-2f4783ebf65e", "scryfallIllustrationId": "4b45861d-7382-4757-8d5b-64c993778360", "scryfallOracleId": "e95a9488-3f86-4598-9c6e-6b1b959f8570", "tcgplayerProductId": "222201"}, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Nimble Trapfinder", "number": "332", "originalText": "Nimble Trapfinder can't be blocked if you had another Cleric, Rogue, Warrior, or Wizard enter the battlefield under your control this turn.\nAt the beginning of combat on your turn, if you have a full party, creatures you control gain \"Whenever this creature deals combat damage to a player, draw a card\" until end of turn.", "originalType": "Creature — Human Rogue", "power": "2", "printings": ["PRM", "PZNR", "ZNR"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6b6c9177f063a26b", "cardKingdomFoil": "https://mtgjson.com/links/55d378eac05510a2", "cardmarket": "https://mtgjson.com/links/ae1d24ac642cf6f6", "tcgplayer": "https://mtgjson.com/links/16163716edbe64b6"}, "rarity": "rare", "rulings": [{"date": "2020-09-25", "text": "Nimble Trapfinder’s first ability checks only whether a permanent entered the battlefield under your control earlier in the turn and had one of the party creature types as it entered. It doesn’t apply if an entering object gained the type later in the turn. It does apply if the entering object left your control since. It doesn’t matter whether Nimble Trapfinder was under your control as that object entered."}, {"date": "2020-09-25", "text": "Nimble Trapfinder’s second ability affects only creatures you control at the time it resolves. Creatures you begin to control later in the turn won’t get the triggered ability."}, {"date": "2020-09-25", "text": "After Nimble Trapfinder’s second ability has resolved, creatures you control keep the triggered ability for the turn even if you no longer have a full party later in the turn."}, {"date": "2020-09-25", "text": "To determine “the number of creatures in your party,” check whether you control a Cleric, whether you control a Rogue, whether you control a Warrior, and whether you control a Wizard. The number is the total number of those checks to which you answered yes. Each creature you control can be counted for only one of those checks."}, {"date": "2020-09-25", "text": "If a creature has more than one party creature type, and there are multiple ways to count that creature that could result in a different number of creatures in your party, the highest such number is used. For example, if you control a Cleric and a Cleric Wizard, the number of creatures in your party is two. You can’t choose to have it be just one by counting the Cleric Wizard first as a Cleric."}, {"date": "2020-09-25", "text": "An ability referring to the number of creatures in your party gets a number from zero to four. Such abilities never ask which creatures are in your party, and you never have to designate specific creatures as being in your party. You can’t choose to exclude creatures from this count to lower the number."}, {"date": "2020-09-25", "text": "Some cards refer to you having a “full party.” This is true if the number of creatures in your party is four."}], "securityStamp": "oval", "setCode": "ZNR", "subtypes": ["Human", "Rogue"], "supertypes": [], "text": "Nimble Trapfinder can't be blocked if you had another Cleric, Rogue, Warrior, or Wizard enter the battlefield under your control this turn.\nAt the beginning of combat on your turn, if you have a full party, creatures you control gain \"Whenever this creature deals combat damage to a player, draw a card\" until end of turn.", "toughness": "1", "type": "Creature — Human Rogue", "types": ["Creature"], "uuid": "0c5b0732-dd62-5b88-88f7-ffc5f2bef530", "variations": ["3f65c9b3-fedc-58e5-854b-1bb5c5c77977"]}