{"artist": "Karl Kopinski", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 2.0, "edhrecRank": 1879, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 231232, "name": "Todesmantel der Nim", "text": "Die ausgerüstete Kreatur erhält +2/+2 sowie Einschüchtern und ist ein schwarzer Zombie.\nImmer wenn eine Kreatur, die kein Spielstein ist, aus dem Spiel auf deinen Friedhof gelegt wird, kannst du {4} bezahlen. Falls du dies tust, bringe diese Karte ins Spiel zurück und lege den Todesmantel der Nim an sie an.\nAusrüsten {4}", "type": "Artefakt — Ausrüstung"}, {"language": "Spanish", "multiverseId": 232726, "name": "Manto mortal nim", "text": "La criatura equipada obtiene +2/+2, tiene la habilidad de intimidar y es un Zombie negro.\nSiempre que una criatura que no sea ficha vaya a tu cementerio desde el campo de batalla, puedes pagar {4}. Si lo haces, regresa esa carta al campo de batalla y anéxale el Manto mortal nim.\nEquipar {4}.", "type": "Artefacto — Equipo"}, {"language": "French", "multiverseId": 231979, "name": "Capote de mort des nims", "text": "La créature équipée gagne +2/+2, elle a l'intimidation et c'est un zombie noir.\nÀ chaque fois qu'une créature non-jeton est mise dans votre cimetière depuis le champ de bataille, vous pouvez payer {4}. Si vous faites ainsi, renvoyez cette carte sur le champ de bataille et attachez-lui la Capote de mort des nims.\nÉquipement {4}", "type": "Artefact : équipement"}, {"language": "Italian", "multiverseId": 232975, "name": "Mantoletale dei Nim", "text": "La creatura equipaggiata prende +2/+2, ha intimidire ed è uno Zombie nero.\nOgniqualvolta una creatura non pedina viene messa nel tuo cimitero dal campo di battaglia, puoi pagare {4}. Se lo fai, rimetti sul campo di battaglia quella carta e assegnale il Mantoletale dei Nim.\nEquipaggiare {4}", "type": "Artefatto — Equipaggiamento"}, {"language": "Japanese", "multiverseId": 231730, "name": "屍賊の死のマント", "text": "装備しているクリーチャーは＋２/＋２の修整を受けるともに威嚇を持ち、黒のゾンビである。\nトークンでないクリーチャーが１体戦場からあなたの墓地に置かれるたび、あなたは{4}を支払ってもよい。 そうした場合、そのカードを戦場に戻し、屍賊の死のマントをそれにつける。\n装備 {4}", "type": "アーティファクト — 装備品"}, {"language": "Portuguese (Brazil)", "multiverseId": 230983, "name": "Manto de Morte dos Nim", "text": "A criatura equipada recebe +2/+2, tem intimidar e é um Zumbi preto.\nToda vez que uma criatura que não seja uma ficha é colocada num cemitério vinda do jogo, você pode pagar {4}. Se fizer isso, devolva aquele card ao campo de batalha e anexe Manto de Morte dos Nim a ele.\nEquipar {4}", "type": "Artefato — Equipamento"}, {"language": "Russian", "multiverseId": 231481, "name": "Нимская Оболочка Смерти", "text": "Снаряженное существо получает +2/+2, имеет Устрашение и является черным Зомби.\nКаждый раз когда не являющееся фишкой существо попадает на ваше кладбище с поля битвы, вы можете заплатить {4}. Если вы это делаете, верните ту карту на поле битвы и прикрепите к ней Нимскую Оболочку Смерти.\nСнарядить {4}", "type": "Артефакт — Снаряжение"}, {"language": "Chinese Simplified", "multiverseId": 232477, "name": "泞族亡者头罩", "text": "佩带此武具的生物得+2/+2，具有威吓异能，且是黑色的灵俑。\n每当一个非衍生物的生物从战场进入你的坟墓场时，你可以支付{4}。 若你如此作，将该牌返回战场，并将泞族亡篷装备于其上。\n佩带{4}", "type": "神器～武具"}, {"language": "Chinese Traditional", "multiverseId": 232228, "name": "濘族亡者頭罩", "text": "佩帶此武具的生物得+2/+2，具有威嚇異能，且是黑色的殭屍。\n每當一個非衍生物的生物從戰場進入你的墳墓場時，你可以支付{4}。 若你如此作，將該牌返回戰場，並將濘族亡者頭罩裝備於其上。\n佩帶{4}", "type": "神器～武具"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "132499", "cardKingdomId": "132265", "cardsphereId": "40512", "mcmId": "242681", "mcmMetaId": "200786", "mtgjsonV4Id": "1e71139b-ca46-501d-a044-9cad24d419bf", "mtgoFoilId": "38286", "mtgoId": "38285", "multiverseId": "209289", "scryfallId": "f638bd96-8424-461f-87bf-4b7a7153fd35", "scryfallIllustrationId": "aa97c1f0-c071-441d-a59d-915e7d953f89", "scryfallOracleId": "66d41377-626d-4ae6-ba86-17bf0c8b3362", "tcgplayerProductId": "36519"}, "keywords": ["Equip"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}", "manaValue": 2.0, "name": "Nim Deathmantle", "number": "188", "originalText": "Equipped creature gets +2/+2, has intimidate, and is a black Zombie.\nWhenever a nontoken creature is put into your graveyard from the battlefield, you may pay {4}. If you do, return that card to the battlefield and attach Nim Deathmantle to it.\nEquip {4}", "originalType": "Artifact — Equipment", "printings": ["2X2", "SOM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7dae2051d1602ed0", "cardKingdomFoil": "https://mtgjson.com/links/16453225810e03cc", "cardmarket": "https://mtgjson.com/links/84c18a03eafe99c7", "tcgplayer": "https://mtgjson.com/links/f8ad30ea83699cff"}, "rarity": "rare", "rulings": [{"date": "2011-01-01", "text": "Once Nim Deathmantle returns a card from your graveyard to the battlefield, it will remain on the battlefield indefinitely, even if Nim Deathmantle becomes unattached from it."}, {"date": "2011-01-01", "text": "Nim Deathmantle’s color-changing and type-changing effects override the equipped creature’s previous colors and creature types. After Nim Deathmantle becomes equipped to a creature, that creature will be a black Zombie, not any other colors or creature types."}, {"date": "2011-01-01", "text": "Nim Deathmantle causes the equipped creature to be a black Zombie even if it didn’t return that creature to the battlefield from the graveyard."}, {"date": "2011-01-01", "text": "Once Nim Deathmantle becomes unattached from a creature, its color-changing and type-changing effects stop affecting that creature. The creature will no longer be black and will no longer be a Zombie (unless its printed characteristics or some other effects still cause it to be black and/or a Zombie, of course). This is true even if Nim Deathmantle returned that creature to the battlefield from the graveyard."}, {"date": "2011-01-01", "text": "You choose whether to pay {4} as Nim Deathmantle’s second ability resolves. Although players may respond to this ability, once it begins to resolve and you decide whether to pay, it’s too late for players to respond."}, {"date": "2011-01-01", "text": "If the nontoken creature that caused Nim Deathmantle’s second ability to trigger is somehow removed from your graveyard before that ability resolves, you may still pay {4} as it resolves. Even if you do, however, no card will be returned to the battlefield."}, {"date": "2011-01-01", "text": "Nim Deathmantle’s second ability may return a card it can’t equip to the battlefield. For example, if a nontoken artifact that’s become a creature is put into your graveyard from the battlefield, Nim Deathmantle’s second ability triggers. If you pay {4} as it resolves, you’ll return that card to the battlefield. However, Nim Deathmantle can’t equip it, so Nim Deathmantle remains attached to whatever it was already equipping (or, if it was unattached, it remains so). The same is true if a nontoken creature with protection from artifacts is put into your graveyard from the battlefield, for example."}, {"date": "2011-01-01", "text": "If multiple nontoken creatures are put into your graveyard from the battlefield at the same time, Nim Deathmantle’s second ability triggers that many times. You put the triggered abilities on the stack in any order, so you’ll determine in which order they resolve. If you pay {4} more than once, each card you paid {4} for will end up on the battlefield under your control, and Nim Deathmantle will end up attached to the last card that returned to the battlefield this way that it could equip."}], "setCode": "SOM", "subtypes": ["Equipment"], "supertypes": [], "text": "Equipped creature gets +2/+2, has intimidate, and is a black Zombie. (A creature with intimidate can't be blocked except by artifact creatures and/or creatures that share a color with it.)\nWhenever a nontoken creature is put into your graveyard from the battlefield, you may pay {4}. If you do, return that card to the battlefield and attach Nim Deathmantle to it.\nEquip {4}", "type": "Artifact — Equipment", "types": ["Artifact"], "uuid": "25065b4f-42ba-5fe5-870f-e0a50d8e2ae0", "watermark": "mirran"}