{"artist": "David Rapoza", "availability": ["arena", "mtgo", "paper"], "borderColor": "borderless", "colorIdentity": ["B", "G"], "colors": ["B", "G"], "convertedManaCost": 4.0, "edhrecRank": 2785, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 495158, "name": "Nissa von den schattigen Ästen", "text": "Landung — Immer wenn ein Land unter deiner Kontrolle ins Spiel kommt, lege eine Loyalitätsmarke auf Nissa von den schattigen Ästen.\n+1: Enttappe ein Land deiner Wahl, das du kontrollierst. Du kannst es bis zum Ende des Zuges zu einer 3/3 Elementarwesen-Kreatur mit Eile und Bedrohlichkeit werden lassen. Es ist immer noch ein Land.\n−5: Du kannst eine Kreaturenkarte mit umgewandelten Manakosten kleiner oder gleich der Anzahl an Ländern, die du kontrollierst, mit zwei zusätzlichen +1/+1-Marken aus deiner Hand oder aus deinem Friedhof ins Spiel bringen.", "type": "Legendärer Planeswalker — Nissa"}, {"language": "Spanish", "multiverseId": 495161, "name": "Nissa de las Ramas Sombrías", "text": "Aterrizaje — Siempre que una tierra entre al campo de batalla bajo tu control, pon un contador de lealtad sobre Nissa de las Ramas Sombrías.\n+1: Endereza la tierra objetivo que controlas. Puedes hacer que se convierta en una criatura Elemental 3/3 con las habilidades de prisa y amenaza hasta el final del turno. Sigue siendo una tierra.\n−5: Puedes poner en el campo de batalla de tu mano o cementerio una carta de criatura con coste de maná convertido menor o igual que la cantidad de tierras que controlas con dos contadores +1/+1 sobre ella.", "type": "Planeswalker legendario — Nissa"}, {"language": "French", "multiverseId": 495164, "name": "Nissa des branches enténébrées", "text": "Toucheterre — À chaque fois qu'un terrain arrive sur le champ de bataille sous votre contrôle, mettez un marqueur « loyauté » sur Nissa des branches enténébrées.\n+1: Dégagez un terrain ciblé que vous contrôlez. Vous pouvez faire qu'il devienne une créature 3/3 Élémental avec la célérité et la menace jusqu'à la fin du tour. C'est toujours un terrain.\n-5: Vous pouvez mettre sur le champ de bataille une carte de créature avec un coût converti de mana inférieur ou égal au nombre de terrains que vous contrôlez de votre main ou de votre cimetière avec deux marqueurs +1/+1 sur elle.", "type": "Planeswalker légendaire : Nissa"}, {"language": "Italian", "multiverseId": 495167, "name": "Nissa delle Fronde Ombrose", "text": "Terraferma — Ogniqualvolta una terra entra nel campo di battaglia sotto il tuo controllo, metti un segnalino fedeltà su Nissa delle Fronde Ombrose.\n+1: STAPpa una terra bersaglio che controlli. Puoi farla diventare una creatura Elementale 3/3 con rapidità e minacciare fino alla fine del turno. È ancora una terra.\n-5: Puoi mettere sul campo di battaglia dalla tua mano o dal tuo cimitero una carta creatura con costo di mana convertito pari o inferiore al numero di terre che controlli con due segnalini +1/+1.", "type": "Planeswalker Leggendario — Nissa"}, {"language": "Japanese", "multiverseId": 495170, "name": "影さす太枝のニッサ", "text": "上陸 ― 土地が１つあなたのコントロール下で戦場に出るたび、影さす太枝のニッサの上に忠誠カウンターを１個置く。\n+1：あなたがコントロールしている土地１つを対象とする。それをアンタップする。あなたは「ターン終了時まで、それは速攻と威迫を持つ３/３のエレメンタル・クリーチャーになる。それは土地でもある。」を選んでもよい。\n-5：あなたはあなたの手札かあなたの墓地から、点数で見たマナ・コストがあなたがコントロールしている土地の総数以下であるクリーチャー・カード１枚を、＋１/＋１カウンターが２個置かれた状態で戦場に出してもよい。", "type": "伝説のプレインズウォーカー — ニッサ"}, {"language": "Korean", "multiverseId": 495173, "name": "그늘진 가지의 니사", "text": "대지력 — 대지가 당신의 조종하에 전장에 들어올 때마다, 그늘진 가지의 니사에 충성 카운터 한 개를 올려놓는다.\n+1: 당신이 조종하는 대지를 목표로 정한다. 그 대지를 언탭한다. 당신은 턴종료까지 그 대지가 신속 및 호전적을 가진 3/3 정령 생물이 되게 할 수 있다. 그 생물은 여전히 대지다.\n−5: 당신은 당신의 손 또는 무덤에서 전환마나비용이 당신이 조종하는 대지의 수 이하인 생물 카드 한 장에 +1/+1 카운터 두 개를 올려놓고 전장에 놓을 수 있다.", "type": "전설적 플레인즈워커 — 니사"}, {"language": "Portuguese (Brazil)", "multiverseId": 495176, "name": "Nissa dos Ramos Umbrosos", "text": "Aterragem — Toda vez que um terreno entrar no campo de batalha sob seu controle, coloque um marcador de lealdade em Nissa dos Ramos Umbrosos.\n+1: Desvire o terreno alvo que você controla. Você pode fazer com que ele se torne uma criatura 3/3 do tipo Elemental com ímpeto e ameaçar até o final do turno. Ela ainda é um terreno.\n−5: Você pode colocar um card de criatura com custo de mana convertido igual ou inferior ao número de terrenos que você controla no campo de batalha de sua mão ou cemitério com dois marcadores +1/+1.", "type": "Planeswalker Lendário — Nissa"}, {"language": "Russian", "multiverseId": 495179, "name": "Нисса Тенистых Ветвей", "text": "Землепад — Каждый раз, когда земля выходит на поле битвы под вашим контролем, положите один жетон верности на Ниссу Тенистых Ветвей.\n+1: разверните целевую землю под вашим контролем. Вы можете заставить ее стать существом 3/3 Элементаль с Ускорением и Угрозой до конца хода. При этом она остается землей.\n−5: вы можете положить из вашей руки или из вашего кладбища карту существа с конвертированной мана-стоимостью, не превышающей число земель под вашим контролем, на поле битвы с двумя дополнительными жетонами +1/+1 на ней.", "type": "Легендарный Planeswalker — Нисса"}, {"language": "Chinese Simplified", "multiverseId": 495182, "name": "郁影林枝妮莎", "text": "地落～每当一个地在你的操控下进战场时，在郁影林枝妮莎上放置一个忠诚指示物。\n+1：重置目标由你操控的地。你可以使它成为3/3，具敏捷与威慑异能的元素生物直到回合结束。它仍然是地。\n−5：你可以将一张总法术力费用等于或小于由你操控之地数量的生物牌从你手上或坟墓场中放进战场，且其上额外有两个+1/+1指示物。", "type": "传奇鹏洛客 ～妮莎"}, {"language": "Chinese Traditional", "multiverseId": 495185, "name": "鬱影林枝妮莎", "text": "地落～每當一個地在你的操控下進戰場時，在鬱影林枝妮莎上放置一個忠誠指示物。\n+1：重置目標由你操控的地。你可以使它成為3/3，具敏捷與威懾異能的元素生物直到回合結束。它仍然是地。\n−5：你可以將一張總魔法力費用等於或小於由你操控之地數量的生物牌從你手上或墳墓場中放進戰場，且其上額外有兩個+1/+1指示物。", "type": "傳奇鵬洛客 ～妮莎"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "237481", "cardKingdomId": "236922", "cardsphereId": "70121", "mcmId": "494649", "mcmMetaId": "315999", "mtgArenaId": "74697", "mtgjsonV4Id": "56fff45b-13a1-58e3-96d7-021e92efecbb", "multiverseId": "495155", "scryfallId": "dabac59d-8319-417e-9cd5-e4ee59b2e5f2", "scryfallIllustrationId": "3e64ba70-1ac4-40ed-9115-9056876d1eeb", "scryfallOracleId": "15e3e226-0dd1-4c9b-a7ec-af67509cbfc5", "tcgplayerProductId": "221781"}, "isStarter": true, "keywords": ["Landfall"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "loyalty": "4", "manaCost": "{2}{B}{G}", "manaValue": 4.0, "name": "Nissa of Shadowed Boughs", "number": "283", "originalText": "Landfall — Whenever a land enters the battlefield under your control, put a loyalty counter on Nissa of Shadowed Boughs.\n+1: Untap target land you control. You may have it become a 3/3 Elemental creature with haste and menace until end of turn. It's still a land.\n−5: You may put a creature card with converted mana cost less than or equal to the number of lands you control onto the battlefield from your hand or graveyard with two +1/+1 counters on it.", "originalType": "Legendary Planeswalker — Nissa", "printings": ["PRM", "PZNR", "ZNR"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/bcf82e4b8a9af638", "cardKingdomFoil": "https://mtgjson.com/links/bdbe5c0c443da0cd", "cardmarket": "https://mtgjson.com/links/fd52ec94d2276492", "tcgplayer": "https://mtgjson.com/links/c4f8f3cddf73cd43"}, "rarity": "mythic", "rulings": [{"date": "2020-09-25", "text": "If a card in a player’s hand or graveyard has {X} in its mana cost, X is considered to be 0."}, {"date": "2020-09-25", "text": "Effects that modify the power or toughness of the land creature without setting it will apply to its new base power and toughness no matter when they started to take effect. The same is true for counters that change its power and toughness."}, {"date": "2020-09-25", "text": "Nissa’s middle ability can target a land that’s already untapped or that’s already a creature."}, {"date": "2020-09-25", "text": "Nissa’s middle ability doesn’t remove any abilities the land creature has."}, {"date": "2020-09-25", "text": "Nissa’s middle ability overwrites any previous effects that set the land creature’s power and/or toughness to specific values. Other effects that set these characteristics to specific values that start to apply after the ability resolves will overwrite that part of the effect."}, {"date": "2020-09-25", "text": "The creature card’s converted mana cost is checked only in your hand or graveyard. You may put a creature card onto the battlefield whose converted mana cost becomes greater than the number of lands you control once it’s on the battlefield, most likely because it enters as a copy of another permanent."}, {"date": "2020-09-25", "text": "A landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability puts a land onto the battlefield under your control."}, {"date": "2020-09-25", "text": "A landfall ability doesn’t trigger if a permanent already on the battlefield becomes a land."}, {"date": "2020-09-25", "text": "Whenever a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one to resolve."}], "securityStamp": "oval", "setCode": "ZNR", "subtypes": ["Nissa"], "supertypes": ["Legendary"], "text": "Landfall — Whenever a land enters the battlefield under your control, put a loyalty counter on Nissa of Shadowed Boughs.\n[+1]: Untap target land you control. You may have it become a 3/3 Elemental creature with haste and menace until end of turn. It's still a land.\n[−5]: You may put a creature card with mana value less than or equal to the number of lands you control onto the battlefield from your hand or graveyard with two +1/+1 counters on it.", "type": "Legendary Planeswalker — Nissa", "types": ["Planeswalker"], "uuid": "e4e1b07e-02b1-5171-b2b0-e0887cfc4f9e", "variations": ["143d09da-3fe5-588d-a004-1e1a6dd69ba1"]}