{"artist": "Brian Despain", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 1.0, "edhrecRank": 18664, "finishes": ["nonfoil", "foil"], "flavorText": "\"There is no shortcut to work done true and well. The Creators learned this to their sorrow, the first time they made the world.\"\n—Githri the Prisoner", "foreignData": [{"flavorText": "„Ehrliche und gute Arbeit kann man nicht beschleunigen. Die Erschaffer mussten das schmerzhaft lernen, als sie zum ersten Mal eine Welt vollbrachten.\" Githri der Gefangene", "language": "German", "multiverseId": 144996, "name": "Ablehnen", "text": "Neutralisiere einen Zauberspruch deiner Wahl, falls kein Mana bezahlt wurde, um ihn zu spielen.", "type": "Spontanzauber"}, {"flavorText": "\"No hay un atajo para el trabajo bien hecho. Los Creadores aprendieron esto a su pesar, la primera vez que crearon el mundo.\"—Githri el prisionero", "language": "Spanish", "multiverseId": 145320, "name": "Nimiedad", "text": "Contrarresta el hechizo objetivo si no se usó maná para jugarlo.", "type": "Instantáneo"}, {"flavorText": "« Il ne peut y avoir de raccourci si l'on veut bien faire son travail. C'est une leçon que les Créateurs ont appris la première fois qu'ils ont façonné le monde. » —Githri le prisonnier", "language": "French", "multiverseId": 145401, "name": "Rien", "text": "Contrecarrez le sort ciblé si aucun mana n'a été dépensé pour le jouer.", "type": "Éphémère"}, {"flavorText": "\"Non ci sono scorciatoie per un lavoro fatto bene e preciso. Perfino i Creatori lo impararono con grande dolore, la prima volta che crearono il mondo.\" —Githri il Prigioniero", "language": "Italian", "multiverseId": 144915, "name": "Nix", "text": "Neutralizza una magia bersaglio se non è stato speso mana per giocarla.", "type": "Istantaneo"}, {"flavorText": "きちんとやるのに近道なんか無いさ。 造物主様も、最初に作った世界にゃ後悔してるだろう。 ――囚人ギスリ", "language": "Japanese", "multiverseId": 145482, "name": "拒否", "text": "呪文１つを対象とする。それをぷれいするためにマナが支払われていない場合、それを打ち消す。", "type": "インスタント"}, {"flavorText": "\"Não há nada que substitua um trabalho feito com cuidado e sinceridade. Para sua tristeza, os criadores aprenderam isso quando fizeram o mundo pela primeira vez.\" Githri o Prisioneiro", "language": "Portuguese (Brazil)", "multiverseId": 145158, "name": "Nix", "text": "Anule a mágica alvo caso nenhum mana tenha sido gasto para jogá-lo.", "type": "Mágica Instantânea"}, {"flavorText": "\"Не существует короткого пути к подлинному мастерству. Творцы осознали эту печальную правду, когда впервые создали мир.\" —Гитри-Узник", "language": "Russian", "multiverseId": 145077, "name": "Ничто", "text": "Отмените целевое заклинание, если на его разыгрывание не было потрачено никакой маны.", "type": "Мгновенное заклинание"}, {"flavorText": "「把事情彻底完成并无捷径。 造物众神对此有痛切领悟，那是在他们初创此世界时。」 ～囚人基兹理", "language": "Chinese Simplified", "multiverseId": 145239, "name": "顽空", "text": "如果目标咒语使用时并未为其支付法术力，则反击之。", "type": "瞬间"}], "frameVersion": "future", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "122572", "cardKingdomId": "122392", "cardsphereId": "18761", "mcmId": "15047", "mcmMetaId": "8976", "mtgjsonV4Id": "b28087d3-1b92-525b-9e42-410c6d8c5a97", "mtgoFoilId": "26917", "mtgoId": "26916", "multiverseId": "130564", "scryfallId": "3dab4f64-2a91-409a-b83b-45b22afd22ff", "scryfallIllustrationId": "a74e0d9b-79df-4973-8cfc-5f633e2cd911", "scryfallOracleId": "fe1a9af0-1774-4d54-b59f-f42dc8afcbe9", "tcgplayerProductId": "14951"}, "isTimeshifted": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{U}", "manaValue": 1.0, "name": "Nix", "number": "55", "originalText": "Counter target spell if no mana was spent to play it.", "originalType": "Instant", "printings": ["FUT"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/219574d42c87a75d", "cardKingdomFoil": "https://mtgjson.com/links/58d4ac687ea091fd", "cardmarket": "https://mtgjson.com/links/d7070509fbe31cac", "tcgplayer": "https://mtgjson.com/links/907626ab0e0f7886"}, "rarity": "rare", "rulings": [{"date": "2007-05-01", "text": "Nix can target any spell. The condition is checked only on resolution."}, {"date": "2007-05-01", "text": "Nix doesn’t check whether a spell’s mana cost is 0. Rather, it checks how much mana was actually spent to cast it. It can counter a spell with mana cost 0 (such as Slaughter Pact), a spell cast via an alternative nonmana cost (such as Allosaurus Rider) or alternative cost of {0} (such as Basking Rootwalla), a spell whose cost to cast it was reduced to 0 (such as Frogmite), a spell cast without paying its cost due to an effect (such as suspend or Mindleech Mass’s ability), or a copy of a spell, among other possibilities. It will not counter a spell that had an additional or alternative mana cost paid to cast it, regardless of that spell’s mana value (such as a face-down spell cast with morph, or an Ornithopter cast while Trinisphere is on the battlefield, for example)."}, {"date": "2007-05-01", "text": "Nix checks whether any player paid mana to cast the spell, not whether its current controller did. If Commandeer is cast on a spell, then Nix is cast on that spell, Nix won’t counter it unless the player who originally cast that spell spent no mana to cast it."}], "setCode": "FUT", "subtypes": [], "supertypes": [], "text": "Counter target spell if no mana was spent to cast it.", "type": "Instant", "types": ["Instant"], "uuid": "d5464d6f-93a2-5f60-943a-3931289663d6"}