{"artist": "Johan Grenier", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 5.0, "edhrecRank": 10512, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "266227", "cardsphereId": "94135", "mtgjsonV4Id": "09a25b0f-7502-5708-814f-d769a7af30e0", "scryfallId": "8b7a1f10-78ce-4341-bf22-d8b85bad4d9c", "scryfallIllustrationId": "5d78ce40-ea03-42cf-bac6-d74d8e881776", "scryfallOracleId": "1f7e85cf-afee-4041-9436-1fb69b4ec292", "tcgplayerProductId": "285799"}, "isAlternative": true, "isStarter": true, "keywords": ["Cascade", "Sonic Blaster"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "paupercommander": "Restricted", "vintage": "Legal"}, "manaCost": "{4}{R}", "manaValue": 5.0, "name": "Noise Marine", "number": "82★", "power": "3", "printings": ["40K"], "promoTypes": ["surgefoil"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/20f27455c14f7417", "tcgplayer": "https://mtgjson.com/links/72edbdb16afb9ad2"}, "rarity": "uncommon", "rulings": [{"date": "2022-10-07", "text": "The spell you cast due to cascade resolves before Noise Marine, so when its enters-the-battlefield ability resolves it will count that spell as a spell you’ve cast this turn."}, {"date": "2022-10-07", "text": "A spell’s mana value is determined only by its mana cost. Ignore any alternative costs, additional costs, cost increases, or cost reductions."}, {"date": "2022-10-07", "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."}, {"date": "2022-10-07", "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."}, {"date": "2022-10-07", "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."}, {"date": "2022-10-07", "text": "You exile the cards face up. All players will be able to see them."}, {"date": "2022-10-07", "text": "If you cast a card “without paying its mana cost,” you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those to cast the card."}, {"date": "2022-10-07", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2022-10-07", "text": "Due to a 2021 rules change to cascade, not only do you stop exiling cards if you exile a nonland card with lesser mana value than the spell with cascade, but the resulting spell you cast must also have lesser mana value. Previously, in cases where a card’s mana value differed from the resulting spell, such as with some modal double-faced cards or cards with an Adventure, you could cast a spell with a higher mana value than the exiled card."}, {"date": "2022-10-07", "text": "Two new cards in this set give the next spell you cast cascade. This means that the next spell you cast gains cascade as you begin to cast it by putting it on the stack, and the cascade ability will trigger when you finish casting that spell."}], "securityStamp": "triangle", "setCode": "40K", "subtypes": ["Astartes", "Warrior"], "supertypes": [], "text": "Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)\nSonic Blaster — When Noise Marine enters the battlefield, it deals damage equal to the number of spells you've cast this turn to any target.", "toughness": "2", "type": "Creature — Astartes Warrior", "types": ["Creature"], "uuid": "f98e40c5-fab9-57ac-bae5-61411181d6ad", "variations": ["76fbd778-c7fa-5ce4-8e44-3eb36b56214b"]}