{"artist": "Izzy", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 7.0, "edhrecRank": 3161, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 217511, "name": "Nicht von dieser Welt", "text": "Neutralisiere einen Zauberspruch oder eine Fähigkeit deiner Wahl, der bzw. die eine bleibende Karte, die du kontrollierst, als Ziel hat.\nNicht von dieser Welt kostet beim Wirken {7} weniger, falls es einen Zauberspruch oder eine Fähigkeit als Ziel hat, der bzw. die eine Kreatur als Ziel hat, die du kontrollierst und die Stärke 7 oder mehr hat.", "type": "Stammesspontanzauber — Eldrazi"}, {"language": "Spanish", "multiverseId": 217263, "name": "De otro mundo", "text": "Contrarresta el hechizo o habilidad objetivo que hace objetivo a un permanente que controlas.\nCuesta {7} menos lanzar De otro mundo si hace objetivo a un hechizo o habilidad que hace objetivo a una criatura que controlas con fuerza de 7 o más.", "type": "Instantáneo tribal — Eldrazi"}, {"language": "French", "multiverseId": 215775, "name": "Pas de ce monde", "text": "Contrecarrez le sort ciblé ou la capacité ciblée qui cible un permanent que vous contrôlez.\nPas de ce monde coûte {7} de moins à lancer s'il cible un sort ou une capacité qui cible une créature que vous contrôlez de force supérieure ou égale à 7.", "type": "Éphémère tribal : eldrazi"}, {"language": "Italian", "multiverseId": 216519, "name": "Non di Questo Mondo", "text": "Neutralizza una magia o abilità bersaglio che bersaglia un permanente che controlli.\nNon di Questo Mondo costa {7} in meno per essere lanciato se bersaglia una magia o abilità che bersaglia una creatura che controlli con forza pari o superiore a 7.", "type": "Istantaneo Tribale — Eldrazi"}, {"language": "Japanese", "multiverseId": 216767, "name": "この世界にあらず", "text": "あなたがコントロールするパーマネントを対象としている、呪文１つか能力１つを対象とし、それを打ち消す。\nこの世界にあらずは、それが対象としている呪文や能力があなたがコントロールするパワーが７以上のクリーチャーを対象としている場合、それを唱えるためのコストが{7}少なくなる。", "type": "部族インスタント — エルドラージ"}, {"language": "Portuguese (Brazil)", "multiverseId": 217015, "name": "Não Deste Mundo", "text": "Anule a mágica ou habilidade alvo que tenha como alvo uma permanente que você controla.\nNão Deste Mundo custa {7} a menos para conjurar se tiver como alvo uma mágica ou habilidade que tenha como alvo uma criatura que você controla com poder maior ou igual a 7.", "type": "Mágica Instantânea Tribal — Eldrazi"}, {"language": "Russian", "multiverseId": 216023, "name": "Не от Мира Сего", "text": "Отмените целевое заклинание или способность, целью которого или которой является перманент под вашим контролем.\nСтоимость разыгрывания Не от Мира Сего уменьшается на {7}, если оно нацелено на заклинание или способность, целью которого или которой является существо под вашим контролем с силой 7 или больше.", "type": "Племенное Мгновенное заклинание — Эльдрази"}, {"language": "Chinese Simplified", "multiverseId": 216271, "name": "异界之物", "text": "反击目标咒语或异能，且它须以由你操控的永久物为目标。\n如果异界之物的目标是以由你操控、且力量为7或更大的生物为目标的咒语或异能，则它便减少{7}来施放。", "type": "部族瞬间～奥札奇"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "130977", "cardKingdomId": "130736", "cardsphereId": "39676", "mcmId": "22508", "mcmMetaId": "11192", "mtgjsonV4Id": "d44fa8dd-cc39-5f54-8f70-d8e7f3689db3", "mtgoFoilId": "36761", "mtgoId": "36760", "multiverseId": "198296", "scryfallId": "569e2c39-7a49-4a3b-afe5-1862a7da8026", "scryfallIllustrationId": "854ffd4e-d66b-47c8-b7a2-48488b24e41d", "scryfallOracleId": "5da5d8a3-009e-4d8a-977e-6ebc73ba2682", "tcgplayerProductId": "34702"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{7}", "manaValue": 7.0, "name": "Not of This World", "number": "8", "originalText": "Counter target spell or ability that targets a permanent you control.\nNot of This World costs {7} less to cast if it targets a spell or ability that targets a creature you control with power 7 or greater.", "originalType": "Tribal Instant — Eldrazi", "printings": ["FMB1", "ROE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/40ddcdd31ccb108a", "cardKingdomFoil": "https://mtgjson.com/links/b258207cc5367076", "cardmarket": "https://mtgjson.com/links/f82df9fb6e213d53", "tcgplayer": "https://mtgjson.com/links/fe5b412741b9006b"}, "rarity": "uncommon", "rulings": [{"date": "2010-06-15", "text": "The spell or ability you target with Not of This World may have any number of targets, as long as one of them is a permanent you control."}, {"date": "2010-06-15", "text": "Not of This World’s first ability checks the current state of the targets of the spell or ability it’s targeting to determine whether one of them is a permanent you control. For example, say a player casts Forked Bolt targeting you and a creature you control. If, in response, another spell or ability causes that creature to no longer be under your control, then you can’t cast Not of This World targeting Forked Bolt. Alternately, if you cast Not of This World targeting Forked Bolt and, in response, another spell or ability causes that creature to no longer be under your control, Not of This World won’t resolve when it tries to resolve for having an illegal target."}, {"date": "2010-06-15", "text": "Not of This World’s second ability checks the current state of the targets of the spell or ability it’s targeting to determine whether one of them is a creature you control with power 7 or greater. This check is made as you cast Not of This World, before you activate mana abilities. It doesn’t matter what the power of the creature was at the time the targeted spell or ability was cast."}, {"date": "2010-06-15", "text": "Not of This World doesn’t check whether the targets of the spell or ability it’s targeting are currently legal for that spell or ability, only who controls them and what their power is. For example, say a player casts Forked Bolt targeting you and a creature you control. If, in response, another spell or ability causes that creature to gain shroud, then you can still cast Not of This World targeting Forked Bolt."}, {"date": "2010-06-15", "text": "If a spell or ability targets you, but not a permanent you control, you can’t cast Not of This World targeting it."}], "setCode": "ROE", "subtypes": ["Eldrazi"], "supertypes": [], "text": "Counter target spell or ability that targets a permanent you control.\nThis spell costs {7} less to cast if it targets a spell or ability that targets a creature you control with power 7 or greater.", "type": "Tribal Instant — Eldrazi", "types": ["Tribal", "Instant"], "uuid": "1c047837-e79f-52bc-8d48-3938e4ddacaa"}