{"artist": "Kieran Yanner", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 3.0, "edhrecRank": 5465, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "6ece3ebc-fd01-5012-95ff-b12ba08441ab", "mtgoId": "86298", "scryfallId": "3ebd3f42-e183-4729-84e5-22c706db4a91", "scryfallIllustrationId": "26446e28-3dd7-4611-852c-32fe8b97189d", "scryfallOracleId": "7f4aa98d-3572-4637-9b0d-3c12f63a96ec"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Partner"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "paupercommander": "Restricted", "vintage": "Legal"}, "manaCost": "{2}{G}", "manaValue": 3.0, "name": "Numa, Joraga Chieftain", "number": "86298", "originalReleaseDate": "2020-12-15", "power": "2", "printings": ["CMR", "KHC", "PRM"], "purchaseUrls": {}, "rarity": "uncommon", "rulings": [{"date": "2020-11-10", "text": "Numa’s triggered ability goes on the stack without a target. While that ability is resolving, you may pay {X}{X}. If you do, a second ability triggers. You choose the target Elves and announce how the +1/+1 counters will be distributed as you put that ability on the stack. Each target must receive at least one +1/+1 counter. This is different from abilities that say “If you do . . .” in that players may cast spells and activate abilities after mana is paid but before counters are placed."}, {"date": "2020-11-10", "text": "If some of the creatures are illegal targets as the reflexive triggered ability tries to resolve, the original distribution of counters still applies and the counters that would have been put on illegal targets are lost."}, {"date": "2020-11-10", "text": "If your Commander deck has two commanders, you can only include cards whose own color identities are also found in your commanders’ combined color identities. If Falthis and Kediss are your commanders, your deck may contain cards with black and/or red in their color identity, but not cards with green, white, or blue."}, {"date": "2020-11-10", "text": "Both commanders start in the command zone, and the remaining 98 cards (or 58 cards in a Commander Draft game) of your deck are shuffled to become your library."}, {"date": "2020-11-10", "text": "To have two commanders, both must have the partner ability as the game begins. Losing the ability during the game doesn’t cause either to cease to be your commander."}, {"date": "2020-11-10", "text": "Once the game begins, your two commanders are tracked separately. If you cast one, you won’t have to pay an additional {2} the first time you cast the other. A player loses the game after having been dealt 21 damage from any one of them, not from both of them combined."}, {"date": "2020-11-10", "text": "If something refers to your commander while you have two commanders, it refers to one of them of your choice. If you are instructed to perform an action on your commander (e.g. put it from the command zone into your hand due to Command Beacon), you choose one of your commanders at the time the effect happens."}, {"date": "2020-11-10", "text": "An effect that checks whether you control your commander is satisfied if you control one or both of your two commanders."}, {"date": "2020-11-10", "text": "You can choose two commanders with partner that are the same color or colors. In Commander Draft, you can even choose two of the same commander with partner if you drafted them. If you do this, make sure you keep the number of times you’ve cast each from the command zone clear for “commander tax” purposes."}], "setCode": "PRM", "subtypes": ["Elf", "Warrior"], "supertypes": ["Legendary"], "text": "At the beginning of combat on your turn, you may pay {X}{X}. When you do, distribute X +1/+1 counters among any number of target Elves.\nPartner (You can have two commanders if both have partner.)", "toughness": "2", "type": "Legendary Creature — Elf Warrior", "types": ["Creature"], "uuid": "5539d806-1c0c-57d0-a1c4-ba736f9deaab"}