{"artist": "John Severin Brassell", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 6.0, "edhrecRank": 1749, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 496187, "name": "Obelisk von Urd", "text": "Einberufen (Deine Kreaturen können dir helfen, diesen Zauberspruch zu wirken. Mit jeder Kreatur, die du tappst, während du diesen Zauberspruch wirkst, bezahlst du für {1} oder ein Mana der Farbe jener Kreatur.)\nSowie der Obelisk von Urd ins Spiel kommt, bestimme einen Kreaturentyp.\nKreaturen des bestimmten Typs, die du kontrollierst, erhalten +2/+2.", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 496321, "name": "Obelisco de Urd", "text": "Convocar. (Tus criaturas pueden ayudar a lanzar este hechizo. Cada criatura que gires al lanzar este hechizo cuenta como un pago de {1} o de un maná del color de esa criatura.)\nEn cuanto el Obelisco de Urd entre al campo de batalla, elige un tipo de criatura.\nLas criaturas que controlas del tipo elegido obtienen +2/+2.", "type": "Artefacto"}, {"language": "French", "multiverseId": 496455, "name": "Obélisque d'Urd", "text": "Convocation (Vos créatures peuvent aider à lancer ce sort. Chaque créature que vous engagez en lançant ce sort paie {1} ou un mana de la couleur de cette créature.)\nAu moment où l'Obélisque d'Urd arrive sur le champ de bataille, choisissez un type de créature.\nLes créatures du type choisi que vous contrôlez gagnent +2/+2.", "type": "Artefact"}, {"language": "Italian", "multiverseId": 496589, "name": "Obelisco di Urd", "text": "Convocazione (Le tue creature possono aiutarti a lanciare questa magia. Ogni creatura che TAPpi mentre lanci questa magia corrisponde al pagamento di {1} o di un mana del colore di quella creatura.)\nMentre l'Obelisco di Urd entra nel campo di battaglia, scegli un tipo di creatura.\nLe creature che controlli del tipo scelto prendono +2/+2.", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 496723, "name": "ウルドのオベリスク", "text": "召集（あなたのクリーチャーが、この呪文を唱える助けとなる。この呪文を唱える段階であなたがタップした各クリーチャーは、{1}かそのクリーチャーの色のマナ１点を支払う。）\nウルドのオベリスクが戦場に出るに際し、クリーチャー・タイプを１つ選ぶ。\nあなたがコントロールしていてその選ばれたタイプを持つクリーチャーは＋２/＋２の修整を受ける。", "type": "アーティファクト"}, {"language": "Portuguese (Brazil)", "multiverseId": 496857, "name": "Obelisco de Urd", "text": "Convocar (Suas criaturas podem ajudar a conjurar esta mágica. Cada criatura que você vira ao conjurar esta mágica paga {1} ou um mana da cor daquela criatura.)\nConforme Obelisco de Urd entra no campo de batalha, escolha um tipo de criatura.\nAs criaturas que você controla do tipo escolhido recebem +2/+2.", "type": "Artefato"}, {"language": "Russian", "multiverseId": 496991, "name": "Обелиск Урда", "text": "Созыв (Ваши существа могут помочь разыграть это заклинание. Каждое существо, которое вы поворачиваете при разыгрывании этого заклинания, считается оплатой {1} или одной маны цвета того существа.)\nПри выходе Обелиска Урда на поле битвы выберите тип существа.\nНаходящиеся под вашим контролем существа выбранного типа получают +2/+2.", "type": "Артефакт"}, {"language": "Chinese Simplified", "multiverseId": 497125, "name": "邬德碑", "text": "召集（此咒语能用你的生物来协助施放。你于施放此咒语时每横置一个生物，就能为此咒语支付{1}或一点该生物颜色之法术力。）\n于邬德碑进战场时，选择一种生物类别。\n由你操控的该类别生物得+2/+2。", "type": "神器"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "237379", "cardsphereId": "71090", "mcmId": "504085", "mtgjsonV4Id": "9952d446-4496-5028-9a6f-75f141a599d0", "multiverseId": "496053", "scryfallId": "c610beb6-6fd5-4230-ae74-240a005d5c8c", "scryfallIllustrationId": "f285c57e-10f0-4e3d-9731-1312254967ab", "scryfallOracleId": "e2ef3a24-9e78-47fc-9192-049aa0ddb7a0", "tcgplayerProductId": "222383"}, "isReprint": true, "isStarter": true, "keywords": ["Convoke"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{6}", "manaValue": 6.0, "name": "Obelisk of Urd", "number": "115", "originalText": "Convoke (Your creatures can help cast this spell. Each creature you tap while casting this spell pays for {1} or one mana of that creature's color.)\nAs Obelisk of Urd enters the battlefield, choose a creature type.\nCreatures you control of the chosen type get +2/+2.", "originalType": "Artifact", "printings": ["M15", "ZNC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/4b886bed4bd202cc", "tcgplayer": "https://mtgjson.com/links/d584c24ce678ceec"}, "rarity": "rare", "rulings": [{"date": "2014-07-18", "text": "You must choose an existing creature type."}, {"date": "2014-07-18", "text": "The choice of creature type is made as Obelisk of Urd enters the battlefield. Players can’t respond to this choice. The bonus starts applying immediately."}, {"date": "2018-10-05", "text": "If a creature you control has a mana ability with {T} in the cost, activating that ability while casting a spell with convoke will result in the creature being tapped before you pay the spell’s costs. You won’t be able to tap it again for convoke. Similarly, if you sacrifice a creature to activate a mana ability while casting a spell with convoke, that creature won’t be on the battlefield when you pay the spell’s costs, so you won’t be able to tap it for convoke."}, {"date": "2018-10-05", "text": "When using convoke to cast a spell with {X} in its mana cost, first choose the value for X. That choice, plus any cost increases or decreases, will determine the spell’s total cost. Then you can tap creatures you control to help pay that cost. For example, if you cast Worldsoul Colossus (a spell with convoke and mana cost {X}{G}{W}) and choose X to be 3, the total cost is {3}{G}{W}. If you tap two green creatures and two white creatures, you’ll have to pay {1}."}, {"date": "2018-10-05", "text": "Convoke doesn’t change a spell’s mana cost or converted mana cost."}, {"date": "2018-10-05", "text": "You can tap an untapped creature you haven’t controlled continuously since the beginning of your most recent turn to convoke a spell."}, {"date": "2018-10-05", "text": "When calculating a spell’s total cost, include any alternative costs, additional costs, or anything else that increases or reduces the cost to cast the spell. Convoke applies after the total cost is calculated."}, {"date": "2018-10-05", "text": "Because convoke isn’t an alternative cost, it can be used in conjunction with alternative costs."}, {"date": "2018-10-05", "text": "Tapping a multicolored creature using convoke will pay for {1} or one mana of your choice of any of that creature’s colors."}], "securityStamp": "oval", "setCode": "ZNC", "subtypes": [], "supertypes": [], "text": "Convoke (Your creatures can help cast this spell. Each creature you tap while casting this spell pays for {1} or one mana of that creature's color.)\nAs Obelisk of Urd enters the battlefield, choose a creature type.\nCreatures you control of the chosen type get +2/+2.", "type": "Artifact", "types": ["Artifact"], "uuid": "bddda6b6-5c1a-59e3-8a41-c7702c223300"}