{"artist": "Daarken", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B", "R"], "colors": ["B", "R"], "convertedManaCost": 5.0, "edhrecRank": 4414, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "08627478-3f67-5d14-98ab-03bece956807", "mtgoId": "80863", "scryfallId": "256623d4-7baf-450f-ab34-92b15ec8d5bd", "scryfallIllustrationId": "c8c91aec-3f6e-4808-a939-1793c7aadcf0", "scryfallOracleId": "6985c8a9-9299-461b-8bef-bd2b2c739c11"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Companion"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B/R}{B/R}", "manaValue": 5.0, "name": "Obosh, the Preypiercer", "number": "80863", "originalReleaseDate": "2020-04-30", "power": "3", "printings": ["IKO", "PIKO", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "If a card in a player’s library has {X} in its mana cost, X is considered to be 0."}, {"date": "2020-04-17", "text": "For spells with {X} in their mana costs, use the value chosen for X to determine the spell’s converted mana cost. If a permanent or card in any other zone has {X} in its mana cost, X is considered to be 0."}, {"date": "2020-04-17", "text": "If a creature with trample you control would deal combat damage to a blocking creature while you control Obosh, you must assign its unmodified damage. For example, a 3/3 creature with trample blocked by a 2/2 creature can have 1 damage assigned to the defending player. It will then deal 4 damage to the blocking creature and 2 damage to the defending player."}, {"date": "2020-04-17", "text": "If an effect such as that of Ravenous Gigantotherium asks you to divide damage among targets, you must divide the unmodified damage before doubling it."}, {"date": "2020-04-17", "text": "If multiple replacement or prevention effects try to modify damage that would be dealt to a permanent or player, the player or the controller of the permanent chooses the order in which they apply."}, {"date": "2020-04-17", "text": "The requirements of the companion ability apply only to your starting deck. They do not apply to your sideboard."}, {"date": "2020-04-17", "text": "If more than one player wishes to reveal a companion, the starting player does so first, and players proceed in turn order. Once a player has chosen not to reveal a companion, that player can’t change their mind."}, {"date": "2020-04-17", "text": "The companion’s other abilities apply only if the creature is on the battlefield. They have no effect while the companion is outside the game."}, {"date": "2020-04-17", "text": "The companion ability has no effect if the card is in your starting deck and creates no restriction on putting a card with a companion ability into your starting deck. For example, Zirda may be in your starting deck even if your other permanent cards don’t all have activated abilities."}, {"date": "2020-04-17", "text": "You may have one companion in the Commander variant. Your deck, including your commander, must meet its companion requirement. Your companion is not one of your one hundred cards."}, {"date": "2020-04-17", "text": "Before shuffling your deck to become your library, you may reveal one card from outside the game to be your companion if your starting deck meets the requirements of the companion ability. You can’t reveal more than one. It remains revealed outside the game as the game begins."}, {"date": "2020-04-17", "text": "Your companion begins the game outside the game. In tournament play, this means your sideboard. In casual play, it’s simply a card you own that’s not in your starting deck."}, {"date": "2020-06-01", "text": "Once you put your companion into your hand, it behaves like any other card you’ve brought into the game. For example, if it’s countered or destroyed, it’s put into your graveyard, remaining in the game."}, {"date": "2020-06-01", "text": "Wizards of the Coast has issued functional errata for the Companion mechanic. Instead of casting companions from outside the game: Once per game, any time you could cast a sorcery (during your main phase when the stack is empty), you can pay {3} to put your companion from your sideboard into your hand. This is a special action, not an activated ability. It happens immediately and can’t be responded to. It can’t be countered or stopped by cards like Phyrexian Revoker. For more information please see https://magic.wizards.com/en/articles/archive/news/june-1-2020-banned-and-restricted-announcement"}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Hellion", "Horror"], "supertypes": ["Legendary"], "text": "Companion — Your starting deck contains only cards with odd mana values and land cards. (If this card is your chosen companion, you may put it into your hand from outside the game for {3} any time you could cast a sorcery.)\nIf a source you control with an odd mana value would deal damage to a permanent or player, it deals double that damage to that permanent or player instead.", "toughness": "5", "type": "Legendary Creature — Hellion Horror", "types": ["Creature"], "uuid": "3d1115a5-d735-5877-8624-978c742db532"}