{"artist": "Chase Stone", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 1122, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 410760, "name": "Odric, Lunarch-Marschall", "text": "Zu Beginn jedes Kampfes erhalten Kreaturen, die du kontrollierst, Erstschlag bis zum Ende des Zuges, falls du eine Kreatur kontrollierst, die Erstschlag hat. Das Gleiche gilt für Flugfähigkeit, Todesberührung, Doppelschlag, Eile, Fluchsicherheit, Unzerstörbarkeit, Lebensverknüpfung, Bedrohlichkeit, Reichweite, Schleichen, Wachsamkeit sowie das Verursachen von Trampelschaden.", "type": "Legendäre Kreatur — Mensch, Soldat"}, {"language": "Spanish", "multiverseId": 413070, "name": "Odric, mariscal lunarca", "text": "Al comienzo de cada combate, las criaturas que controlas ganan la habilidad de dañar primero hasta el final del turno si una criatura que controlas daña primero. Lo mismo vale para las habilidades de volar, toque mortal, dañar dos veces, prisa, antimaleficio, indestructible, vínculo vital, amenaza, alcance, escurridizo, arrollar y vigilancia.", "type": "Criatura legendaria — Soldado humano"}, {"language": "French", "multiverseId": 411090, "name": "Odric, maréchal lunarque", "text": "Au début de chaque combat, les créatures que vous contrôlez acquièrent l'initiative jusqu'à la fin du tour si une créature que vous contrôlez a l'initiative. C'est vrai aussi pour le vol, le contact mortel, la double initiative, la célérité, la défense talismanique, l'indestructible, le lien de vie, la menace, la portée, la furtivité, le piétinement et la vigilance.", "type": "Créature légendaire : humain et soldat"}, {"language": "Italian", "multiverseId": 411420, "name": "Odric, Maresciallo del Lunarca", "text": "All'inizio di ogni combattimento, le creature che controlli hanno attacco improvviso fino alla fine del turno se una creatura che controlli ha attacco improvviso. Lo stesso vale per volare, tocco letale, doppio attacco, rapidità, anti-malocchio, indistruttibile, legame vitale, minacciare, raggiungere, furtivo, travolgere e cautela.", "type": "Creatura Leggendaria — Soldato Umano"}, {"language": "Japanese", "multiverseId": 411750, "name": "月皇の司令官、オドリック", "text": "各戦闘の開始時に、あなたが１体以上の先制攻撃を持つクリーチャーをコントロールしているなら、ターン終了時まで、あなたがコントロールするクリーチャーは先制攻撃を得る。飛行、接死、二段攻撃、速攻、呪禁、破壊不能、絆魂、威迫、到達、潜伏、トランプル、警戒についても同様である。", "type": "伝説のクリーチャー — 人間・兵士"}, {"language": "Korean", "multiverseId": 412080, "name": "달의 집행관 오드릭", "text": "각 전투단계 시작에, 당신이 조종하는 생물이 선제공격을 가지고 있다면, 당신이 조종하는 생물들은 턴종료까지 선제공격을 얻는다. 비행, 치명타, 이단공격, 신속, 방호, 무적, 생명연결, 호전적, 대공, 은폐, 돌진 및 경계에 대해서도 이와 같이 취급한다.", "type": "전설적 생물 — 인간 병사"}, {"language": "Portuguese (Brazil)", "multiverseId": 412410, "name": "Odric, Marechal Lunarca", "text": "No início de cada combate, as criaturas que você controla ganharão iniciativa até o final do turno se uma criatura que você controla tiver iniciativa. O mesmo vale para voar, toque mortífero, golpe duplo, ímpeto, resistência a magia, indestrutível, vínculo com a vida, ameaçar, alcance, esquivo, atropelar e vigilância.", "type": "Criatura Lendária — Humano Soldado"}, {"language": "Russian", "multiverseId": 412740, "name": "Одрик, Маршал-Лунарх", "text": "В начале каждого боя существа под вашим контролем получают Первый удар до конца хода, если у находящегося под вашим контролем существа есть Первый удар. То же самое относится к Бдительности, Двойному удару, Захвату, Неразрушимости, Полету, Порчеустойчивости, Пробивному удару, Скрытности, Смертельному касанию, Угрозе, Ускорению и Цепи жизни.", "type": "Легендарное Существо — Человек Солдат"}, {"language": "Chinese Simplified", "multiverseId": 410100, "name": "月主会元帅欧吉克", "text": "在每次战斗开始时，如果由你操控的某个生物具有先攻异能，则由你操控的生物获得先攻异能直到回合结束。且飞行、死触、连击、敏捷、辟邪、不灭、系命、威慑、延势、潜匿、践踏与警戒异能亦比照办理。", "type": "传奇生物～人类／士兵"}, {"language": "Chinese Traditional", "multiverseId": 410430, "name": "月主會元帥歐吉克", "text": "在每次戰鬥開始時，如果由你操控的某個生物具有先攻異能，則由你操控的生物獲得先攻異能直到回合結束。且飛行、死觸、連擊、敏捷、辟邪、不滅、繫命、威懾、延勢、潛匿、踐踏與警戒異能亦比照辦理。", "type": "傳奇生物～人類／士兵"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "206081", "cardKingdomId": "205618", "cardsphereId": "41987", "mcmId": "288922", "mcmMetaId": "222158", "mtgjsonV4Id": "fef51d15-c820-57bc-9ebe-6e2854018283", "mtgoFoilId": "59945", "mtgoId": "59944", "multiverseId": "409770", "scryfallId": "5c77c30f-d813-46e6-9cdd-938b4a6359ad", "scryfallIllustrationId": "c8653dbb-6a30-4f38-a2d4-0ff289d86cff", "scryfallOracleId": "bad76170-c773-4be5-9457-20dc9f745cb4", "tcgplayerProductId": "115434"}, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}", "manaValue": 4.0, "name": "Odric, Lunarch Marshal", "number": "31", "originalText": "At the beginning of each combat, creatures you control gain first strike until end of turn if a creature you control has first strike. The same is true for flying, deathtouch, double strike, haste, hexproof, indestructible, lifelink, menace, reach, skulk, trample, and vigilance.", "originalType": "Legendary Creature — Human Soldier", "power": "3", "printings": ["C20", "CMR", "DMC", "MB1", "PSOI", "SOI"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/0a573d11bfdc79fb", "cardKingdomFoil": "https://mtgjson.com/links/2dbe01a50f50b1d4", "cardmarket": "https://mtgjson.com/links/6251b8b9837e3267", "tcgplayer": "https://mtgjson.com/links/e2a15f5690b38590"}, "rarity": "rare", "rulings": [{"date": "2016-04-08", "text": "Odric’s ability triggers at the beginning of each combat, not just combat on your turn, whether or not any creatures you control have any of the listed abilities. If a creature gains one of the listed abilities before Odric’s triggered ability resolves, perhaps due to another ability that triggered at the beginning of combat, then creatures you control will gain that ability."}, {"date": "2016-04-08", "text": "The set of creatures affected by Odric’s ability and how they are affected is determined as the ability resolves. Creatures you begin to control later in the turn won’t gain any abilities or cause creatures to gain new abilities, and the abilities gained won’t change even if every creature that normally had the abilities leaves the battlefield."}, {"date": "2016-04-08", "text": "Multiple instances of any of the abilities Odric can grant your creatures are redundant."}, {"date": "2020-01-24", "text": "If one of those creatures has one or more variants of the listed keywords (for example, hexproof from white), creatures you control gain those specific variants."}], "securityStamp": "oval", "setCode": "SOI", "subtypes": ["Human", "Soldier"], "supertypes": ["Legendary"], "text": "At the beginning of each combat, creatures you control gain first strike until end of turn if a creature you control has first strike. The same is true for flying, deathtouch, double strike, haste, hexproof, indestructible, lifelink, menace, reach, skulk, trample, and vigilance.", "toughness": "3", "type": "Legendary Creature — Human Soldier", "types": ["Creature"], "uuid": "34c24b4a-8546-52d2-8de4-210dbbdf6db3"}