{"artist": "Wesley Burt", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G", "U"], "colors": ["G", "U"], "convertedManaCost": 3.0, "edhrecRank": 896, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "b6286b7c-dbd6-51ef-b8ea-1ba77cc02443", "mtgoId": "78858", "scryfallId": "4a4c2221-ee54-4ff8-b7bb-c115ffdad44b", "scryfallIllustrationId": "4c64f0e1-8d5d-449f-afe8-333f7b41789d", "scryfallOracleId": "60c60923-ff1b-43f7-8768-731499fcffc9"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Banned", "gladiator": "Banned", "historic": "Banned", "historicbrawl": "Banned", "legacy": "Banned", "modern": "Banned", "pioneer": "Banned", "vintage": "Legal"}, "loyalty": "4", "manaCost": "{1}{G}{U}", "manaValue": 3.0, "name": "Oko, Thief of Crowns", "number": "78858", "originalReleaseDate": "2019-10-06", "printings": ["ELD", "PELD", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2019-10-04", "text": "The effects of Oko's second ability lasts indefinitely. It doesn't expire during the cleanup step or if you or Oko leave the game."}, {"date": "2019-10-04", "text": "The effects of Oko's third ability lasts indefinitely. It doesn't expire during the cleanup step or if the creature you take has its power raised above 3 later."}, {"date": "2019-10-04", "text": "If the affected creature gains an ability after Oko's second ability resolves, it will keep that ability."}, {"date": "2019-10-04", "text": "Oko's second ability overwrites all previous effects that set the creature's base power and toughness to specific values. Any power- or toughness-setting effects that start to apply after Oko's second ability resolves will overwrite this effect."}, {"date": "2019-10-04", "text": "Effects that modify a creature's power and/or toughness, such as the effect of Festive Funeral, will apply to the creature no matter when they started to take effect. The same is true for any counters that change its power and/or toughness."}, {"date": "2019-10-04", "text": "Oko's second ability overwrites all colors and creature types the affected creature has. It's just a green Elk. The creature keeps any supertypes (such as legendary) it has, but loses any other card types it has (such as artifact)."}, {"date": "2019-10-04", "text": "Oko's second ability may target a permanent that is only temporarily an artifact or a creature, such as Oko, the Trickster. If this happens, the effect causes that permanent to remain a green Elk creature even after the temporary effect expires."}, {"date": "2019-10-04", "text": "Because damage remains marked on a creature until the damage is removed as the turn ends, nonlethal damage dealt to a creature may become lethal if Oko's second ability changes its toughness during that turn."}, {"date": "2019-10-04", "text": "If either of the target permanents is an illegal target when Oko's last ability resolves, the exchange won't happen."}, {"date": "2019-10-04", "text": "Gaining control of a permanent doesn't cause you to gain control of any Auras or Equipment attached to it. Gaining control of an Equipment doesn't cause it to become unattached, although its new controller may activate its equip abilities during their main phase."}, {"date": "2019-10-04", "text": "Food is an artifact type. Even though it appears on some creatures (such as Gingerbrute), it's never a creature type."}, {"date": "2019-10-04", "text": "You can't sacrifice a Food token to pay multiple costs. For example, you can't sacrifice a Food token to activate its own ability and also to activate the ability of Tempting Witch."}, {"date": "2019-10-04", "text": "Whatever you do, don't eat the delicious cards."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Oko"], "supertypes": ["Legendary"], "text": "[+2]: Create a Food token. (It's an artifact with \"{2}, {T}, Sacrifice this artifact: You gain 3 life.\")\n[+1]: Target artifact or creature loses all abilities and becomes a green Elk creature with base power and toughness 3/3.\n[−5]: Exchange control of target artifact or creature you control and target creature an opponent controls with power 3 or less.", "type": "Legendary Planeswalker — Oko", "types": ["Planeswalker"], "uuid": "bdb60241-5e6a-5e91-b05a-7ac239c13671"}