{"artist": "Greg Staples", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 18192, "finishes": ["foil"], "foreignData": [], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": false, "identifiers": {"mtgjsonV4Id": "f8463e4a-001d-5ab1-8a0e-c1ade0dfde28", "mtgoId": "43644", "scryfallId": "991975e3-56d9-4d24-be28-7af02a5a56a8", "scryfallIllustrationId": "8a85ea7f-a478-47b6-a2fd-e3b2e0824f2f", "scryfallOracleId": "cce84cf1-5574-43b0-9d75-72e6451403a7"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "isReserved": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}{U}", "manaValue": 3.0, "name": "Old Man of the Sea", "number": "43644", "originalReleaseDate": "2014-10-17", "power": "2", "printings": ["ARN", "ME3", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "You lose control of the creature if the Old Man leaves the battlefield. This is because it is no longer tapped."}, {"date": "2009-10-01", "text": "If Old Man of the Sea stops being tapped before its ability resolves — even if it becomes tapped again right away — you won’t gain control of the targeted creature at all. The same is true if the targeted creature’s power becomes greater than Old Man of the Sea’s power before the ability resolves."}, {"date": "2009-10-01", "text": "The ability doesn’t care whether Old Man of the Sea remains under your control, only that Old Man of the Sea remains tapped and its power remains large enough. If an opponent gains control of Old Man of the Sea, you’ll keep control of the affected creature (until Old Man of the Sea stops being tapped or it no longer has enough power)."}, {"date": "2009-10-01", "text": "Once the ability resolves, it doesn’t care whether the targeted permanent remains a legal target for the ability, only that it’s on the battlefield and its power remains small enough. The effect will continue to apply to it even if it gains shroud, stops being a creature, or would no longer be a legal target for any other reason. If it stops being a creature, its power is considered to be 0."}], "setCode": "PRM", "subtypes": ["Djinn"], "supertypes": [], "text": "You may choose not to untap Old Man of the Sea during your untap step.\n{T}: Gain control of target creature with power less than or equal to Old Man of the Sea's power for as long as Old Man of the Sea remains tapped and that creature's power remains less than or equal to Old Man of the Sea's power.", "toughness": "3", "type": "Creature — Djinn", "types": ["Creature"], "uuid": "fd222fea-9428-574f-8858-694f27de0e2b"}