{"artist": "Liiga Smilshkalne", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 8.0, "edhrecRank": 10507, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "349b127f-34b4-56d3-99db-234704b9c138", "mtgoId": "105682", "scryfallId": "1402054e-4b48-4df2-867a-c4a7abba3bb0", "scryfallIllustrationId": "cc245409-0b2a-4d9a-a68a-dec1a4e708cc", "scryfallOracleId": "06bb4272-25d1-46db-8585-15f919267e1e"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{6}{U}{U}", "manaValue": 8.0, "name": "One with the Multiverse", "number": "105682", "originalReleaseDate": "2022-11-18", "printings": ["BRO", "PBRO", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2022-10-14", "text": "You must follow all normal timing rules for spells cast and lands played using the middle ability and must pay all costs for spells cast this way. To cast a spell this way, you may choose to pay any alternative costs or optional additional costs the spell may have (such as a kicker cost). You must pay any mandatory additional costs."}, {"date": "2022-10-14", "text": "While casting a spell without paying its mana cost using the last ability, you can’t pay alternative costs, but you may choose to pay any optional additional costs the spell may have (such as a kicker cost). You still must pay any mandatory additional costs."}, {"date": "2022-10-14", "text": "While casting a card with the prototype ability using the last ability of One with the Multiverse, you can either choose to cast it normally or choose to cast it as a prototyped spell. In either case, you won’t pay its mana cost."}, {"date": "2022-10-14", "text": "If One with the Multiverse leaves the battlefield and later returns to the battlefield (or you play a second one), it’s considered a new object and you may cast a spell using its last ability regardless of whether or not you did so earlier this turn using the enchantment that was on the battlefield before."}, {"date": "2022-10-14", "text": "Similarly, if you control more than one One with the Multiverse (Two with the Multiverse, if you will), each one’s last ability applies independently, and you may cast a spell without paying its mana cost once for each of them during each of your turns. In this case, you will need to track which enchantment’s permission you are using to cast a spell this way (due to the possibility that one of them might leave the battlefield before you use its permission that turn)."}], "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "You may look at the top card of your library any time.\nYou may play lands and cast spells from the top of your library.\nOnce during each of your turns, you may cast a spell from your hand or the top of your library without paying its mana cost.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "c2c2fafa-51fb-51e2-bfd0-33ce867c64d3"}