{"artist": "DZO", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 2336, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "95cd51ce-9a5a-55bb-9e6e-5daebe9e0f91", "mtgoId": "88234", "scryfallId": "452bafa1-bff4-4e7d-a69a-d5c985341d1f", "scryfallIllustrationId": "108bcd9e-8382-4c4b-adda-437c1dbac8d5", "scryfallOracleId": "276c4643-13ad-43bf-840b-08c025ebc065"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Changeling"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Orvar, the All-Form", "number": "88234", "originalReleaseDate": "2021-02-28", "power": "3", "printings": ["KHM", "PKHM", "PLIST", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2021-02-05", "text": "Orvar’s first triggered ability resolves (if it resolves; see below) before the spell or ability that caused it to trigger."}, {"date": "2021-02-05", "text": "For the first triggered ability, the instant or sorcery spell can target other things if it also targets one or more permanents you control; however, the token you create can copy only permanents you control that are targets of the spell. If the spell targets more than one permanent you control, you choose which permanent the token is copying as you create the token."}, {"date": "2021-02-05", "text": "As the first triggered ability tries to resolve, the spell that caused it to trigger and that spell’s targets are checked again. Ignore any target of the spell that has left the battlefield by that point. If all of the permanents you controlled that were targets have left the battlefield by that point, the triggered ability will do nothing and no token will be created. If at least one permanent you control that’s a target is still on the battlefield, the triggered ability will resolve, even if that permanent is now an illegal target for the spell."}, {"date": "2021-02-05", "text": "If the spell itself has left the stack by that point, use the targets it had when it left the stack to perform the check described above."}, {"date": "2021-02-05", "text": "For the second triggered ability, you can choose any permanent as the target, regardless of who controls it."}, {"date": "2021-02-05", "text": "The token copies exactly what is printed on the permanent and nothing else (unless that permanent is a token or is copying something else; see below). It doesn’t copy whether that permanent is tapped or untapped, whether it has any counters on it, whether it has any Auras and/or Equipment attached to it, or any non-copy effects that changed its power, toughness, types, color, and so on."}, {"date": "2021-02-05", "text": "If the permanent being copied is itself a token, the token created by the last ability copies the original characteristics of that token as stated by the effect that created it."}, {"date": "2021-02-05", "text": "If the permanent being copied is copying something else, the token you create will use the copiable values of the that permanent. In most cases, it will be a copy of whatever the permanent is copying. If it’s copying a permanent or card with {X} in its mana cost, X is 0."}, {"date": "2021-02-05", "text": "If the permanent being copied has {X} in its mana cost, X is 0."}, {"date": "2021-02-05", "text": "Any enters-the-battlefield abilities of the copied permanent will trigger when the token enters the battlefield. Any “As [this permanent] enters the battlefield” or “[This permanent] enters the battlefield with” abilities of the copied permanent will also work."}, {"date": "2021-02-05", "text": "If a spell or ability an opponent controls allows or instructs you to choose a card to discard, and you discard Orvar, its last ability will trigger."}, {"date": "2021-02-05", "text": "Changeling is a characteristic-defining ability. It functions in all zones, not only while a card that has it is on the battlefield."}, {"date": "2021-02-05", "text": "The subtype Shapeshifter that appears on the type line is mostly there to reinforce the flavor. A creature card with changeling is just as much an Elf, a Dwarf, a Sliver, a Goat, a Coward, and a Zombie as it is a Shapeshifter."}, {"date": "2021-02-05", "text": "If an effect causes a creature with changeling to become a new creature type, it will be only that new creature type. It will still have changeling; the effect making it all creature types will simply be overwritten."}, {"date": "2021-02-05", "text": "If an effect causes a creature with changeling to lose all abilities, it will remain all creature types, even though it will no longer have changeling. This is because changeling applies before the effect that removes it."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Shapeshifter"], "supertypes": ["Legendary"], "text": "Changeling\nWhenever you cast an instant or sorcery spell, if it targets one or more other permanents you control, create a token that's a copy of one of those permanents.\nWhen a spell or ability an opponent controls causes you to discard this card, create a token that's a copy of target permanent.", "toughness": "3", "type": "Legendary Creature — Shapeshifter", "types": ["Creature"], "uuid": "9bd98683-82ae-58af-9d88-4c51c3d1af2d"}