{"artist": "Zoltan Boros", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "W"], "colors": ["B", "W"], "convertedManaCost": 2.0, "edhrecRank": 7907, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 366921, "name": "Orzhov-Amulett", "text": "Bestimme eines — Bringe eine Kreatur deiner Wahl, die du kontrollierst, und alle an sie angelegten Auren, die du kontrollierst, auf die Hand ihrer Besitzer zurück; oder zerstöre eine Kreatur deiner Wahl und du verlierst ebenso viele Lebenspunkte wie deren Widerstandskraft beträgt; oder bringe eine Kreaturenkarte deiner Wahl mit umgewandelten Manakosten von 1 oder weniger aus deinem Friedhof ins Spiel zurück.", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 368176, "name": "Amuleto orzhov", "text": "Elige uno: Regresa la criatura objetivo que controlas y todas las auras que controlas anexadas a ella a la mano de su propietario; o destruye la criatura objetivo y pierdes una cantidad de vidas igual a su resistencia; o regresa la carta de criatura objetivo con un coste de maná convertido de 1 o menos de tu cementerio al campo de batalla.", "type": "Instantáneo"}, {"language": "French", "multiverseId": 366656, "name": "Charme d'Orzhov", "text": "Choisissez l'un — Renvoyez la créature ciblée que vous contrôlez et toutes les auras que vous contrôlez qui lui sont attachées dans la main de son propriétaire ; ou détruisez une créature ciblée et vous perdez un nombre de points de vie égal à son endurance ; ou renvoyez sur le champ de bataille depuis votre cimetière une carte de créature ayant un coût converti de mana inférieur ou égal à 1.", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 367094, "name": "Talismano Orzhov", "text": "Scegli uno — Fai tornare una creatura bersaglio che controlli e tutte le Aure che controlli assegnate ad essa in mano ai rispettivi proprietari; oppure distruggi una creatura bersaglio e perdi punti vita pari alla sua costituzione; oppure rimetti sul campo di battaglia una carta creatura bersaglio con costo di mana convertito pari o inferiore a 1 dal tuo cimitero.", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 368298, "name": "オルゾフの魔除け", "text": "以下の３つから１つを選ぶ。「あなたがコントロールするクリーチャー１体を対象とし、それとそれにつけられているあなたがコントロールするすべてのオーラをオーナーの手札に戻す。」「クリーチャー１体を対象とする。それを破壊し、あなたはそれのタフネスに等しい点数のライフを失う。」「あなたの墓地にある点数で見たマナ・コストが１以下のクリーチャー・カード１枚を対象とし、それを戦場に戻す。」", "type": "インスタント"}, {"language": "Korean", "multiverseId": 367296, "name": "오르조브 부적", "text": "하나를 선택한다 — 당신이 조종하는 생물 한 개를 목표로 정한다. 그 생물과 그 생물에 부착된 모든 마법진 중 당신이 조종하는 모든 마법진을 소유자의 손으로 되돌린다; 또는 생물 한 개를 목표로 정한다. 그 생물을 파괴하고 당신은 그 생물의 방어력만큼 생명점을 잃는다; 또는 당신의 무덤에서 전환마나비용이 1 이하인 생물 카드 한 장을 목표로 정한다. 그 카드를 전장으로 되돌린다.", "type": "순간마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 367635, "name": "Amuleto Orzhov", "text": "Escolha um — Devolva a criatura alvo que você controla e todas as Auras que você controla anexadas a ela para a mão do dono delas; ou destrua a criatura alvo e perca uma quantidade de pontos de vida igual à resistência dela; ou devolva o card de criatura alvo com custo de mana convertido igual ou inferior a 1 de seu cemitério para o campo de batalha.", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 367819, "name": "Талисман Орзовов", "text": "Выберите одно — верните целевое существо под вашим контролем и все прикрепленные к нему Ауры под вашим контролем в руку их владельца; или уничтожьте целевое существо, и вы теряете количество жизней, равное его выносливости; или верните целевую карту существа с конвертированной мана-стоимостью 1 или меньше из вашего кладбища на поле битвы.", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 365858, "name": "欧佐夫护符", "text": "选择一项～将目标由你操控的生物及所有由你操控且结附于其上的灵气移回其拥有者手上；或消灭目标生物，且你失去等同于其防御力的生命；或将目标总法术力费用等于或小于1的生物牌自你的坟墓场移回战场。", "type": "瞬间"}, {"language": "Chinese Traditional", "multiverseId": 366175, "name": "歐佐夫護符", "text": "選擇一項～將目標由你操控的生物及所有由你操控且結附於其上的靈氣移回其擁有者手上；或消滅目標生物，且你失去等同於其防禦力的生命；或將目標總魔法力費用等於或小於1的生物牌自你的墳墓場移回戰場。", "type": "瞬間"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "189252", "cardKingdomId": "188970", "cardsphereId": "19284", "mcmId": "259953", "mcmMetaId": "207168", "mtgjsonV4Id": "23758bb1-4536-5121-aa14-6ea9fd078fe1", "mtgoFoilId": "47482", "mtgoId": "47481", "multiverseId": "366436", "scryfallId": "8ca44265-5e1b-4fbf-9002-52b2ce9b7448", "scryfallIllustrationId": "fc582527-e2f7-4a54-9be8-ea5532daa9b3", "scryfallOracleId": "26f8626a-ce64-450c-bda5-833df2fbb4fb", "tcgplayerProductId": "67452"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{W}{B}", "manaValue": 2.0, "name": "Orzhov Charm", "number": "185", "originalText": "Choose one — Return target creature you control and all Auras you control attached to it to their owner's hand; or destroy target creature and you lose life equal to its toughness; or return target creature card with converted mana cost 1 or less from your graveyard to the battlefield.", "originalType": "Instant", "printings": ["GK2", "GTC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/dbb1037af99d4df3", "cardKingdomFoil": "https://mtgjson.com/links/5e0ee71ee77b4b46", "cardmarket": "https://mtgjson.com/links/58d194e6c5ac1457", "tcgplayer": "https://mtgjson.com/links/450cefe7bc1adfdd"}, "rarity": "uncommon", "rulings": [{"date": "2013-01-24", "text": "Orzhov Charm’s first mode doesn’t target any of the Auras attached to the target creature."}, {"date": "2013-01-24", "text": "If you choose the first mode, any Aura controlled by another player attached to the creature will be put into its owner’s graveyard as a state-based action after the creature leaves the battlefield."}, {"date": "2013-01-24", "text": "If you choose the second mode, you’ll lose life equal to the creature’s toughness when it was last on the battlefield."}, {"date": "2013-01-24", "text": "For each of the modes, if the target creature or creature card is an illegal target when Orzhov Charm tries to resolve, it won’t resolve and none of its effects will happen."}, {"date": "2013-07-01", "text": "If you choose the second mode, and Orzhov Charm resolves but the creature isn’t destroyed (perhaps because it has indestructible or it regenerates), you’ll still lose life equal to the creature’s toughness."}], "setCode": "GTC", "subtypes": [], "supertypes": [], "text": "Choose one —\n• Return target creature you control and all Auras you control attached to it to their owner's hand.\n• Destroy target creature and you lose life equal to its toughness.\n• Return target creature card with mana value 1 or less from your graveyard to the battlefield.", "type": "Instant", "types": ["Instant"], "uuid": "6ef4f182-2b33-5564-a10f-fb47f5378853", "watermark": "orzhov"}