{"artist": "Charles Urbach", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210270", "mcmId": "294456", "mtgjsonV4Id": "4bce3795-5796-5083-a5d9-ea518eefe887", "multiverseId": "423642", "scryfallId": "35add85f-a70a-497d-9a11-593325a1a4ef", "scryfallIllustrationId": "cf2338ee-d708-47ef-8510-444ce9b499a2", "scryfallOracleId": "29e3371d-aa41-46a9-921a-96565be47eff", "tcgplayerProductId": "125616"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Otaria", "number": "61", "originalText": "Instant and sorcery cards in graveyards have flashback. The flashback cost is equal to the card's mana cost. (Its owner may cast the card from his or her graveyard for its mana cost. Then he or she exiles it.)\nWhenever you roll {Chaos}, take an extra turn after this one.", "originalType": "Plane — Dominaria", "printings": ["OHOP", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/08179508625268b8", "tcgplayer": "https://mtgjson.com/links/fe3c9ef05dbbf773"}, "rarity": "common", "rulings": [{"date": "2009-10-01", "text": "A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"}, {"date": "2009-10-01", "text": "A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."}, {"date": "2009-10-01", "text": "The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."}, {"date": "2009-10-01", "text": "If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}, {"date": "2009-10-01", "text": "If you use a card’s flashback ability, you’re actually casting that card. It moves from your graveyard to the stack. Abilities that trigger when you cast a spell will trigger. That spell can be countered."}, {"date": "2009-10-01", "text": "If you cast a card by using flashback, you cast that card from your graveyard rather than your hand, and you pay an alternative cost rather than its mana cost, but everything else about casting that spell works normally. You must follow timing restrictions based on the card’s type (if it’s a sorcery), as well as other restrictions (such as “Cast [this card] only before blockers are declared”). You may pay additional costs (such as kicker). Effects that cause you to pay more or less for a spell will apply."}, {"date": "2009-10-01", "text": "As a spell cast with flashback resolves, it never goes to its owner’s graveyard, so abilities that trigger on cards being put in a graveyard won’t trigger. The card is exiled instead."}, {"date": "2009-10-01", "text": "If a spell cast by using flashback is countered, it’s still exiled rather than being put into its owner’s graveyard."}, {"date": "2009-10-01", "text": "If you use the flashback ability granted by Otaria to cast a split card from your graveyard, the flashback cost you pay is equal to the mana cost of the half that you’re casting."}, {"date": "2009-10-01", "text": "If you use the flashback ability granted by Otaria to cast a card with X in its mana cost from your graveyard, you choose the value of X as you cast it. You’ll still have to pay that X."}, {"date": "2009-10-01", "text": "Otaria may cause an instant or sorcery card in a graveyard to have multiple flashback abilities. Its owner may cast it using any one of those abilities."}, {"date": "2009-10-01", "text": "If you roll {CHAOS} multiple times in the same turn, you’ll take that many extra turns after this one."}], "setCode": "OPCA", "subtypes": ["Dominaria"], "supertypes": [], "text": "Instant and sorcery cards in graveyards have flashback. The flashback cost is equal to the card's mana cost. (Its owner may cast the card from their graveyard for its mana cost. Then they exile it.)\nWhenever you roll {CHAOS}, take an extra turn after this one.", "type": "Plane — Dominaria", "types": ["Plane"], "uuid": "539fb88a-a80e-591d-9cff-f35fb1893ec3"}