{"artist": "Jim Pavelec", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 3.0, "edhrecRank": 2215, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "238063", "cardsphereId": "71707", "mcmId": "498530", "mcmMetaId": "4038", "mtgjsonV4Id": "9c4bc667-8658-53eb-96e0-b461b6ff4a59", "scryfallId": "96ccfecd-0dab-426a-8897-86c73934d21d", "scryfallIllustrationId": "f892ea52-b417-48b9-90fa-d28103693bb1", "scryfallOracleId": "c753e9e3-9374-4e3c-8622-94576a8c1da3", "tcgplayerProductId": "222767"}, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "pauper": "Legal", "paupercommander": "Legal", "vintage": "Legal"}, "manaCost": "{1}{B}{B}", "manaValue": 3.0, "name": "Oubliette", "number": "109", "printings": ["2XM", "ARN", "ME1", "PLIST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d3825bf13e4ae167", "cardmarket": "https://mtgjson.com/links/88fdb3c0654dbaa1", "tcgplayer": "https://mtgjson.com/links/dd7436e5bed2363a"}, "rarity": "uncommon", "rulings": [{"date": "2020-08-07", "text": "If Oubliette leaves the battlefield before its triggered ability resolves, the target creature won't be phased out or tapped."}, {"date": "2020-08-07", "text": "While a permanent is phased out, it's treated as though it doesn't exist. It can't be the target of spells or abilities, its static abilities have no effect on the game, its triggered abilities can't trigger, it can't attack or block, and so on."}, {"date": "2020-08-07", "text": "Phasing out doesn't cause any “leaves the battlefield” abilities to trigger. Similarly, phasing in won't cause any “enters the battlefield” abilities to trigger."}, {"date": "2020-08-07", "text": "Any one-shot effects that are waiting “until [this] leaves the battlefield,” such as that of Kitesail Freebooter, won't happen when a permanent phases out."}, {"date": "2020-08-07", "text": "Any continuous effects with a “for as long as” duration such as that of Awakener Druid ignore phased-out objects. Any such effects will expire if their conditions are no longer met after ignoring the phased-out objects."}, {"date": "2020-08-07", "text": "Each Aura and Equipment attached to a permanent that's phasing out also phases out. They will phase in with that permanent and still be attached to it. Similarly, permanents that phase out with counters phase in with those counters."}, {"date": "2020-08-07", "text": "Choices made for permanents as they entered the battlefield are remembered when they phase in."}, {"date": "2020-08-07", "text": "A creature phased out by Oubliette doesn't phase in during its controller's untap step as normal. Rather, it phases in immediately after Oubliette leaves the battlefield."}, {"date": "2020-08-07", "text": "Abilities that trigger when a creature becomes tapped won't trigger when the creature phases in tapped."}], "setCode": "PLIST", "subtypes": [], "supertypes": [], "text": "When Oubliette enters the battlefield, target creature phases out until Oubliette leaves the battlefield. Tap that creature as it phases in this way. (Auras and Equipment phase out with it. While permanents are phased out, they're treated as though they don't exist.)", "type": "Enchantment", "types": ["Enchantment"], "uuid": "38a005f6-40c9-505a-ab48-fdc65dc0fe37"}