{"artist": "Viktor Titov", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 4.0, "edhrecRank": 9057, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 473401, "name": "Niederringen", "text": "Lege eine +1/+1-Marke auf eine Kreatur deiner Wahl, die du kontrollierst. Dann kämpft sie gegen eine Kreatur deiner Wahl, die du nicht kontrollierst. (Jede der Kreaturen fügt der anderen Schadenspunkte in Höhe ihrer Stärke zu.)\nAdamant — Falls drei oder mehr grüne Mana ausgegeben wurden, um diesen Zauberspruch zu wirken, erhält die Kreatur, die du kontrollierst, Unzerstörbarkeit bis zum Ende des Zuges.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 473670, "name": "Fuerza superior", "text": "Pon un contador +1/+1 sobre la criatura objetivo que controlas. Luego, lucha contra la criatura objetivo que no controlas. (Cada una hace un daño igual a su fuerza a la otra.)\nTesón — Si se usaron al menos tres manás verdes para lanzar este hechizo, la criatura que controlas gana la habilidad de indestructible hasta el final del turno.", "type": "Conjuro"}, {"language": "French", "multiverseId": 473939, "name": "Plus costaud", "text": "Mettez un marqueur +1/+1 sur une créature ciblée que vous contrôlez, puis elle se bat contre une créature ciblée que vous ne contrôlez pas. (Chacune inflige un nombre de blessures égal à sa force à l'autre.)\nInflexible — Si au moins trois manas verts ont été dépensés pour lancer ce sort, la créature que vous contrôlez acquiert l'indestructible jusqu'à la fin du tour.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 474208, "name": "Superare in Forza", "text": "Metti un segnalino +1/+1 su una creatura bersaglio che controlli, poi essa lotta con una creatura bersaglio che non controlli. (Ogni creatura infligge all'altra danno pari alla propria forza.)\nAdamantino — Se sono stati spesi almeno tre mana verdi per lanciare questa magia, la creatura che controlli ha indistruttibile fino alla fine del turno.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 474477, "name": "筋骨隆々", "text": "あなたがコントロールしているクリーチャー１体と、あなたがコントロールしていないクリーチャー１体を対象とする。その前者の上に＋１/＋１カウンターを１個置く。その後、その前者はその後者と格闘を行う。（それぞれはもう一方に自身のパワーに等しい点数のダメージを与える。）\n一徹 ― この呪文を唱えるために緑マナが３点以上支払われていたなら、ターン終了時まで、あなたがコントロールしているクリーチャーは破壊不能を得る。", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 474746, "name": "힘으로 압도", "text": "당신이 조종하는 생물과 당신이 조종하지 않는 생물을 목표로 정한다. 첫 번째 목표에 +1/+1 카운터 한 개를 올려놓은 후, 그 두 생물은 서로 싸운다. (각 생물은 서로에게 각자의 공격력만큼 피해를 입힌다.)\n단호 — 이 주문을 발동하는 데 적어도 녹색 마나 세 개가 지불되었다면, 첫 번째 목표는 턴종료까지 무적을 얻는다.", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 475015, "name": "Superar em Força", "text": "Coloque um marcador +1/+1 na criatura alvo que você controla. Em seguida, ela luta com a criatura alvo que você não controla. (Cada uma causa dano igual ao seu poder à outra.)\nObstinação — Se ao menos três manas verdes tiverem sido gastos para conjurar esta mágica, a criatura que você controla ganha indestrutível até o final do turno.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 475284, "name": "Пересилить", "text": "Положите один жетон +1/+1 на целевое существо под вашим контролем, затем оно дерется с целевым существом не под вашим контролем. (Они наносят друг другу повреждения, равные своей силе.)\nТвердость — Если на разыгрывание этого заклинания было потрачено три или больше зеленой маны, то существо под вашим контролем получает Неразрушимость до конца хода.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 475553, "name": "膂力过人", "text": "在目标由你操控的生物上放置一个+1/+1指示物，然后它与目标不由你操控的生物互斗。（它们各向对方造成等同于本身力量的伤害。）\n固色～如果施放此咒语时支付过至少三点绿色法术力，则该由你操控的生物获得不灭异能直到回合结束。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 475822, "name": "膂力過人", "text": "在目標由你操控的生物上放置一個+1/+1指示物，然後它與目標不由你操控的生物互鬥。（它們各向對方造成等同於本身力量的傷害。）\n固色～如果施放此咒語時支付過至少三點綠色魔法力，則該由你操控的生物獲得不滅異能直到回合結束。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "227814", "cardKingdomId": "227413", "cardsphereId": "62288", "mcmId": "400269", "mcmMetaId": "281669", "mtgArenaId": "70317", "mtgjsonV4Id": "42ddbd48-e841-5caf-89c6-d6331cefef0b", "mtgoId": "78480", "multiverseId": "473132", "scryfallId": "40d0ddcc-e6df-4fe1-9ac9-f895885ccc84", "scryfallIllustrationId": "f46b7072-b107-41a6-a973-11ee6061bdab", "scryfallOracleId": "185d84f4-6095-46ef-917f-3d662a86aa81", "tcgplayerProductId": "198867"}, "keywords": ["Adamant", "Fight"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{G}", "manaValue": 4.0, "name": "Outmuscle", "number": "170", "originalText": "Put a +1/+1 counter on target creature you control, then it fights target creature you don't control. (Each deals damage equal to its power to the other.)\nAdamant — If at least three green mana was spent to cast this spell, the creature you control gains indestructible until end of turn.", "originalType": "Sorcery", "printings": ["ELD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1376ddf970641351", "cardKingdomFoil": "https://mtgjson.com/links/731f4ec8dc2536fe", "cardmarket": "https://mtgjson.com/links/28c95f074c716c3f", "tcgplayer": "https://mtgjson.com/links/aa27fb622dc1b345"}, "rarity": "common", "rulings": [{"date": "2019-10-04", "text": "You can't cast Outmuscle unless you choose both a creature you control and a creature you don't control as targets."}, {"date": "2019-10-04", "text": "If either target is an illegal target as Outmuscle tries to resolve, neither creature will deal or be dealt damage."}, {"date": "2019-10-04", "text": "If the creature you control is an illegal target as Outmuscle tries to resolve, no creature gets a +1/+1 counter. If that creature is a legal target but the creature you don't control isn't, it still gets a +1/+1 counter and gains indestructible if appropriate."}, {"date": "2019-10-04", "text": "Because state-based actions don't destroy a creature with lethal damage marked on it until a player would receive priority, gaining indestructible from Outmuscle will save your creature if it's dealt lethal damage in the fight."}, {"date": "2019-10-04", "text": "If an instant or sorcery spell has an adamant ability, you perform the spell's instructions in order. You don't perform the adamant instruction before the spell resolves or before any other effects printed above it."}, {"date": "2019-10-04", "text": "If an effect allows you to cast a spell without paying its mana cost, you can't choose to cast it and pay unless another rule or effect allows you to cast that spell for a cost. Similarly, you can't waive a cost reduction unless that effect says you may."}, {"date": "2019-10-04", "text": "Adamant effects check what mana was actually spent to cast a spell. If an effect allows you to spend mana “as though it were mana” of any color or type, that allows you to spend mana you couldn't otherwise spend, but it doesn't change what mana you spent to cast the spell."}, {"date": "2019-10-04", "text": "If you copy a spell that has an adamant ability, no mana was spent to cast the copy at all, so that ability won't apply."}], "setCode": "ELD", "subtypes": [], "supertypes": [], "text": "Put a +1/+1 counter on target creature you control, then it fights target creature you don't control. (Each deals damage equal to its power to the other.)\nAdamant — If at least three green mana was spent to cast this spell, the creature you control gains indestructible until end of turn.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "14903635-d346-52c7-a401-230dfee1859f"}