{"artist": "Tobias Kwan", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 3818, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "fbf381a6-e9a3-5fd8-bdbe-127e64775320", "mtgoId": "91219", "scryfallId": "366bf689-f53f-42fe-8cec-201cb35e452d", "scryfallIllustrationId": "8f36b730-8e3f-4d28-b58a-c48b933f059e", "scryfallOracleId": "8491de1e-dc37-4a89-b4f7-56a2c668f0fc"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Vanishing"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{W}{W}", "manaValue": 3.0, "name": "Out of Time", "number": "91219", "originalReleaseDate": "2021-06-19", "printings": ["MH2", "PMH2", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-06-18", "text": "A creature phased out by Out of Time doesn't phase in during its controller's untap step as normal."}, {"date": "2021-06-18", "text": "If Out of Time happens to be a creature when its enter the battlefield trigger resolves, it will phase out along with all other creatures. You'll never remove the last counter since it's phased out, so all creatures will remain phased out indefinitely."}, {"date": "2021-06-18", "text": "If there are no creatures on the battlefield when Out of Time's triggered ability resolves, nothing phases out and Out of Time won't get any time counters. It will remain on the battlefield and won't be sacrificed, since the last time counter will never be removed."}, {"date": "2021-06-18", "text": "If Out of Time leaves the battlefield before its enter the battlefield trigger resolves, creatures will untap, but they won't phase out."}, {"date": "2021-06-18", "text": "While a permanent is phased out, it's treated as though it doesn't exist. It can't be the target of spells or abilities, its static abilities have no effect on the game, its triggered abilities can't trigger, it can't attack or block, and so on."}, {"date": "2021-06-18", "text": "Phasing out doesn't cause any “leaves the battlefield” abilities to trigger. Similarly, phasing in won't cause any “enters the battlefield” abilities to trigger."}, {"date": "2021-06-18", "text": "Any one-shot effects that are waiting “until [this] leaves the battlefield,” such as that of Banisher Priest, won't happen when a permanent phases out."}, {"date": "2021-06-18", "text": "Any continuous effects with a “for as long as” duration, such as that of Tide Shaper, ignore phased-out objects. Any such effects will expire if their conditions are no longer met after ignoring the phased-out objects."}, {"date": "2021-06-18", "text": "Each Aura and Equipment attached to a permanent that's phasing out also phases out. They will phase in with that permanent and still be attached to it. Similarly, permanents that phase out with counters phase in with those counters."}, {"date": "2021-06-18", "text": "Choices made for permanents as they entered the battlefield are remembered when they phase in."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "When Out of Time enters the battlefield, untap all creatures, then those creatures phase out until Out of Time leaves the battlefield. Put a time counter on Out of Time for each creature that phased out this way.\nVanishing (At the beginning of your upkeep, remove a time counter from this enchantment. When the last is removed, sacrifice it.)", "type": "Enchantment", "types": ["Enchantment"], "uuid": "5a51f254-05ee-531d-8972-21535b6604cb"}