{"artist": "Richard Wright", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 8.0, "edhrecRank": 5157, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "213415", "cardsphereId": "50550", "mcmId": "299010", "mtgjsonV4Id": "c8fb8413-deea-58fe-b4c2-3d0dae5a3b11", "scryfallId": "9044a422-fbf4-43db-b408-515b486dbb19", "scryfallIllustrationId": "174c8c96-26b2-437e-b826-2e84bcb98072", "scryfallOracleId": "1099588c-cc26-4523-8bd2-90e1e1433f53", "tcgplayerProductId": "137156"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Enchant"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{6}{W}{W}", "manaValue": 8.0, "name": "Overwhelming Splendor", "number": "19s", "printings": ["AKR", "HOU", "PHOU"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/694b68090770cdd7", "tcgplayer": "https://mtgjson.com/links/b7476a560c203de1"}, "rarity": "mythic", "rulings": [{"date": "2017-07-14", "text": "Effects that modify a creature’s power and/or toughness, such as the effect of Titanic Growth, will apply to the creatures no matter when they started to take effect. The same is true for any counters that change their power and/or toughness."}, {"date": "2017-07-14", "text": "If an effect grants a creature an ability after Overwhelming Splendor has become attached to its controller, that creature won’t lose that ability."}, {"date": "2017-07-14", "text": "If a noncreature permanent becomes a creature, it will lose all abilities it has. However, if the effect that makes that permanent a creature grants it an ability, it will continue to have that ability. For example, the enchanted player’s Riddleform will have flying once it becomes a creature."}, {"date": "2017-07-14", "text": "Overwhelming Splendor overwrites all previous effects that set a creature’s base power and toughness to specific values. Any power- or toughness-setting effects that start to apply to a creature after Overwhelming Splendor becomes attached to its controller will overwrite this effect. For example, the enchanted player’s Riddleform will become a 3/3 creature if player casts a noncreature spell."}, {"date": "2017-07-14", "text": "Activated abilities contain a colon. They’re generally written “[Cost]: [Effect].” Some keyword abilities (such as equip and eternalize) are activated abilities and will have colons in their reminder text. Triggered abilities (starting with “when,” “whenever,” or “at”) of noncreature permanents are unaffected by the last ability of Overwhelming Splendor."}, {"date": "2017-07-14", "text": "An activated mana ability is one that produces mana as it resolves, not one that costs mana to activate. A loyalty ability is an ability of a planeswalker whose cost specifies how many loyalty counters to give or remove."}, {"date": "2017-07-14", "text": "While the enchanted player can still activate mana abilities and loyalty abilities, creatures that player controls won’t normally have any of those abilities to be activated."}, {"date": "2017-07-14", "text": "If Overwhelming Splendor leaves the battlefield at the same time as a creature enchanted player controls, any “when [this creature] [dies or leaves the battlefield]” abilities of that creature won’t trigger."}, {"date": "2017-09-29", "text": "If a creature enters the battlefield under enchanted player’s control, any “when [this creature] enters the battlefield” abilities of that creature won’t trigger. Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities won’t be applied. This is a change from previous rulings."}], "securityStamp": "oval", "setCode": "PHOU", "subtypes": ["Aura", "Curse"], "supertypes": [], "text": "Enchant player\nCreatures enchanted player controls lose all abilities and have base power and toughness 1/1.\nEnchanted player can't activate abilities that aren't mana abilities or loyalty abilities.", "type": "Enchantment — Aura Curse", "types": ["Enchantment"], "uuid": "29f0c665-1188-5cba-b486-a1ca7134ae2d"}