{"artist": "Ron Spencer", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 10015, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 93831, "name": "Überlodern", "text": "Zu jedem Zeitpunkt, zu dem eine bleibende Karte deiner Wahl in diesem Zug einer Kreatur oder einem Spieler Schadenspunkte zufügen würde, fügt sie dieser Kreatur oder diesem Spieler stattdessen doppelt so viele Schadenspunkte zu.\nArkane Kopplung {2}{R}{R} (Sowie du einen arkanen Zauberspruch spielst, kannst du diese Karte aus deiner Hand vorzeigen und ihre Kopplungskosten bezahlen. Falls du dies tust, füge dem Zauberspruch den Effekt dieser Karte hinzu.)", "type": "Spontanzauber - Arkan"}, {"language": "Spanish", "multiverseId": 94521, "name": "Sobrequemar", "text": "Cada vez que el permanente objetivo fuera a hacer daño a una criatura o jugador este turno, en vez de eso, hace el doble de ese daño a esa criatura o jugador.\nEmpalmar con lo arcano {2}{R}{R} (En cuanto juegues un hechizo arcano, puedes mostrar esta carta de tu mano y pagar su coste de empalme. Si lo haces, agrega los efectos de esta carta a ese hechizo).", "type": "Instantáneo - Arcano"}, {"language": "French", "multiverseId": 93666, "name": "Surenflammement", "text": "À chaque fois que le permanent ciblé devrait, ce tour-ci, infliger des blessures à une créature ou un joueur, il inflige à la place le double de ces blessures à cette créature ou à ce joueur.\n Imprégnation d'arcane {2}{R}{R} (Au moment où vous jouez un sort d'arcane, vous pouvez révéler cette carte depuis votre main et payer son coût d'imprégnation. Si vous le faites, ajoutez les effets de cette carte à ce sort.)", "type": "Éphémère : arcane"}, {"language": "Italian", "multiverseId": 94026, "name": "Doppia Vampata", "text": "Ogni volta che il permanente bersaglio sta per infliggere danno a una creatura o a un giocatore in questo turno, invece infligge il doppio di quel danno a quella creatura o a quel giocatore.\nUnire nell'Arcano {2}{R}{R} (Mentre giochi una magia Arcano, puoi rivelare questa carta dalla tua mano e pagare il suo costo di unione. Se lo fai, aggiungi l'effetto di questa carta a quella magia.)", "type": "Istantaneo - Arcano"}, {"language": "Japanese", "multiverseId": 94191, "name": "猛火煽り", "text": "パーマネント１つを対象とする。このターン、それがいずれかのクリーチャーかプレイヤーにダメージを与える場合、代わりにそれは２倍のダメージをそのクリーチャーやプレイヤーに与える。\n連繋（秘儀） {2}{R}{R}（あなたが秘儀呪文をプレイするに際し、あなたはこのカードを手札から公開して、連繋コストを支払ってもよい。 そうした場合、このカードの効果をその呪文に加える。）", "type": "インスタント — 秘儀"}, {"language": "Portuguese (Brazil)", "multiverseId": 94356, "name": "Extravazar em Labaredas", "text": "Cada vez que a permanente alvo fosse causar dano a uma criatura ou jogador neste turno, em vez disso ela causa o dobro daquele dano àquela criatura ou jogador.\nUnir em Arcana {2}{R}{R} (Conforme jogar uma mágica Arcana, você pode revelar este card de sua mão e pagar o seu custo de união. Se o fizer, adicione os efeitos deste card àquela mágica.)", "type": "Mágica Instantânea - Arcana"}, {"language": "Chinese Simplified", "multiverseId": 93501, "name": "以火助势", "text": "如果目标永久物在本回合中将对某生物或牌手造成伤害，则它每次均改为对该生物或牌手造成加倍的伤害。\n通联古咒{2}{R}{R} （当你使用古咒咒语时，你可以从你的手上展示此牌，并支付其通联费用。 若你如此作，则将此牌的效应加入该咒语中。）", "type": "瞬间～古咒"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "113902", "cardKingdomId": "113737", "cardsphereId": "7227", "mcmId": "12881", "mcmMetaId": "7470", "mtgjsonV4Id": "fd22ee00-125e-55d0-b451-97aae08248f1", "mtgoFoilId": "21598", "mtgoId": "21597", "multiverseId": "81986", "scryfallId": "97040b82-ad9e-4c06-a9ac-74d0688279f9", "scryfallIllustrationId": "1c32c1d8-52e9-4ae0-8f18-63dd424b5204", "scryfallOracleId": "543599e2-8312-43a6-ab26-0be17e690d4f", "tcgplayerProductId": "12323"}, "keywords": ["Splice"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}", "manaValue": 4.0, "name": "Overblaze", "number": "114", "originalText": "Each time target permanent would deal damage to a creature or player this turn, it deals double that damage to that creature or player instead.\nSplice onto Arcane {2}{R}{R} (As you play an Arcane spell, you may reveal this card from your hand and pay its splice cost. If you do, add this card's effects to that spell.)", "originalType": "Instant - Arcane", "printings": ["BOK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/0ee160df4320572a", "cardKingdomFoil": "https://mtgjson.com/links/0fa93e3838db3fac", "cardmarket": "https://mtgjson.com/links/98e9dd18c2cbc93c", "tcgplayer": "https://mtgjson.com/links/c4045f76b2c6a2be"}, "rarity": "uncommon", "rulings": [{"date": "2013-06-07", "text": "You reveal all cards you intend to splice at the same time. Each individual card can be spliced only once onto any one spell."}, {"date": "2013-06-07", "text": "A card with a splice ability can’t be spliced onto itself because the spell is on the stack (and not in your hand) when you reveal the cards you want to splice onto it."}, {"date": "2013-06-07", "text": "You choose all targets for the spell after revealing cards you want to splice, including any targets required by the text of any of those cards. You may choose a different target for each instance of the word “target” on the resulting spell."}, {"date": "2013-06-07", "text": "If all of the spell’s targets are illegal when the spell tries to resolve, it won’t resolve and none of its effects will happen."}], "setCode": "BOK", "subtypes": ["Arcane"], "supertypes": [], "text": "Each time target permanent would deal damage to a permanent or player this turn, it deals double that damage to that permanent or player instead.\nSplice onto Arcane {2}{R}{R} (As you cast an Arcane spell, you may reveal this card from your hand and pay its splice cost. If you do, add this card's effects to that spell.)", "type": "Instant — Arcane", "types": ["Instant"], "uuid": "3b921b2e-6388-58f7-a84d-41f1c8338c00"}