{"artist": "Sam Rowan", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 9221, "finishes": ["nonfoil", "foil"], "flavorText": "Tovolar's howl of command was too much to resist, even for Arlinn's own loyal pack.", "foreignData": [{"flavorText": "Selbst Arlinns eigenes Rudel konnte Tovolars Befehlsgeheul nicht widerstehen.", "language": "German", "multiverseId": 535248, "name": "Verrat des Rudels", "text": "Übernimm bis zum Ende des Zuges die Kontrolle über eine Kreatur deiner Wahl. Enttappe sie. Sie erhält Eile bis zum Ende des Zuges. Falls du einen Wolf oder Werwolf kontrollierst, wende Hellsicht 2 an. (Schaue dir die obersten zwei Karten deiner Bibliothek an. Du kannst eine beliebige Anzahl davon unter deine Bibliothek legen und den Rest in beliebiger Reihenfolge oben darauf.)", "type": "Hexerei"}, {"flavorText": "Fue demasiado difícil resistirse al aullido autoritario de Tovolar, incluso para la manada leal de Arlinn.", "language": "Spanish", "multiverseId": 535564, "name": "Traición de la manada", "text": "Gana el control de la criatura objetivo hasta el final del turno. Endereza esa criatura. Gana la habilidad de prisa hasta el final del turno. Si controlas un Lobo o Licántropo, adivina 2. (Mira las dos primeras cartas de tu biblioteca, luego pon cualquier cantidad de ellas en el fondo de tu biblioteca y el resto en la parte superior en cualquier orden.)", "type": "Conjuro"}, {"flavorText": "Il était trop difficile de résister au hurlement impérieux de Tovolar, même pour la propre meute d'Arlinn.", "language": "French", "multiverseId": 535880, "name": "Trahison de la meute", "text": "Acquérez le contrôle d'une créature ciblée jusqu'à la fin du tour. Dégagez cette créature. Elle acquiert la célérité jusqu'à la fin du tour. Si vous contrôlez un loup ou un loup-garou, regard 2. (Regardez les deux cartes du dessus de votre bibliothèque. Mettez n'importe quel nombre d'entre elles au-dessous de votre bibliothèque et le reste, au-dessus, dans n'importe quel ordre.)", "type": "Rituel"}, {"flavorText": "L'ululato di Tovolar era impossibile da resistere, anche per il fedele branco di Arlinn.", "language": "Italian", "multiverseId": 536196, "name": "Tradimento del Branco", "text": "Prendi il controllo di una creatura bersaglio fino alla fine del turno. STAPpa quella creatura. Ha rapidità fino alla fine del turno. Se controlli un Lupo o un Mannaro, profetizza 2. (Guarda le prime due carte del tuo grimorio, poi mettine un qualsiasi numero in fondo al tuo grimorio e le altre in cima in qualsiasi ordine.)", "type": "Stregoneria"}, {"flavorText": "アーリンの忠実な群れですら、トヴォラーの招集の遠吠えには耐えがたいものがあった。", "language": "Japanese", "multiverseId": 536512, "name": "群れの裏切り", "text": "クリーチャー１体を対象とする。ターン終了時まで、それのコントロールを得る。そのクリーチャーをアンタップする。ターン終了時まで、それは速攻を得る。あなたが狼や狼男をコントロールしているなら、占術２を行う。（あなたのライブラリーの一番上にあるカード２枚を見て、そのうちの望む枚数をあなたのライブラリーの一番下に、残りを一番上に、それぞれ望む順番で置く。）", "type": "ソーサリー"}, {"flavorText": "토볼라르가 울부짖으며 내린 명령은 아를린에게 충성하는 무리조차 저항할 수 없을 정도로 벅찼다.", "language": "Korean", "multiverseId": 536828, "name": "무리의 배신", "text": "생물을 목표로 정한다. 턴종료까지 그 생물의 조종권을 얻는다. 그 생물은 언탭되고 턴종료까지 신속을 얻는다. 당신이 늑대 또는 늑대인간을 조종한다면, 점술 2를 한다. (당신의 서고 맨 위 카드 두 장을 본다. 당신은 그 카드들 중 원하는 만큼을 당신의 서고 맨 밑에 놓고 나머지를 당신의 서고 맨 위에 원하는 순서대로 놓을 수 있다.)", "type": "집중마법"}, {"flavorText": "O uivo de comando de Tovolar era forte demais para resistir, mesmo para a leal alcateia da própria Arlinn.", "language": "Portuguese (Brazil)", "multiverseId": 537144, "name": "Traição da Alcateia", "text": "Ganhe o controle da criatura alvo até o final do turno. Desvire aquela criatura. Ela ganha ímpeto até o final do turno. Se você controlar um Lobo ou um Lobisomem, use vidência 2. (Olhe os dois cards do topo do seu grimório. Depois, coloque qualquer número deles no fundo do seu grimório e o restante no topo em qualquer ordem.)", "type": "Feitiço"}, {"flavorText": "Владетельный вой Товолара был слишком силен, и даже верная стая Арлинн не могла сопротивляться ему.", "language": "Russian", "multiverseId": 537460, "name": "Предательство Стаи", "text": "Получите контроль над целевым существом до конца хода. Разверните то существо. Оно получает Ускорение до конца хода. Если у вас под контролем есть Волк или Вервольф, предскажите 2. (Посмотрите две верхние карты вашей библиотеки, затем положите любое количество из них в низ вашей библиотеки, а остальные на верх вашей библиотеки в любом порядке.)", "type": "Волшебство"}, {"flavorText": "托瓦拉号令狼嚎难以抗拒，纵连雅琳自己的忠诚狼群亦为之动摇。", "language": "Chinese Simplified", "multiverseId": 537776, "name": "狼群背叛", "text": "获得目标生物的操控权直到回合结束。重置该生物。它获得敏捷异能直到回合结束。如果你操控狼或狼人，则占卜2。（检视你牌库顶的两张牌，然后将其中任意数量的牌以任意顺序置于你牌库底，其余则以任意顺序置于你牌库顶。）", "type": "法术"}, {"flavorText": "托瓦拉號令狼嚎難以抗拒，縱連雅琳自己的忠誠狼群亦為之動搖。", "language": "Chinese Traditional", "multiverseId": 538092, "name": "狼群背叛", "text": "獲得目標生物的操控權直到回合結束。重置該生物。它獲得敏捷異能直到回合結束。如果你操控狼或狼人，則占卜2。（檢視你牌庫頂的兩張牌，然後將其中任意數量的牌以任意順序置於你牌庫底，其餘則以任意順序置於你牌庫頂。）", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "251017", "cardKingdomId": "250734", "cardsphereId": "81034", "mcmId": "575066", "mcmMetaId": "345528", "mtgArenaId": "78503", "mtgjsonV4Id": "8bd53b86-08c2-548d-aaa4-833bedb139ad", "mtgoId": "93278", "multiverseId": "534932", "scryfallId": "7ebadb1e-32cd-41d6-b26e-49134973d05c", "scryfallIllustrationId": "9a970d35-2e3a-44cf-8760-9c0081094d04", "scryfallOracleId": "5b7abe71-0be3-4dd4-880e-88b65b47ea4d", "tcgplayerProductId": "248284"}, "isStorySpotlight": true, "keywords": ["Scry"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}", "manaValue": 3.0, "name": "Pack's Betrayal", "number": "153", "originalText": "Gain control of target creature until end of turn. Untap that creature. It gains haste until end of turn. If you control a Wolf or Werewolf, scry 2. (Look at the top two cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)", "originalType": "Sorcery", "printings": ["DBL", "MID"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7fe323731f12e5cf", "cardKingdomFoil": "https://mtgjson.com/links/bb009d1dc8c70969", "cardmarket": "https://mtgjson.com/links/3b51aba870dfbd28", "tcgplayer": "https://mtgjson.com/links/de486c5bcbd843e8"}, "rarity": "common", "rulings": [], "setCode": "MID", "subtypes": [], "supertypes": [], "text": "Gain control of target creature until end of turn. Untap that creature. It gains haste until end of turn. If you control a Wolf or Werewolf, scry 2. (Look at the top two cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "fa180baf-a5c1-5d3c-8530-2d7139cb3f9d"}