{"artist": "Mike Dringenberg", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 2.0, "edhrecRank": 5089, "finishes": ["nonfoil", "foil"], "flavorText": "It gathers hues from the twilight mist so that its master can paint a better world.", "foreignData": [{"flavorText": "Er sammelt Schattierungen im Dämmernebel, damit sein Meister eine bessere Welt malen kann.", "language": "German", "multiverseId": 174734, "name": "Diener des Malers", "text": "Sowie der Diener des Malers ins Spiel kommt, bestimme eine Farbe.\nAlle Karten, die nicht im Spiel sind, alle Zaubersprüche und alle bleibenden Karten haben diese Farbe zusätzlich zu ihren anderen Farben.", "type": "Artefaktkreatur — Vogelscheuche"}, {"flavorText": "Recolecta tintes de la niebla del crepúsculo para que su amo pueda pintar un mundo mejor.", "language": "Spanish", "multiverseId": 172928, "name": "Sirviente del pintor", "text": "En cuanto el Sirviente del pintor entre en juego, elige un color.\nTodas las cartas que no están en juego, hechizos y permanentes son del color elegido además de sus otros colores.", "type": "Criatura artefacto — Espantapájaros"}, {"flavorText": "Il récolte des pigments de la brume crépusculaire pour que son maître puisse peindre un monde meilleur.", "language": "French", "multiverseId": 173530, "name": "Servant du peintre", "text": "Au moment où le Servant du peintre arrive en jeu, choisissez une couleur.\nToutes les cartes qui ne sont pas en jeu, les sorts et les permanents sont de la couleur choisie en plus de leurs autres couleurs.", "type": "Créature-artefact : épouvantail"}, {"flavorText": "Raccoglie le tinte dalla nebbia serale, affinché il suo padrone possa dipingere un mondo migliore.", "language": "Italian", "multiverseId": 173831, "name": "Servo del Pittore", "text": "Mentre il Servo del Pittore entra in gioco, scegli un colore.\nTutte le carte che non sono in gioco, le magie e i permanenti sono del colore scelto in aggiunta ai propri altri colori.", "type": "Creatura Artefatto — Spaventapasseri"}, {"flavorText": "それが黄昏の霧から色を集めることで、主人は世界をより良い色に染めることができる。", "language": "Japanese", "multiverseId": 174132, "name": "絵描きの召使い", "text": "絵描きの召使いが場に出るに際し、色を１色選ぶ。\nすべての呪文やパーマネントや場に出ていないカードは、自身の色に加えて選ばれた色である。", "type": "アーティファクト・クリーチャー — カカシ"}, {"flavorText": "Ele coleta tonalidades das brumas do crepúsculo para que seu mestre possa pintar um mundo melhor.", "language": "Portuguese (Brazil)", "multiverseId": 172326, "name": "Servo do Pintor", "text": "Conforme Servo do Pintor entra em jogo, escolha uma cor.\nTodos os cards que não estão em jogo, mágicas e permanentes são da cor escolhida além de suas outras cores.", "type": "Criatura Artefato — Espantalho"}, {"flavorText": "Оно собирает краски сумеречного тумана, чтобы его хозяин смог написать ими картину о лучшем мире.", "language": "Russian", "multiverseId": 172627, "name": "Слуга Живописца", "text": "При входе Слуги Живописца в игру выберите цвет.\nВсе карты, которые не находятся в игре, заклинания и перманенты являются объектами выбранного цвета в дополнение к своим другим цветам.", "type": "Артефактное Существо — Пугало"}, {"flavorText": "它从暮色雾气间收集颜色，好让主人画出更好的世界。", "language": "Chinese Simplified", "multiverseId": 173229, "name": "画家仆役", "text": "于画家仆役进场时，选择一种颜色。\n所有不在场上的牌，所有咒语，以及所有永久物均额外具有该颜色。", "type": "神器生物～稻草人"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "124957", "cardKingdomId": "124671", "cardsphereId": "41366", "mcmId": "19272", "mcmMetaId": "9821", "mtgjsonV4Id": "40a0ef0c-cb01-51d1-8538-f89ccf8f7a8c", "mtgoFoilId": "29430", "mtgoId": "29429", "multiverseId": "146022", "scryfallId": "be407a81-b25a-4e5d-845e-be0cc0d18db8", "scryfallIllustrationId": "97767359-7458-4c62-ab33-9ef0e4e26d1f", "scryfallOracleId": "baf93873-35e6-4bf2-bdcc-78a5206422fb", "tcgplayerProductId": "18732"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "vintage": "Legal"}, "manaCost": "{2}", "manaValue": 2.0, "name": "Painter's Servant", "number": "257", "originalText": "As Painter's Servant comes into play, choose a color.\nAll cards that aren't in play, spells, and permanents are the chosen color in addition to their other colors.", "originalType": "Artifact Creature - Scarecrow", "power": "1", "printings": ["MPS", "SHM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/35414997993286f5", "cardKingdomFoil": "https://mtgjson.com/links/f020fe240f26230b", "cardmarket": "https://mtgjson.com/links/d5351d18e3398b82", "tcgplayer": "https://mtgjson.com/links/1910152aa788d768"}, "rarity": "rare", "rulings": [{"date": "2008-05-01", "text": "This ability affects every card in every game zone, all tokens on the battlefield, and all spell copies on the stack, regardless of who controls or owns them."}, {"date": "2008-05-01", "text": "This ability doesn’t overwrite any previous colors. Rather, it adds another color."}, {"date": "2008-05-01", "text": "The effects of multiple Painter’s Servants are cumulative."}, {"date": "2008-05-01", "text": "While Painter’s Servant is on the battlefield, an effect that changes an object’s colors will overwrite Painter’s Servant’s effect. For example, casting Cerulean Wisps on a creature will turn it blue, regardless of the color chosen for Painter’s Servant."}, {"date": "2008-05-01", "text": "Each card becomes a new object as it changes zones, so this effect will apply to it from scratch in the new zone. Zone-change replacement abilities that care about the new color (like “[color] permanents enter the battlefield tapped”) won’t work because those effects are applied as the card is entering its new zone. Zone-change triggered abilities that care about the new color (like “when a [color] permanent enters the battlefield” or “when you cast a [color] spell”) will work because those effects apply after the card is already in its new zone."}, {"date": "2008-05-01", "text": "If something affected by Painter’s Servant is normally colorless, it will simply be the new color. It won’t be both the new color and colorless."}], "setCode": "SHM", "subtypes": ["Scarecrow"], "supertypes": [], "text": "As Painter's Servant enters the battlefield, choose a color.\nAll cards that aren't on the battlefield, spells, and permanents are the chosen color in addition to their other colors.", "toughness": "3", "type": "Artifact Creature — Scarecrow", "types": ["Artifact", "Creature"], "uuid": "e8a0b28b-01e3-5e11-b57c-27f761cde41b"}