{"artist": "Manuel Castañón", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["G", "R"], "colors": ["G", "R"], "convertedManaCost": 5.0, "edhrecRank": 10154, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 484740, "name": "Pako, arkaner Retriever", "text": "Partner von Haldan, eifriger Arkanist\nEile\nImmer wenn Pako, arkaner Retriever, angreift, schicke die oberste Karte der Bibliothek jedes Spielers ins Exil und lege auf jede von ihnen eine Apportiermarke. Lege für jede auf diese Weise ins Exil geschickte Nichtkreatur-Karte eine +1/+1-Marke auf Pako.", "type": "Legendäre Kreatur — Elementarwesen, Hund"}, {"language": "Spanish", "multiverseId": 484760, "name": "Pako, recobrador arcano", "text": "Camarada de Haldan, arcanista entusiasta.\nPrisa.\nSiempre que Pako, recobrador arcano ataque, exilia la primera carta de la biblioteca de cada jugador y pon un contador de juego sobre cada una de ellas. Pon un contador +1/+1 sobre Pako por cada carta que no sea de criatura exiliada de esta manera.", "type": "Criatura legendaria — Perro elemental"}, {"language": "French", "multiverseId": 484780, "name": "Pako, retriever ésotérique", "text": "Partenariat avec Haldan, arcaniste avide\nCélérité\nÀ chaque fois que Pako, retriever ésotérique attaque, exilez la carte du dessus de la bibliothèque de chaque joueur et mettez un marqueur « rabattage » sur chacune d'elles. Mettez un marqueur +1/+1 sur Pako pour chaque carte non-créature exilée de cette manière.", "type": "Créature légendaire : élémental et chien de chasse"}, {"language": "Italian", "multiverseId": 484800, "name": "Pako, Segugio da Riporto Arcano", "text": "Partner di Haldan, Avido Arcanista\nRapidità\nOgniqualvolta Pako, Segugio da Riporto Arcano attacca, esilia la prima carta del grimorio di ogni giocatore e metti un segnalino riporto su ognuna di esse. Metti un segnalino +1/+1 su Pako per ogni carta non creatura esiliata in questo modo.", "type": "Creatura Leggendaria — Segugio Elementale"}, {"language": "Japanese", "multiverseId": 484820, "name": "秘儀を運ぶもの、パコ", "text": "熱心な秘儀術師、ハルダンとの共闘\n速攻\n秘儀を運ぶもの、パコが攻撃するたび、各プレイヤーのライブラリーの一番上のカードを追放し、それらの上に取得カウンターをそれぞれ１個置く。これにより追放されたクリーチャーでないカード１枚につき、秘儀を運ぶもの、パコの上に＋１/＋１カウンターを１個置く。", "type": "伝説のクリーチャー — エレメンタル・猟犬"}, {"language": "Portuguese (Brazil)", "multiverseId": 484840, "name": "Pako, Buscador Arcano", "text": "Parceiro de Haldan, Arcanista Ávido\nÍmpeto\nToda vez que Pako, Buscador Arcano, atacar, exile o card do topo do grimório de cada jogador e coloque um marcador de buscar em cada um deles. Coloque um marcador +1/+1 em Pako para cada card que não seja de criatura exilado dessa forma.", "type": "Criatura Lendária — Elemental Sabujo"}, {"language": "Russian", "multiverseId": 484860, "name": "Пако, Колдовской Добытчик", "text": "Партнер с Халданом, Заядлым Арканистом\nУскорение\nКаждый раз, когда Пако, Колдовской Добытчик атакует, изгоните верхнюю карту библиотеки каждого игрока и положите один жетон получения на каждую из тех карт. Положите один жетон +1/+1 на Пако за каждую не являющуюся существом карту, изгнанную таким образом.", "type": "Легендарное Существо — Элементаль Пес"}], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "233244", "cardKingdomId": "232321", "cardsphereId": "66382", "mcmId": "452263", "mtgjsonV4Id": "0b250820-522c-5e06-b96b-b6526b482cbb", "mtgoId": "80749", "multiverseId": "484720", "scryfallId": "066c8f63-52e6-475e-8d27-6ee37e92fc05", "scryfallIllustrationId": "27461402-c857-4141-b750-9f083617b368", "scryfallOracleId": "680a3e17-5144-4e97-bc59-9f5fc3ad6514", "tcgplayerProductId": "212182"}, "isStarter": true, "keywords": ["Haste", "Partner", "Partner with"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}{G}", "manaValue": 5.0, "name": "Pako, Arcane Retriever", "number": "13", "originalText": "Partner with Haldan, Avid Arcanist\nHaste\nWhenever Pako, Arcane Retriever attacks, exile the top card of each player's library and put a fetch counter on each of them. Put a +1/+1 counter on Pako for each noncreature card exiled this way.", "originalType": "Legendary Creature — Elemental Hound", "power": "3", "printings": ["C20"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1e5d86b970d191a8", "cardKingdomFoil": "https://mtgjson.com/links/666b55902d93f75b", "tcgplayer": "https://mtgjson.com/links/54b5f8d257ab00f7"}, "rarity": "mythic", "rulings": [{"date": "2020-04-17", "text": "You exile cards and put +1/+1 counters on Pako all while Pako’s last ability is resolving. Nothing can happen between the two, and no player may choose to take actions."}, {"date": "2020-04-17", "text": "Haldan’s ability applies only while it’s on the battlefield. You’ll be able to play cards you exiled with fetch counters before Haldan entered the battlefield, and if Haldan leaves, you won’t be able to play cards that were exiled with fetch counters until Haldan returns."}, {"date": "2020-04-17", "text": "Haldan doesn’t change when you can play the exiled cards. For example, if you exile a sorcery card, you can cast it only during your main phase when the stack is empty. If you exile a land card, you can play it only during your main phase and only if you have an available land play remaining."}, {"date": "2020-04-17", "text": "A creature card that you exiled with a fetch counter on it may be cast as a noncreature spell if a rule or effect (such as that of adventurer cards) allows you to do so."}, {"date": "2020-04-17", "text": "In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. If you leave the game, any spells or permanents you control that Pako fetched are exiled."}, {"date": "2020-04-17", "text": "“Partner with [name]” represents two abilities. The first is a triggered ability: “When this permanent enters the battlefield, target player may search their library for a card named [name], reveal it, put it into their hand, then shuffle their library.”"}, {"date": "2020-04-17", "text": "Note that the target player searches their library (which may be affected by effects such as that of Stranglehold) and that the card they find is revealed, even though these words aren’t included in the ability’s reminder text."}, {"date": "2020-04-17", "text": "The second ability represented by the “partner with [name]” keyword modifies the rules for deck construction in the Commander variant and has no function outside of that variant. If a legendary creature card with “partner with [name]” is designated as your commander, the named legendary creature card can also be designated as your commander."}, {"date": "2020-04-17", "text": "If your Commander deck has two commanders, you can only include cards whose own color identities are also found in your commanders’ combined color identities. If Haldan and Pako are your commanders, your deck may contain cards with blue, red, and/or green in their color identity, but not cards with white or black."}, {"date": "2020-04-17", "text": "Both commanders start in the command zone, and the remaining 98 cards of your deck are shuffled to become your library."}, {"date": "2020-04-17", "text": "A creature with a “partner with” ability can’t partner with any creature other than its designated partner. Losing a partner ability during the game doesn’t cause either to cease to be your commander."}, {"date": "2020-04-17", "text": "Once the game begins, your two commanders are tracked separately. If you cast one, you won’t have to pay an additional {2} the first time you cast the other. A player loses the game after having been dealt 21 damage from one of them, not from both of them combined. Command Beacon’s effect puts one into your hand from the command zone, not both."}, {"date": "2020-04-17", "text": "The triggered ability of the “partner with” keyword still triggers in a Commander game. If your other commander has somehow ended up in your library, you can find it. You can also target another player who might have that card in their library."}], "securityStamp": "oval", "setCode": "C20", "subtypes": ["Elemental", "Dog"], "supertypes": ["Legendary"], "text": "Partner with Haldan, Avid Arcanist\nHaste\nWhenever Pako, Arcane Retriever attacks, exile the top card of each player's library and put a fetch counter on each of them. Put a +1/+1 counter on Pako for each noncreature card exiled this way.", "toughness": "3", "type": "Legendary Creature — Elemental Dog", "types": ["Creature"], "uuid": "1039432d-3b62-568e-b4f8-a2890ff85c72"}