{"artist": "David Palumbo", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 2629, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 512385, "name": "Palast-Kerkermeister", "text": "Wenn der Palast-Kerkermeister ins Spiel kommt, wirst du zum Monarchen.\nWenn der Palast-Kerkermeister ins Spiel kommt, schicke eine Kreatur deiner Wahl, die ein Gegner kontrolliert, ins Exil, bis ein Gegner zum Monarchen wird.", "type": "Kreatur — Mensch, Soldat"}, {"language": "Spanish", "multiverseId": 512506, "name": "Carcelero de palacio", "text": "Cuando el Carcelero de palacio entre al campo de batalla, te conviertes en el monarca.\nCuando el Carcelero de palacio entre al campo de batalla, exilia la criatura objetivo que controla un oponente hasta que un oponente se convierta en el monarca.", "type": "Criatura — Soldado humano"}, {"language": "French", "multiverseId": 512627, "name": "Gardien de prison du palais", "text": "Quand le Gardien de prison du palais arrive sur le champ de bataille, vous devenez le monarque.\nQuand le Gardien de prison du palais arrive sur le champ de bataille, exilez une créature ciblée qu'un adversaire contrôle jusqu'à ce qu'un adversaire devienne le monarque.", "type": "Créature : humain et soldat"}, {"language": "Italian", "multiverseId": 512748, "name": "Carceriere del Palazzo", "text": "Quando il Carceriere del Palazzo entra nel campo di battaglia, diventi il monarca.\nQuando il Carceriere del Palazzo entra nel campo di battaglia, esilia una creatura bersaglio controllata da un avversario finché un avversario non diventa il monarca.", "type": "Creatura — Soldato Umano"}, {"language": "Japanese", "multiverseId": 512869, "name": "宮殿の看守", "text": "宮殿の看守が戦場に出たとき、あなたが統治者になる。\n宮殿の看守が戦場に出たとき、対戦相手がコントロールしているクリーチャー１体を対象とする。それを追放する。対戦相手１人が統治者になるまでそれを追放する。", "type": "クリーチャー — 人間・兵士"}, {"language": "Portuguese (Brazil)", "multiverseId": 512990, "name": "Carcereiro do Palácio", "text": "Quando Carcereiro do Palácio entra no campo de batalha, você se torna o monarca.\nQuando Carcereiro do Palácio entrar no campo de batalha, exile a criatura alvo que um oponente controla até que um oponente se torne o monarca.", "type": "Criatura — Humano Soldado"}, {"language": "Russian", "multiverseId": 513111, "name": "Дворцовый Тюремщик", "text": "Когда Дворцовый Тюремщик выходит на поле битвы, вы становитесь монархом.\nКогда Дворцовый Тюремщик выходит на поле битвы, изгоните целевое существо под контролем оппонента до тех пор, пока кто-либо из оппонентов не станет монархом.", "type": "Существо — Человек Солдат"}, {"language": "Chinese Simplified", "multiverseId": 513232, "name": "宫殿狱卒", "text": "当宫殿狱卒进战场时，你成为君主。\n当宫殿狱卒进战场时，放逐目标由对手操控的生物，直到任一对手成为君主为止。", "type": "生物 ～人类／士兵"}, {"language": "Chinese Traditional", "multiverseId": 513353, "name": "宮殿獄卒", "text": "當宮殿獄卒進戰場時，你成為君主。\n當宮殿獄卒進戰場時，放逐目標由對手操控的生物，直到任一對手成為君主為止。", "type": "生物 ～人類／士兵"}], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "242954", "cardKingdomId": "242449", "cardsphereId": "75385", "mcmId": "542751", "mtgjsonV4Id": "563b8e7d-1638-59d1-8b8f-cebe1c894377", "mtgoId": "86973", "multiverseId": "512264", "scryfallId": "ed869151-02e9-4daa-994d-ccdf9f9dc3c8", "scryfallIllustrationId": "70f2e232-3559-4dbf-b8ec-ce054760bc2c", "scryfallOracleId": "180eda7c-fca2-403b-85cd-8ffebaf9f408", "tcgplayerProductId": "233582"}, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "paupercommander": "Restricted", "vintage": "Legal"}, "manaCost": "{2}{W}{W}", "manaValue": 4.0, "name": "Palace Jailer", "number": "298", "originalText": "When Palace Jailer enters the battlefield, you become the monarch.\nWhen Palace Jailer enters the battlefield, exile target creature an opponent controls until an opponent becomes the monarch.", "originalType": "Creature — Human Soldier", "power": "2", "printings": ["CN2", "MB1", "PZ2", "TSR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/979cfcefebed7027", "cardKingdomFoil": "https://mtgjson.com/links/729f6671ba1cc68c", "tcgplayer": "https://mtgjson.com/links/46f2c211833064b0"}, "rarity": "special", "rulings": [{"date": "2021-03-19", "text": "The game starts with no monarch. Once an effect makes one player the monarch, the game will have exactly one monarch from that point forward."}, {"date": "2021-03-19", "text": "Being the monarch carries two inherent triggered abilities. “At the beginning of the monarch’s end step, that player draws a card” and “Whenever a creature deals combat damage to the monarch, its controller becomes the monarch.”"}, {"date": "2021-03-19", "text": "If you’re not the monarch as Palace Jailer’s second ability resolves, the creature will be exiled until there’s a new monarch and that player is one of your opponents. The creature won’t immediately return just because an opponent is the monarch."}, {"date": "2021-03-19", "text": "Auras attached to the exiled creature will be put into their owners’ graveyards. Equipment attached to the exiled creature will become unattached and remain on the battlefield. Counters on the exiled creature will cease to exist."}, {"date": "2021-03-19", "text": "If a creature token is exiled, it ceases to exist. It won’t return to the battlefield."}, {"date": "2021-03-19", "text": "Palace Jailer leaving the battlefield won’t cause the exiled creature to return. The game will continue to watch for the next time an opponent becomes the monarch."}, {"date": "2021-03-19", "text": "The opponent that controlled the exiled card doesn’t have to be the same opponent that becomes the monarch in order to cause that card to return to the battlefield. Any opponent becoming the monarch will cause the card to return."}, {"date": "2021-03-19", "text": "In a multiplayer game, if the monarch leaves the game, the player whose turn it is immediately becomes the monarch. If the player whose turn it is has left the game, instead the next player in turn order becomes the monarch."}], "setCode": "TSR", "subtypes": ["Human", "Soldier"], "supertypes": [], "text": "When Palace Jailer enters the battlefield, you become the monarch.\nWhen Palace Jailer enters the battlefield, exile target creature an opponent controls until an opponent becomes the monarch.", "toughness": "2", "type": "Creature — Human Soldier", "types": ["Creature"], "uuid": "0d02f774-8734-538a-ad75-b87e5b4f8b8c"}