{"artist": "Jim Pavelec", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 7.0, "edhrecRank": 8411, "finishes": ["nonfoil"], "flavorText": "\"Step lightly and we might be able to use it as a bridge.\"\n—Ib Halfheart, goblin tactician", "foreignData": [], "frameVersion": "2003", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "241285", "mcmId": "529122", "mcmMetaId": "8247", "mtgjsonV4Id": "edccfe7b-dfee-5d0d-80bd-2dc1be9b0908", "scryfallId": "db7ce449-d833-4954-945a-2f609cf083ad", "scryfallIllustrationId": "13435434-0980-4fd4-930d-e25ab4b790a7", "scryfallOracleId": "49d4aef7-d2d1-4f66-bc2a-79ec8cc96565", "tcgplayerProductId": "210444"}, "isReprint": true, "keywords": ["Trample"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{5}{G}{G}", "manaValue": 7.0, "name": "Panglacial Wurm", "number": "330", "originalReleaseDate": "2021-02-05", "power": "9", "printings": ["CSP", "FMB1", "PLIST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d762ab9dffefb8a9", "cardmarket": "https://mtgjson.com/links/bdb7bbdb7d2e6da4", "tcgplayer": "https://mtgjson.com/links/2f2903de6804c475"}, "rarity": "rare", "rulings": [{"date": "2006-07-15", "text": "Panglacial Wurm’s ability works only while you’re searching your own library. The effect that caused you to search needs to say “search” and “library,” and you need to be looking through your own library for this to work. Examples of effects that let you cast Panglacial Wurm are Rampant Growth and Gifts Ungiven. Examples of effects that don’t are Bribery and Sage Owl."}, {"date": "2006-07-15", "text": "Casting Panglacial Wurm while searching your library follows all the normal rules for casting a creature spell, except for timing (casting the Wurm this way always occurs during the resolution of another spell or ability) and what zone the Wurm is being cast from. The spell goes on the stack. You have to pay the Wurm’s mana cost and any applicable additional costs, which means you can activate mana abilities while you’re casting the Wurm while you’re searching your library."}, {"date": "2006-07-15", "text": "After you cast Panglacial Wurm, you pick up the search effect where you left off. When the search effect finishes resolving, the active player gets priority with Panglacial Wurm on the stack. Any abilities that triggered when the spell was cast are put on the stack now."}, {"date": "2006-07-15", "text": "If you have enough mana, you can cast multiple Panglacial Wurms during a single search effect."}, {"date": "2006-07-15", "text": "A Panglacial Wurm that you cast while searching your library can’t be found by the search effect."}, {"date": "2006-07-15", "text": "If you want to cast Panglacial Wurm while searching your library, you must do so before you find any cards with the search effect."}, {"date": "2006-07-15", "text": "While searching your library, you must keep your library in the same order until you shuffle it. This order could matter if you tap Millikin for mana, for example, to pay for a Panglacial Wurm you cast from your library."}], "setCode": "PLIST", "subtypes": ["Wurm"], "supertypes": [], "text": "Trample\nWhile you're searching your library, you may cast Panglacial Wurm from your library.", "toughness": "5", "type": "Creature — Wurm", "types": ["Creature"], "uuid": "d6ec81a6-bcc1-5678-bb49-46bbe5592701"}