{"artist": "Volkan Baǵa", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 4.0, "edhrecRank": 265, "finishes": ["nonfoil", "foil"], "flavorText": "All who listen hear their own song, a unique melody played just for them.", "foreignData": [{"flavorText": "Jeder, der zuhört, vernimmt sein eigenes Lied — eine einzigartige Melodie ganz für ihn alleine.", "language": "German", "multiverseId": 512486, "name": "Panharmonikon", "text": "Falls ein Artefakt oder eine Kreatur ins Spiel kommt und dadurch bei einer bleibenden Karte, die du kontrollierst, eine ausgelöste Fähigkeit auslöst, wird die Fähigkeit ein weiteres Mal ausgelöst.", "type": "Artefakt"}, {"flavorText": "Todos los que lo escuchan oyen su propia canción, una melodía única que suena solo para ellos.", "language": "Spanish", "multiverseId": 512607, "name": "Panharmónico", "text": "Si un artefacto o criatura que entra al campo de batalla hiciera que una habilidad disparada de un permanente que controlas se disparase, esa habilidad se dispara una vez más.", "type": "Artefacto"}, {"flavorText": "Tous ceux qui l'écoutent entendent une musique différente, une mélodie unique jouée seulement pour eux.", "language": "French", "multiverseId": 512728, "name": "Panharmonicus", "text": "Si l'arrivée sur le champ de bataille d'un artefact ou d'une créature provoque le déclenchement d'une capacité déclenchée d'un permanent que vous contrôlez, cette capacité se déclenche une fois de plus.", "type": "Artefact"}, {"flavorText": "Chiunque lo ascolti sente una canzone diversa, una melodia unica suonata solo per le sue orecchie.", "language": "Italian", "multiverseId": 512849, "name": "Panarmonico", "text": "Se un artefatto o una creatura che entrano nel campo di battaglia fanno innescare l'abilità innescata di un permanente che controlli, quell'abilità si innesca una volta in più.", "type": "Artefatto"}, {"flavorText": "その音色に耳を傾ける者たちは、自分自身の歌を聴く。自分のためのみに奏でられた独特な旋律を。", "language": "Japanese", "multiverseId": 512970, "name": "パンハモニコン", "text": "アーティファクト１つかクリーチャー１体が戦場に出たことによりあなたがコントロールするパーマネントの誘発型能力１つが誘発するなら、その能力は追加でもう１回誘発する。", "type": "アーティファクト"}, {"flavorText": "Cada um que o ouve escuta uma canção diferente, uma melodia única tocada só para os seus ouvidos.", "language": "Portuguese (Brazil)", "multiverseId": 513091, "name": "Panarmônico", "text": "Se um artefato ou uma criatura desencadear uma habilidade desencadeada de uma permanente que você controla ao entrar no campo de batalha, aquela habilidade será desencadeada uma vez adicional.", "type": "Artefato"}, {"flavorText": "Каждый, кто его слушает, слышит свою песню — уникальную мелодию, что играет только для него.", "language": "Russian", "multiverseId": 513212, "name": "Пангармоникон", "text": "Если выходящий на поле битвы артефакт или существо вызывает срабатывание срабатывающей способности перманента под вашим контролем, та способность срабатывает дополнительный раз.", "type": "Артефакт"}, {"flavorText": "听者各闻心中悦音，独特旋律为其特别奏响。", "language": "Chinese Simplified", "multiverseId": 513333, "name": "万和琴", "text": "如果进战场的神器或生物触发由你操控之永久物的触发式异能，则该异能额外触发一次。", "type": "神器"}, {"flavorText": "聽者心中各聞悅音，獨特旋律為其特別奏響。", "language": "Chinese Traditional", "multiverseId": 513454, "name": "萬和琴", "text": "如果進戰場的神器或生物觸發由你操控的永久物之觸發式異能，則該異能額外觸發一次。", "type": "神器"}], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "243243", "cardKingdomId": "242814", "cardsphereId": "75216", "mcmId": "547826", "mtgjsonV4Id": "991f0ac8-76e6-5675-85c1-9846ae6a6bc6", "mtgoId": "87175", "multiverseId": "512365", "scryfallId": "9c88ec62-c3c9-4bb8-99f6-04c7a9d65e45", "scryfallIllustrationId": "c6ab8390-134c-4b37-ad69-0d55df14beba", "scryfallOracleId": "76678885-3674-443d-b9a2-2a460cf6aac0", "tcgplayerProductId": "234218"}, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}", "manaValue": 4.0, "name": "Panharmonicon", "number": "399", "originalText": "If an artifact or creature entering the battlefield causes a triggered ability of a permanent you control to trigger, that ability triggers an additional time.", "originalType": "Artifact", "printings": ["2X2", "J22", "KLD", "KLR", "PKLD", "PLIST", "PRM", "SLD", "TSR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2f854db188ada043", "cardKingdomFoil": "https://mtgjson.com/links/0be1ab70328777e9", "tcgplayer": "https://mtgjson.com/links/8097120d7f3d814b"}, "rarity": "special", "rulings": [{"date": "2021-03-19", "text": "Panharmonicon affects a permanent's own enters-the-battlefield triggered abilities as well as other triggered abilities that trigger when that permanent enters the battlefield. Such triggered abilities start with “when” or “whenever.”"}, {"date": "2021-03-19", "text": "Replacement effects are unaffected by Panharmonicon's ability. For example, a creature that enters the battlefield with one +1/+1 counter on it won't receive an additional +1/+1 counter."}, {"date": "2021-03-19", "text": "Abilities that apply “as [this artifact or creature] enters the battlefield,” such as choosing a color with Gauntlet of Power, are also unaffected."}, {"date": "2021-03-19", "text": "You don't need to control the permanent entering the battlefield, only the permanent that has the triggered ability."}, {"date": "2021-03-19", "text": "Panharmonicon's effect doesn't copy the triggered ability; it just causes the ability to trigger twice. Any choices made as you put the ability onto the stack, such as modes and targets, are made separately for each instance of the ability. Any choices made on resolution, such as whether to put counters on a permanent, are also made individually."}, {"date": "2021-03-19", "text": "If you control two Panharmonicons, an artifact or creature entering the battlefield causes abilities to trigger three times, not four. A third Panharmonicon causes abilities to trigger four times, a fourth causes abilities to trigger five times, and so on."}, {"date": "2021-03-19", "text": "If an artifact or creature entering the battlefield at the same time as Panharmonicon (including Panharmonicon itself) causes a triggered ability of a permanent you control to trigger, that ability triggers an additional time."}, {"date": "2021-03-19", "text": "If a triggered ability is linked to a second ability, additional instances of that triggered ability are also linked to that second ability. If the second ability refers to “the exiled card,” it refers to all cards exiled by instances of the triggered ability."}, {"date": "2021-03-19", "text": "In some cases involving linked abilities, an ability requires information about “the exiled card.” When this happens, the ability gets multiple answers. If these answers are being used to determine the value of a variable, the sum is used. For example, if Elite Arcanist's enters-the-battlefield ability triggers twice, two cards are exiled. The value of X in the activation cost of Elite Arcanist's other ability is the sum of the two cards' mana values. As the ability resolves, you create copies of both cards and can cast none, one, or both of the copies in any order."}], "setCode": "TSR", "subtypes": [], "supertypes": [], "text": "If an artifact or creature entering the battlefield causes a triggered ability of a permanent you control to trigger, that ability triggers an additional time.", "type": "Artifact", "types": ["Artifact"], "uuid": "13050cfb-9a41-5c62-b135-e548bd131961"}