{"artist": "Glen Angus", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 5.0, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 76397, "name": "Panoptischer Spiegel", "text": "Einprägen {X}, {T}: Du kannst eine Spontanzauber- oder Hexereikarte deiner Wahl mit umgewandelten Manakosten von X aus deiner Hand ganz aus dem Spiel entfernen. (Diese Karte wird in dieses Artefakt eingeprägt.)\nDu kannst zu Beginn deines Versorgungssegments die eingeprägte Spontanzauber- oder Hexereikarte kopieren und die Kopie spielen, ohne ihre Manakosten zu bezahlen.", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 75572, "name": "Espejo panóptico", "text": "Estampa {X}, {T}: Puedes remover del juego una carta de instantáneo o conjuro de tu mano con coste de maná convertido de X. (Esa carta es estampada en este artefacto.)\nAl comienzo de tu mantenimiento, puedes copiar una carta de instantáneo o conjuro estampada y jugar la copia sin pagar su coste de maná.", "type": "Artefacto"}, {"language": "French", "multiverseId": 76067, "name": "Miroir panoptique", "text": "Empreinte {X}, {T} : Vous pouvez retirer de la partie une carte d'éphémère ou de rituel de votre main ayant un coût converti de mana de X. (Cet artefact a l'empreinte de la carte retirée.)\nAu début de votre entretien, vous pouvez copier la carte d'éphémère ou de rituel dont cette carte a l'empreinte et jouer la copie sans payer son coût de mana.", "type": "Artefact"}, {"language": "Italian", "multiverseId": 75737, "name": "Specchio di Panoptic", "text": "Imprimere {X}, {T}: Puoi rimuovere dal gioco una carta istantaneo o stregoneria con costo di mana convertito pari a X presente nella tua mano. (Quella carta viene impressa su questo artefatto.)\nAll'inizio del tuo mantenimento, puoi copiare una carta istantaneo o stregoneria impressa e giocare la copia senza pagare il suo costo di mana.", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 76232, "name": "一望の鏡", "text": "刻印 ― {X}, {T}：あなたの手札にある、点数で見たマナ・コストがＸ点のインスタント･カードかソーサリー･カードを１枚、ゲームから取り除いてもよい。 （そのカードは、このアーティファクトに刻印される。）\nあなたのアップキープの開始時に、あなたは刻印されているインスタント･カードやソーサリー･カードの中から１枚をコピーし、そのコピーをマナ・コストを支払わずにプレイしてもよい。", "type": "アーティファクト"}, {"language": "Portuguese (Brazil)", "multiverseId": 75902, "name": "Espelho Panóptico", "text": "Estampar {X}, {T}: Você pode remover de jogo um card de mágica instantânea ou de feitiço com custo de mana convertido igual a X de sua mão. (O card removido fica estampado neste artefato.)\nNo início de sua manutenção, você pode copiar um card de mágica instantânea ou de feitiço estampado e jogar a cópia sem pagar seu custo de mana.", "type": "Artefato"}, {"language": "Chinese Simplified", "multiverseId": 76562, "name": "万象镜", "text": "压印～{X}，{T}：你可以将你手上一张总法术力费用为X的瞬间牌或法术牌移出对战。 （该牌压印在此神器上）\n在你的维持开始时，你可以复制压印的一张瞬间牌或法术牌并使用此复制，且不须支付其法术力费用。", "type": "神器"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "110547", "cardKingdomId": "110377", "cardsphereId": "12684", "mcmId": "352", "mcmMetaId": "4077", "mtgjsonV4Id": "53387149-460c-518c-b065-3d8096fd22e4", "mtgoFoilId": "20412", "mtgoId": "20411", "multiverseId": "47930", "scryfallId": "50e945b0-e919-41bb-9bc5-f71ad531e8f1", "scryfallIllustrationId": "57b6d5c1-a4db-4c87-8e71-eec0ea204f50", "scryfallOracleId": "505cb78d-b292-4d16-b3f2-110164b4cc93", "tcgplayerProductId": "11645"}, "keywords": ["Imprint"], "language": "English", "layout": "normal", "legalities": {"commander": "Banned", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{5}", "manaValue": 5.0, "name": "Panoptic Mirror", "number": "136", "originalText": "Imprint {X}, {T}: You may remove an instant or sorcery card with converted mana cost X in your hand from the game. (That card is imprinted on this artifact.)\nAt the beginning of your upkeep, you may copy an imprinted instant or sorcery card and play the copy without paying its mana cost.", "originalType": "Artifact", "printings": ["DST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7ce824aba66ab667", "cardKingdomFoil": "https://mtgjson.com/links/ae89fcb6110816ef", "cardmarket": "https://mtgjson.com/links/395089c36299123a", "tcgplayer": "https://mtgjson.com/links/10d43ab3118afd94"}, "rarity": "rare", "rulings": [{"date": "2004-12-01", "text": "The triggered ability triggers only once each upkeep, not once per imprinted card. If no cards are imprinted on Panoptic Mirror when the triggered ability resolves, it does nothing."}, {"date": "2004-12-01", "text": "As Panoptic Mirror’s triggered ability resolves, it allows you to create a copy of one of the instant or sorcery cards imprinted on Panoptic Mirror in the Exile zone (that’s where the imprinted card is) and then cast it without paying its mana cost."}, {"date": "2004-12-01", "text": "Exiling a card when the activated ability resolves is optional. If you choose to exile a card, you can exile only a card with converted mana cost equal to X."}, {"date": "2004-12-01", "text": "You may imprint a card on Panoptic Mirror in response to the upkeep-triggered ability. If you do, that card is available to copy when the triggered ability resolves."}, {"date": "2004-12-01", "text": "You don’t pay the spell’s mana cost. If the spell has X in its mana cost, X is 0. You do pay any additional costs for that spell. You can’t use any alternative costs."}, {"date": "2005-03-01", "text": "The creation of the copy and then the casting of the copy are both optional."}, {"date": "2017-04-18", "text": "To imprint a split card, you pay X equal to card’s converted mana cost, determined by the combined mana cost of its two halves. If the copied card is a split card, you choose which one side of it to cast, but you can’t cast both sides."}], "setCode": "DST", "subtypes": [], "supertypes": [], "text": "Imprint — {X}, {T}: You may exile an instant or sorcery card with mana value X from your hand.\nAt the beginning of your upkeep, you may copy a card exiled with Panoptic Mirror. If you do, you may cast the copy without paying its mana cost.", "type": "Artifact", "types": ["Artifact"], "uuid": "f1f15f6b-494d-5f74-83ba-939d0da8397f"}