{"artist": "Ben Thompson", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 11448, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 166001, "name": "Parallele Gedanken", "text": "Wenn die Parallelen Gedanken ins Spiel kommen, durchsuche deine Bibliothek nach sieben Karten, entferne diese in einem verdeckten Stapel ganz aus dem Spiel und mische diesen Stapel. Mische danach deine Bibliothek.\nFalls du eine Karte ziehen würdest, kannst du stattdessen die oberste Karte des so ganz aus dem Spiel entfernten Stapels auf deine Hand nehmen.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 166574, "name": "Pensamientos paralelos", "text": "Cuando los Pensamientos paralelos entren en juego, busca en tu biblioteca siete cartas, remuévelas del juego en un montón boca abajo y baraja ese montón. Luego baraja tu biblioteca.\nSi fueras a robar una carta, en vez de eso, puedes poner en tu mano la carta de la parte superior del montón que removiste.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 166144, "name": "Pensées parallèles", "text": "Quand les Pensées parallèles arrivent en jeu, cherchez sept cartes dans votre bibliothèque, retirez-les de la partie, empilez-les face cachée et mélangez cette pile. Mélangez ensuite votre bibliothèque.\nSi vous deviez piocher une carte, vous pouvez, à la place, mettre dans votre main la carte du dessus de la pile des cartes retirées.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 166287, "name": "Pensieri Paralleli", "text": "Quando i Pensieri Paralleli entrano in gioco, passa in rassegna il tuo grimorio, scegli sette carte, rimuovile dal gioco in una pila a faccia in giù e rimescola quella pila. Poi rimescola il tuo grimorio.\nSe devi pescare una carta, puoi invece aggiungere alla tua mano la carta in cima alla pila che hai rimosso.", "type": "Incantesimo"}, {"language": "Japanese", "name": "平行思考"}, {"language": "Portuguese (Brazil)", "multiverseId": 166430, "name": "Pensamentos Paralelos", "text": "Quando Pensamentos Paralelos entra em jogo, procure em seu grimório por sete cards, remova-os do jogo com a face voltada para baixo em uma pilha e embaralhe-a. Depois, embaralhe seu grimório.\nSe fosse comprar um card, ao invés disso você pode colocar em sua mão o card do topo da pilha que você removeu de jogo.", "type": "Encantamento"}], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "67043", "cardKingdomId": "66043", "cardsphereId": "40899", "mcmId": "1037", "mcmMetaId": "4087", "mtgjsonV4Id": "a2af9071-1af4-57e7-b034-177f0022667e", "mtgoFoilId": "18723", "mtgoId": "18722", "multiverseId": "43604", "scryfallId": "d913c541-a8fb-4383-bbab-988be3e0f5d5", "scryfallIllustrationId": "9801b50a-0e4a-41ee-a693-70ee58ee8d6c", "scryfallOracleId": "2daee7cb-6736-4aa6-9921-0371c1abe69f", "tcgplayerProductId": "10870"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "penny": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}{U}", "manaValue": 5.0, "name": "Parallel Thoughts", "number": "44", "originalText": "When Parallel Thoughts comes into play, search your library for seven cards, remove them from the game in a face-down pile, and shuffle that pile. Then shuffle your library.\nIf you would draw a card, you may instead put the top card of the pile you removed into your hand.", "originalType": "Enchantment", "printings": ["SCG"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2d65c42814284037", "cardKingdomFoil": "https://mtgjson.com/links/1776d112f6dae495", "cardmarket": "https://mtgjson.com/links/a86137221ca9d611", "tcgplayer": "https://mtgjson.com/links/5d473af73a8c4515"}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "If you have fewer than 7 cards in your library, exile them all."}, {"date": "2004-10-04", "text": "You can choose to take the top card from the pile (and not draw) even if there are no cards in the pile. This allows you to skip draws."}, {"date": "2004-10-04", "text": "You can’t look at the face down cards."}], "setCode": "SCG", "subtypes": [], "supertypes": [], "text": "When Parallel Thoughts enters the battlefield, search your library for seven cards, exile them in a face-down pile, and shuffle that pile. Then shuffle your library.\nIf you would draw a card, you may instead put the top card of the pile you exiled into your hand.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "6e41075d-21c4-52c6-96f3-35cce7f10605"}