{"artist": "Alayna Danner", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "edhrecRank": 34, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 545909, "name": "Pfad der Ahnen", "text": "Der Pfad der Ahnen kommt getappt ins Spiel.\n{T}: Erzeuge ein Mana einer beliebigen Farbe der Farbidentität deines Kommandeurs. Wenn dieses Mana verwendet wird, um einen Kreaturenzauber zu wirken, der einen Kreaturentyp mit deinem Kommandeur gemeinsam hat, wende Hellsicht 1 an.", "type": "Land"}, {"language": "Spanish", "multiverseId": 546021, "name": "Senda de los ancestros", "text": "La Senda de los ancestros entra al campo de batalla girada.\n{T}: Agrega un maná de cualquier color en la identidad de color de tu comandante. Cuando ese maná se use para lanzar un hechizo de criatura que comparta un tipo de criatura con tu comandante, adivina 1.", "type": "Tierra"}, {"language": "French", "multiverseId": 546133, "name": "Voie de l'Ascendance", "text": "La Voie de l'Ascendance arrive sur le champ de bataille engagée.\n{T} : Ajoutez un mana de la couleur de votre choix de l'identité couleur de votre commandant. Quand ce mana est dépensé pour lancer un sort de créature qui partage un type de créature avec votre commandant, regard 1.", "type": "Terrain"}, {"language": "Italian", "multiverseId": 546245, "name": "Sentiero Ancestrale", "text": "Il Sentiero Ancestrale entra nel campo di battaglia TAPpato.\n{T}: Aggiungi un mana di un qualsiasi colore nell'identità di colore del tuo comandante. Quando quel mana viene speso per lanciare una magia creatura che condivide un tipo di creatura con il tuo comandante, profetizza 1.", "type": "Terra"}, {"language": "Japanese", "multiverseId": 546357, "name": "祖先の道", "text": "祖先の道はタップ状態で戦場に出る。\n{T}：あなたの統率者の固有色のうち好きな色１色のマナ１点を加える。そのマナが、あなたの統率者と共通のクリーチャー・タイプを持つクリーチャー・呪文を唱えるために支払われたとき、占術１を行う。", "type": "土地"}, {"language": "Portuguese (Brazil)", "multiverseId": 546469, "name": "Caminho da Ascendência", "text": "Caminho da Ascendência entra no campo de batalha virado.\n{T}: Adicione um mana de qualquer cor da identidade de cor de seu comandante. Quando aquele mana for gasto para conjurar uma mágica de criatura que compartilhe um tipo de criatura com seu comandante, use vidência 1.", "type": "Terreno"}, {"language": "Russian", "multiverseId": 546581, "name": "Путь Предков", "text": "Путь Предков выходит на поле битвы повернутым.\n{T}: добавьте одну ману любого цвета из цветовой принадлежности вашего командира. Когда та мана тратится на разыгрывание заклинания существа, у которого есть такой же тип существа, как у вашего командира, предскажите 1.", "type": "Земля"}, {"language": "Chinese Simplified", "multiverseId": 546693, "name": "祖灵径道", "text": "祖灵径道须横置进战场。\n{T}：加一点法术力，其颜色为你指挥官标识色中的任一颜色。当该法术力用来施放与你指挥官具共通生物类别的生物咒语时，占卜1。", "type": "地"}, {"language": "Chinese Traditional", "multiverseId": 546805, "name": "祖靈徑道", "text": "祖靈徑道須橫置進戰場。\n{T}：加一點魔法力，其顏色為你指揮官標識色中的任一顏色。當該魔法力用來施放與你指揮官具共通生物類別的生物咒語時，占卜1。", "type": "地"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "253475", "cardsphereId": "82564", "mcmId": "584157", "mtgjsonV4Id": "a8b66b12-5659-5089-bd6a-cba9eeeb1a37", "multiverseId": "545797", "scryfallId": "92031493-b21f-4029-a01b-0a5c1ddb4776", "scryfallIllustrationId": "588f6d6f-e78a-4468-8067-dfbdf29c5a49", "scryfallOracleId": "b473e293-59e3-4e04-acf2-622604aeb25f", "tcgplayerProductId": "254248"}, "isReprint": true, "keywords": ["Scry"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaValue": 0.0, "name": "Path of Ancestry", "number": "177", "originalText": "Path of Ancestry enters the battlefield tapped.\n{T}: Add one mana of any color in your commander's color identity. When that mana is spent to cast a creature spell that shares a creature type with your commander, scry 1.", "originalType": "Land", "printings": ["40K", "AFC", "BRC", "C17", "C20", "CLB", "CMR", "KHC", "MIC", "NCC", "P30A", "PF21", "PHED", "PRM", "PZ2", "SCD", "SLD", "VOC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/365d8ddc8727275e", "tcgplayer": "https://mtgjson.com/links/b8c27ef25668102c"}, "rarity": "common", "rulings": [{"date": "2020-11-10", "text": "If you have two commanders, the last ability adds one mana of any color in their combined color identities."}, {"date": "2020-11-10", "text": "Your commander's creature types are checked immediately after you cast a creature spell spending mana from Path of Ancestry's last ability. They aren't set before the game begins, and they may not be the same types your commander had when you activated that ability. Notably, if your commander is in a hidden zone (like the hand or library) or is phased out, it's considered to have no creature types."}, {"date": "2020-11-10", "text": "If your commander is a card that has no colors in its color identity, Path of Ancestry's ability produces no mana. It doesn't produce {C}."}, {"date": "2020-11-10", "text": "If you don't have a commander, Path of Ancestry's ability produces no mana."}, {"date": "2020-11-10", "text": "If you cast your commander with mana from Path of Ancestry, and your commander hasn't somehow lost all of its creature types while on the stack, you'll scry 1."}, {"date": "2020-11-10", "text": "If your commander has no creature types, it can't share a creature type with any spell that you cast."}, {"date": "2020-11-10", "text": "If Path of Ancestry's last ability produces two mana (most likely due to Mana Reflection), spending those two mana to cast creature spells that share a creature type with your commander will cause two abilities to trigger. Each of those abilities will cause you to scry 1. You won't scry 2. This is true whether you spend the mana on one creature spell or two."}], "setCode": "VOC", "subtypes": [], "supertypes": [], "text": "Path of Ancestry enters the battlefield tapped.\n{T}: Add one mana of any color in your commander's color identity. When that mana is spent to cast a creature spell that shares a creature type with your commander, scry 1. (Look at the top card of your library. You may put that card on the bottom of your library.)", "type": "Land", "types": ["Land"], "uuid": "f680a92b-a7cf-5e5f-a77f-f20e42b585a6"}