{"artist": "Raoul Vitale", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 2987, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 519539, "name": "Anhänger des Gedeihens", "text": "Der Anhänger des Gedeihens kommt unter der Kontrolle eines Gegners, den du bestimmst, ins Spiel.\n{2}, {T}: Ziehe eine Karte, dann kannst du eine Länderkarte aus deiner Hand ins Spiel bringen. Der Besitzer des Anhängers des Gedeihens zieht eine Karte, dann kann er eine Länderkarte aus seiner Hand ins Spiel bringen.", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 519787, "name": "Medallón de prosperidad", "text": "El Medallón de prosperidad entra al campo de batalla bajo el control de un oponente de tu elección.\n{2}, {T}: Roba una carta, luego puedes poner en el campo de batalla una carta de tierra de tu mano. El propietario del Medallón de prosperidad roba una carta, luego ese jugador puede poner en el campo de batalla una carta de tierra de su mano.", "type": "Artefacto"}, {"language": "French", "multiverseId": 520035, "name": "Pendentif de prospérité", "text": "Le Pendentif de prospérité arrive sur le champ de bataille sous le contrôle d'un adversaire de votre choix.\n{2}, {T} : Piochez une carte, puis vous pouvez mettre sur le champ de bataille une carte de terrain de votre main. Le propriétaire du Pendentif de prospérité pioche une carte, puis ce joueur peut mettre sur le champ de bataille une carte de terrain depuis sa main.", "type": "Artefact"}, {"language": "Italian", "multiverseId": 520283, "name": "Medaglione della Prosperità", "text": "Il Medaglione della Prosperità entra nel campo di battaglia sotto il controllo di un avversario a tua scelta.\n{2}, {T}: Pesca una carta, poi puoi mettere sul campo di battaglia una carta terra dalla tua mano. Il proprietario del Medaglione della Prosperità pesca una carta, poi quel giocatore può mettere sul campo di battaglia una carta terra dalla sua mano.", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 520531, "name": "繁栄のペンダント", "text": "繁栄のペンダントは、あなたが選んだ対戦相手１人のコントロール下で戦場に出る。\n{2}, {T}：カード１枚を引く。その後、あなたはあなたの手札から土地・カード１枚を戦場に出してもよい。繁栄のペンダントのオーナーはカード１枚を引く。その後、そのプレイヤーは自分の手札から土地・カード１枚を戦場に出してもよい。", "type": "アーティファクト"}, {"language": "Portuguese (Brazil)", "multiverseId": 520779, "name": "Pingente da Prosperidade", "text": "Pingente da Prosperidade entra no campo de batalha sob o controle de um oponente à sua escolha.\n{2}, {T}: Compre um card. Depois, você pode colocar no campo de batalha um card de terreno de sua mão. O dono de Pingente da Prosperidade compra um card e, depois, aquele jogador pode colocar no campo de batalha um card de terreno da própria mão.", "type": "Artefato"}, {"language": "Russian", "multiverseId": 521027, "name": "Амулет Процветания", "text": "Амулет Процветания выходит на поле битвы под контролем оппонента по вашему выбору.\n{2}, {T}: возьмите карту, затем вы можете положить карту земли из вашей руки на поле битвы. Владелец Амулета Процветания берет карту, затем тот игрок может положить карту земли из своей руки на поле битвы.", "type": "Артефакт"}, {"language": "Chinese Simplified", "multiverseId": 521275, "name": "兴旺垂饰", "text": "于兴旺垂饰进战场时，选择一位对手。兴旺垂饰在该牌手的操控下进战场。\n{2}，{T}：抓一张牌，然后你可以将一张地牌从你手上放进战场。兴旺垂饰的拥有者抓一张牌，然后该牌手可以将一张地牌从其手上放进战场。", "type": "神器"}, {"language": "Chinese Traditional", "multiverseId": 521523, "name": "興旺垂飾", "text": "於興旺垂飾進戰場時，選擇一位對手。興旺垂飾在該玩家的操控下進戰場。\n{2}，{T}：抽一張牌，然後你可以將一張地牌從你手上放進戰場。興旺垂飾的擁有者抽一張牌，然後該玩家可以將一張地牌從其手上放進戰場。", "type": "神器"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "245298", "cardsphereId": "76587", "mcmId": "559520", "mtgjsonV4Id": "47c04481-7a14-528c-b614-64933f316609", "mtgoId": "89617", "multiverseId": "519291", "scryfallId": "a0a34d52-cbab-4d81-8e10-2597a2e25696", "scryfallIllustrationId": "c4b6a8be-fbdf-45fb-bea3-82c0bb14a0ac", "scryfallOracleId": "d958321b-789d-4f9a-bdbe-f907166a0216", "tcgplayerProductId": "236427"}, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Pendant of Prosperity", "number": "256", "originalText": "Pendant of Prosperity enters the battlefield under the control of an opponent of your choice.\n{2}, {T}: Draw a card, then you may put a land card from your hand onto the battlefield. Pendant of Prosperity's owner draws a card, then that player may put a land card from their hand onto the battlefield.", "originalType": "Artifact", "printings": ["C19", "C21"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1ac0c6d21f67b016", "tcgplayer": "https://mtgjson.com/links/f1a11a5216f296f1"}, "rarity": "rare", "rulings": [{"date": "2019-08-23", "text": "Pendant of Prosperity’s effect doesn’t count as playing a land. It can put a land card onto the battlefield even if you’ve already played your land for the turn, and even if it’s not your turn."}, {"date": "2019-08-23", "text": "If you control your own Pendant of Prosperity and activate its last ability, you’ll draw a card, then you may put a land card onto the battlefield, then you’ll draw a second card, then you may once again put a land card onto the battlefield."}, {"date": "2019-08-23", "text": "In a multiplayer game, if Pendant of Prosperity’s owner leaves the game, Pendant of Prosperity leaves the game with them. If Pendant of Prosperity’s controller leaves the game, Pendant of Prosperity is exiled (assuming that player wasn’t also Pendant of Prosperity’s owner)."}], "securityStamp": "oval", "setCode": "C21", "subtypes": [], "supertypes": [], "text": "Pendant of Prosperity enters the battlefield under the control of an opponent of your choice.\n{2}, {T}: Draw a card, then you may put a land card from your hand onto the battlefield. Pendant of Prosperity's owner draws a card, then that player may put a land card from their hand onto the battlefield.", "type": "Artifact", "types": ["Artifact"], "uuid": "555f5b1b-6d0f-5090-9014-e4bc6ec08947"}