{"artist": "Tyler Jacobson", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 3513, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 378915, "name": "Verwirrende Chimäre", "text": "Immer wenn ein Gegner einen Zauberspruch wirkt, kannst du die Kontrolle über die Verwirrende Chimäre und diesen Zauberspruch tauschen. Falls du dies tust, kannst du neue Ziele für den Zauberspruch bestimmen. (Falls der Zauberspruch zu einer bleibenden Karte wird, kontrollierst du diese bleibende Karte.)", "type": "Verzauberungskreatur — Chimäre"}, {"language": "Spanish", "multiverseId": 380070, "name": "Quimera desconcertante", "text": "Siempre que un oponente lance un hechizo, puedes intercambiar el control de la Quimera desconcertante y ese hechizo. Si lo haces, puedes elegir nuevos objetivos para el hechizo. (Si el hechizo se convierte en un permanente, tú controlas ese permanente.)", "type": "Criatura encantamiento — Quimera"}, {"language": "French", "multiverseId": 379080, "name": "Chimère inconcevable", "text": "À chaque fois qu'un adversaire lance un sort, vous pouvez échanger le contrôle de la Chimère inconcevable contre celui de ce sort. Si vous faites ainsi, vous pouvez choisir de nouvelles cibles pour le sort. (Si le sort devient un permanent, vous contrôlez ce permanent.)", "type": "Créature-enchantement : chimère"}, {"language": "Italian", "multiverseId": 379245, "name": "Chimera Sconcertante", "text": "Ogniqualvolta un avversario lancia una magia, puoi scambiare il controllo della Chimera Sconcertante e di quella magia. Se lo fai, puoi scegliere nuovi bersagli per la magia. (Se la magia diventa un permanente, controlli quel permanente.)", "type": "Creatura Incantesimo — Chimera"}, {"language": "Japanese", "multiverseId": 379410, "name": "厄介なキマイラ", "text": "対戦相手１人が呪文を１つ唱えるたび、あなたは厄介なキマイラとその呪文とのコントロールを交換してもよい。そうしたなら、あなたはその呪文の新しい対象を選んでもよい。（その呪文がパーマネントとなったなら、あなたがそのパーマネントをコントロールする。）", "type": "クリーチャー・エンチャント — キマイラ"}, {"language": "Korean", "multiverseId": 379575, "name": "기묘한 키메라", "text": "상대가 주문을 발동할 때마다, 당신은 기묘한 키메라와 그 주문의 조종권을 교환할 수 있다. 그렇게 한다면, 당신은 그 주문의 목표를 새로 정할 수 있다. (주문이 지속물이 된다면, 당신은 그 지속물을 조종한다.)", "type": "부여마법 생물 — 키메라"}, {"language": "Portuguese (Brazil)", "multiverseId": 379740, "name": "Quimera Desconcertante", "text": "Toda vez que um oponente conjura uma mágica, você pode permutar o controle de Quimera Desconcertante e daquela mágica. Se fizer isso, você poderá escolher novos alvos para a mágica. (Se a mágica se tornar uma permanente, você controlará aquela permanente.)", "type": "Criatura Encantamento — Quimera"}, {"language": "Russian", "multiverseId": 379905, "name": "Озадачивающая Химера", "text": "Каждый раз, когда оппонент разыгрывает заклинание, вы можете поменяться контролем над Озадачивающей Химерой и тем заклинанием. Если вы это делаете, вы можете выбрать новые цели для того заклинания. (Если заклинание становится перманентом, вы контролируете тот перманент.)", "type": "Чары Существо — Химера"}, {"language": "Chinese Simplified", "multiverseId": 378585, "name": "扰志盖美拉", "text": "每当任一对手施放咒语时，你可以交换扰志盖美拉与该咒语的操控权。若你如此作，你可以为该咒语选择新的目标。（如果该咒语成为永久物，则你操控该永久物。）", "type": "结界生物～盖美拉"}, {"language": "Chinese Traditional", "multiverseId": 378750, "name": "擾志蓋美拉", "text": "每當任一對手施放咒語時，你可以交換擾志蓋美拉與該咒語的操控權。若你如此作，你可以為該咒語選擇新的目標。（如果該咒語成為永久物，則你操控該永久物。）", "type": "結界生物～蓋美拉"}], "frameEffects": ["nyxtouched"], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "193664", "cardKingdomId": "193443", "cardsphereId": "7606", "mcmId": "265872", "mcmMetaId": "209334", "mtgjsonV4Id": "b3121f7d-5f12-58f4-b910-3d653a973328", "mtgoFoilId": "51796", "mtgoId": "51795", "multiverseId": "378420", "scryfallId": "f9cff40b-9cae-47d0-8df4-c287a17a33e4", "scryfallIllustrationId": "39699d47-c3fe-47f9-b679-a95c7bbbbe8a", "scryfallOracleId": "7d075b8a-a606-4590-b52b-b4ef3a9e342f", "tcgplayerProductId": "79115"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U}", "manaValue": 5.0, "name": "Perplexing Chimera", "number": "48", "originalText": "Whenever an opponent casts a spell, you may exchange control of Perplexing Chimera and that spell. If you do, you may choose new targets for the spell. (If the spell becomes a permanent, you control that permanent.)", "originalType": "Enchantment Creature — Chimera", "power": "3", "printings": ["BNG"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/e82389dbb8b4dcb9", "cardKingdomFoil": "https://mtgjson.com/links/2d4361f118205a06", "cardmarket": "https://mtgjson.com/links/de4dfacb3c964d1b", "tcgplayer": "https://mtgjson.com/links/5c2365f306c812ae"}, "rarity": "rare", "rulings": [{"date": "2014-02-01", "text": "You may exchange control of Perplexing Chimera and any spell cast by an opponent, not just one with targets."}, {"date": "2014-02-01", "text": "You make the decision whether to exchange control of Perplexing Chimera and the spell as the triggered ability resolves."}, {"date": "2014-02-01", "text": "If Perplexing Chimera leaves the battlefield or the spell leaves the stack before the triggered ability resolves, you can’t make the exchange."}, {"date": "2014-02-01", "text": "Neither Perplexing Chimera nor the spell changes zones. Only control of them is exchanged."}, {"date": "2014-02-01", "text": "After the ability resolves, you control the spell. Any instance of “you” in that spell’s text now refers to you, “an opponent” refers to one of your opponents, and so on. The change of control happens before new targets are chosen, so any targeting restrictions such as “target opponent” or “target creature you control” are now made in reference to you, not the spell’s original controller. You may change those targets to be legal in reference to you, or, if those are the spell’s only targets, the spell will doesn’t resolve for having illegal targets. When the spell resolves, any illegal targets are unaffected by it and you make all decisions the spell’s effect calls for."}, {"date": "2014-02-01", "text": "You may change any of the spell’s targets. If you change a target, you must choose a legal target for the spell. If you can’t, you must leave the target the same (even if that target is now illegal)."}, {"date": "2014-02-01", "text": "Gaining control of a spell and changing its targets won’t cause any heroic abilities of the new targets to trigger."}, {"date": "2014-02-01", "text": "If you gain control of an instant or sorcery spell, it will be put into its owner’s graveyard as it resolves, fails to resolve, or is countered."}, {"date": "2014-02-01", "text": "In some unusual cases, you may not control Perplexing Chimera when its triggered ability resolves (perhaps because the triggered ability triggered again and resolved while the original ability was on the stack). In these cases, you can exchange control of Perplexing Chimera and the spell that causes the ability to trigger, even if you control neither of them. If you do, you’ll be able to change targets of the spell, not the spell’s new controller."}], "setCode": "BNG", "subtypes": ["Chimera"], "supertypes": [], "text": "Whenever an opponent casts a spell, you may exchange control of Perplexing Chimera and that spell. If you do, you may choose new targets for the spell. (If the spell becomes a permanent, you control that permanent.)", "toughness": "3", "type": "Enchantment Creature — Chimera", "types": ["Enchantment", "Creature"], "uuid": "0eb32ad2-4528-5ea3-ad77-76407333c37e"}