{"artist": "Brian Valeza", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 5475, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 531563, "name": "Geisterross", "text": "Aufblitzen\nWenn das Geisterross ins Spiel kommt, schicke eine andere Kreatur deiner Wahl, die du kontrollierst, ins Exil, bis das Geisterross das Spiel verlässt.\nImmer wenn das Geisterross angreift, erzeuge einen getappten und angreifenden Spielstein, der eine Kopie der ins Exil geschickten Kreatur ist, außer dass er zusätzlich zu seinen anderen Typen eine Illusion ist. Opfere den Spielstein am Ende des Kampfes.", "type": "Kreatur — Pferd, Illusion"}, {"language": "Spanish", "multiverseId": 531619, "name": "Corcel fantasma", "text": "Destello.\nCuando el Corcel fantasma entre al campo de batalla, exilia otra criatura objetivo que controlas hasta que el Corcel fantasma deje el campo de batalla.\nSiempre que el Corcel fantasma ataque, crea una ficha girada y atacando que es una copia de la criatura exiliada, excepto que es una Ilusión además de sus otros tipos. Sacrifica esa ficha al final del combate.", "type": "Criatura — Ilusión caballo"}, {"language": "French", "multiverseId": 531675, "name": "Monture fantôme", "text": "Flash\nQuand la Monture fantôme arrive sur le champ de bataille, exilez une autre créature ciblée que vous contrôlez jusqu'à ce que la Monture fantôme quitte le champ de bataille.\nÀ chaque fois que la Monture fantôme attaque, créez un jeton engagé et attaquant qui est une copie de la créature exilée, excepté que c'est une illusion en plus de ses autres types. Sacrifiez ce jeton à la fin du combat.", "type": "Créature : cheval et illusion"}, {"language": "Italian", "multiverseId": 531731, "name": "Destriero Fantomatico", "text": "Lampo\nQuando il Destriero Fantomatico entra nel campo di battaglia, esilia un'altra creatura bersaglio che controlli finché il Destriero Fantomatico non lascia il campo di battaglia.\nOgniqualvolta il Destriero Fantomatico attacca, crea una pedina TAPpata e attaccante che è una copia della creatura esiliata, tranne che è un'Illusione in aggiunta ai suoi altri tipi. Sacrifica quella pedina alla fine del combattimento.", "type": "Creatura — Illusione Cavallo"}, {"language": "Japanese", "multiverseId": 531787, "name": "ファントム・スティード", "text": "瞬速\nファントム・スティードが戦場に出たとき、これ以外であなたがコントロールしているクリーチャー１体を対象とする。ファントム・スティードが戦場を離れるまで、それを追放する。\nファントム・スティードが攻撃するたび、それの他のタイプに加えてイリュージョンであることを除きその追放されているクリーチャーのコピーであるトークン１体を、タップ状態かつ攻撃している状態で生成する。戦闘終了時に、そのトークンを生け贄に捧げる。", "type": "クリーチャー — 馬・イリュージョン"}], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "249340", "cardsphereId": "80232", "mcmId": "572640", "mtgjsonV4Id": "34e6142c-0f14-5736-904e-a7035213df7c", "multiverseId": "531507", "scryfallId": "75e36b6f-05f1-4150-bc0b-f04a63cd92b9", "scryfallIllustrationId": "257eb2ff-1812-4b43-b0e6-6850737106c7", "scryfallOracleId": "22c643b1-62dd-477c-8944-97b3becdfdbe", "tcgplayerProductId": "244223"}, "keywords": ["Flash"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Phantom Steed", "number": "287", "originalText": "Flash\nWhen Phantom Steed enters the battlefield, exile another target creature you control until Phantom Steed leaves the battlefield.\nWhenever Phantom Steed attacks, create a tapped and attacking token that's a copy of the exiled creature, except it's an Illusion in addition to its other types. Sacrifice that token at end of combat.", "originalType": "Creature — Horse Illusion", "power": "4", "printings": ["AFC"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/341c6ebe12cc056e", "tcgplayer": "https://mtgjson.com/links/e9cd63fbe775121a"}, "rarity": "rare", "rulings": [{"date": "2021-07-23", "text": "Phantom Steed has received a nonfunctional update to its wording. The printed card refers to the “exiled creature.” The corrected text (“exiled card”) is included above."}, {"date": "2021-07-23", "text": "If Phantom Steed leaves the battlefield before its ability resolves, the target creature won't be exiled."}, {"date": "2021-07-23", "text": "Auras attached to the exiled creature will be put into their owners' graveyards. Any Equipment will become unattached and remain on the battlefield. Any counters on the exiled creature will cease to exist. When the card returns to the battlefield, it will be a new object with no connection to the card that was exiled."}, {"date": "2021-07-23", "text": "If a token is exiled this way, it will cease to exist and won't return to the battlefield. Phantom Steed's last ability won't create any tokens."}, {"date": "2021-07-23", "text": "Although the token created by the triggered ability is attacking, it was never declared as an attacking creature (for the purposes of abilities that trigger whenever a creature attacks, for example)."}, {"date": "2021-07-23", "text": "You declare which player or planeswalker the token is attacking as you put it onto the battlefield. It doesn't have to be the same player or planeswalker Phantom Steed is attacking."}, {"date": "2021-07-23", "text": "If the exiled card has {X} in its mana cost, X is 0."}, {"date": "2021-07-23", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when the token enters the battlefield. Any “As [this creature] enters the battlefield” or “[This creature] enters the battlefield with” abilities of the copied creature will also work."}, {"date": "2021-07-23", "text": "If Phantom Steed somehow exiles a noncreature card, such as an animated land, it will still create a copy of that card when it attacks. It enters the battlefield tapped and will be sacrificed at the end of combat. However, it is not attacking and it is not an Illusion."}], "securityStamp": "oval", "setCode": "AFC", "subtypes": ["Horse", "Illusion"], "supertypes": [], "text": "Flash\nWhen Phantom Steed enters the battlefield, exile another target creature you control until Phantom Steed leaves the battlefield.\nWhenever Phantom Steed attacks, create a tapped and attacking token that's a copy of the exiled card, except it's an Illusion in addition to its other types. Sacrifice that token at end of combat.", "toughness": "3", "type": "Creature — Horse Illusion", "types": ["Creature"], "uuid": "7c5f2dba-e1a5-55d1-8e99-742981f692a6", "variations": ["f35b94a5-fba5-598b-b3e4-4e2ad9cb8ba2"]}