{"artist": "Jason A. Engle", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B", "U"], "colors": ["B", "U"], "convertedManaCost": 5.0, "edhrecRank": 2978, "finishes": ["foil"], "foreignData": [], "frameEffects": ["nyxtouched", "legendary", "showcase"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "231893", "cardsphereId": "66038", "mcmId": "440288", "mtgjsonV4Id": "8e035a86-b6b3-547c-9593-3a98615a8898", "multiverseId": "479504", "scryfallId": "73f9e502-23a3-4f1c-af10-e6c48a5262b2", "scryfallIllustrationId": "2ae38a04-f788-41a9-b962-6cbf810a2de1", "scryfallOracleId": "046ccc8a-ec0d-4dc5-b41d-5e8a6d86812a", "tcgplayerProductId": "209392"}, "isFullArt": true, "isReprint": true, "isStarter": true, "keywords": ["Indestructible", "Mill"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}{B}", "manaValue": 5.0, "name": "Phenax, God of Deception", "number": "75", "originalReleaseDate": "2020-02-14", "originalText": "Indestructible\nAs long as your devotion to blue and black is less than seven, Phenax isn't a creature.\nCreatures you control have \"{T}: Target player puts the top X cards of their library into their graveyard, where X is this creature's toughness.\"", "originalType": "Legendary Enchantment Creature — God", "power": "4", "printings": ["BNG", "PLIST", "SLD"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/70e03dfa9ebdbb6b", "tcgplayer": "https://mtgjson.com/links/a7691ead803de99a"}, "rarity": "mythic", "rulings": [{"date": "2013-09-15", "text": "If an activated ability or triggered ability has an effect that depends on your devotion to a color, you count the number of mana symbols of that color among the mana costs of permanents you control as the ability resolves. The permanent with that ability will be counted if it’s still on the battlefield at that time."}, {"date": "2013-09-15", "text": "The type-changing ability that can make the God not be a creature functions only on the battlefield. It’s always a creature card in other zones, regardless of your devotion to its color."}, {"date": "2013-09-15", "text": "If a God enters the battlefield, your devotion to its color (including the mana symbols in the mana cost of the God itself) will determine if a creature entered the battlefield or not, for abilities that trigger whenever a creature enters the battlefield."}, {"date": "2013-09-15", "text": "Numeric mana symbols ({0}, {1}, and so on) in mana costs of permanents you control don’t count toward your devotion to any color."}, {"date": "2013-09-15", "text": "The abilities of Gods function as long as they’re on the battlefield, regardless of whether they’re creatures."}, {"date": "2013-09-15", "text": "If a God is attacking or blocking and it stops being a creature, it will be removed from combat."}, {"date": "2013-09-15", "text": "If a God is dealt damage, then stops being a creature, then becomes a creature again later in the same turn, the damage will still be marked on it. This is also true for any effects that were affecting the God when it was originally a creature. (Note that in most cases, the damage marked on the God won’t matter because it has indestructible.)"}, {"date": "2013-09-15", "text": "If a God stops being a creature, it loses the type creature and all creature subtypes. It continues to be a legendary enchantment."}, {"date": "2013-09-15", "text": "Mana symbols in the text boxes of permanents you control don’t count toward your devotion to any color."}, {"date": "2013-09-15", "text": "Hybrid mana symbols, monocolored hybrid mana symbols, and Phyrexian mana symbols do count toward your devotion to their color(s)."}, {"date": "2014-02-01", "text": "If you activate the ability Phenax grants to creatures you control, the toughness of the creature is calculated as the ability resolves. If the creature is no longer on the battlefield at that time, use its toughness when it was last on the battlefield."}, {"date": "2014-02-01", "text": "If Phenax is a creature, it will grant itself the activated ability."}, {"date": "2014-02-01", "text": "If you tap Phenax to activate the ability it grants itself, and Phenax is no longer a creature but still on the battlefield as that ability resolves, no cards will be put into the target player’s graveyard. Similarly, if Phenax isn’t on the battlefield as the ability resolves and wasn’t a creature when it left the battlefield, no cards will be put into the graveyard."}], "securityStamp": "oval", "setCode": "SLD", "subset": ["Theros Stargazing, Volume III"], "subtypes": ["God"], "supertypes": ["Legendary"], "text": "Indestructible\nAs long as your devotion to blue and black is less than seven, Phenax isn't a creature.\nCreatures you control have \"{T}: Target player mills X cards, where X is this creature's toughness.\"", "toughness": "7", "type": "Legendary Enchantment Creature — God", "types": ["Enchantment", "Creature"], "uuid": "8ae84b1a-0e5d-5b96-802a-529f558102d0"}