{"artist": "Steve Prescott", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B"], "colors": [], "convertedManaCost": 7.0, "edhrecRank": 11202, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "6b124bac-4815-5ed6-aab2-1cd7fad7f5f2", "mtgoId": "105722", "scryfallId": "34f0ddb8-23df-4818-ad70-fdc103011471", "scryfallIllustrationId": "3daaf0ae-0d1d-482f-ae0e-e12883cd8bd1", "scryfallOracleId": "d3a5a830-cd14-49da-9412-c50049c74c92"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Lifelink", "Menace", "Prototype", "Ward"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{7}", "manaValue": 7.0, "name": "Phyrexian Fleshgorger", "number": "105722", "originalReleaseDate": "2022-11-18", "power": "7", "printings": ["BRO", "PBRO", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2022-10-14", "text": "The amount of life an opponent needs to pay for that spell or ability to resolve is equal to Phyrexian Fleshgorger’s power at the time the ward ability resolves, which may be different from its power when the ward ability triggered. If Phyrexian Fleshgorger is no longer on the battlefield at the time the ward ability resolves, use the power it had the last time it was on the battlefield to determine how much life that player must pay (though if Phyrexian Fleshgorger was the only target, the spell has no legal targets anymore and hence it would not resolve even if they pay the life)."}, {"date": "2022-10-14", "text": "A prototype card is a colorless card in every zone except the stack or the battlefield, as well as while on the stack or the battlefield if not cast as a prototyped spell. Ignore its alternative characteristics in those cases. For example, while it’s in your graveyard, Blitz Automaton is a colorless creature card with mana value 7. It can’t be the target of Recommission, a spell that targets an artifact or creature card with mana value 3 or less in your graveyard."}, {"date": "2022-10-14", "text": "When cast as a prototyped spell, that spell has the mana cost, power, and toughness characteristics shown in its colored, secondary text box rather than the normal values of those characteristics. Its color and mana value are determined by that mana cost. The permanent that spell becomes as it resolves has the same characteristics. If the spell leaves the stack in any other way, or the permanent it becomes leaves the battlefield, it immediately resumes using its normal characteristics."}, {"date": "2022-10-14", "text": "Regardless of how it was cast, a prototype card always has the same name, abilities, types, and so on. Only the mana cost, mana value, color, power, and toughness change depending on whether the card was cast as a prototyped spell."}, {"date": "2022-10-14", "text": "The prototype ability functions in any zone that the spell could be cast from. For example, if an effect allows you to cast artifact spells from your graveyard, you could cast a prototyped Blitz Automaton from your graveyard."}, {"date": "2022-10-14", "text": "Casting a prototyped spell isn’t the same as casting it for an alternative cost, and an alternative cost may be applied to a spell cast this way. For example, if an effect allows you to cast an artifact card without paying its mana cost, you could either cast Blitz Automaton normally, or as a prototyped spell."}, {"date": "2022-10-14", "text": "When casting a prototyped spell, use only its prototype characteristics to determine whether it’s legal to cast it. For example, if Blitz Automaton is exiled with the last ability of Chandra, Dressed to Kill, you would be able to cast it for {2}{R} (because it’s a red spell), even though you wouldn’t be able to cast it as a colorless spell for its normal cost."}, {"date": "2022-10-14", "text": "If an effect copies a prototyped spell, that copy (as well as the token it becomes on the battlefield) will have the same characteristics as the prototyped spell. Similarly, if an effect creates a token that’s a copy of a prototyped permanent or causes another permanent to become a copy of it, the copy would have the same characteristics as the prototyped permanent."}], "setCode": "PRM", "subtypes": ["Phyrexian", "Wurm"], "supertypes": [], "text": "Prototype {1}{B}{B} — 3/3 (You may cast this spell with different mana cost, color, and size. It keeps its abilities and types.)\nMenace, lifelink\nWard—Pay life equal to Phyrexian Fleshgorger's power.", "toughness": "5", "type": "Artifact Creature — Phyrexian Wurm", "types": ["Artifact", "Creature"], "uuid": "28a9ad20-e864-59a2-b231-d27dcf6f2259"}