{"artist": "Yoji Shinkawa", "availability": ["paper"], "borderColor": "borderless", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 399, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "268178", "cardKingdomId": "268177", "mtgjsonV4Id": "c9777f6a-2d52-5022-a731-4fffd7e72bfe", "scryfallId": "e7501a66-76f8-4f1d-8b4c-2a82b5f930c4", "scryfallIllustrationId": "d513a881-f749-48c0-a6da-2a95b8f863c3", "scryfallOracleId": "340bbe8b-e987-4c3e-ab4e-9dee63e57d4f", "tcgplayerProductId": "450541"}, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U/P}", "manaValue": 4.0, "name": "Phyrexian Metamorph", "number": "1110", "originalReleaseDate": "2022-11-28", "power": "0", "printings": ["2XM", "HA6", "MB1", "NPH", "PNPH", "PRM", "SLD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/f966d544d69f4372", "cardKingdomFoil": "https://mtgjson.com/links/0c452ee8abeea2ed", "tcgplayer": "https://mtgjson.com/links/cb8bf73ef5d79885"}, "rarity": "rare", "rulings": [{"date": "2011-06-01", "text": "A card with Phyrexian mana symbols in its mana cost is each color that appears in that mana cost, regardless of how that cost may have been paid."}, {"date": "2011-06-01", "text": "To calculate the mana value of a card with Phyrexian mana symbols in its cost, count each Phyrexian mana symbol as 1."}, {"date": "2011-06-01", "text": "As you cast a spell or activate an activated ability with one or more Phyrexian mana symbols in its cost, you choose how to pay for each Phyrexian mana symbol at the same time you would choose modes or choose a value for X."}, {"date": "2011-06-01", "text": "If you're at 1 life or less, you can't pay 2 life."}, {"date": "2011-06-01", "text": "Phyrexian mana is not a new color. Players can't add Phyrexian mana to their mana pools."}, {"date": "2011-06-01", "text": "Except for also being an artifact, Phyrexian Metamorph copies exactly what was printed on the original permanent and nothing more (unless that creature is itself copying something or is a token; see below). It doesn't copy whether that permanent is tapped or untapped, whether it has any counters on it or Auras attached to it, or any noncopy effects that have changed its power, toughness, types, color, and so on."}, {"date": "2011-06-01", "text": "If Phyrexian Metamorph copies a noncreature artifact, it is no longer a creature."}, {"date": "2011-06-01", "text": "If the chosen permanent has {X} in its mana cost (such as Protean Hydra), X is considered to be zero."}, {"date": "2011-06-01", "text": "If the chosen creature is copying something else (for example, if the chosen creature is a Clone), then your Phyrexian Metamorph enters the battlefield as whatever the chosen creature copied, except it's also an artifact."}, {"date": "2011-06-01", "text": "If the chosen permanent is a token, Phyrexian Metamorph copies the original characteristics of that token as stated by the effect that put the token onto the battlefield, except it's also an artifact. Phyrexian Metamorph is not a token."}, {"date": "2011-06-01", "text": "Any enters-the-battlefield abilities of the copied permanent will trigger when Phyrexian Metamorph enters the battlefield. Any “as [this] enters the battlefield” or “[this] enters the battlefield with” abilities of the chosen permanent will also work."}, {"date": "2011-06-01", "text": "If Phyrexian Metamorph somehow enters the battlefield at the same time as another permanent (due to Mass Polymorph or Liliana Vess's third ability, for example), Phyrexian Metamorph can't become a copy of that permanent. You may choose only a permanent that's already on the battlefield."}, {"date": "2011-06-01", "text": "You can choose not to copy anything. In that case, Phyrexian Metamorph simply enters the battlefield as a 0/0 artifact creature and is put into its owner's graveyard as a state-based action (unless something else is raising its toughness)."}], "securityStamp": "oval", "setCode": "SLD", "subset": ["Special Guest: Yoji Shinkawa"], "subtypes": ["Phyrexian", "Shapeshifter"], "supertypes": [], "text": "({U/P} can be paid with either {U} or 2 life.)\nYou may have Phyrexian Metamorph enter the battlefield as a copy of any artifact or creature on the battlefield, except it's an artifact in addition to its other types.", "toughness": "0", "type": "Artifact Creature — Phyrexian Shapeshifter", "types": ["Artifact", "Creature"], "uuid": "217a093a-8dbe-53e9-b6a1-67c4df48b5ec"}