{"artist": "Mathias Kollros", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 3.0, "edhrecRank": 22480, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 410869, "name": "Gedanken zerpflücken", "text": "Ein Gegner deiner Wahl zeigt die Karten auf seiner Hand offen vor. Bestimme eine Karte davon, die kein Land ist, und schicke sie ins Exil.\nDelirium — Falls dein Friedhof vier oder mehr unterschiedliche Kartentypen enthält, durchsuche den Friedhof, die Hand und die Bibliothek dieses Spielers nach einer beliebigen Anzahl an Karten mit dem gleichen Namen wie die ins Exil geschickte Karte und schicke diese Karten ins Exil; dieser Spieler mischt dann seine Bibliothek.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 413179, "name": "Hurgar en el cerebro", "text": "El oponente objetivo muestra su mano. Tú eliges de ahí una carta que no sea tierra y la exilias.\nDelirio — Si entre las cartas de tu cementerio hay cuatro o más tipos de cartas, busca en el cementerio, mano y biblioteca de ese jugador cualquier cantidad de cartas con el mismo nombre que la carta exiliada, exilia esas cartas y luego ese jugador baraja su biblioteca.", "type": "Conjuro"}, {"language": "French", "multiverseId": 411199, "name": "Creuser la cervelle", "text": "L'adversaire ciblé révèle sa main. Choisissez-y une carte non-terrain et exilez cette carte.\nDélire — S'il y a au moins quatre types de carte parmi les cartes de votre cimetière, cherchez dans le cimetière, la main et la bibliothèque de ce joueur n'importe quel nombre de cartes ayant le même nom que la carte exilée, exilez-les, puis ce joueur mélange sa bibliothèque.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 411529, "name": "Scervellarsi", "text": "Un avversario bersaglio rivela la sua mano. Scegli una carta non terra da quella mano ed esilia quella carta.\nDelirio — Se ci sono quattro o più tipi di carta tra le carte nel tuo cimitero, passa in rassegna il cimitero, la mano e il grimorio di quel giocatore per un qualsiasi numero di carte con lo stesso nome della carta esiliata ed esiliale, poi quel giocatore rimescola il suo grimorio.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 411859, "name": "知恵の拝借", "text": "対戦相手１人を対象とする。そのプレイヤーは自分の手札を公開する。あなたはその中から土地でないカードを１枚選び、そのカードを追放する。\n昂揚 ― あなたの墓地にあるカードにカード・タイプが合計４種類以上含まれるなら、そのプレイヤーの墓地と手札とライブラリーからそのカードと同じ名前を持つカードを望む枚数探し、それらのカードを追放する。その後そのプレイヤーは自分のライブラリーを切り直す。", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 412189, "name": "뇌 끄집어내기", "text": "상대를 목표로 정한다. 그 상대는 자신의 손을 공개한다. 당신은 그 중에서 대지가 아닌 카드 한 장을 골라서 추방한다.\n섬망 — 당신의 무덤에 네 개 이상의 카드 유형이 있다면, 그 플레이어의 무덤, 손과 서고에서 추방된 카드와 이름이 같은 카드를 원하는 수만큼 찾아서 추방한다. 그러고 나서 그 플레이어는 자신의 서고를 섞는다.", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 412519, "name": "Colher o Cérebro", "text": "O oponente alvo revela a própria mão. Você escolhe um card que não seja terreno da mão dele e exila aquele card.\nDelírio — Se houver quatro ou mais tipos de card entre os cards de seu cemitério, procure no cemitério, na mão e no grimório daquele jogador qualquer número de cards com o mesmo nome do card exilado e exile aqueles cards. Depois, aquele jogador embaralha o próprio grimório.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 412849, "name": "Очистка Мозга", "text": "Целевой оппонент показывает свою руку. Вы выбираете из нее не являющуюся землей карту и изгоняете ту карту.\nБуйство — Если среди карт на вашем кладбище есть не менее четырех типов карт, найдите на кладбище, в руке и в библиотеке того игрока любое количество карт с таким же именем, что у изгнанной карты, и изгоните их, затем тот игрок тасует свою библиотеку.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 410209, "name": "采摘思绪", "text": "目标对手展示其手牌。你选择其中一张非地牌，并放逐该牌。\n躁狂～如果你坟墓场中牌的类别有四种或更多，则从该牌手的坟墓场、手牌及牌库中搜寻任意数量与所放逐之牌同名的牌，放逐这些牌，然后该牌手将其牌库洗牌。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 410539, "name": "採摘思緒", "text": "目標對手展示其手牌。你選擇其中一張非地牌，並放逐該牌。\n躁狂～如果你墳墓場中牌的類別有四種或更多，則從該玩家的墳墓場、手牌及牌庫中搜尋任意數量與所放逐之牌同名的牌，放逐這些牌，然後該玩家將其牌庫洗牌。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "206052", "cardKingdomId": "205564", "cardsphereId": "42004", "mcmId": "288651", "mcmMetaId": "222098", "mtgjsonV4Id": "f0718a2d-b92d-5e2d-b33e-60b99bcecf51", "mtgoFoilId": "60375", "mtgoId": "60374", "multiverseId": "409879", "scryfallId": "53503e59-6b6c-4de1-8528-458ab94f4e9a", "scryfallIllustrationId": "68571a8c-e1a0-45c5-9b0b-12ef95764b64", "scryfallOracleId": "bef3fca4-7290-416c-a100-1b7abbe7886e", "tcgplayerProductId": "114838"}, "keywords": ["Delirium"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}", "manaValue": 3.0, "name": "Pick the Brain", "number": "129", "originalText": "Target opponent reveals his or her hand. You choose a nonland card from it and exile that card.\nDelirium — If there are four or more card types among cards in your graveyard, search that player's graveyard, hand, and library for any number of cards with the same name as the exiled card, exile those cards, then that player shuffles his or her library.", "originalType": "Sorcery", "printings": ["SOI"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/5c4a5e0ac8731f92", "cardKingdomFoil": "https://mtgjson.com/links/6497bbae265fff2c", "cardmarket": "https://mtgjson.com/links/3fbff541daa402ca", "tcgplayer": "https://mtgjson.com/links/883012404167b04f"}, "rarity": "uncommon", "rulings": [{"date": "2016-04-08", "text": "If there is no nonland card to choose, and you have four or more card types among cards in your graveyard, you’ll search that player’s library even though you won’t be able to find any cards. That library will be shuffled."}, {"date": "2016-04-08", "text": "The card types in Magic are artifact, creature, enchantment, instant, land, planeswalker, sorcery, and tribal (a card type that appears on some older cards). Supertypes (such as legendary and basic) and subtypes (such as Human and Equipment) are not counted."}, {"date": "2016-04-08", "text": "The number of card types matters, not the number of cards. For example, Wicker Witch (an artifact creature) along with Catalog (an instant) and Chaplain’s Blessing (a sorcery) will enable delirium."}, {"date": "2016-04-08", "text": "Because you consider only the characteristics of a double-faced card’s front face while it’s not on the battlefield, the types of its back face won’t be counted for delirium."}, {"date": "2016-04-08", "text": "In some rare cases, you can have a token or a copy of a spell in your graveyard at the moment that an object’s delirium ability counts the card types among cards in your graveyard, before that token or copy ceases to exist. Because tokens and copies of spells are not cards, even if they are copies of cards, their types will never be counted."}], "setCode": "SOI", "subtypes": [], "supertypes": [], "text": "Target opponent reveals their hand. You choose a nonland card from it and exile that card.\nDelirium — If there are four or more card types among cards in your graveyard, search that player's graveyard, hand, and library for any number of cards with the same name as the exiled card, exile those cards, then that player shuffles.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "ef07ff13-bf1d-546b-a307-62ef4f951e65"}