{"artist": "Bayard Wu", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 5.0, "edhrecRank": 16496, "finishes": ["nonfoil", "foil"], "flavorText": "When art projects collapse, Prismari students revel in the beauty of destruction. Everyone else runs for cover.", "foreignData": [{"flavorText": "Wenn Kunstprojekte auseinanderbrechen, feiern Prismari-Studenten die Schönheit der Zerstörung. Alle anderen gehen in Deckung.", "language": "German", "multiverseId": 513879, "name": "Pigmentsturm", "text": "Der Pigmentsturm fügt einer Kreatur deiner Wahl 5 Schadenspunkte zu. Überschüssiger Schaden wird stattdessen dem Beherrscher der Kreatur zugefügt.", "type": "Hexerei"}, {"flavorText": "Cuando fracasan los proyectos artísticos, los estudiantes de Prismari disfrutan de la belleza de la destrucción. Los demás se ponen a cubierto.", "language": "Spanish", "multiverseId": 514170, "name": "Tormenta de pigmento", "text": "La Tormenta de pigmento hace 5 puntos de daño a la criatura objetivo. El daño sobrante se hace al controlador de esa criatura en vez de eso.", "type": "Conjuro"}, {"flavorText": "Lorsque les projets artistiques s'effondrent, les étudiants de Prismari célèbrent la beauté de la destruction. Tous les autres se mettent aux abris.", "language": "French", "multiverseId": 514461, "name": "Déluge de pigments", "text": "Le Déluge de pigments inflige 5 blessures à une créature ciblée. Le surplus de blessures est infligé au contrôleur de cette créature à la place.", "type": "Rituel"}, {"flavorText": "Quando i progetti artistici collassano, gli studenti di Prismari gioiscono della bellezza della distruzione. Tutti gli altri scappano al riparo.", "language": "Italian", "multiverseId": 514752, "name": "Tempesta di Pigmenti", "text": "La Tempesta di Pigmenti infligge 5 danni a una creatura bersaglio. Il danno in eccesso viene invece inflitto al controllore di quella creatura.", "type": "Stregoneria"}, {"flavorText": "アート・プロジェクトが崩壊すると、プリズマリの生徒は破壊の美を満喫し、他の者たちは急いで物影に隠れた。", "language": "Japanese", "multiverseId": 515043, "name": "色素の嵐", "text": "クリーチャー１体を対象とする。色素の嵐はそれに５点のダメージを与える。余剰のダメージは、代わりにそのクリーチャーのコントローラーが受ける。", "type": "ソーサリー"}, {"flavorText": "예술 프로젝트가 무너져내릴 때, 프리즈마리 학생들은 파괴의 아름다움을 신나게 즐긴다. 다른 사람들은 안전한 곳을 찾아 도망간다.", "language": "Korean", "multiverseId": 515334, "name": "염료 폭풍", "text": "생물을 목표로 정한다. 염료 폭풍은 그 생물에게 피해 5점을 입힌다. 여분의 피해는 대신 그 생물의 조종자에게 입혀진다.", "type": "집중마법"}, {"flavorText": "Quando os projetos de arte fracassam, os alunos de Prismari divertem-se com a beleza da destruição. Todos os outros correm em busca de abrigo.", "language": "Portuguese (Brazil)", "multiverseId": 515625, "name": "Tempestade Pigmentar", "text": "Tempestade Pigmentar causa 5 pontos de dano à criatura alvo. O dano excedente será causado, em vez disso, ao controlador daquela criatura.", "type": "Feitiço"}, {"flavorText": "Когда их художественные произведения рушатся, студенты Призмари упиваются красотой разрушений. Все остальные бегут в укрытие.", "language": "Russian", "multiverseId": 515916, "name": "Буря Красок", "text": "Буря Красок наносит 5 повреждений целевому существу. Избыточные повреждения вместо этого наносятся контролирующему то существо игроку.", "type": "Волшебство"}, {"flavorText": "当艺术作品轰然倒塌时，粹丽学生会在毁灭之美中尽情狂欢。而其他人则会慌忙寻找避难处。", "language": "Chinese Simplified", "multiverseId": 516207, "name": "染料风暴", "text": "染料风暴对目标生物造成5点伤害。过量伤害改为对该生物的操控者造成之。", "type": "法术"}, {"flavorText": "當藝術作品轟然倒塌時，粹麗學生會在毀滅之美中盡情狂歡。而其他人則會慌忙尋找避難處。", "language": "Chinese Traditional", "multiverseId": 516498, "name": "染料風暴", "text": "染料風暴對目標生物造成5點傷害。過量傷害改為對該生物的操控者造成之。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "244799", "cardKingdomId": "244486", "cardsphereId": "76020", "mcmId": "558026", "mcmMetaId": "339089", "mtgArenaId": "76504", "mtgjsonV4Id": "85d7fe09-f58a-5171-9b73-f88da14e4e8d", "mtgoId": "88699", "multiverseId": "513588", "scryfallId": "d285a7a1-bb7e-4a78-a49f-c2add62b829a", "scryfallIllustrationId": "ad5bebe8-b326-4000-b05e-fe99602fc98e", "scryfallOracleId": "89abdf4c-ba9d-4602-ae50-cf79c68ea08d", "tcgplayerProductId": "235974"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}{R}", "manaValue": 5.0, "name": "Pigment Storm", "number": "111", "originalText": "Pigment Storm deals 5 damage to target creature. Excess damage is dealt to that creature's controller instead.", "originalType": "Sorcery", "printings": ["STX"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d306dbeea4b868b7", "cardKingdomFoil": "https://mtgjson.com/links/3a15f8138f2e0287", "cardmarket": "https://mtgjson.com/links/b2a2c2bc981e0e83", "tcgplayer": "https://mtgjson.com/links/9564949e39c0ca76"}, "rarity": "common", "rulings": [{"date": "2021-04-16", "text": "Excess damage caused by a spell or ability is similar to how combat damage from a creature with trample is handled. Start with the amount of damage being dealt to the creature and determine what is “lethal.” This is the creature’s toughness minus the amount of damage that it already has marked on it, but ignoring any replacement or prevention effects that will modify this damage. Also ignore whether the creature has an ability such as indestructible that will result in it not being destroyed by this damage."}, {"date": "2021-04-16", "text": "Once you’ve determined how much damage is excess, Pigment Storm simultaneously deals damage to the creature and to its controller. This damage may be modified by replacement or prevention effects."}, {"date": "2021-04-16", "text": "If the target creature is an illegal target by the time Pigment Storm tries to resolve, the spell won’t resolve. It won’t deal damage to any player."}, {"date": "2021-04-16", "text": "Pigment Storm’s replacement effect is a self-replacement effect. It is applied before any other replacement effects that would change the amount of damage dealt to the target creature and its controller."}], "setCode": "STX", "subtypes": [], "supertypes": [], "text": "Pigment Storm deals 5 damage to target creature. Excess damage is dealt to that creature's controller instead.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "e6620102-4262-529d-97d8-acb19792fdb4"}