{"artist": "Jeannie L Paske", "availability": ["paper"], "borderColor": "borderless", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 3.0, "edhrecRank": 1953, "finishes": ["nonfoil", "foil"], "flavorText": "Pir always had a *very *big imagination.", "foreignData": [], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "268102", "cardKingdomId": "268101", "mtgjsonV4Id": "fabc936c-4cb3-5536-8eae-aab64bdbaa50", "scryfallId": "70e84108-c54f-4074-b38c-91dc8abc2f64", "scryfallIllustrationId": "2edda8b7-8fbe-4c0b-a088-e31dbf6c388c", "scryfallOracleId": "7683c2b2-a06f-4691-9cc5-1968dc032885", "tcgplayerProductId": "283319"}, "isReprint": true, "keywords": ["Partner", "Partner with"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}", "manaValue": 3.0, "name": "Pir, Imaginative Rascal", "number": "1050", "originalReleaseDate": "2022-11-02", "power": "1", "printings": ["BBD", "PBBD", "SLD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d3d7b9bfe11c20c3", "cardKingdomFoil": "https://mtgjson.com/links/7890d272df47a131", "tcgplayer": "https://mtgjson.com/links/41e1b172268cc308"}, "rarity": "rare", "rulings": [{"date": "2018-06-08", "text": "If a permanent your team controls would enter the battlefield with one or more counters of any kind on it, it enters with that many plus one instead."}, {"date": "2018-06-08", "text": "If an effect includes multiple instructions to put one or more counters on a permanent, such as Lifecrafter’s Gift does, Pir’s effect applies to each of those instructions."}, {"date": "2018-06-08", "text": "Pir’s effect can’t apply to itself as it’s entering the battlefield or to any other permanent entering the battlefield at the same time as it."}, {"date": "2018-06-08", "text": "“Partner with [name]” represents two abilities. The first is a triggered ability: “When this permanent enters the battlefield, target player may search their library for a card named [name], reveal it, put it into their hand, then shuffle their library.”"}, {"date": "2018-06-08", "text": "Note that the target player searches their library (which may be affected by effects such as that of Stranglehold) and that the card they find is revealed, even though these words aren’t included in the ability’s reminder text."}, {"date": "2018-06-08", "text": "The second ability represented by the “partner with [name]” keyword modifies the rules for deck construction in the Commander variant and has no function outside of that variant. If a legendary creature card with “partner with [name]” is designated as your commander, the named legendary creature card can also be designated as your commander. For more information on the Commander variant, please visit Wizards.com/Commander."}, {"date": "2018-06-08", "text": "If your Commander deck has two commanders, you can only include cards whose own color identities are also found in your commanders’ combined color identities. If Khorvath and Sylvia are your commanders, your deck may contain cards with red and/or white in their color identity, but not blue, black, or green."}, {"date": "2018-06-08", "text": "Both commanders start in the command zone, and the remaining 98 cards of your deck are shuffled to become your library."}, {"date": "2018-06-08", "text": "To have two commanders, both must have the partner ability (featured in the Magic: The Gathering—Commander™ (2016 Edition) set) or corresponding “partner with” abilities as the game begins. A creature with a “partner with” ability can’t partner with any creature other than its designated partner. Losing a partner ability during the game doesn’t cause either to cease to be your commander."}, {"date": "2018-06-08", "text": "Once the game begins, your two commanders are tracked separately. If you cast one, you won’t have to pay an additional {2} the first time you cast the other. A player loses the game after having been dealt 21 damage from one of them, not from both of them combined. Command Beacon’s effect puts one into your hand from the command zone, not both."}, {"date": "2018-06-08", "text": "An effect that checks whether you control your commander is satisfied if you control one or both of your two commanders."}, {"date": "2018-06-08", "text": "The triggered ability of the “partner with” keyword still triggers in a Commander game. If your other commander has somehow ended up in your library, you can find it. You can also target another player who might have that card in their library."}, {"date": "2018-06-08", "text": "If a spell or ability causes you to put cards in your hand without specifically using the word “draw,” Toothy’s middle ability won’t trigger."}, {"date": "2018-06-08", "text": "If you draw multiple cards, Toothy’s middle ability triggers that many times. If your team also controls Pir, each of those resolving triggered abilities puts two +1/+1 counters on Toothy."}, {"date": "2018-06-08", "text": "If enough -1/-1 counters are put on Toothy at the same time to make its toughness 0 or less, the number of +1/+1 counters on it before it got any -1/-1 counters will be used to determine how many cards you draw. For example, if there are two +1/+1 counters on Toothy and it gets three -1/-1 counters, you’ll draw two cards."}], "securityStamp": "oval", "setCode": "SLD", "subset": ["Imaginary Friends"], "subtypes": ["Human"], "supertypes": ["Legendary"], "text": "Partner with Toothy, Imaginary Friend (When this creature enters the battlefield, target player may put Toothy into their hand from their library, then shuffle.)\nIf one or more counters would be put on a permanent your team controls, that many plus one of each of those kinds of counters are put on that permanent instead.", "toughness": "1", "type": "Legendary Creature — Human", "types": ["Creature"], "uuid": "c8170053-4d6e-5f87-8342-aa0a17e2e913"}