{"artist": "Jakub Kasper", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 4.0, "edhrecRank": 2850, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "252711", "cardsphereId": "83265", "mcmId": "583955", "mcmMetaId": "262719", "mtgjsonV4Id": "8ce117d2-ec91-5348-8c13-a5fb5a57cb89", "scryfallId": "cccfa463-c691-4905-9bc3-06fc9a5bca8e", "scryfallIllustrationId": "cce7aa2d-09a4-4cf1-804e-8abca9deee82", "scryfallOracleId": "01c2b66a-66d1-4282-a078-b1fa737c57f4", "tcgplayerProductId": "254606"}, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{G}", "manaValue": 4.0, "name": "Pir's Whim", "number": "624", "originalReleaseDate": "2021-11-19", "printings": ["BBD", "PLIST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/bd5014e0177a0b43", "cardmarket": "https://mtgjson.com/links/5587929f3e74167e", "tcgplayer": "https://mtgjson.com/links/05a78981c55e2644"}, "rarity": "rare", "rulings": [{"date": "2018-06-08", "text": "When Pir’s Whim resolves and your friends perform their actions, first the next friend in turn order (or, if it’s a friend’s turn, that friend) searches their library for a land without revealing the card they choose, then each other friend in turn order does the same. Then all the lands are put onto the battlefield at the same time."}, {"date": "2018-06-08", "text": "When Pir’s Whim resolves and your foes perform their actions, first the next foe in turn order (or, if it’s a foe’s turn, that foe) chooses an artifact or enchantment they control, then each other foe in turn order does the same, then all chosen permanents are sacrificed at the same time. Foes will know choices made by earlier players when making their choices."}, {"date": "2018-06-08", "text": "You make this choice for yourself as well as each other player. In some rare cases, you may wish to call yourself (or your teammate in a Two-Headed Giant game) a foe. You can do that."}, {"date": "2018-06-08", "text": "The designation of friend or foe is only relevant to the spell that asks you to choose. A player you call your friend doesn’t become your teammate, and the next “friend or foe” spell you cast could name that player your foe."}, {"date": "2018-06-08", "text": "You may call a player a friend or a foe even if that player will be instructed to perform an impossible action. For example, for Regna’s Sanction, a foe may control no untapped creatures."}, {"date": "2018-06-08", "text": "Friends perform their specified actions before foes. This means that a friend’s action may cause a triggered ability of a foe’s permanent to trigger before that foe’s action causes that permanent to leave the battlefield."}, {"date": "2018-06-08", "text": "Players can’t take actions in between the time that friends perform their actions and the time that foes perform theirs. If any abilities trigger from friends performing actions, those triggers won’t be put onto the stack until the foes perform their actions and the spell finishes resolving."}], "securityStamp": "oval", "setCode": "PLIST", "subtypes": [], "supertypes": [], "text": "For each player, choose friend or foe. Each friend searches their library for a land card, puts it onto the battlefield tapped, then shuffles. Each foe sacrifices an artifact or enchantment they control.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "d9b5df81-813d-5b78-acae-0450e231ba98"}