{"artist": "Jason Chan", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210272", "mcmId": "294458", "mtgjsonV4Id": "95986adf-f99c-5aba-ab0a-a0914ddc5ff4", "multiverseId": "423644", "scryfallId": "559007a6-c515-413a-8d3c-8ce1df0742ff", "scryfallIllustrationId": "55170f25-6bd2-41c4-a5af-5b22891ebb86", "scryfallOracleId": "f133e42a-2962-4781-b413-ce2127f17c26", "tcgplayerProductId": "125619"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Pools of Becoming", "number": "63", "originalText": "At the beginning of your end step, put the cards in your hand on the bottom of your library in any order, then draw that many cards.\nWhenever you roll {Chaos}, reveal the top three cards of your planar deck. Each of the revealed cards' {Chaos} abilities triggers. Then put the revealed cards on the bottom of your planar deck in any order.", "originalType": "Plane — Bolas's Meditation Realm", "printings": ["OHOP", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/012494ad50ddd434", "tcgplayer": "https://mtgjson.com/links/c6f3383218f3c05d"}, "rarity": "common", "rulings": [{"date": "2009-10-01", "text": "A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"}, {"date": "2009-10-01", "text": "A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."}, {"date": "2009-10-01", "text": "The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."}, {"date": "2009-10-01", "text": "If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}, {"date": "2009-10-01", "text": "The face-up plane card isn’t currently part of its owner’s planar deck. If the chaos ability is rolled by the owner of Pools of Becoming, Pools of Becoming is not one of the three cards that are revealed."}, {"date": "2009-10-01", "text": "You may put the chaos abilities of the three revealed plane cards on the stack in any order. The last one you put on the stack will be the first one to resolve."}, {"date": "2009-10-01", "text": "If one of the revealed plane cards is another Pools of Becoming, its chaos ability triggers. When it resolves, you’ll reveal three more cards from the top of your planar deck, their chaos abilities will trigger, and you’ll put them on the stack in any order on top of any remaining chaos abilities from the first Pools of Becoming’s effect."}], "setCode": "OPCA", "subtypes": ["Bolas's Meditation Realm"], "supertypes": [], "text": "At the beginning of your end step, put the cards in your hand on the bottom of your library in any order, then draw that many cards.\nWhenever you roll {CHAOS}, reveal the top three cards of your planar deck. Each of the revealed cards' {CHAOS} abilities triggers. Then put the revealed cards on the bottom of your planar deck in any order.", "type": "Plane — Bolas's Meditation Realm", "types": ["Plane"], "uuid": "72f74b16-8db3-5e14-a12e-3e15e49039e4"}