{"artist": "Yongjae Choi", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 5914, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 483001, "name": "Portalmagierin", "text": "Aufblitzen\nWenn die Portalmagierin während des Angreifer-deklarieren-Segments ins Spiel kommt, kannst du neu bestimmen, welchen Spieler oder Planeswalker eine angreifende Kreatur deiner Wahl angreift. (Jene Kreatur kann weder ihren Beherrscher noch einen Planeswalker, den ihr Beherrscher kontrolliert, angreifen.)", "type": "Kreatur — Mensch, Zauberer"}, {"language": "Spanish", "multiverseId": 483252, "name": "Maga del portal", "text": "Destello.\nCuando la Maga del portal entre al campo de batalla durante el paso de declarar atacantes, puedes seleccionar de nuevo a qué jugador o planeswalker ataca la criatura atacante objetivo. (No puede atacar a su controlador ni a los planeswalkers de su controlador.)", "type": "Criatura — Hechicero humano"}, {"language": "French", "multiverseId": 483503, "name": "Mage du portail", "text": "Flash\nQuand le Mage du portail arrive sur le champ de bataille pendant l'étape de déclaration des attaquants, vous pouvez re-sélectionner quel joueur ou planeswalker une créature attaquante ciblée attaque. (Elle ne peut pas attaquer son contrôleur ou les planeswalkers de son contrôleur.)", "type": "Créature : humain et sorcier"}, {"language": "Italian", "multiverseId": 483754, "name": "Maga dei Portali", "text": "Lampo\nQuando la Maga dei Portali entra nel campo di battaglia durante la sottofase di dichiarazione delle creature attaccanti, puoi cambiare il giocatore o il planeswalker che una creatura attaccante bersaglio sta attaccando. (Non può attaccare il suo controllore o i planeswalker del suo controllore.)", "type": "Creatura — Mago Umano"}, {"language": "Japanese", "multiverseId": 484005, "name": "門の魔道士", "text": "瞬速\n門の魔道士が攻撃クリーチャー指定ステップ中に戦場に出たとき、攻撃クリーチャー１体を対象とする。あなたはそれが攻撃するプレイヤーやプレインズウォーカーを選び直してもよい。（それはそれのコントローラーやそれのコントローラーのプレインズウォーカーを攻撃することはできない。）", "type": "クリーチャー — 人間・ウィザード"}, {"language": "Portuguese (Brazil)", "multiverseId": 484256, "name": "Maga do Portal", "text": "Lampejo\nQuando Maga do Portal entra no campo de batalha durante a etapa de declaração de atacantes, você pode resselecionar qual jogador ou planeswalker a criatura atacante alvo está atacando. (Ela não pode atacar seu controlador nem os planeswalkers de seu controlador.)", "type": "Criatura — Humano Mago"}, {"language": "Russian", "multiverseId": 484507, "name": "Волшебница Порталов", "text": "Миг\nКогда Волшебница Порталов выходит на поле битвы во время шага объявления атакующих, вы можете изменить то, какого игрока или planeswalker'а атакует целевое атакующее существо. (Оно не может атаковать контролирующего его игрока или planeswalker'ов контролирующего его игрока.)", "type": "Существо — Человек Чародей"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "232524", "cardsphereId": "66460", "mcmId": "453788", "mtgjsonV4Id": "ed036f86-3d28-5bb7-9284-b9a81883ce99", "multiverseId": "482750", "scryfallId": "e9f6cb64-07e3-44ca-986c-fd10ab74cc8a", "scryfallIllustrationId": "deb53964-03f8-4b83-aff9-5d32199ab097", "scryfallOracleId": "4d19ea6d-cabe-4a25-a911-dd744517dd73", "tcgplayerProductId": "212393"}, "isReprint": true, "isStarter": true, "keywords": ["Flash"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}", "manaValue": 3.0, "name": "Portal Mage", "number": "122", "originalText": "Flash\nWhen Portal Mage enters the battlefield during the declare attackers step, you may reselect which player or planeswalker target attacking creature is attacking. (It can't attack its controller or its controller's planeswalkers.)", "originalType": "Creature — Human Wizard", "power": "2", "printings": ["C17", "C20"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ea784e813f28df54", "tcgplayer": "https://mtgjson.com/links/32d7d677c41f69a1"}, "rarity": "rare", "rulings": [{"date": "2017-08-25", "text": "You may cast Portal Mage outside of a declare attackers step. If Portal Mage enters the battlefield outside of a declare attackers step, its ability simply doesn’t trigger."}, {"date": "2017-08-25", "text": "Reselecting which player or planeswalker a creature is attacking ignores all requirements, restrictions, and costs associated with attacking."}, {"date": "2017-08-25", "text": "Reselecting which player or planeswalker a creature is attacking doesn’t cause “whenever this creature attacks” abilities to trigger. Notably, the Curses in this set (such as Curse of Vitality) won’t trigger while Portal Mage’s ability is resolving."}, {"date": "2017-08-25", "text": "If you reselect which player or planeswalker an attacking creature is attacking, that creature is still considered to have attacked the player or planeswalker as declared, but it is now attacking the new player or planeswalker."}, {"date": "2017-08-25", "text": "If an ability targets something controlled by the “defending player” of an attacking creature and the defending player for that creature changes before that ability resolves, the ability won’t resolve because its target has become illegal."}], "securityStamp": "oval", "setCode": "C20", "subtypes": ["Human", "Wizard"], "supertypes": [], "text": "Flash\nWhen Portal Mage enters the battlefield during the declare attackers step, you may reselect which player or planeswalker target attacking creature is attacking. (It can't attack its controller or its controller's planeswalkers.)", "toughness": "2", "type": "Creature — Human Wizard", "types": ["Creature"], "uuid": "fc2a7f03-57f1-543a-a263-0b04aa97ddd4"}