{"artist": "Christine Choi", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "212741", "mcmId": "298305", "mtgjsonV4Id": "133dd25b-3021-528a-adb4-b6f98bb586cc", "multiverseId": "430660", "scryfallId": "62485ec5-9667-4e3c-acb2-482c4eacdf8e", "scryfallIllustrationId": "1e1bf57e-5535-4ad9-8e38-3d370b959634", "scryfallOracleId": "f6af8de1-4f92-4d18-a95a-c160d91830bb", "tcgplayerProductId": "132368"}, "isOversized": true, "isStarter": true, "language": "English", "layout": "scheme", "legalities": {}, "manaValue": 0.0, "name": "Power Without Equal", "number": "15★", "originalText": "When you set this scheme in motion, draw three cards. You have no maximum hand size until your next turn. If you control six or more lands, you may cast up to three nonland cards from your hand without paying their mana costs.", "originalType": "Scheme", "printings": ["OE01"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/38a251549fd40caf", "tcgplayer": "https://mtgjson.com/links/d60ecc441fe6b201"}, "rarity": "common", "rulings": [{"date": "2017-06-13", "text": "The number of lands you control is checked as this scheme’s triggered ability resolves. You can’t play a land during your turn before it resolves."}, {"date": "2017-06-13", "text": "If you control six or more lands, you’ll draw three cards and get to cast three spells for free. No player may take any actions between the time you draw three cards and the time you finish casting free spells."}, {"date": "2017-06-13", "text": "If you cast a card “without paying its mana cost,” you can’t choose to cast it for any alternative costs, such as emerge costs. You can, however, pay additional costs. If the card has any mandatory additional costs, such as that of Tormenting Voice, you must pay those to cast the card."}, {"date": "2017-06-13", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2017-06-13", "text": "You must cast any of the three spells you wish to cast for free while this scheme’s ability is resolving. You’ll have to pay the mana cost of any spells cast later in the turn, even if you cast fewer than three as you resolved this ability. The spells will be added to the stack in the order that you cast them."}], "setCode": "OE01", "subtypes": [], "supertypes": [], "text": "When you set this scheme in motion, draw three cards. You have no maximum hand size until your next turn. If you control six or more lands, you may cast up to three spells from your hand without paying their mana costs.", "type": "Scheme", "types": ["Scheme"], "uuid": "6c3ab35c-ed89-5fb1-99e8-26abcd8335b8"}