{"artist": "Brian Valeza", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 8882, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 527614, "name": "Überzeugungskraft", "text": "Bestimme eine Kreatur deiner Wahl, die ein Gegner kontrolliert, und würfle dann einen W20.\n1—9 | Bringe sie auf die Hand ihres Besitzers zurück.\n10—19 | Ihr Besitzer legt sie auf oder unter seine Bibliothek.\n20 | Übernimm bis zum Ende deines nächsten Zuges die Kontrolle über sie.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 527875, "name": "Poder de la persuasión", "text": "Elige una criatura objetivo que controla un oponente y luego tira 1d20.\n1—9 | Regrésala a la mano de su propietario.\n10—19 | Su propietario la pone en la parte superior o en el fondo de su biblioteca.\n20 | Gana su control hasta el final de tu próximo turno.", "type": "Conjuro"}, {"language": "French", "multiverseId": 528136, "name": "Pouvoir de persuasion", "text": "Choisissez une créature ciblée qu'un adversaire contrôle, puis lancez un d20.\n1—9 | Renvoyez-la dans la main de son propriétaire.\n10—19 | Son propriétaire la met au-dessus ou au-dessous de sa bibliothèque.\n20 | Acquérez-en le contrôle jusqu'à la fin de votre prochain tour.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 528397, "name": "Potere della Persuasione", "text": "Scegli una creatura bersaglio controllata da un avversario, poi tira un d20.\n1—9 | Falla tornare in mano al suo proprietario.\n10—19 | Il suo proprietario la mette in cima o in fondo al suo grimorio.\n20 | Prendine il controllo fino alla fine del tuo prossimo turno.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 528658, "name": "説得の力", "text": "対戦相手がコントロールしているクリーチャー１体を対象とする。１個のd20を振る。\n１—９ | それをオーナーの手札に戻す。\n10—19 | それのオーナーはそれを自分のライブラリーの一番上か一番下に置く。\n20 | 次のあなたのターン終了時まで、それのコントロールを得る。", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 528918, "name": "설득의 힘", "text": "상대가 조종하는 생물을 목표로 정한 후, 20면체를 굴린다.\n1—9 | 그 생물을 소유자의 손으로 되돌린다.\n10—19 | 그 생물의 소유자는 그 생물을 자신의 서고 맨 위 또는 맨 밑에 놓는다.\n20 | 당신의 다음 턴 턴종료까지 그 생물의 조종권을 얻는다.", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 529179, "name": "Poder de Persuasão", "text": "Escolha a criatura alvo que um oponente controla e depois role um d20.\n1—9 | Devolva-a para a mão de seu dono.\n10—19 | O dono dela a coloca no topo ou no fundo do próprio grimório.\n20 | Ganhe o controle dela até o final de seu próximo turno.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 529440, "name": "Сила Убеждения", "text": "Выберите целевое существо под контролем оппонента, затем бросьте d20.\n1—9 | Верните его в руку его владельца.\n10—19 | Его владелец кладет его на верх или в низ своей библиотеки.\n20 | Получите контроль над ним до конца вашего следующего хода.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 529700, "name": "劝诱技巧", "text": "选择目标由对手操控的生物，然后掷一颗d20。\n1～9 | 将它移回其拥有者手上。\n10～19 | 其拥有者将它置于其牌库顶或牌库底。\n20 | 获得它的操控权直到你下一个回合的回合结束。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 529960, "name": "勸誘技巧", "text": "選擇目標由對手操控的生物，然後擲一顆d20。\n1～9 | 將它移回其擁有者手上。\n10～19 | 其擁有者將它置於其牌庫頂或牌庫底。\n20 | 獲得它的操控權直到你下一個回合的回合結束。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "248466", "cardKingdomId": "248133", "cardsphereId": "79171", "mcmId": "571370", "mcmMetaId": "343770", "mtgArenaId": "77172", "mtgjsonV4Id": "764d45f5-a658-5568-91cd-4212169deef9", "mtgoId": "91636", "multiverseId": "527354", "scryfallId": "8d84cb72-d0a0-4af0-aded-47e5fb7addef", "scryfallIllustrationId": "59023a41-98d6-4f5e-86d9-d33df5ddc6f3", "scryfallOracleId": "5c615c99-77b7-4bea-9286-1e8d257153fb", "tcgplayerProductId": "243276"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}", "manaValue": 3.0, "name": "Power of Persuasion", "number": "67", "originalText": "Choose target creature an opponent controls, then roll a d20.\n1–9 | Return it to its owner's hand.\n10–19 | Its owner puts it on the top or bottom of their library.\n20 | Gain control of it until the end of your next turn.", "originalType": "Sorcery", "printings": ["AFR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/b827b383362fd4c2", "cardKingdomFoil": "https://mtgjson.com/links/ab018f327da965b7", "cardmarket": "https://mtgjson.com/links/f8cdf0d1f15081b3", "tcgplayer": "https://mtgjson.com/links/6fac4fe4fc9ca69c"}, "rarity": "uncommon", "rulings": [{"date": "2021-07-23", "text": "Dice are identified by the number of faces each one has. For example, a d20 is a twenty-sided die."}, {"date": "2021-07-23", "text": "Dice used must have equally likely outcomes and the roll must be fair. Although physical dice are recommended, digital substitutes are allowed, provided they have the same number of equally likely outcomes as specified in the original roll instruction."}, {"date": "2021-07-23", "text": "An ability that tells you to roll a die will also specify what to do with the result of that roll. Most often, this is in the form of a “results table” in the card text."}, {"date": "2021-07-23", "text": "The instruction to roll a die and the effect that occurs because of the result are all part of the same ability. Players do not get the chance to respond to the ability after knowing the result of the roll."}, {"date": "2021-07-23", "text": "An effect that says “choose a target, then roll a d20” or similar still uses the normal process of putting an ability on the stack and resolving it. Choosing targets is part of putting the ability on the stack and rolling the d20 happens later, as the ability resolves."}, {"date": "2021-07-23", "text": "Some effects may modify the result of a die roll. This may be part of the instruction to roll a die or it may come from other cards. Anything that references the “result” of a die roll is looking for the result after these modifications. Anything that is looking for the “natural result” is looking for the number shown on the face of the die before these modifications."}, {"date": "2021-07-23", "text": "Some abilities, like that of Pixie Guide and Barbarian Class, replace rolling a die with rolling extra dice and ignoring the lowest roll. The ignored rolls are not considered for the effect that instructed you to roll a die, and do not cause abilities to trigger. For all intents and purposes, once you determine which dice count, any extra dice were never rolled."}, {"date": "2021-07-23", "text": "Some effects instruct you to roll again. This uses the same number and type of dice as the original roll, and that roll will use the same set of possible outcomes."}, {"date": "2021-07-23", "text": "While playing Planechase, rolling the planar die will cause any ability that triggers whenever a player rolls one or more dice to trigger. However, any effect that refers to a numerical result will ignore the rolling of the planar die."}, {"date": "2021-07-23", "text": "Tournament events have more specific rules regarding dice and die-rolling. For more information, please see the most recent version of the Magic Tournament Rules at https://wpn.wizards.com/en/document/magic-gathering-tournament-rules."}], "setCode": "AFR", "subtypes": [], "supertypes": [], "text": "Choose target creature an opponent controls, then roll a d20.\n1—9 | Return it to its owner's hand.\n10—19 | Its owner puts it on the top or bottom of their library.\n20 | Gain control of it until the end of your next turn.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "32ddf2da-bb81-58c8-99b1-b0d9080fe208"}