{"artist": "Scott M. Fischer", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 3.0, "edhrecRank": 6415, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "156db935-8935-5a14-b77d-3dd23a0c8177", "scryfallId": "b4caa840-8f68-41c6-abc2-12bfd820b275", "scryfallIllustrationId": "93381a9c-b9f2-41ca-9755-8efb7ca03601", "scryfallOracleId": "539d7c1a-b5e9-4204-9109-ddb2e8dec168"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {}, "manaCost": "{B}{B}{B}", "manaValue": 3.0, "name": "Pox", "number": "63", "originalReleaseDate": "1999-01-01", "printings": ["5ED", "ICE", "ME1", "OLEP"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2007-09-16", "text": "The losses, discards, and sacrifices are rounded up. For example, if you have 5 life, you’ll lose 2 life, leaving you at 3 life. (Five divided by three is one and two-thirds. Rounding that up to the nearest whole number gives you two.)"}, {"date": "2007-09-16", "text": "Each part of Pox’s effect is processed separately. For each part, first the player whose turn it is makes all necessary choices (such as which cards to discard), then each other player in turn order chooses, then the actions happen at the same time. Then Pox’s effect moves to the next stage."}, {"date": "2007-09-16", "text": "The number you need to lose, discard, or sacrifice isn’t calculated until it’s time to perform that part of the effect. For example, if your opponent casts Pox and you discard Dodecapod as part of Pox’s discard effect, Dodecapod will be put onto the battlefield instead of into your graveyard. Then, when determining how many creatures you need to sacrifice, the Dodecapod is taken into account."}], "setCode": "OLEP", "subtypes": [], "supertypes": [], "text": "Each player loses a third of their life, then discards a third of the cards in their hand, then sacrifices a third of the creatures they control, then sacrifices a third of the lands they control. Round up each time.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "9e0325ea-4944-591e-bc4f-d81bc1bbd965"}