{"artist": "Chippy", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 5.0, "edhrecRank": 6167, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 231238, "name": "Golem-Vorläufer", "text": "Wenn der Golem-Vorläufer ins Spiel kommt, bringe zwei 3/3 farblose Golem-Artefaktkreaturenspielsteine ins Spiel.\nImmer wenn ein Spieler einen Spontanzauber oder eine Hexerei wirkt, der bzw. die nur einen einzelnen Golem als Ziel hat, kopiert dieser Spieler diesen Zauber für jeden anderen Golem, den der Zauber als Ziel haben könnte. Jede dieser Kopien hat einen unterschiedlichen dieser Golems als Ziel.", "type": "Artefaktkreatur — Golem"}, {"language": "Spanish", "multiverseId": 232732, "name": "Gólem precursor", "text": "Cuando el Gólem precursor entre al campo de batalla, pon en el campo de batalla dos fichas de criatura artefacto Gólem incoloras 3/3.\nSiempre que un jugador lance un hechizo instantáneo o conjuro que haga objetivo a un único Gólem, ese jugador copia ese hechizo para cada otro Gólem que ese hechizo podría hacer objetivo. Cada copia hace objetivo a cada uno de esos otros Gólems.", "type": "Criatura artefacto — Gólem"}, {"language": "French", "multiverseId": 231985, "name": "Golem précurseur", "text": "Quand le Golem précurseur arrive sur le champ de bataille, mettez sur le champ de bataille deux jetons de créature-artefact 3/3 incolore Golem.\nÀ chaque fois qu'un joueur lance un sort d'éphémère ou de rituel qui ne cible qu'un seul golem, ce joueur copie ce sort pour chaque autre golem que ce sort pourrait cibler. Chaque copie cible un golem différent parmi eux.", "type": "Créature-artefact : golem"}, {"language": "Italian", "multiverseId": 232981, "name": "Predecessore Golem", "text": "Quando il Predecessore Golem entra nel campo di battaglia, metti sul campo di battaglia due pedine creatura artefatto Golem 3/3 incolori.\nOgniqualvolta un giocatore lancia una magia istantaneo o stregoneria che bersaglia solo un Golem, quel giocatore copia quella magia per ogni altro Golem che quella magia potrebbe bersagliare. Ogni copia bersaglia uno diverso di quei Golem.", "type": "Creatura Artefatto — Golem"}, {"language": "Japanese", "multiverseId": 231736, "name": "先駆のゴーレム", "text": "先駆のゴーレムが戦場に出たとき、無色の３/３のゴーレム・アーティファクト・クリーチャー・トークンを２体戦場に出す。\nいずれかのプレイヤーが、ゴーレム１体のみを対象とする、インスタント呪文かソーサリー呪文を１つ唱えるたび、そのプレイヤーはその呪文を、その呪文が対象にできる他の各ゴーレム１体につき１回コピーする。 それぞれのコピーは、それらのゴーレムのうち別々のものを対象とする。", "type": "アーティファクト・クリーチャー — ゴーレム"}, {"language": "Portuguese (Brazil)", "multiverseId": 230989, "name": "Golem Precursor", "text": "Quando Golem Precursor entrar no campo de batalha, coloque no campo de batalha duas fichas de criatura artefato incolores 3/3 do tipo Golem.\nToda vez que um jogador conjura uma mágica instantânea ou feitiço que tem um único Golem como alvo, aquele jogador copia aquela mágica para cada outro Golem que aquela mágica poderia ter como alvo. Cada cópia tem um Golem diferente como alvo.", "type": "Criatura Artefato — Golem"}, {"language": "Russian", "multiverseId": 231487, "name": "Голем-Предтеча", "text": "Когда Голем-Предтеча выходит на поле битвы, положите на поле битвы две фишки артефактного существа 3/3 бесцветный Голем.\nКаждый раз когда игрок разыгрывает мгновенное заклинание или заклинание волшебства, целью которого является только один Голем, тот игрок копирует то заклинание за каждого другого Голема, на которого могло бы быть нацелено то заклинание. Целью каждой копии является один из тех разных Големов.", "type": "Артефактное Существо — Голем"}, {"language": "Chinese Simplified", "multiverseId": 232483, "name": "先驱魔像", "text": "当先驱魔像进战场时，将两个3/3无色魔像神器生物衍生物放进战场。\n每当牌手施放一个仅以单一魔像为目标的瞬间或法术咒语时，该牌手为每个可成为该咒语目标的其他魔像将该咒语各复制一次。 每个复制都要以这些魔像之一为目标，且不能重复选择。", "type": "神器生物～魔像"}, {"language": "Chinese Traditional", "multiverseId": 232234, "name": "先驅魔像", "text": "當先驅魔像進戰場時，將兩個3/3無色魔像衍生神器生物放進戰場。\n每當玩家施放一個僅以單一魔像為目標的瞬間或巫術咒語時，該玩家為每個可成為該咒語目標的其他魔像將該咒語各複製一次。 每個複製都要以這些魔像之一為目標，且不能重複選擇。", "type": "神器生物～魔像"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "132376", "cardKingdomId": "132132", "cardsphereId": "40547", "mcmId": "242611", "mcmMetaId": "200734", "mtgjsonV4Id": "f2b18cc3-be56-591a-84f6-8643d0a375e3", "mtgoFoilId": "38158", "mtgoId": "38157", "multiverseId": "206348", "scryfallId": "1c4625ad-1c83-4095-a5a2-0fc9fa4dd5f2", "scryfallIllustrationId": "aa95ce2d-4ee3-4c59-8fd6-8a2c26db5869", "scryfallOracleId": "668fc293-1b8f-4870-9784-4ac660925e30", "tcgplayerProductId": "36381"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{5}", "manaValue": 5.0, "name": "Precursor Golem", "number": "194", "originalText": "When Precursor Golem enters the battlefield, put two 3/3 colorless Golem artifact creature tokens onto the battlefield.\nWhenever a player casts an instant or sorcery spell that targets only a single Golem, that player copies that spell for each other Golem that spell could target. Each copy targets a different one of those Golems.", "originalType": "Artifact Creature — Golem", "power": "3", "printings": ["BRR", "MB1", "MM2", "SOM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/426a6edd113a3e2a", "cardKingdomFoil": "https://mtgjson.com/links/626b76d868627f5c", "cardmarket": "https://mtgjson.com/links/da73dcda2c980711", "tcgplayer": "https://mtgjson.com/links/25a16498513756a8"}, "rarity": "rare", "rulings": [{"date": "2011-01-01", "text": "The second ability triggers whenever a player casts an instant or sorcery spell that targets only one Golem and no other object or player. That Golem can be Precursor Golem itself, one of the Golem tokens it created, or any other Golem. It doesn’t matter who controls the Golem."}, {"date": "2011-01-01", "text": "If an instant or sorcery spell has multiple targets, but it’s targeting the same Golem with all of them (such as Agony Warp targeting the same Golem twice), Precursor Golem’s last ability will trigger."}, {"date": "2011-01-01", "text": "Any Golem that couldn’t be targeted by the original spell (due to shroud, protection abilities, targeting restrictions, or any other reason) is just ignored by Precursor Golem’s second ability."}, {"date": "2011-01-01", "text": "The controller of the spell that caused Precursor Golem’s second ability to trigger also controls all the copies. That player chooses the order the copies are put onto the stack. The original spell will be on the stack beneath those copies and will resolve last."}, {"date": "2011-01-01", "text": "The copies that Precursor Golem’s second ability creates are created on the stack, so they’re not “cast.” Abilities that trigger when a player casts a spell (like Precursor Golem’s second ability itself) won’t trigger."}, {"date": "2011-01-01", "text": "If the spell that’s copied is modal (that is, it says “Choose one —” or the like), the copies will have the same mode. Their controller can’t choose a different one."}, {"date": "2011-01-01", "text": "If the spell that’s copied has an X whose value was determined as it was cast (like Fireball does), the copies have the same value of X."}, {"date": "2011-01-01", "text": "The controller of a copy can’t choose to pay any additional costs for the copy. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too."}], "setCode": "SOM", "subtypes": ["Golem"], "supertypes": [], "text": "When Precursor Golem enters the battlefield, create two 3/3 colorless Golem artifact creature tokens.\nWhenever a player casts an instant or sorcery spell that targets only a single Golem, that player copies that spell for each other Golem that spell could target. Each copy targets a different one of those Golems.", "toughness": "3", "type": "Artifact Creature — Golem", "types": ["Artifact", "Creature"], "uuid": "af7e6dc0-636e-538b-956a-9cee90365bc9", "watermark": "mirran"}