{"artist": "John Avon", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 4.0, "edhrecRank": 875, "faceConvertedManaCost": 0.0, "faceManaValue": 0.0, "faceName": "Primal Wellspring", "finishes": ["nonfoil", "foil"], "foreignData": [{"faceName": "Urtümliche Quelle", "language": "German", "multiverseId": 435700, "name": "Urtümliches Amulett // Urtümliche Quelle", "text": "(Transformiertes Urtümliches Amulett.)\n{T}: Erhöhe deinen Manavorrat um ein Mana einer beliebigen Farbe. Wenn dieses Mana verwendet wird, um einen Spontanzauber oder eine Hexerei zu wirken, kopiere jenen Zauberspruch. Du kannst neue Ziele für die Kopie bestimmen.", "type": "Land"}, {"faceName": "Manantial primigenio", "language": "Spanish", "multiverseId": 437793, "name": "Amuleto primigenio // Manantial primigenio", "text": "(Se transforma del Amuleto primigenio.)\n{T}: Agrega un maná de cualquier color a tu reserva de maná. Cuando ese maná se use para lanzar un hechizo de instantáneo o de conjuro, copia ese hechizo y puedes elegir nuevos objetivos para la copia.", "type": "Tierra"}, {"faceName": "Source primordiale", "language": "French", "multiverseId": 435999, "name": "Amulette primordiale // Source primordiale", "text": "(Transformation de l'Amulette primordiale.)\n{T} : Ajoutez un mana de la couleur de votre choix à votre réserve. Quand ce mana est dépensé pour lancer un sort d'éphémère ou de rituel, copiez ce sort et vous pouvez choisir de nouvelles cibles pour la copie.", "type": "Terrain"}, {"faceName": "Fonte Primordiale", "language": "Italian", "multiverseId": 436298, "name": "Amuleto Primordiale // Fonte Primordiale", "text": "(Si trasforma dall'Amuleto Primordiale.)\n{T}: Aggiungi un mana di un qualsiasi colore alla tua riserva di mana. Quando quel mana viene speso per lanciare una magia istantaneo o stregoneria, copia quella magia. Puoi scegliere nuovi bersagli per la copia.", "type": "Terra"}, {"faceName": "原初の水源", "language": "Japanese", "multiverseId": 436597, "name": "原初の呪物 // 原初の水源", "text": "（原初の呪物から変身する。）\n{T}：あなたのマナ・プールに、好きな色１色のマナ１点を加える。そのマナがインスタントかソーサリーである呪文を唱えるために支払われたとき、その呪文をコピーする。あなたはそのコピーの新しい対象を選んでもよい。", "type": "土地"}, {"faceName": "태고의 원천", "language": "Korean", "multiverseId": 436896, "name": "태고의 부적 // 태고의 원천", "text": "(태고의 부적에서 변신함)\n{T}: 원하는 색의 마나 한 개를 당신의 마나풀에 담는다. 그 마나가 순간마법이나 집중마법을 발동하기 위해 사용될 때, 그 주문을 복사한다. 당신은 그 복사본의 목표를 새로 정할 수 있다.", "type": "대지"}, {"faceName": "Fonte Primal", "language": "Portuguese (Brazil)", "multiverseId": 437195, "name": "Amuleto Primal // Fonte Primal", "text": "(Transformação de Amuleto Primal.)\n{T}: Adicione um mana de qualquer cor à sua reserva de mana. Quando aquele mana for gasto para conjurar uma mágica instantânea ou um feitiço, copie aquela mágica e você poderá escolher novos alvos para a cópia.", "type": "Terreno"}, {"faceName": "ПЕРВОБЫТНЫЙ ИСТОЧНИК", "language": "Russian", "multiverseId": 437494, "name": "Первобытный Амулет // ПЕРВОБЫТНЫЙ ИСТОЧНИК", "text": "(Трансформируется из Первобытного Амулета.)\n{T}: добавьте одну ману любого цвета в ваше хранилище маны. Когда та мана тратится на разыгрывание мгновенного заклинания или волшебства, скопируйте то заклинание, и вы можете выбрать новые цели для копии.", "type": "Земля"}, {"faceName": "原初涌泉", "language": "Chinese Simplified", "multiverseId": 438092, "name": "原初护身符 // 原初涌泉", "text": "（由原初护身符转化。）\n{T}：加一点任意颜色的法术力到你的法术力池中。当该法术力用来施放瞬间或法术咒语时，复制该咒语，且你可以为该复制品选择新的目标。", "type": "地"}, {"faceName": "原初湧泉", "language": "Chinese Traditional", "multiverseId": 438391, "name": "原初護身符 // 原初湧泉", "text": "（由原初護身符轉化。）\n{T}：加一點任意顏色的魔法力到你的魔法力池中。當該魔法力用來施放瞬間或巫術咒語時，複製該咒語，且你可以為該複製品選擇新的目標。", "type": "地"}], "frameEffects": ["compasslanddfc"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardsphereId": "51402", "mcmId": "301312", "mcmMetaId": "226836", "mtgArenaId": "66459", "mtgjsonV4Id": "085d0fe4-66d6-55ff-92a4-0ed4ee1c71d8", "mtgoFoilId": "65511", "mtgoId": "65510", "multiverseId": "435402", "scryfallId": "d4d379b5-7f56-4a7d-a4ac-131fc3d579c6", "scryfallIllustrationId": "2b4ccae0-92f9-4b9b-9e91-3a033def20a7", "scryfallOracleId": "8e4d0da0-c7d8-4a20-9bfd-02c1331a7a49", "tcgplayerProductId": "144856"}, "keywords": ["Transform"], "language": "English", "layout": "transform", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaValue": 4.0, "name": "Primal Amulet // Primal Wellspring", "number": "243", "originalText": "(Transforms from Primal Amulet.)\n{T}: Add one mana of any color to your mana pool. When that mana is spent to cast an instant or sorcery spell, copy that spell and you may choose new targets for the copy.", "originalType": "Land", "otherFaceIds": ["b05dcfd1-37a5-5ea9-850f-acfb1837b43b"], "printings": ["PXLN", "PXTC", "XLN"], "purchaseUrls": {"cardmarket": "https://mtgjson.com/links/cfc5eeb7ccfac8cd", "tcgplayer": "https://mtgjson.com/links/6e4a844e76e85927"}, "rarity": "rare", "rulings": [{"date": "2017-09-29", "text": "Effects that reduce the generic mana cost of a spell can’t reduce that spell’s colored mana requirements."}, {"date": "2017-09-29", "text": "Primal Amulet’s last ability triggers once you’ve completed casting a spell. Notably, you can’t use Primal Wellspring to pay for the spell that gives Primal Amulet its fourth counter."}, {"date": "2017-09-29", "text": "If a fourth charge counter is put on Primal Amulet by something other than the resolution of its ability (as modified by any applicable replacement effects), you won’t be able to remove those counters and transform it yet. You’ll have to wait until you cast an instant or sorcery spell again."}, {"date": "2017-09-29", "text": "The mana produced by Primal Wellspring can be spent on anything, not just an instant or sorcery spell."}, {"date": "2017-09-29", "text": "Any instant or sorcery spell you spend the mana on will be copied, not just one that requires targets."}, {"date": "2017-09-29", "text": "The delayed triggered ability from Primal Wellspring’s mana ability will trigger even if Primal Wellspring leaves the battlefield before that mana is spent."}, {"date": "2017-09-29", "text": "If more than one mana produced by a Primal Wellspring is spent to cast a single instant or sorcery spell, the delayed triggered ability associated with each mana spent will trigger. That many copies will be created. It doesn’t matter if this mana was produced by one Primal Wellspring or by multiple Primal Wellsprings."}, {"date": "2017-09-29", "text": "Primal Wellspring’s delayed triggered ability can copy the spell even if that spell is countered before the ability resolves."}, {"date": "2017-09-29", "text": "If a copy is created, you control the copy. That copy is created on the stack, so it’s not “cast.” Abilities that trigger when a player casts a spell won’t trigger. The copy will then resolve like a normal spell, after players get a chance to cast spells and activate abilities."}, {"date": "2017-09-29", "text": "The copy will have the same targets as the spell it’s copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can’t choose a new legal target, then it remains unchanged (even if the current target is illegal)."}, {"date": "2017-09-29", "text": "If the copied spell is modal (that is, it says “Choose one —” or the like), the copy will have the same mode. You can’t choose a different one."}, {"date": "2017-09-29", "text": "If the copied spell has an X whose value was determined as it was cast, the copy has the same value of X."}, {"date": "2017-09-29", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost you’re paying, add any cost increases, then apply any cost reductions. The converted mana cost of the spell remains unchanged, no matter what the total cost to cast it was."}, {"date": "2017-09-29", "text": "You can’t choose to pay any additional costs for the copy. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too. For example, if you sacrifice a 3/3 creature to cast Fling, and you copy it, the copy of Fling will also deal 3 damage to its target."}, {"date": "2018-01-19", "text": "For more information on double-faced cards, see the Ixalan mechanics article (http://magic.wizards.com/en/articles/archive/feature/ixalan-mechanics)."}], "securityStamp": "oval", "setCode": "XLN", "side": "b", "subtypes": [], "supertypes": [], "text": "(Transforms from Primal Amulet.)\n{T}: Add one mana of any color. When that mana is spent to cast an instant or sorcery spell, copy that spell and you may choose new targets for the copy.", "type": "Land", "types": ["Land"], "uuid": "f7642222-7218-5fe6-9d78-7d436c5bdaef"}