{"artist": "Titus Lunter", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 6757, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "21bc3954-a41a-5e0d-9d26-462ea20fc3ee", "mtgoId": "70733", "scryfallId": "ebf1d150-f453-42e9-ac8c-99911d8eb498", "scryfallIllustrationId": "ea80aed2-0493-49ac-98ac-19eb7fba5953", "scryfallOracleId": "afc9e1d3-b012-49e9-8d22-89abbee03c22"}, "isOnlineOnly": true, "isReprint": true, "keywords": ["Manifest"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U}", "manaValue": 5.0, "name": "Primordial Mist", "number": "70733", "originalReleaseDate": "2018-12-06", "printings": ["C18", "PZ2"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2018-07-13", "text": "Casting an exiled card causes it to leave exile. You can’t cast it multiple times."}, {"date": "2018-07-13", "text": "If you somehow control a face-down token, you may exile it to activate Primordial Mist’s last ability, but you won’t be able to cast that token."}, {"date": "2018-07-13", "text": "At any time, you can look at a face-down permanent you control. You can’t look at face-down permanents you don’t control unless an effect instructs you to do so."}, {"date": "2018-07-13", "text": "A permanent that turns face up or face down changes characteristics but is otherwise the same permanent. Spells and abilities that were targeting that permanent, as well as Auras and Equipment that were attached to the permanent, aren’t affected."}, {"date": "2018-07-13", "text": "Activating Primordial Mist’s last ability doesn’t trigger abilities that trigger “when [something] is turned face up.”"}, {"date": "2018-07-13", "text": "If you activate Primordial Mist’s last ability but don’t play the exiled card this turn, it remains exiled."}, {"date": "2018-07-13", "text": "You must follow the normal timing permissions and restrictions of each card you play."}, {"date": "2018-07-13", "text": "You may play a land exiled this way only if you have an available land play this turn."}, {"date": "2018-07-13", "text": "You’ll still pay all costs for a spell cast this way, including additional costs. You may also pay alternative costs such as evoke costs."}, {"date": "2018-07-13", "text": "The face-down permanent is a 2/2 creature with no name, mana cost, creature types, or abilities. It’s colorless and has a converted mana cost of 0. Other effects that apply to the permanent can still grant or change any of these characteristics."}, {"date": "2018-07-13", "text": "The face-down characteristics of a permanent are copiable values. If another object becomes a copy of a face-down creature or if a token is created that’s a copy of a face-down creature, that new object is a 2/2 colorless face-up creature with no abilities."}, {"date": "2018-07-13", "text": "Any time you have priority, you may turn a manifested creature face up by revealing that it’s a creature card (ignoring any type-changing effects that might be applying to it) and paying its mana cost. This is a special action. It doesn’t use the stack and can’t be responded to."}, {"date": "2018-07-13", "text": "Because face-down creatures don’t have a name, they can’t have the same name as any other creature or share any creature types with any other creature, even another face-down creature."}, {"date": "2018-07-13", "text": "Because the permanent is on the battlefield both before and after it’s turned face up, turning a permanent face up doesn’t cause any enters-the-battlefield abilities to trigger."}, {"date": "2018-07-13", "text": "Turning a permanent face up or face down doesn’t change whether that permanent is tapped or untapped."}, {"date": "2018-07-13", "text": "If a face-down permanent you control leaves the battlefield, you must reveal it. You must also reveal all face-down spells and permanents you control if you leave the game or if the game ends."}, {"date": "2018-07-13", "text": "You must ensure that your face-down spells and permanents can easily be differentiated from each other. You’re not allowed to mix up the cards that represent them on the battlefield to confuse other players. The order they entered the battlefield should remain clear. Common methods for indicating this include using markers or dice, or simply placing them in order on the battlefield. You must also track how each became face down (manifested, cast face down using a morph ability, and so on)."}, {"date": "2018-07-13", "text": "There are no cards in this set that would turn a face-down instant or sorcery card on the battlefield face up, but some older cards can try to do this. If something tries to turn a face-down instant or sorcery card on the battlefield face up, reveal that card to show all players it’s an instant or sorcery card. The permanent remains on the battlefield face down. Abilities that trigger when a permanent turns face up won’t trigger, because even though you revealed the card, it never turned face up."}, {"date": "2018-07-13", "text": "If an effect tries to return a face-down creature to the battlefield after it leaves (such as Aminatou’s second ability or Adarkar Valkyrie’s delayed triggered ability), that effect returns the card face up. If it tries to put an instant or sorcery card onto the battlefield this way, that card remains in its current zone instead."}, {"date": "2018-07-13", "text": "Some previous Magic sets feature double-faced cards, which have a Magic card face on each side rather than a Magic card face on one side and a Magic card back on the other. If a double-faced card is manifested, it will be put onto the battlefield face down. While face down, it can’t transform. If the front face of the card is a creature card, you can turn it face up by paying its mana cost. If you do, its front face will be up. Although a double-faced card can enter the battlefield face down, one already on the battlefield can’t be turned face down."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": [], "supertypes": [], "text": "At the beginning of your end step, you may manifest the top card of your library. (Put it onto the battlefield face down as a 2/2 creature. Turn it face up any time for its mana cost if it's a creature card.)\nExile a face-down permanent you control face up: You may play that card this turn. (You still pay its costs. Timing rules still apply.)", "type": "Enchantment", "types": ["Enchantment"], "uuid": "0fdf07d8-f830-5dd3-ab03-01758e4754f3"}