{"artist": "Steven Belledin", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 5.0, "edhrecRank": 8581, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "46879da6-5f07-5dc7-9b8e-9aa3971c7c84", "mtgoId": "62339", "scryfallId": "88f6940a-39cb-4097-977c-849d73b4d387", "scryfallIllustrationId": "b1e98ab2-49e6-4726-8c9d-99e8b1e6b872", "scryfallOracleId": "be838f57-4e74-44ad-aee1-506e63b0ff37"}, "isOnlineOnly": true, "isReprint": true, "isStarter": true, "keywords": ["Domain"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{5}", "manaValue": 5.0, "name": "Prismatic Geoscope", "number": "71", "printings": ["C16", "J17", "PLIST", "PZ2"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2016-11-08", "text": "The colors of mana that Prismatic Geoscope can produce aren’t related to the specific basic land types among lands you control. For example, if you control a Plains and an Island, you can activate Prismatic Geoscope’s ability to add {R}{G} to your mana pool."}, {"date": "2016-11-08", "text": "You can activate Prismatic Geoscope’s mana ability if you have no basic land types among lands you control, but it won’t produce any mana."}, {"date": "2016-11-08", "text": "Prismatic Geoscope can’t produce colorless mana."}, {"date": "2016-11-08", "text": "To determine the number of basic land types among lands you control, look for the Plains, Island, Swamp, Mountain, and Forest subtypes among the lands you control. Count each subtype that appears one or more times toward the number of basic land types among lands you control. This number can’t exceed five."}, {"date": "2016-11-08", "text": "How many lands you control of a particular basic land type is irrelevant to a domain ability, as long as that number is greater than zero. As far as domain is concerned, ten Forests are the same as one Forest."}, {"date": "2016-11-08", "text": "Most nonbasic lands don’t have basic land types, even if they produce colored mana. For example, Caves of Koilos is neither a Plains nor a Swamp."}, {"date": "2016-11-08", "text": "Some nonbasic lands do have basic land types. Domain abilities don’t count the number of lands you control—they count the number of basic land types among lands you control, even if that means checking the same land twice. For example, if you control a Tundra, a Blood Crypt, and a Forest, you’ll have a Plains, Island, Swamp, Mountain, and Forest among the lands you control. Your domain abilities will be maxed out."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": [], "supertypes": [], "text": "Prismatic Geoscope enters the battlefield tapped.\nDomain — {T}: Add X mana in any combination of colors, where X is the number of basic land types among lands you control.", "type": "Artifact", "types": ["Artifact"], "uuid": "bc9582aa-54a5-5a93-9ba9-bcc48f62df0f"}