{"artist": "Jama Jurabaev", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": [], "convertedManaCost": 2.0, "edhrecRank": 20403, "finishes": ["nonfoil", "foil"], "flavorText": "Ulamog's processors trail behind him, converting ruined matter into furious energy.", "foreignData": [{"flavorText": "Ulamogs Verwerter folgen dicht hinter ihm und verwandeln zerstörte Materie in unbändige Energie.", "language": "German", "multiverseId": 402897, "name": "Verwerter-Angriff", "text": "Fahl (Diese Karte hat keine Farbe.)Lege als zusätzliche Kosten, um den Verwerter-Angriff zu wirken, eine Karte, die ein Gegner besitzt, aus dem Exil auf den Friedhof dieses Spielers.Der Verwerter-Angriff fügt einer Kreatur deiner Wahl 5 Schadenspunkte zu.", "type": "Hexerei"}, {"flavorText": "Los metabolizadores de Ulamog siguen sus pasos y convierten la materia corrompida en energía furiosa.", "language": "Spanish", "multiverseId": 404990, "name": "Asalto metabolizador", "text": "Vacío. (Esta carta no tiene ningún color.)Como coste adicional para lanzar el Asalto metabolizador, pon en el cementerio de un oponente una carta del exilio de la que ese jugador sea propietario.El Asalto metabolizador hace 5 puntos de daño a la criatura objetivo.", "type": "Conjuro"}, {"flavorText": "Les convertisseurs suivent Ulamog de près, transformant la matière détruite en énergie phénoménale.", "language": "French", "multiverseId": 403196, "name": "Assaut du convertisseur", "text": "Carence (Cette carte n'a pas de couleur.)En tant que coût supplémentaire pour lancer l'Assaut du convertisseur, mettez une carte qu'un adversaire possède dans le cimetière de ce joueur depuis l'exil.L'Assaut du convertisseur inflige 5 blessures à une créature ciblée.", "type": "Rituel"}, {"flavorText": "I metabolizzatori di Ulamog seguono le sue tracce, convertendo in energia impetuosa la materia in rovina.", "language": "Italian", "multiverseId": 403495, "name": "Assalto del Metabolizzatore", "text": "Vacuità (Questa carta non ha colore.)Come costo addizionale per lanciare l'Assalto del Metabolizzatore, metti una carta posseduta da un avversario dall'esilio nel cimitero di quel giocatore.L'Assalto del Metabolizzatore infligge 5 danni a una creatura bersaglio.", "type": "Stregoneria"}, {"flavorText": "廃棄物を凄まじいエネルギーに変えながらウラモグの昇華者が獲物に迫る。", "language": "Japanese", "multiverseId": 403794, "name": "昇華者の突撃", "text": "欠色（このカードは無色である。）昇華者の突撃を唱えるための追加コストとして、追放領域から対戦相手がオーナーであるカードを１枚そのプレイヤーの墓地に置く。クリーチャー１体を対象とする。昇華者の突撃はそれに５点のダメージを与える。", "type": "ソーサリー"}, {"flavorText": "분노에 찬 울라목의 처리자들이 그를 뒤쫓고 있다.", "language": "Korean", "multiverseId": 404093, "name": "처리자 습격", "text": "결여 (이 카드는 무색이다.)처리자 습격을 발동하기 위한 추가 비용으로, 추방 영역에서 상대가 소유한 카드 한 장을 그 플레이어의 무덤에 넣는다.생물을 목표로 정한다. 처리자 습격은 그 생물에게 피해 5점을 입힌다.", "type": "집중마법"}, {"flavorText": "Os processadores de Ulamog seguem atrás dele, convertendo a matéria arruinada em energia furiosa.", "language": "Portuguese (Brazil)", "multiverseId": 404392, "name": "Assalto do Processador", "text": "Desprovido (Este card não tem cor.)Como custo adicional para conjurar Assalto do Processador, coloque um card exilado de um oponente no cemitério dele.Assalto do Processador causa 5 pontos de dano à criatura alvo.", "type": "Feitiço"}, {"flavorText": "За Уламогом следуют его переработчики, превращающие разрушенную материю в яростную энергию.", "language": "Russian", "multiverseId": 404691, "name": "Нападение Переработчика", "text": "Лишение (У этой карты нет цвета.)В качестве дополнительной стоимости разыгрывания Нападения Переработчика положите принадлежащую оппоненту карту из изгнания на кладбище того игрока.Нападение Переработчика наносит 5 повреждений целевому существу.", "type": "Волшебство"}, {"flavorText": "钨拉莫的噬体紧随其后，将破败残余转化成狂暴能量。", "language": "Chinese Simplified", "multiverseId": 402299, "name": "噬体突袭", "text": "虚色（此牌没有颜色。）将一张由对手拥有的牌从放逐区置入该牌手的坟墓场，以作为施放噬体突袭的额外费用。噬体突袭对目标生物造成5点伤害。", "type": "法术"}, {"flavorText": "鎢拉莫的噬體緊隨其後，將破敗殘餘轉化成狂暴能量。", "language": "Chinese Traditional", "multiverseId": 402598, "name": "噬體突襲", "text": "虛色（此牌沒有顏色。）將一張由對手擁有的牌從放逐區置入該玩家的墳墓場，以作為施放噬體突襲的額外費用。噬體突襲對目標生物造成5點傷害。", "type": "巫術"}], "frameEffects": ["devoid"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "203089", "cardKingdomId": "202766", "cardsphereId": "6748", "mcmId": "284876", "mcmMetaId": "220806", "mtgjsonV4Id": "43fa2781-d0f6-5889-8837-aa5790c0fc82", "mtgoFoilId": "58770", "mtgoId": "58769", "multiverseId": "402000", "scryfallId": "5a689975-d27b-4b8f-8d46-6e97c754ae81", "scryfallIllustrationId": "85eca616-b11b-46bd-9901-44f3f8c300f7", "scryfallOracleId": "e773258a-e59b-4e5f-b4e1-4f95cb11a39f", "tcgplayerProductId": "105663"}, "keywords": ["Devoid"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}", "manaValue": 2.0, "name": "Processor Assault", "number": "132", "originalText": "Devoid (This card has no color.)\nAs an additional cost to cast Processor Assault, put a card an opponent owns from exile into that player's graveyard.Processor Assault deals 5 damage to target creature.", "originalType": "Sorcery", "printings": ["BFZ"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/55f4c3ecf6461e83", "cardKingdomFoil": "https://mtgjson.com/links/89d5c6778934522a", "cardmarket": "https://mtgjson.com/links/918715c019f2d3a8", "tcgplayer": "https://mtgjson.com/links/b2337fd14cc2b157"}, "rarity": "uncommon", "rulings": [{"date": "2015-08-25", "text": "You must put exactly one card an opponent owns from exile into that player’s graveyard to cast Processor Assault. You can’t cast it without doing so, and you can’t put multiple exiled cards into their owners’ graveyards this way."}, {"date": "2015-08-25", "text": "Players can respond to Processor Assault only after it’s been cast and all of its costs have been paid. No one can try to remove the card from exile to stop you from casting the spell."}, {"date": "2015-08-25", "text": "Cards with devoid use frames that are variations of the transparent frame traditionally used for Eldrazi. The top part of the card features some color over a background based on the texture of the hedrons that once imprisoned the Eldrazi. This coloration is intended to aid deckbuilding and game play."}, {"date": "2015-08-25", "text": "A card with devoid is just colorless. It’s not colorless and the colors of mana in its mana cost."}, {"date": "2015-08-25", "text": "Other cards and abilities can give a card with devoid color. If that happens, it’s just the new color, not that color and colorless."}, {"date": "2015-08-25", "text": "Devoid works in all zones, not just on the battlefield."}, {"date": "2015-08-25", "text": "If a card loses devoid, it will still be colorless. This is because effects that change an object’s color (like the one created by devoid) are considered before the object loses devoid."}, {"date": "2015-08-25", "text": "If a spell or ability requires that you put more than one exiled card into the graveyard, you may choose cards owned by different opponents. Each card chosen will be put into its owner’s graveyard."}, {"date": "2015-08-25", "text": "If a replacement effect will cause cards that would be put into a graveyard from anywhere to be exiled instead (such as the one created by Anafenza, the Foremost), you can still put an exiled card into its opponent’s graveyard. The card becomes a new object and remains in exile. In this situation, you can’t use a single exiled card if required to put more than one exiled card into the graveyard. Conversely, you could use the same card in this situation if two separate spells or abilities each required you to put a single exiled card into its owner’s graveyard."}, {"date": "2015-08-25", "text": "You can’t look at face-down cards in exile unless an effect allows you to."}, {"date": "2015-08-25", "text": "Face-down cards in exile are grouped using two criteria: what caused them to be exiled face down and when they were exiled face down. If you want to put a face-down card in exile into its owner’s graveyard, you must first choose one of these groups and then choose a card from within that group at random. For example, say an artifact causes your opponent to exile their hand of three cards face down. Then on a later turn, that artifact causes your opponent to exile another two cards face down. If you use Wasteland Strangler to put one of those cards into their graveyard, you would pick the first or second pile and put a card chosen at random from that pile into the graveyard."}], "setCode": "BFZ", "subtypes": [], "supertypes": [], "text": "Devoid (This card has no color.)\nAs an additional cost to cast this spell, put a card an opponent owns from exile into that player's graveyard.\nProcessor Assault deals 5 damage to target creature.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "9c58bb8b-769d-5b0c-96a9-79eb248ac5cd"}