{"artist": "Daarken", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["G", "U"], "colors": ["G", "U"], "convertedManaCost": 6.0, "edhrecRank": 1791, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 460809, "name": "Nachahmer der Ahnen", "text": "Du kannst den Nachahmer der Ahnen als eine Kopie einer beliebigen Kreatur im Spiel ins Spiel kommen lassen, außer dass er „Zu Beginn deines Versorgungssegments und falls diese Kreatur kein Spielstein ist, erzeuge einen Spielstein, der eine Kopie dieser Kreatur ist\" hat.", "type": "Kreatur — Gestaltwandler"}, {"language": "Spanish", "multiverseId": 460836, "name": "Mímico progenitor", "text": "Puedes hacer que el Mímico progenitor entre al campo de batalla como una copia de cualquier criatura en el campo de batalla, excepto que tiene \"Al comienzo de tu mantenimiento, si esta criatura no es una ficha, crea una ficha que es una copia de esta criatura\".", "type": "Criatura — Metamorfo"}, {"language": "French", "multiverseId": 460863, "name": "Mimique progéniteur", "text": "Vous pouvez faire que le Mimique progéniteur arrive sur le champ de bataille comme une copie de n'importe quelle créature sur le champ de bataille, excepté qu'il a « Au début de votre entretien, si cette créature n'est pas un jeton, créez un jeton qui est une copie de cette créature. »", "type": "Créature : changeforme"}, {"language": "Italian", "multiverseId": 460890, "name": "Mimic Progenitore", "text": "Puoi far entrare il Mimic Progenitore nel campo di battaglia come una copia di qualsiasi creatura sul campo di battaglia, tranne che ha \"All'inizio del tuo mantenimento, se questa creatura non è una pedina, crea una pedina che è una copia di questa creatura\".", "type": "Creatura — Polimorfo"}, {"language": "Japanese", "multiverseId": 460917, "name": "前駆ミミック", "text": "あなたは前駆ミミックを、これが「あなたのアップキープの開始時に、このクリーチャーがトークンでない場合、このクリーチャーのコピーであるトークンを１体生成する。」を持つことを除き、戦場にあるクリーチャー１体のコピーとして戦場に出してもよい。", "type": "クリーチャー — 多相の戦士"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "223816", "cardsphereId": "59003", "mcmId": "369887", "mtgjsonV4Id": "ed54dedf-e78e-5d67-941c-b6668f7f93de", "multiverseId": "460782", "scryfallId": "73a32fa2-da7a-442d-89d9-cf1461441f4a", "scryfallIllustrationId": "26438fb9-81c3-4f79-9489-f15fee941db9", "scryfallOracleId": "88929ea9-900f-4dbb-b16c-cf3bad4e410c", "tcgplayerProductId": "184857"}, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{G}{U}", "manaValue": 6.0, "name": "Progenitor Mimic", "number": "123", "originalText": "You may have Progenitor Mimic enter the battlefield as a copy of any creature on the battlefield, except it has \"At the beginning of your upkeep, if this creature isn't a token, create a token that's a copy of this creature.\"", "originalType": "Creature — Shapeshifter", "power": "0", "printings": ["2XM", "C16", "DGM", "GK2"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6468b41280a5abe5", "tcgplayer": "https://mtgjson.com/links/37ef52a2ff81fdd5"}, "rarity": "mythic", "rulings": [{"date": "2013-04-15", "text": "Progenitor Mimic copies exactly what was printed on the original creature and nothing more (unless that creature is copying something else or is a token). It doesn't copy whether that creature is tapped or untapped, whether it has any counters on it or Auras attached to it, or any non-copy effects that have changed its power, toughness, types, color, or so on."}, {"date": "2013-04-15", "text": "The original Progenitor Mimic will create tokens, but those token copies will not."}, {"date": "2013-04-15", "text": "If you choose to have Progenitor Mimic enter the battlefield as a copy of a creature, the triggered ability it gains will become part of its copiable values. For example, suppose Progenitor Mimic enters the battlefield as a copy of Runeclaw Bear, a 2/2 green Bear creature with mana cost {1}{G}. The resulting object is a 2/2 green Bear creature named Runeclaw Bear with mana cost {1}{G} and with “At the beginning of your upkeep, if this creature isn't a token, put a token onto the battlefield that's a copy of this creature.” If another Progenitor Mimic enters the battlefield as a copy of that creature, it will be a Runeclaw Bear with two instances of the triggered ability."}, {"date": "2013-04-15", "text": "If the chosen creature is a token, Progenitor Mimic copies the original characteristics of that token as stated by the effect that put it onto the battlefield. Copying a token doesn't make Progenitor Mimic become a token."}, {"date": "2013-04-15", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when Progenitor Mimic enters the battlefield. Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities of the chosen creature will also work."}, {"date": "2013-04-15", "text": "If the chosen creature has {X} in its mana cost (such as Protean Hydra), X is considered to be zero."}, {"date": "2013-04-15", "text": "If Progenitor Mimic somehow enters the battlefield at the same time as another creature, it can't become a copy of that creature. You may choose only a creature that's already on the battlefield."}, {"date": "2013-04-15", "text": "You can choose not to copy anything. In that case, Progenitor Mimic enters the battlefield as a 0/0 Shapeshifter creature and is probably put into the graveyard immediately."}], "securityStamp": "oval", "setCode": "GK2", "subtypes": ["Shapeshifter"], "supertypes": [], "text": "You may have Progenitor Mimic enter the battlefield as a copy of any creature on the battlefield, except it has \"At the beginning of your upkeep, if this creature isn't a token, create a token that's a copy of this creature.\"", "toughness": "0", "type": "Creature — Shapeshifter", "types": ["Creature"], "uuid": "d3b6927d-4f39-5bd8-b0a9-3acc8de7c2c8", "watermark": "simic"}