{"artist": "Seb McKinnon", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 6953, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "985bac76-e5cf-526b-ae46-6b9c73913d77", "mtgoId": "85970", "scryfallId": "5f459bb6-436f-4f7f-88e0-9b6b934e42d3", "scryfallIllustrationId": "edfa4296-d491-437b-b63a-a5161f5eb27a", "scryfallOracleId": "26c22894-10e5-48f1-a32a-a7f1f3f7e12e"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}", "manaValue": 3.0, "name": "Promise of Tomorrow", "number": "85970", "originalReleaseDate": "2020-12-15", "printings": ["CMR", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-11-10", "text": "If a creature you control dies, but it isn’t a creature card in the graveyard (perhaps because it was a noncreature that became a creature), Promise of Tomorrow will still exile it, and it may return it to the battlefield later."}, {"date": "2020-11-10", "text": "Players can respond to the first ability of Promise of Tomorrow to try and move the card to another zone (even exile) before Promise of Tomorrow exiles it."}, {"date": "2020-11-10", "text": "If you control more than one Promise of Tomorrow, each creature you control that dies will cause the triggered ability of each of them to trigger. Those abilities can be put on the stack in any order, and the first one to resolve is the one that exiles the creature card. That creature card will be exiled by that Promise of Tomorrow, and only that Promise of Tomorrow can return it."}, {"date": "2020-11-10", "text": "Similarly, if you control more than one Promise of Tomorrow, they will each trigger at the beginning of the end step if you control no creatures. These abilities can be put on the stack in any order, and the first one to resolve will be sacrificed and return cards to the battlefield if appropriate. The next ability to try and resolve will check to see if you control any creatures at that time. If you do, the ability won’t resolve, Promise of Tomorrow won’t be sacrificed, and it won’t return any cards."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Whenever a creature you control dies, exile it.\nAt the beginning of each end step, if you control no creatures, sacrifice Promise of Tomorrow and return all cards exiled with it to the battlefield under your control.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "9f939ac3-81d5-531d-b375-ee64f47c3ffd"}