{"artist": "Slawomir Maniak", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["R", "U"], "colors": ["R", "U"], "convertedManaCost": 6.0, "edhrecRank": 10600, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 526795, "name": "Prophetischer Titan", "text": "Delirium — Wenn der Prophetische Titan ins Spiel kommt, bestimme eines. Falls dein Friedhof vier oder mehr unterschiedliche Kartentypen enthält, bestimme stattdessen beides.\n• Der Prophetische Titan fügt einem Ziel deiner Wahl 4 Schadenspunkte zu.\n• Schaue dir die obersten vier Karten deiner Bibliothek an. Nimm eine davon auf deine Hand und lege den Rest in zufälliger Reihenfolge unter deine Bibliothek.", "type": "Kreatur — Riese, Zauberer"}, {"language": "Spanish", "multiverseId": 526849, "name": "Titán profético", "text": "Delirio — Cuando el Titán profético entre al campo de batalla, elige uno. Si entre las cartas de tu cementerio hay cuatro o más tipos de cartas, en vez de eso, elige los dos.\n• El Titán profético hace 4 puntos de daño a cualquier objetivo.\n• Mira las cuatro primeras cartas de tu biblioteca. Pon una de ellas en tu mano y el resto en el fondo de tu biblioteca en un orden aleatorio.", "type": "Criatura — Hechicero gigante"}, {"language": "French", "multiverseId": 526903, "name": "Titan prophétique", "text": "Délire — Quand le Titan prophétique arrive sur le champ de bataille, choisissez l'un. S'il y a au moins quatre types de carte parmi les cartes de votre cimetière, choisissez les deux à la place.\n• Le Titan prophétique inflige 4 blessures à n'importe quelle cible.\n• Regardez les quatre cartes du dessus de votre bibliothèque. Mettez l'une d'elles dans votre main et le reste au-dessous de votre bibliothèque, dans un ordre aléatoire.", "type": "Créature : géant et sorcier"}, {"language": "Italian", "multiverseId": 526957, "name": "Titano Profetico", "text": "Delirio — Quando il Titano Profetico entra nel campo di battaglia, scegli uno. Se ci sono quattro o più tipi di carta tra le carte nel tuo cimitero, invece scegli entrambi.\n• Il Titano Profetico infligge 4 danni a un qualsiasi bersaglio.\n• Guarda le prime quattro carte del tuo grimorio. Aggiungine una alla tua mano e metti le altre in fondo al tuo grimorio in ordine casuale.", "type": "Creatura — Mago Gigante"}, {"language": "Japanese", "multiverseId": 527011, "name": "予言のタイタン", "text": "昂揚 ― 予言のタイタンが戦場に出たとき、以下から１つを選ぶ。あなたの墓地にあるカードの中に４種類以上のカード・タイプがあるなら、代わりに両方を選ぶ。\n• クリーチャー１体かプレインズウォーカー１体かプレイヤー１人を対象とする。予言のタイタンはそれに４点のダメージを与える。\n• あなたのライブラリーの一番上からカード４枚を見る。そのうち１枚をあなたの手札に、残りをあなたのライブラリーの一番下に無作為の順番で、置く。", "type": "クリーチャー — 巨人・ウィザード"}, {"language": "Korean", "multiverseId": 527065, "name": "예언하는 거신", "text": "섬망 — 예언하는 거신이 전장에 들어올 때, 하나를 선택한다. 당신의 무덤에 네 개 이상의 카드 유형이 있다면, 대신 둘다 선택한다.\n• 원하는 목표를 정한다. 예언하는 거신은 그 목표에게 피해 4점을 입힌다.\n• 당신의 서고 맨 위 카드 네 장을 본다. 그중 한 장을 당신의 손으로 가져가고 나머지 카드들은 무작위 순서로 당신의 서고 맨 밑에 놓는다.", "type": "생물 — 거인 마법사"}, {"language": "Portuguese (Brazil)", "multiverseId": 527119, "name": "Titã Profético", "text": "Delírio — Quando Titã Profético entrar no campo de batalha, escolha um. Se houver quatro ou mais tipos de card entre os dos cards em seu cemitério, em vez disso, escolha ambos.\n• Titâ Profético causa 4 pontos de dano a qualquer alvo.\n• Olhe os quatro cards do topo do seu grimório. Coloque um deles em sua mão e o restante no fundo de seu grimório em ordem aleatória.", "type": "Criatura — Gigante Mago"}, {"language": "Russian", "multiverseId": 527173, "name": "Пророческий Титан", "text": "Буйство — Когда Пророческий Титан выходит на поле битвы, выберите одно. Если среди карт на вашем кладбище есть не менее четырех типов карт, вместо этого выберите оба.\n• Пророческий Титан наносит 4 повреждения любой цели.\n• Посмотрите четыре верхние карты вашей библиотеки. Положите одну из них в вашу руку, а остальные — в низ вашей библиотеки в случайном порядке.", "type": "Существо — Гигант Чародей"}, {"language": "Chinese Simplified", "multiverseId": 527227, "name": "预言泰坦", "text": "躁狂～当预言泰坦进战场时，选择一项。如果你坟墓场中牌的牌张类别有四种或更多，则改为都选。\n•预言泰坦对任意一个目标造成4点伤害。\n•检视你牌库顶的四张牌。将其中一张置于你手上，其余的牌则以随机顺序置于你的牌库底。", "type": "生物 ～巨人／法术师"}, {"language": "Chinese Traditional", "multiverseId": 527281, "name": "預言泰坦", "text": "躁狂～當預言泰坦進戰場時，選擇一項。如果你墳墓場中牌的牌張類別有四種或更多，則改為都選。\n•預言泰坦對任意一個目標造成4點傷害。\n•檢視你牌庫頂的四張牌。將其中一張置於你手上，其餘的牌則以隨機順序置於你的牌庫底。", "type": "生物 ～巨人／魔法師"}], "frameEffects": ["showcase"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "246724", "cardKingdomId": "246385", "cardsphereId": "78391", "mcmId": "566644", "mcmMetaId": "341687", "mtgjsonV4Id": "23bed69e-1d61-5611-94bb-17e2f4f5eb14", "multiverseId": "526741", "scryfallId": "b27e8b65-16ec-4aef-ac26-8afd78d8bfe5", "scryfallIllustrationId": "fa6c0f09-7c10-4dc4-85bc-58ce8ba589c0", "scryfallOracleId": "224f5f1a-4f31-4935-bf5a-910fd0a666a1", "tcgplayerProductId": "240122"}, "isStarter": true, "keywords": ["Delirium"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U}{R}", "manaValue": 6.0, "name": "Prophetic Titan", "number": "373", "originalText": "Delirium — When Prophetic Titan enters the battlefield, choose one. If there are four or more card types among cards in your graveyard, choose both instead.\n• Prophetic Titan deals 4 damage to any target.\n• Look at the top four cards of your library. Put one of them into your hand and the rest on the bottom of your library in a random order.", "originalType": "Creature — Giant Wizard", "power": "4", "printings": ["J21", "MH2"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/bbda8254afe0e754", "cardKingdomFoil": "https://mtgjson.com/links/e395b404321b524f", "cardmarket": "https://mtgjson.com/links/2d2c27c0a5fd6f90", "tcgplayer": "https://mtgjson.com/links/3c91071b625163cf"}, "rarity": "uncommon", "rulings": [{"date": "2021-06-18", "text": "Prophetic Titan's ability checks the number of card types in your graveyard as it's put on the stack. If you have four or more types in your graveyard at that time, but fewer than four as it resolves, you will still get to use both modes chosen."}, {"date": "2021-06-18", "text": "If only the first mode is chosen, or if both modes are chosen, and the chosen target is illegal as the ability tries to resolve, the ability won't resolve and none of its effects will happen."}, {"date": "2021-06-18", "text": "The card types that can appear in a graveyard are artifact, creature, enchantment, instant, land, planeswalker, sorcery, and tribal. Legendary, basic, and snow are supertypes, not card types; Giant and Wizard are subtypes, not card types."}], "setCode": "MH2", "subtypes": ["Giant", "Wizard"], "supertypes": [], "text": "Delirium — When Prophetic Titan enters the battlefield, choose one. If there are four or more card types among cards in your graveyard, choose both instead.\n• Prophetic Titan deals 4 damage to any target.\n• Look at the top four cards of your library. Put one of them into your hand and the rest on the bottom of your library in a random order.", "toughness": "4", "type": "Creature — Giant Wizard", "types": ["Creature"], "uuid": "6ebf083b-1921-5751-b162-579066e40e96", "variations": ["42d8848b-6238-5f45-bb6f-c1ed25f92e30"]}