{"artist": "Todd Lockwood", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 13159, "finishes": ["nonfoil", "foil"], "flavorText": "\"I know what you're thinking,\" Jace whispered in the mage's mind. \"It's not going to work.\"", "foreignData": [{"flavorText": "„Ich weiß, was du denkst\", ertönte Jaces Stimme im Geist des Magiers. „Es wird nicht funktionieren.\"", "language": "German", "multiverseId": 399310, "name": "Psychische Zurückweisung", "text": "Neutralisiere einen Spontanzauber oder eine Hexerei deiner Wahl, der bzw. die dich als Ziel hat.Zauberkunst — Falls sich zwei oder mehr Spontanzauber- und/oder Hexerei-Karten in deinem Friedhof befinden, kannst du den auf diese Weise neutralisierten Zauberspruch kopieren. Du kannst neue Ziele für die Kopie bestimmen.", "type": "Spontanzauber"}, {"flavorText": "\"Sé lo que estás pensando\", susurró Jace a la mente del mago. \"No va a resultar\".", "language": "Spanish", "multiverseId": 401249, "name": "Refutación psíquica", "text": "Contrarresta el hechizo objetivo de instantáneo o de conjuro que te hace objetivo.Dominio de hechizos — Si hay dos o más cartas de instantáneo y/o de conjuro en tu cementerio, puedes copiar el hechizo contrarrestado de esta manera. Puedes elegir nuevos objetivos para la copia.", "type": "Instantáneo"}, {"flavorText": "« Je sais ce que tu penses, murmura Jace dans l'esprit du mage. Mais ça ne marchera pas. »", "language": "French", "multiverseId": 399587, "name": "Réfutation psychique", "text": "Contrecarrez le sort d'éphémère ou de rituel ciblé qui vous cible.Maîtrise de sort — S'il y a au moins deux cartes d'éphémère et/ou de rituel dans votre cimetière, vous pouvez copier le sort contrecarré de cette manière. Vous pouvez choisir de nouvelles cibles pour cette copie.", "type": "Éphémère"}, {"flavorText": "\"So cosa stai pensando\", sussurrò Jace nella mente del mago. \"Non funzionerà.\"", "language": "Italian", "multiverseId": 399864, "name": "Rifiuto Psichico", "text": "Neutralizza una magia istantaneo o stregoneria bersaglio che ti bersaglia.Arte magica — Se nel tuo cimitero ci sono due o più carte istantaneo e/o stregoneria, puoi copiare la magia neutralizzata in questo modo. Puoi scegliere nuovi bersagli per la copia.", "type": "Istantaneo"}, {"flavorText": "ジェイスは魔道士の頭の中に囁いた。「お前が何を考えているかなんて、すべてお見通しだ。それが成功することなど、万に一つもあり得ない。」", "language": "Japanese", "multiverseId": 400141, "name": "精神的反論", "text": "あなたを対象とするインスタント・呪文１つかソーサリー・呪文１つを対象とし、それを打ち消す。魔巧 ― あなたの墓地にインスタント・カードやソーサリー・カードが合わせて２枚以上あるなら、あなたはこれにより打ち消された呪文をコピーしてもよい。あなたはそのコピーの新しい対象を選んでもよい。", "type": "インスタント"}, {"flavorText": "\"난 네 계획을 알고 있지.\" 제이스가 그 마도사의 마음에 속삭였다. \"실패할 거야.\"", "language": "Korean", "multiverseId": 400418, "name": "정신 반격", "text": "당신을 목표로 정한 순간마법 또는 집중마법 주문을 목표로 정한다. 그 주문을 무효화한다.주문 숙련 — 당신의 무덤에 집중마법 그리고/또는 순간마법 카드가 두 장 이상 있다면, 당신은 이런 식으로 무효화된 주문을 복사할 수 있다. 당신은 그 복사본의 목표를 새로 정할 수 있다.", "type": "순간마법"}, {"flavorText": "\"Eu sei o que você está pensando\", sussurrou Jace na mente do mago. \"Não vai funcionar.\"", "language": "Portuguese (Brazil)", "multiverseId": 400695, "name": "Repulsão Psíquica", "text": "Anule a mágica instantânea ou o feitiço alvo que tenha você como alvo.Maestria em magia — Se houver dois ou mais cards de mágica instantânea ou feitiço no seu cemitério, você poderá copiar a mágica anulada desta forma. Você pode escolher novos alvos para a cópia.", "type": "Mágica Instantânea"}, {"flavorText": "«Я знаю, что ты задумал, — прошептал голос Джейса в разуме волшебника. — Ничего не выйдет».", "language": "Russian", "multiverseId": 400972, "name": "Психический Отпор", "text": "Отмените целевое мгновенное заклинание или заклинание волшебства, целью которого являетесь вы.Мастерство заклинаний — Если на вашем кладбище есть не менее двух карт мгновенных заклинаний и (или) волшебства, вы можете скопировать отмененное таким образом заклинание. Вы можете выбрать новые цели для этой копии.", "type": "Мгновенное заклинание"}, {"flavorText": "「我知道你在想什么，」杰斯的声音在法师的心灵中飘荡。「没用。」", "language": "Chinese Simplified", "multiverseId": 398756, "name": "心灵抗辩", "text": "反击目标瞬间或法术咒语，且该咒语须以你为目标。精熟咒语～如果你坟墓场中有两张或更多的瞬间和／或法术牌，则你可以复制以此法被反击的咒语。你可以为该复制品选择新的目标。", "type": "瞬间"}, {"flavorText": "「我知道你在想什麼，」傑斯的聲音在法師的心靈中飄蕩。「沒用。」", "language": "Chinese Traditional", "multiverseId": 399033, "name": "心靈抗辯", "text": "反擊目標瞬間或巫術咒語，且該咒語須以你為目標。精熟咒語～如果你墳墓場中有兩張或更多的瞬間和／或巫術牌，則你可以複製以此法被反擊的咒語。你可以為該複製品選擇新的目標。", "type": "瞬間"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "202165", "cardKingdomId": "201880", "cardsphereId": "29221", "mcmId": "283590", "mcmMetaId": "220304", "mtgjsonV4Id": "c3ff86f8-84b4-55b1-8fb9-c9221dc92e22", "mtgoFoilId": "57891", "mtgoId": "57890", "multiverseId": "398479", "scryfallId": "67a105f8-0c01-4c09-a3bf-8c912b6dc741", "scryfallIllustrationId": "95a1f37a-ad84-4557-b9ec-c0c4ebd3a450", "scryfallOracleId": "08dd393f-12d8-4801-882c-6d76009b4f12", "tcgplayerProductId": "100359"}, "keywords": ["Spell mastery"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Psychic Rebuttal", "number": "67", "originalText": "Counter target instant or sorcery spell that targets you.\nSpell mastery — If there are two or more instant and/or sorcery cards in your graveyard, you may copy the spell countered this way. You may choose new targets for the copy.", "originalType": "Instant", "printings": ["ORI"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/004c4e4f2a62940b", "cardKingdomFoil": "https://mtgjson.com/links/66bf1d7928778b10", "cardmarket": "https://mtgjson.com/links/faace608a52d4452", "tcgplayer": "https://mtgjson.com/links/c4c2da0dafd276bc"}, "rarity": "uncommon", "rulings": [{"date": "2015-06-22", "text": "The target instant or sorcery spell can have other targets as long as one of them is you."}, {"date": "2015-06-22", "text": "If the spell mastery ability applies, you’ll create a copy of the instant or sorcery spell only if Psychic Rebuttal counters that spell. If that spell can’t be countered by spells or abilities, you won’t get a copy."}, {"date": "2015-06-22", "text": "If Psychic Rebuttal creates a copy of the spell, you control the copy. That copy is created on the stack, so it’s not “cast.” Abilities that trigger when a player casts a spell won’t trigger. The copy will then resolve like a normal spell, after players get a chance to cast spells and activate abilities."}, {"date": "2015-06-22", "text": "The copy will have the same targets as the spell it’s copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can’t choose a new legal target, then it remains unchanged (even if the current target is illegal)."}, {"date": "2015-06-22", "text": "If the copied spell is modal (that is, it says “Choose one –” or the like), the copy will have the same mode. You can’t choose a different one."}, {"date": "2015-06-22", "text": "If the copied spell has an X whose value was determined as it was cast, the copy has the same value of X."}, {"date": "2015-06-22", "text": "You can’t choose to pay any additional costs for the copy. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too. For example, if a player sacrifices a 3/3 creature to cast Fling, and you copy it, the copy of Fling will also deal 3 damage to its target."}, {"date": "2015-06-22", "text": "If the copy says that it affects “you,” it affects the controller of the copy, not the controller of the original spell. Similarly, if the copy says that it affects an “opponent,” it affects an opponent of the copy’s controller, not an opponent of the original spell’s controller."}, {"date": "2015-06-22", "text": "Check to see if there are two or more instant and/or sorcery cards in your graveyard as the spell resolves to determine whether the spell mastery ability applies. The spell itself won’t count because it’s still on the stack as you make this check."}], "setCode": "ORI", "subtypes": [], "supertypes": [], "text": "Counter target instant or sorcery spell that targets you.\nSpell mastery — If there are two or more instant and/or sorcery cards in your graveyard, you may copy the spell countered this way. You may choose new targets for the copy.", "type": "Instant", "types": ["Instant"], "uuid": "c0d269c7-b9de-5c40-ae5f-7f7951d6492e"}