{"artist": "Scott Altmann", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 5972, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 174524, "name": "Unfug des Phookas", "text": "Zu Beginn deines Versorgungssegments kannst du die Kontrolle über eine bleibende Karte deiner Wahl, die kein Land ist und die du kontrollierst, und eine bleibende Karte deiner Wahl, die kein Land ist, die ein Gegner kontrolliert und die gleich hohe oder niedrigere umgewandelte Manakosten hat, tauschen.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 172718, "name": "Diablura de puca", "text": "Al comienzo de tu mantenimiento, puedes intercambiar el control del permanente objetivo que no sea tierra que controlas y el permanente objetivo que no sea tierra que controla un oponente que tenga un coste de maná convertido igual o menor.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 173320, "name": "Malice selon le pucca", "text": "Au début de votre entretien, vous pouvez échanger le contrôle du permanent non-terrain ciblé que vous contrôlez contre celui du permanent non-terrain ciblé qu'un adversaire contrôle et qui a un coût converti de mana inférieur ou égal.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 173621, "name": "Inganno del Puca", "text": "All'inizio del tuo mantenimento, puoi scambiare il controllo di un permanente non terra bersaglio che controlli e un permanente non terra bersaglio controllato da un avversario con un costo di mana convertito pari o inferiore.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 173922, "name": "プーカの悪戯", "text": "あなたのアップキープの開始時に、あなたがコントロールする土地でないパーマネント１つと、いずれかの対戦相手がコントロールする点数で見たマナ・コストがそれ以下の土地でないパーマネント１つを対象とする。あなたはそれらのコントロールを交換してもよい。", "type": "エンチャント"}, {"language": "Portuguese (Brazil)", "multiverseId": 172116, "name": "Travessura de Puca", "text": "No início de sua manutenção, você pode permutar o controle da permanente alvo (que não seja um terreno) controlada por você com a permanente alvo (que não seja um terreno) controlada por um oponente com um custo de mana convertido, igual ou menor.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 172417, "name": "Проделки Пуки", "text": "В начале вашего шага поддержки вы можете обменять контроль над целевым не являющимся землей перманентом под вашим контролем на контроль над целевым не являющимся землей перманентом под контролем оппонента с равной или меньшей конвертированной мана-стоимостью.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 173019, "name": "铺卡的作弄", "text": "在你的维持开始时，你可以选择目标由你操控的非地永久物，与目标由对手操控、且总法术力费用等于或小于前者的非地永久物，并交换它们的操控权。", "type": "结界"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "124971", "cardKingdomId": "124685", "cardsphereId": "41400", "mcmId": "19061", "mcmMetaId": "9612", "mtgjsonV4Id": "80770576-7af4-56ae-8d76-79514b03692e", "mtgoFoilId": "29344", "mtgoId": "29343", "multiverseId": "141996", "scryfallId": "8380bd90-35f2-4936-995b-af6427f61752", "scryfallIllustrationId": "8672454a-2463-4035-9467-ca88e701bb5b", "scryfallOracleId": "a8e6655c-e63f-4a60-98f6-9d5bf8631488", "tcgplayerProductId": "18749"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Puca's Mischief", "number": "47", "originalText": "At the beginning of your upkeep, you may exchange control of target nonland permanent you control and target nonland permanent an opponent controls with an equal or lesser converted mana cost.", "originalType": "Enchantment", "printings": ["FMB1", "SHM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/8870322378eb461c", "cardKingdomFoil": "https://mtgjson.com/links/e65c24895c40dbfe", "cardmarket": "https://mtgjson.com/links/e57233a73ffd9fcb", "tcgplayer": "https://mtgjson.com/links/53421a53f4b0fe21"}, "rarity": "rare", "rulings": [{"date": "2008-05-01", "text": "You choose two targets such that as a set, all of the targeting conditions are met. That means, for example, that if you control a nonland permanent whose converted mana cost is lower than any of your opponents’ nonland permanents, you can’t choose it as a target. (If you did, you’d be unable to choose a second target.)"}, {"date": "2008-05-01", "text": "Even if you don’t plan on exchanging control of any permanents, if you can choose two legal targets when the ability triggers, you must do so. If you can’t, then you don’t choose any targets."}, {"date": "2008-05-01", "text": "If either one of the targets becomes illegal (because it leaves the battlefield or for any other reason) by the time the ability resolves, the exchange won’t happen. If both targets become illegal, the ability doesn’t resolve."}], "setCode": "SHM", "subtypes": [], "supertypes": [], "text": "At the beginning of your upkeep, you may exchange control of target nonland permanent you control and target nonland permanent an opponent controls with an equal or lesser mana value.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "dd5887fe-2e33-5a6c-ad59-7b0ed37b399a"}