{"artist": "Warren Mahy", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 6.0, "edhrecRank": 11833, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 154659, "name": "Lauterkeit", "text": "Fliegend\nFalls ein Zauberspruch oder eine Fähigkeit dir Schaden zufügen würde, verhindere diesen Schaden. Du erhältst so viele Lebenspunkte dazu, wie auf diese Weise Schadenspunkte verhindert wurden.\nWenn die Lauterkeit von egal woher in einen Friedhof gelegt würde, mische sie in die Bibliothek ihres Besitzers.", "type": "Kreatur — Elementarwesen, Inkarnation"}, {"language": "Spanish", "multiverseId": 156776, "name": "Pureza", "text": "Vuela.\nSi un hechizo o habilidad fuera a hacerte daño, prevén ese daño. Ganas vida igual a la cantidad de daño prevenido de esta manera.\nCuando la Pureza vaya a un cementerio desde cualquier parte, barájala en la biblioteca de su propietario.", "type": "Criatura — Encarnación elemental"}, {"language": "French", "multiverseId": 155572, "name": "Pureté", "text": "Vol\nSi un sort ou une capacité devait vous infliger des blessures, prévenez ces blessures. Vous gagnez autant de points de vie que de blessures prévenues de cette manière.\nQuand la Pureté est mise dans un cimetière d'où qu'elle vienne, mélangez-la dans la bibliothèque de son propriétaire.", "type": "Créature : élémental et incarnation"}, {"language": "Italian", "multiverseId": 155873, "name": "Purezza", "text": "Volare\nSe una magia o abilità sta per infliggerti danno, previeni quel danno. Guadagni un ammontare di punti vita pari ai danni prevenuti in questo modo.\nQuando la Purezza viene messa in un cimitero da qualsiasi zona, rimescolala nel grimorio del suo proprietario.", "type": "Creatura — Incarnazione Elementale"}, {"language": "Japanese", "multiverseId": 156174, "name": "清純", "text": "飛行\nいずれかの呪文や能力があなたにダメージを与える場合、そのダメージを軽減し、０にする。 あなたはこれにより軽減されたダメージに等しい点数のライフを得る。\n清純がいずれかの領域からいずれかの墓地に置かれたとき、それをオーナーのライブラリーに加えて切り直す。", "type": "クリーチャー — エレメンタル・インカーネーション"}, {"language": "Portuguese (Brazil)", "multiverseId": 157077, "name": "Pureza", "text": "Voar\nSe uma mágica ou habilidade causaria dano a você, previna esse dano. Você ganha uma quantidade de pontos de vida igual ao dano prevenido desta maneira.\nQuando Pureza é colocado num cemitério vindo de qualquer lugar, embaralhe-o no grimório de seu dono.", "type": "Criatura — Elemental Encarnação"}, {"language": "Russian", "multiverseId": 156475, "name": "Чистота", "text": "Полет\nЕсли заклинание или способность должны нанести вам повреждения, предотвратите эти повреждения. Вы получаете столько жизни, сколько повреждений было предотвращено таким образом.\nКогда Чистота попадает откуда-либо на кладбище, втасуйте ее в библиотеку ее владельца.", "type": "Существо — Элементаль Инкарнация"}, {"language": "Chinese Simplified", "multiverseId": 154960, "name": "纯洁", "text": "飞行\n如果咒语或异能将对你造成伤害，则防止该伤害。 你获得等同于以此法所防止的伤害之生命。\n当纯洁从任何地方置入坟墓场时，将它洗入其拥有者的牌库。", "type": "生物～元素／化身"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "124027", "cardKingdomId": "123540", "cardsphereId": "25551", "mcmId": "17778", "mcmMetaId": "9149", "mtgjsonV4Id": "b3cbd880-cb1e-524d-9ab2-eac5c967370c", "mtgoFoilId": "28462", "mtgoId": "28461", "multiverseId": "140214", "scryfallId": "154a335d-188d-49c3-af6d-c8e702b4b3ba", "scryfallIllustrationId": "78685498-474d-4e60-a912-cd8e416892a7", "scryfallOracleId": "23ef92b0-2298-4e8d-bf64-46d096c84a9d", "tcgplayerProductId": "15607"}, "keywords": ["Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}{W}{W}", "manaValue": 6.0, "name": "Purity", "number": "37", "originalText": "Flying\nIf a spell or ability would deal damage to you, prevent that damage. You gain life equal to the damage prevented this way.\nWhen Purity is put into a graveyard from anywhere, shuffle it into its owner's library.", "originalType": "Creature - Elemental Incarnation", "power": "6", "printings": ["LRW"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7880fe5c4605ac6e", "cardKingdomFoil": "https://mtgjson.com/links/efb2308f0906c525", "cardmarket": "https://mtgjson.com/links/5d89ebd4d4d41148", "tcgplayer": "https://mtgjson.com/links/86f89fd5fbc4bf76"}, "rarity": "rare", "rulings": [{"date": "2007-10-01", "text": "The last ability triggers when the Incarnation is put into its owner’s graveyard from any zone, not just from on the battlefield."}, {"date": "2007-10-01", "text": "Although this ability triggers when the Incarnation is put into a graveyard from the battlefield, it doesn’t *specifically* trigger on leaving the battlefield, so it doesn’t behave like other leaves-the-battlefield abilities. The ability will trigger from the graveyard."}, {"date": "2007-10-01", "text": "If the Incarnation had lost this ability while on the battlefield (due to Lignify, for example) and then was destroyed, the ability would still trigger and it would get shuffled into its owner’s library. However, if the Incarnation lost this ability when it was put into the graveyard (due to Yixlid Jailer, for example), the ability wouldn’t trigger and the Incarnation would remain in the graveyard."}, {"date": "2007-10-01", "text": "If the Incarnation is removed from the graveyard after the ability triggers but before it resolves, it will remain in its new zone when its owner shuffles their library. Similarly, if a replacement effect has the Incarnation move to a different zone instead of being put into the graveyard, the ability won’t trigger at all."}], "setCode": "LRW", "subtypes": ["Elemental", "Incarnation"], "supertypes": [], "text": "Flying\nIf noncombat damage would be dealt to you, prevent that damage. You gain life equal to the damage prevented this way.\nWhen Purity is put into a graveyard from anywhere, shuffle it into its owner's library.", "toughness": "6", "type": "Creature — Elemental Incarnation", "types": ["Creature"], "uuid": "f784396b-bcca-5f3d-815f-833b5dfac379"}