{"artist": "Rob Alexander", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 1.0, "edhrecRank": 5120, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 210594, "name": "Suche nach Ulas Tempel", "text": "Zu Beginn deines Versorgungssegments kannst du dir die oberste Karte deiner Bibliothek anschauen. Falls es eine Kreaturenkarte ist, kannst du sie offen vorzeigen und eine Quest-Marke auf die Suche nach Ulas Tempel legen.\nBefinden sich zu Beginn eines Endsegments drei oder mehr Quest-Marken auf der Suche nach Ulas Tempel, kannst du eine Kraken-, Leviathan-, Oktopus- oder Schlangen-Kreaturenkarte aus deiner Hand ins Spiel bringen.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 211609, "name": "Búsqueda del templo de Ula", "text": "Al comienzo de tu mantenimiento, puedes mirar la primera carta de tu biblioteca. Si es una carta de criatura, puedes mostrarla y poner un contador de búsqueda sobre la Búsqueda del templo de Ula.\nAl comienzo de cada paso final, si hay tres o más contadores de búsqueda sobre la Búsqueda del templo de Ula, puedes poner en el campo de batalla una carta de criatura de Kraken, Leviatán, Pulpo o Serpiente de tu mano.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 211319, "name": "Quête du Temple d'Ula", "text": "Au début de votre entretien, vous pouvez regarder la carte du dessus de votre bibliothèque. Si c'est une carte de créature, vous pouvez la révéler et mettre un marqueur « quête » sur la Quête du Temple d'Ula.\nAu début de chaque étape de fin, s'il y a au moins trois marqueurs « quête » sur la Quête du Temple d'Ula, vous pouvez mettre sur le champ de bataille une carte de créature Kraken, Léviathan, Pieuvre ou Serpent depuis votre main.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 211174, "name": "In Cerca del Tempio di Ula", "text": "All'inizio del tuo mantenimento, puoi guardare la prima carta del tuo grimorio. Se è una carta creatura, puoi rivelarla e mettere un segnalino ricerca su In Cerca del Tempio di Ula.\nAll'inizio di ogni sottofase finale, se ci sono tre o più segnalini ricerca su In Cerca del Tempio di Ula, puoi mettere sul campo di battaglia una carta creatura Kraken, Leviatano, Piovra o Serpe dalla tua mano.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 210739, "name": "ウーラの寺院の探索", "text": "あなたのアップキープの開始時に、あなたはあなたのライブラリーの一番上のカードを見てもよい。 それがクリーチャー・カードである場合、あなたはそれを公開してもよい。そうしたなら、ウーラの寺院の探索の上に探索カウンターを１個置く。\n各終了ステップの開始時に、ウーラの寺院の探索の上に３個以上の探索カウンターが置かれている場合、あなたはあなたの手札にあるクラーケンかリバイアサンかタコか海蛇のクリーチャー・カードを１枚戦場に出してもよい。", "type": "エンチャント"}, {"language": "Portuguese (Brazil)", "multiverseId": 210884, "name": "Busca pelo Templo de Ula", "text": "No início de sua manutenção, você pode olhar o card do topo do seu grimório. Se for um card de criatura, você pode revelá-lo e colocar um marcador de busca em Busca pelo Templo de Ula.\nNo início de cada etapa final, se houver três ou mais marcadores de busca sobre Busca pelo Templo de Ula, você poderá colocar no campo de batalha um card de criatura do tipo Kraken, Leviatã, Polvo ou Serpente da sua mão.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 211464, "name": "Поиски Храма Улы", "text": "В начале вашего шага поддержки вы можете посмотреть верхнюю карту вашей библиотеки. Если это карта существа, вы можете показать ее и положить жетон странствий на Поиски Храма Улы.\nВ начале каждого заключительного шага, если на Поисках Храма Улы есть не менее трех жетонов странствий, вы можете положить карту существа-Кракена, Левиафана, Спрута или Змея из вашей руки на поле битвы.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 211029, "name": "探索钨拉神庙", "text": "在你的维持开始时，你可以检视你的牌库顶牌。 若该牌是生物牌，则你可以展示它且在探索钨拉神庙上放置一个探索指示物。\n在每个结束步骤开始时，若探索钨拉神庙上有三个或更多探索指示物，则你可以将一张生物牌从你手上放进战场，且必须为巨海兽，海怪，章鱼，或巨蛇。", "type": "结界"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "130224", "cardKingdomId": "130029", "cardsphereId": "47511", "mcmId": "22161", "mcmMetaId": "11000", "mtgjsonV4Id": "b39b6a13-4fd0-58d8-a8a2-83682f76b6df", "mtgoFoilId": "35732", "mtgoId": "35731", "multiverseId": "198401", "scryfallId": "77983bbf-6761-4126-82b4-bdcdd6b8e1dc", "scryfallIllustrationId": "41e95e66-4dab-41ea-a132-5dc7ab96e0f2", "scryfallOracleId": "434807c5-5948-4181-a46c-2c834d0a2f0b", "tcgplayerProductId": "34417"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{U}", "manaValue": 1.0, "name": "Quest for Ula's Temple", "number": "35", "originalText": "At the beginning of your upkeep, you may look at the top card of your library. If it's a creature card, you may reveal it and put a quest counter on Quest for Ula's Temple.\nAt the beginning of each end step, if there are three or more quest counters on Quest for Ula's Temple, you may put a Kraken, Leviathan, Octopus, or Serpent creature card from your hand onto the battlefield.", "originalType": "Enchantment", "printings": ["WWK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6b8920581b3cf45f", "cardKingdomFoil": "https://mtgjson.com/links/27fc8ed6f6126c76", "cardmarket": "https://mtgjson.com/links/1574354da81ede9e", "tcgplayer": "https://mtgjson.com/links/ca4107d11677c482"}, "rarity": "rare", "rulings": [{"date": "2010-03-01", "text": "When the first ability resolves, you may look at the top card of your library. If you don’t, nothing happens. If you look at it and it’s not a creature card, it simply stays hidden. If you look at it and it is a creature card, you may reveal it and put a quest counter on Quest for Ula’s Temple, or you may choose to leave it hidden. In all cases, the card remains on top of your library."}, {"date": "2010-03-01", "text": "If an ability (from Future Sight or Oracle of Mul Daya, for example) causes you to play with the top card of your library revealed, you may still put a quest counter on Quest for Ula’s Temple when the first ability resolves if the top card of your library is a creature card."}, {"date": "2010-03-01", "text": "Although the first ability triggers only on your turn, the second ability may trigger each turn."}], "setCode": "WWK", "subtypes": [], "supertypes": [], "text": "At the beginning of your upkeep, you may look at the top card of your library. If it's a creature card, you may reveal it and put a quest counter on Quest for Ula's Temple.\nAt the beginning of each end step, if there are three or more quest counters on Quest for Ula's Temple, you may put a Kraken, Leviathan, Octopus, or Serpent creature card from your hand onto the battlefield.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "0dbb20da-58bf-5e7b-95e7-e0f8d8a26f97"}