{"artist": "Mike Bierek", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 1.0, "edhrecRank": 6879, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 210623, "name": "Suche nach dem Stein Nihil", "text": "Immer wenn ein Gegner eine Karte aus der Hand abwirft, kannst du eine Quest-Marke auf die Suche nach dem Stein Nihil legen.\nFalls zu Beginn des Versorgungssegments eines Gegners dieser Spieler keine Karten auf der Hand hat und auf der Suche nach dem Stein Nihil zwei oder mehr Quest-Marken liegen, kannst du diesen Spieler 5 Lebenspunkte verlieren lassen.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 211638, "name": "Búsqueda de la piedra nihil", "text": "Siempre que un oponente descarte una carta, puedes poner un contador de búsqueda sobre la Búsqueda de la piedra nihil.\nAl comienzo del mantenimiento de cada oponente, si ese jugador no tiene cartas en su mano y la Búsqueda de la piedra nihil tiene dos o más contadores de búsqueda sobre ella, puedes hacer que ese jugador pierda 5 vidas.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 211348, "name": "Quête de la Pierre de Nihil", "text": "À chaque fois qu'un adversaire se défausse d'une carte, vous pouvez mettre un marqueur « quête » sur la Quête de la Pierre de Nihil.\nAu début de l'entretien de chaque adversaire, si ce joueur n'a pas de carte en main et que la Quête de la Pierre de Nihil a au moins deux marqueurs « quête » sur elle, vous pouvez faire que ce joueur perde 5 points de vie.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 211203, "name": "In Cerca della Pietra Nichilista", "text": "Ogniqualvolta un avversario scarta una carta, puoi mettere un segnalino ricerca su In Cerca della Pietra Nichilista.\nAll'inizio del mantenimento di ogni avversario, se quel giocatore non ha carte in mano e ci sono due o più segnalini ricerca su In Cerca della Pietra Nichilista, puoi far perdere 5 punti vita a quel giocatore.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 210768, "name": "虚石の探索", "text": "いずれかの対戦相手がカードを１枚捨てるたび、あなたは虚石の探索の上に探索カウンターを１個置いてもよい。\n各対戦相手のアップキープの開始時に、そのプレイヤーの手札にカードが無く、虚石の探索の上に探索カウンターが２個以上置かれている場合、あなたは「そのプレイヤーは５点のライフを失う。」を選んでもよい。", "type": "エンチャント"}, {"language": "Portuguese (Brazil)", "multiverseId": 210913, "name": "Busca pela Pedra Niilista", "text": "Toda vez que um oponente descarta um card, você pode colocar um marcador de busca em Busca pela Pedra Niilista.\nNo início da manutenção de cada oponente, se aquele jogador não tiver nenhum card na mão e Busca pela Pedra Niilista tiver dois ou mais marcadores de busca, você poderá fazer com que aquele jogador perca 5 pontos de vida.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 211493, "name": "Поиски Камня Нигиляции", "text": "Каждый раз когда оппонент сбрасывает карту, вы можете положить жетон странствий на Поиски Камня Нигиляции.\nВ начале шага поддержки каждого оппонента, если у того игрока в руке нет карт, а на Поисках Камня Нигиляции есть не менее двух жетонов странствий, вы можете заставить того игрока потерять 5 жизней.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 211058, "name": "探索返虚石", "text": "每当任一对手弃一张牌时，你可以在探索返虚石上放置一个探索指示物。\n在每位对手的维持开始时，若该牌手没有手牌、且探索返虚石上有两个或更多探索指示物，你可以令该牌手失去5点生命。", "type": "结界"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "130209", "cardKingdomId": "129993", "cardsphereId": "47515", "mcmId": "22133", "mcmMetaId": "10973", "mtgjsonV4Id": "f2b62640-d153-5fa9-969d-681ce42b5ca2", "mtgoFoilId": "35704", "mtgoId": "35703", "multiverseId": "198386", "scryfallId": "c604a567-71dd-47d9-ae5d-b87b4db98df4", "scryfallIllustrationId": "8e2c8fe9-ff2c-432f-8831-7edc26752de3", "scryfallOracleId": "7f65178e-dd2e-44aa-a68f-f8694e0b250a", "tcgplayerProductId": "34416"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{B}", "manaValue": 1.0, "name": "Quest for the Nihil Stone", "number": "64", "originalText": "Whenever an opponent discards a card, you may put a quest counter on Quest for the Nihil Stone.\nAt the beginning of each opponent's upkeep, if that player has no cards in hand and Quest for the Nihil Stone has two or more quest counters on it, you may have that player lose 5 life.", "originalType": "Enchantment", "printings": ["PLIST", "WWK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/40f50d8e1bf4abf8", "cardKingdomFoil": "https://mtgjson.com/links/51d2199d2509030e", "cardmarket": "https://mtgjson.com/links/d4e9c276fdae68c8", "tcgplayer": "https://mtgjson.com/links/a63bbb69ca0482dd"}, "rarity": "rare", "rulings": [{"date": "2010-03-01", "text": "The second ability has an “intervening ‘if’ clause.” That means (1) the ability won’t trigger at all unless, as an opponent’s upkeep starts, that player has no cards in hand and Quest for the Nihil Stone has two or more quest counters on it, and (2) the ability will do nothing if that player has at least one card in hand and/or Quest for the Nihil Stone has fewer than two quest counters on it by the time it resolves. (If Quest for the Nihil Stone is no longer on the battlefield by that point, its last existence on the battlefield is checked to see how many quest counters were on it.)"}], "setCode": "WWK", "subtypes": [], "supertypes": [], "text": "Whenever an opponent discards a card, you may put a quest counter on Quest for the Nihil Stone.\nAt the beginning of each opponent's upkeep, if that player has no cards in hand and Quest for the Nihil Stone has two or more quest counters on it, you may have that player lose 5 life.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "505682ec-c30d-5d46-9b4d-801f86a92836"}