{"artist": "Tony Szczudlo", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 10918, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 73444, "name": "Quecksilber-Elementar", "text": "{U}: Das Quecksilber-Elementar erhält bis zum Ende des Zuges alle aktivierten Fähigkeiten einer Kreatur deiner Wahl. (Verwenden einige dieser Fähigkeiten den Namen jener Kreatur, verwende stattdessen den Namen dieser Kreatur.)\nUm für die Aktivierungskosten von Fähigkeiten des Quecksilber-Elementars zu bezahlen, kannst du blaues Mana ausgeben, als wäre es Mana beliebiger Farbe.", "type": "Kreatur — Elementarwesen"}, {"language": "Spanish", "multiverseId": 161927, "name": "Elemental de mercurio", "text": "{U}: El Elemental de mercurio gana todas las habilidades activadas de la criatura objetivo hasta el final del turno. (Si cualquiera de las habilidades usa el nombre de la criatura, en vez de eso, usa el nombre de esta criatura.)\nPuedes usar maná azul como si fuera de cualquier color para pagar los costes de activación de las habilidades del Elemental de mercurio.", "type": "Criatura — Elemental"}, {"language": "French", "multiverseId": 161549, "name": "Élémental de vif-argent", "text": "{U} : L'Élémental de vif-argent acquiert toutes les capacités activées de la créature ciblée jusqu'à la fin du tour. (Si l'une de ces capacités utilise le nom de la créature, utilisez le nom de cette créature à la place.)\nVous pouvez dépenser du mana bleu comme s'il s'agissait de mana de n'importe quelle couleur pour payer les coûts d'activation des capacités de l'Élémental de vif-argent.", "type": "Créature : élémental"}, {"language": "Italian", "multiverseId": 160018, "name": "Elementale di Mercurio", "text": "{U}: L'Elementale di Mercurio guadagna tutte le abilità attivate di una creatura bersaglio fino alla fine del turno (se una delle abilità usa il nome di quella creatura, usa invece il nome di questa creatura).\nPuoi spendere il mana blu come se fosse mana di un colore qualsiasi, per pagare i costi di attivazione delle abilità dell'Elementale di Mercurio.", "type": "Creatura — Elementale"}, {"language": "Japanese", "multiverseId": 73797, "name": "水銀の精霊", "text": "{U}：クリーチャー１体を対象とする。ターン終了時まで、水銀の精霊はそれのすべての起動型能力を得る。 （その能力にそのクリーチャーの名前がある場合、代わりにこのクリーチャーの名前を使う。）\nあなたは、すべての色のマナであるかのように、水銀の精霊の能力の起動コストを青マナで支払ってもよい。", "type": "クリーチャー — エレメンタル"}, {"language": "Portuguese (Brazil)", "multiverseId": 162243, "name": "Elemental de Mercúrio", "text": "{U}: Elemental de Mercúrio ganha todas as habilidades ativadas da criatura alvo até o final do turno. (Se alguma das habilidades usar o nome daquela criatura, ao invés disso use o nome desta.)\nVocê pode utilizar a mana azul como se ela fosse mana de qualquer cor para pagar os custos de ativação das habilidades de Elemental de Mercúrio.", "type": "Criatura — Elemental"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "73046", "cardKingdomId": "72046", "cardsphereId": "30859", "mcmId": "47", "mcmMetaId": "4437", "mtgjsonV4Id": "5473cc39-9e28-5709-b17e-1e2b63527539", "mtgoFoilId": "20042", "mtgoId": "20041", "multiverseId": "46559", "scryfallId": "2905f6ac-d054-454b-8e1a-9c32db13a581", "scryfallIllustrationId": "e0be7964-800a-435a-ad96-dc25f9395e8c", "scryfallOracleId": "c88e3aff-c539-4e8b-8ee1-a43b3d0962b4", "tcgplayerProductId": "11370"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}{U}", "manaValue": 5.0, "name": "Quicksilver Elemental", "number": "47", "originalText": "{U}: Quicksilver Elemental gains all activated abilities of target creature until end of turn. (If any of the abilities use that creature's name, use this creature's name instead.)\nYou may spend blue mana as though it were mana of any color to pay the activation costs of Quicksilver Elemental's abilities.", "originalType": "Creature - Elemental", "power": "3", "printings": ["MRD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/99703d2267f5ab55", "cardKingdomFoil": "https://mtgjson.com/links/a7ca7636c9c45354", "cardmarket": "https://mtgjson.com/links/842f3c7d7c8e1124", "tcgplayer": "https://mtgjson.com/links/3bdacedd32af8c50"}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "You can activate the ability more than once, collecting abilities from multiple creatures (or the same creature more than once)."}, {"date": "2004-10-04", "text": "If you make two copies of an ability that can be activated once a turn, you can activate each of them once a turn."}, {"date": "2004-10-04", "text": "If you use this card to gain Wall of Deceit’s ability to turn itself face down, you will not be able to turn this card face up because it will not have the Morph ability."}, {"date": "2004-12-01", "text": "Quicksilver Elemental can gain the activated abilities of any creature on the battlefield that you can target with its ability, even if you don’t control that creature."}, {"date": "2004-12-01", "text": "Quicksilver Elemental gains only activated abilities. It doesn’t gain keyword abilities (unless those keyword abilities are activated), triggered abilities, or static abilities."}, {"date": "2004-12-01", "text": "The granted abilities effectively use “this permanent,” rather than “[that card’s name],” so you treat the abilities as if they were printed on Quicksilver Elemental. For example, you treat an ability that says “Sacrifice a creature: Nantuko Husk gets +2/+2 until end of turn” as “Sacrifice a creature: Quicksilver Elemental gets +2/+2 until end of turn.”"}, {"date": "2004-12-01", "text": "Quicksilver Elemental has a rather tricky interaction with Leonin Bola. You can actually unattach your opponent’s Bola as part of the cost of activating the Elemental-copied ability."}, {"date": "2016-06-08", "text": "Activated abilities contain a colon. They’re generally written “[Cost]: [Effect].” Some keywords are activated abilities and will have colons in their reminder text."}], "setCode": "MRD", "subtypes": ["Elemental"], "supertypes": [], "text": "{U}: Quicksilver Elemental gains all activated abilities of target creature until end of turn. (If any of the abilities use that creature's name, use this creature's name instead.)\nYou may spend blue mana as though it were mana of any color to pay the activation costs of Quicksilver Elemental's abilities.", "toughness": "4", "type": "Creature — Elemental", "types": ["Creature"], "uuid": "8a2698ef-19c3-5997-92c6-ba8506f36876"}