{"artist": "Trevor Hairsine", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 7971, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 73445, "name": "Quecksilberspringbrunnen", "text": "Zu Beginn des Versorgungssegments jedes Spielers legt dieser Spieler eine Flutmarke auf ein Land seiner Wahl, das keine Insel ist und das er kontrolliert. Dieses Land ist eine Insel, solange eine Flutmarke auf ihm liegt.\nSind am Ende des Zuges alle Länder im Spiel Inseln, entferne alle Flutmarken von ihnen.", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 162113, "name": "Fuente de mercurio", "text": "Al comienzo del mantenimiento de cada jugador, ese jugador pone un contador de inundación sobre la tierra objetivo que controle que no sea isla. Esa tierra es una isla mientras tenga un contador de inundación sobre ella.\nAl final del turno, si todas las tierras en juego son islas, remueve todos los contadores de inundación de ellas.", "type": "Artefacto"}, {"language": "French", "multiverseId": 161735, "name": "Fontaine de vif-argent", "text": "Au début de l'entretien de chaque joueur, ce joueur met un marqueur « inondation » sur le terrain non-île ciblé qu'il contrôle. Le terrain est une île tant qu'il a un marqueur « inondation » placé sur lui.\nÀ la fin du tour, si tous les terrains en jeu sont des îles, retirez tous les marqueurs « inondation » placés sur eux.", "type": "Artefact"}, {"language": "Italian", "multiverseId": 160204, "name": "Fontana di Mercurio", "text": "All'inizio del proprio mantenimento, ciascun giocatore mette un segnalino inondazione su una terra non Isola bersaglio che controlla. Quella terra è un'Isola fintanto che ha almeno un segnalino inondazione su di essa.\nAlla fine del turno, se tutte le terre in gioco sono Isole, rimuovi da esse tutti i segnalini inondazione.", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 73798, "name": "水銀の泉", "text": "各プレイヤーのアップキープの開始時に、そのプレイヤーは自分がコントロールする島でない土地１つを対象とし、それの上に洪水カウンターを１個置く。 その土地は、洪水カウンターが置かれているかぎり島である。\nターン終了時に、場に出ているすべての土地が島である場合、それらの上からすべての洪水カウンターを取り除く。", "type": "アーティファクト"}, {"language": "Portuguese (Brazil)", "multiverseId": 162429, "name": "Fonte de Mercúrio", "text": "No início da manutenção de cada jogador, aquele jogador coloca um marcador de inundação no terreno alvo que não seja uma Ilha que ele próprio controla. Aquele terreno é uma Ilha enquanto tiver um marcador de inundação sobre ele.\nNo final do turno, se todos os terrenos em jogo forem Ilhas, remova todos os marcadores de inundação deles.", "type": "Artefato"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "73232", "cardKingdomId": "72232", "cardsphereId": "30861", "mcmId": "233", "mcmMetaId": "4438", "mtgjsonV4Id": "31bdd96f-274e-570f-80e5-e389feffa611", "mtgoFoilId": "20240", "mtgoId": "20239", "multiverseId": "49772", "scryfallId": "b4f2bf63-e3cf-4a58-86b7-f3bab3b90712", "scryfallIllustrationId": "86374562-a810-470a-aad0-7348e991c60e", "scryfallOracleId": "0e7cf14a-6149-4ba9-b3f5-c5faf9f772bc", "tcgplayerProductId": "11543"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Quicksilver Fountain", "number": "233", "originalText": "At the beginning of each player's upkeep, that player puts a flood counter on target non-Island land he or she controls. That land is an Island as long as it has a flood counter on it.\nAt end of turn, if all lands in play are Islands, remove all flood counters from them.", "originalType": "Artifact", "printings": ["MRD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6d7be949ac9f8d8c", "cardKingdomFoil": "https://mtgjson.com/links/1119db51788a002e", "cardmarket": "https://mtgjson.com/links/0cf30457ab182570", "tcgplayer": "https://mtgjson.com/links/8df4c90266584a90"}, "rarity": "rare", "rulings": [{"date": "2004-12-01", "text": "The land stays an Island until the flood counter is removed, even if Quicksilver Fountain leaves the battlefield."}, {"date": "2004-12-01", "text": "The timestamp of the land-type-changing ability is set when the triggered ability resolves (so each one has a different timestamp)."}], "setCode": "MRD", "subtypes": [], "supertypes": [], "text": "At the beginning of each player's upkeep, that player puts a flood counter on target non-Island land they control of their choice. That land is an Island for as long as it has a flood counter on it.\nAt the beginning of each end step, if all lands on the battlefield are Islands, remove all flood counters from them.", "type": "Artifact", "types": ["Artifact"], "uuid": "f6c1643d-5e74-5cf0-a404-4d1545052be1"}