{"artist": "Alexander Mokhov", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 6.0, "edhrecRank": 3589, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 531554, "name": "Strahlender Solar", "text": "Fliegend, Lebensverknüpfung\nImmer wenn der Strahlende Solar oder eine andere Nichtspielsteinkreatur unter deiner Kontrolle ins Spiel kommt, wage dich ins Gewölbe.\n{W}, wirf den Strahlenden Solar ab: Wage dich ins Gewölbe. Du erhältst 3 Lebenspunkte dazu.", "type": "Kreatur — Engel"}, {"language": "Spanish", "multiverseId": 531610, "name": "Solar radiante", "text": "Vuela, vínculo vital.\nSiempre que el Solar radiante u otra criatura que no sea ficha entre al campo de batalla bajo tu control, adéntrate en la mazmorra.\n{W}, descartar el Solar radiante: Adéntrate en la mazmorra y ganas 3 vidas.", "type": "Criatura — Ángel"}, {"language": "French", "multiverseId": 531666, "name": "Solar radieux", "text": "Vol, lien de vie\nÀ chaque fois que le Solar radieux ou une autre créature non-jeton arrive sur le champ de bataille sous votre contrôle, aventurez-vous dans le donjon.\n{W}, défaussez-vous du Solar radieux : Aventurez-vous dans le donjon et vous gagnez 3 points de vie.", "type": "Créature : ange"}, {"language": "Italian", "multiverseId": 531722, "name": "Solar Radioso", "text": "Volare, legame vitale\nOgniqualvolta il Solar Radioso o un'altra creatura non pedina entrano nel campo di battaglia sotto il tuo controllo, esplora il dungeon.\n{W}, Scarta il Solar Radioso: Esplora il dungeon e guadagni 3 punti vita.", "type": "Creatura — Angelo"}, {"language": "Japanese", "multiverseId": 531778, "name": "光輝のソーラー", "text": "飛行、絆魂\n光輝のソーラーか、トークンでもこれでもないクリーチャー１体があなたのコントロール下で戦場に出るたび、ダンジョン探索をする。\n{W}, 光輝のソーラーを捨てる：ダンジョン探索をして、あなたは３点のライフを得る。", "type": "クリーチャー — 天使"}], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "249332", "cardsphereId": "80223", "mcmId": "572631", "mtgjsonV4Id": "908fcbbe-a9bb-5d52-a50a-3802e32e6f0e", "multiverseId": "531498", "scryfallId": "18e448db-e60f-407c-95df-33d7ae12532f", "scryfallIllustrationId": "d6ca4473-edd9-4a67-915e-e99a1364052d", "scryfallOracleId": "21a86dcd-03e3-409b-b214-5feed07db584", "tcgplayerProductId": "244212"}, "keywords": ["Flying", "Lifelink", "Venture into the dungeon"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{5}{W}", "manaValue": 6.0, "name": "Radiant Solar", "number": "278", "originalText": "Flying, lifelink\nWhenever Radiant Solar or another nontoken creature enters the battlefield under your control, venture into the dungeon.\n{W}, Discard Radiant Solar: Venture into the dungeon and you gain 3 life.", "originalType": "Creature — Angel", "power": "3", "printings": ["AFC"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/61141605e67bf022", "tcgplayer": "https://mtgjson.com/links/707e4fc768ec0049"}, "rarity": "rare", "rulings": [{"date": "2021-07-23", "text": "A token copy of Radiant Solar entering the battlefield will cause its own ability to trigger, but not that of any other Radiant Solars."}, {"date": "2021-07-23", "text": "To venture into the dungeon, a player moves their venture marker into the next room of the dungeon they are currently in. If they aren't currently in a dungeon, that player instead chooses a dungeon card from outside the game, puts it into the command zone, and moves their venture marker onto the first room."}, {"date": "2021-07-23", "text": "Moving into a dungeon room will cause its room ability to trigger."}, {"date": "2021-07-23", "text": "Once you resolve the last room ability of a dungeon, that dungeon is now completed and is removed from the game."}, {"date": "2021-07-23", "text": "A player may only have one dungeon in the command zone at a time."}, {"date": "2021-07-23", "text": "The player venturing into the dungeon chooses which dungeon they will venture into. They may choose a dungeon that they have already completed this game."}, {"date": "2021-07-23", "text": "Dungeon cards are not part of a player's deck or sideboard. In both constructed and limited formats, players can use any dungeon card when they venture into the dungeon."}, {"date": "2021-07-23", "text": "You can only move forward (well, downward) in a dungeon, never backwards or sideways."}, {"date": "2021-07-23", "text": "Dungeons are removed from the game as a state-based action."}, {"date": "2021-07-23", "text": "If you somehow venture into the dungeon while a room's ability is on the stack, you will continue on in the dungeon. If you're already in the last room, complete that dungeon and start a new one."}, {"date": "2021-07-23", "text": "Choosing the dungeon or room to venture into is part of resolving the venture into the dungeon keyword action. Once that choice is made, players may not respond until after the appropriate room ability has triggered."}], "securityStamp": "oval", "setCode": "AFC", "subtypes": ["Angel"], "supertypes": [], "text": "Flying, lifelink\nWhenever Radiant Solar or another nontoken creature enters the battlefield under your control, venture into the dungeon. (Enter the first room or advance to the next room.)\n{W}, Discard Radiant Solar: Venture into the dungeon and you gain 3 life.", "toughness": "6", "type": "Creature — Angel", "types": ["Creature"], "uuid": "493163ab-d0b8-5d16-ab1d-e56efb49dd8f", "variations": ["4b64f4bb-21d6-5ec8-ac5c-a4aa0ca6f553"]}