{"artist": "Greg Opalinski", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B", "U"], "colors": ["U"], "convertedManaCost": 11.0, "edhrecRank": 7625, "faceConvertedManaCost": 7.0, "faceManaValue": 7.0, "faceName": "Riches", "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardsphereId": "49512", "mcmId": "297663", "mtgjsonV4Id": "9a785254-f31b-5a0b-830c-8ffc3ec81758", "scryfallId": "ccb6c790-c010-4ade-b2fb-0365bc681efd", "scryfallIllustrationId": "977466a9-4626-481d-8a93-01820deaeeba", "scryfallOracleId": "c2c66419-c2ca-4259-afc6-eaec6d3bb897", "tcgplayerProductId": "130667"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Aftermath"], "language": "English", "layout": "aftermath", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{5}{U}{U}", "manaValue": 11.0, "name": "Rags // Riches", "number": "222s", "otherFaceIds": ["0fe7dfba-f53e-5143-bf15-8981e2f8794c"], "printings": ["AKH", "AKR", "PAKH"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"tcgplayer": "https://mtgjson.com/links/20a9aa7c9c3d48fd"}, "rarity": "rare", "rulings": [{"date": "2017-04-18", "text": "Split cards with aftermath have a new frame treatment—the half you can cast from your hand is oriented the same as other cards you’d cast from your hand, while the half you can cast from your graveyard is a traditional split card half. This frame treatment is for your convenience and has no rules significance."}, {"date": "2017-04-18", "text": "All split cards have two card faces on a single card, and you put a split card onto the stack with only the half you’re casting. The characteristics of the half of the card you didn’t cast are ignored while the spell is on the stack. For example, if an effect prevents you from casting green spells, you can cast Destined of Destined // Lead, but not Lead."}, {"date": "2017-04-18", "text": "Each split card is a single card. For example, if you discard one, you’ve discarded one card, not two. If an effect counts the number of instant and sorcery cards in your graveyard, Destined // Lead counts once, not twice."}, {"date": "2017-04-18", "text": "Each split card has two names. If an effect instructs you to choose a card name, you may choose one, but not both."}, {"date": "2017-04-18", "text": "While not on the stack, the characteristics of a split card are the combination of its two halves. For example, Destined // Lead is a green and black card, it is both an instant card and a sorcery card, and its converted mana cost is 6. This means that if an effect allows you to cast a card with converted mana cost 2 from your hand, you can’t cast Destined. This is a change from the previous rules for split cards."}, {"date": "2017-04-18", "text": "If you cast the first half of a split card with aftermath during your turn, you’ll have priority immediately after it resolves. You can cast the half with aftermath from your graveyard before any player can take any other action if it’s legal for you to do so."}, {"date": "2017-04-18", "text": "If another effect allows you to cast a split card with aftermath from any zone other than a graveyard, you can’t cast the half with aftermath."}, {"date": "2017-04-18", "text": "Rags affects only creatures on the battlefield at the time it resolves. It won’t affect creatures that enter the battlefield or noncreature permanents that become creatures later in the turn."}, {"date": "2017-04-18", "text": "A spell with aftermath cast from a graveyard will always be exiled afterward, whether it resolves, it’s countered, or it leaves the stack in some other way."}, {"date": "2017-04-18", "text": "Riches’s effect doesn’t target. Creatures with hexproof may be lured away this way."}, {"date": "2017-04-18", "text": "Riches’s effect lasts indefinitely. It doesn’t wear off during the cleanup step."}, {"date": "2017-04-18", "text": "Once Riches begins to resolve, no player may take other actions until it’s done. Notably, opponents can’t try to remove a creature after choosing it but before you gain control of it."}, {"date": "2017-04-18", "text": "In a multiplayer game, each opponent in turn order chooses a creature they control, if they control any creatures. After each opponent has done so, you gain control of each chosen creature simultaneously."}, {"date": "2017-04-18", "text": "In a multiplayer game, if a player leaves the game, all cards that player owns leave as well, and any effects that give the player control of permanents immediately end."}, {"date": "2017-04-18", "text": "If another effect allows you to cast a split card with aftermath from a graveyard, you may cast either half. If you cast the half that has aftermath, you’ll exile the card if it would leave the stack."}, {"date": "2017-07-14", "text": "Once you’ve started to cast a spell with aftermath from your graveyard, the card is immediately moved to the stack. Opponents can’t try to stop the ability by exiling the card with an effect such as that of Crook of Condemnation."}], "securityStamp": "oval", "setCode": "PAKH", "side": "b", "subtypes": [], "supertypes": [], "text": "Aftermath (Cast this spell only from your graveyard. Then exile it.)\nEach opponent chooses a creature they control. You gain control of those creatures.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "c9a5f51e-35db-5e99-af4d-f7752109049c"}