{"artist": "Suzanne Helmigh", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 2.0, "edhrecRank": 3469, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "248845", "cardsphereId": "80357", "mcmId": "572491", "mtgjsonV4Id": "73959529-befc-583e-b0fa-f17ea26dff86", "scryfallId": "a07b06a6-b7ef-45da-beb3-5479dc7fdb0a", "scryfallIllustrationId": "6c76a54e-223b-4fdf-9010-1bbf2765fa1b", "scryfallOracleId": "d1586808-efc2-469a-8384-ba4acf231e69", "tcgplayerProductId": "244555"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "class", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}", "manaValue": 2.0, "name": "Ranger Class", "number": "202s", "printings": ["AFR", "PAFR"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/1fd25ebc6c3c76db", "tcgplayer": "https://mtgjson.com/links/5dc968e57dbf6e5a"}, "rarity": "rare", "rulings": [{"date": "2021-07-23", "text": "The triggered ability Ranger Class gets at level 2 can trigger only once per combat, no matter how many creatures you attack with."}, {"date": "2021-07-23", "text": "If Ranger Class is level 3, you can look at the top card of your library whenever you want (with one restriction; see below), even if you don't have priority. This action doesn't use the stack. Knowing what that card is becomes part of the information you have access to, just like you can look at the cards in your hand."}, {"date": "2021-07-23", "text": "If the top card of your library changes while you're casting a spell, playing a land, or activating an ability, you can't look at the new top card until you finish doing so. This means that if you cast a spell from the top of your library, you can't look at the next one until you're done paying for that spell."}, {"date": "2021-07-23", "text": "Ranger Class doesn't change when you can cast creature spells. Normally, this means during your main phase when the stack is empty, although flash may change this."}, {"date": "2021-07-23", "text": "You'll still pay all costs for the spell, including additional costs. You may also pay alternative costs if any are available."}, {"date": "2021-07-23", "text": "Each Class has five abilities. The three in the major sections of its text box are class abilities. Class abilities can be static, activated, or triggered abilities. The other two are level abilities, one activated ability to advance the Class to level 2 and another to advance the Class to level 3."}, {"date": "2021-07-23", "text": "Each Class starts with only the first of three class abilities. As the first level ability resolves, the Class becomes level 2 and gains the second class ability. As the second level ability resolves, the Class becomes level 3 and gains the third class ability."}, {"date": "2021-07-23", "text": "Gaining a level won't remove abilities that a Class had at a previous level."}, {"date": "2021-07-23", "text": "Gaining a level is a normal activated ability. It uses the stack and can be responded to."}, {"date": "2021-07-23", "text": "You can't activate the first level ability of a Class unless that Class is level 1. Similarly, you can't activate the second level ability of a Class unless that Class is level 2."}, {"date": "2021-07-23", "text": "You can multiclass or even control multiple Class enchantments of the same class. Each Class permanent tracks its own level separately."}, {"date": "2021-07-23", "text": "Some Class cards have an effect that increases when more are under your control. For example, if you have multiple Barbarian Class cards, you roll that many additional dice and ignore that many of the lowest rolls."}], "securityStamp": "oval", "setCode": "PAFR", "subtypes": ["Class"], "supertypes": [], "text": "(Gain the next level as a sorcery to add its ability.)\nWhen Ranger Class enters the battlefield, create a 2/2 green Wolf creature token.\n{1}{G}: Level 2\nWhenever you attack, put a +1/+1 counter on target attacking creature.\n{3}{G}: Level 3\nYou may look at the top card of your library any time.\nYou may cast creature spells from the top of your library.", "type": "Enchantment — Class", "types": ["Enchantment"], "uuid": "7d1a017c-629d-512c-a727-4d2ba2e81113", "variations": ["238c1388-3d37-5c07-919b-652a4b7145a4", "5a171121-d2f3-510c-a728-e85a6d4f96b3"]}