{"artist": "Min Yum", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G", "R", "U"], "colors": ["G"], "convertedManaCost": 2.0, "edhrecRank": 3010, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"mtgjsonV4Id": "70f85f2c-32ab-5cb0-ad1e-46e38991f9d8", "mtgoId": "54557", "scryfallId": "c2b2fe45-f2ee-457d-8bf5-2d0014993318", "scryfallIllustrationId": "5ba7959a-8c02-45a9-8830-fce2dd9192f9", "scryfallOracleId": "84c9d8b8-8dd9-41fc-a2b6-af1ffb9090f9"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Morph"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}", "manaValue": 2.0, "name": "Rattleclaw Mystic", "number": "54557", "originalReleaseDate": "2015-03-30", "power": "2", "printings": ["KTK", "PKTK", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2014-09-20", "text": "At any time, you can look at a face-down spell or permanent you control. You can’t look at face-down spells or permanents you don’t control unless an effect instructs you to do so."}, {"date": "2014-09-20", "text": "Although turning a face-down creature with morph face up doesn’t use the stack, Rattleclaw Mystic’s triggered ability does use the stack, and players can respond to that ability. Notably, you can’t turn Rattleclaw Mystic face up while casting a spell or activating an ability. You’ll need to turn Rattleclaw Mystic face up and have its triggered ability resolve before you can spend that mana."}, {"date": "2014-09-20", "text": "Morph lets you cast a card face down by paying {3}, and lets you turn the face-down permanent face up any time you have priority by paying its morph cost."}, {"date": "2014-09-20", "text": "The face-down spell has no mana cost and has a converted mana cost of 0. When you cast a face-down spell, put it on the stack face down so no other player knows what it is, and pay {3}. This is an alternative cost."}, {"date": "2014-09-20", "text": "When the spell resolves, it enters the battlefield as a 2/2 creature with no name, mana cost, creature types, or abilities. It’s colorless and has a converted mana cost of 0. Other effects that apply to the creature can still grant it any of these characteristics."}, {"date": "2014-09-20", "text": "Any time you have priority, you may turn the face-down creature face up by revealing what its morph cost is and paying that cost. This is a special action. It doesn’t use the stack and can’t be responded to. Only a face-down permanent can be turned face up this way; a face-down spell cannot."}, {"date": "2014-09-20", "text": "Because the permanent is on the battlefield both before and after it’s turned face up, turning a permanent face up doesn’t cause any enters-the-battlefield abilities to trigger."}, {"date": "2014-09-20", "text": "A permanent that turns face up or face down changes characteristics but is otherwise the same permanent. Spells and abilities that were targeting that permanent, as well as Auras and Equipment that were attached to the permanent, aren’t affected."}, {"date": "2014-09-20", "text": "You must ensure that your face-down spells and permanents can easily be differentiated from each other. You’re not allowed to mix up the cards that represent them on the battlefield in order to confuse other players. The order they entered the battlefield should remain clear. Common methods for doing this include using markers or dice, or simply placing them in order on the battlefield."}, {"date": "2014-09-20", "text": "If a face-down permanent leaves the battlefield, you must reveal it. You must also reveal all face-down spells and permanents you control if you leave the game or if the game ends."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Human", "Shaman"], "supertypes": [], "text": "{T}: Add {G}, {U}, or {R}.\nMorph {2} (You may cast this card face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.)\nWhen Rattleclaw Mystic is turned face up, add {G}{U}{R}.", "toughness": "1", "type": "Creature — Human Shaman", "types": ["Creature"], "uuid": "2ec33121-a88c-5f14-8757-8a227ee2199e", "watermark": "temur"}