{"artist": "Omar Rayyan", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210273", "mcmId": "294461", "mtgjsonV4Id": "71c34f85-2203-5390-980b-594f77c4e19f", "multiverseId": "423647", "scryfallId": "de770524-9afc-4971-842a-6ee0b81176fb", "scryfallIllustrationId": "01a7ef60-261a-4813-a9ca-b246e4a9d298", "scryfallOracleId": "b53e06af-be18-4f75-9dd0-7494ec867b13", "tcgplayerProductId": "125622"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Raven's Run", "number": "66", "originalText": "All creatures have wither. (They deal damage to creatures in the form of -1/-1 counters.)\nWhenever you roll {Chaos}, put a -1/-1 counter on target creature, two -1/-1 counters on another target creature, and three -1/-1 counters on a third target creature.", "originalType": "Plane — Shadowmoor", "printings": ["OHOP", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7a2b1357b7174854", "tcgplayer": "https://mtgjson.com/links/df9e482a297cc48b"}, "rarity": "common", "rulings": [{"date": "2009-10-01", "text": "A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"}, {"date": "2009-10-01", "text": "A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."}, {"date": "2009-10-01", "text": "The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."}, {"date": "2009-10-01", "text": "If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}, {"date": "2009-10-01", "text": "Wither applies to any damage, not just combat damage."}, {"date": "2009-10-01", "text": "The -1/-1 counters that result from wither remain on the damaged creature indefinitely. They won’t be removed if the creature regenerates or the turn ends."}, {"date": "2009-10-01", "text": "Since damage from a creature with wither is real damage, it follows all the other rules for damage. It can be prevented or redirected. When it’s dealt, it will cause “Whenever [this creature] deals damage” and “Whenever [this creature] is dealt damage” abilities to trigger."}, {"date": "2009-10-01", "text": "If the source of the damage is still on the battlefield at the time that damage is dealt, its characteristics are checked to see if it has wither. If the source has left the battlefield by then, its last existence on the battlefield is checked to see if it had wither."}, {"date": "2009-10-01", "text": "Damage from creatures with wither affects players and planeswalkers normally."}, {"date": "2009-10-01", "text": "Multiple instances of wither are redundant."}, {"date": "2009-10-01", "text": "You must target three different creatures when the chaos ability triggers, even if that means you have to target creatures you control. If you can’t target three creatures (because there are just two creatures on the battlefield, perhaps), the ability is removed from the stack and does nothing."}], "setCode": "OPCA", "subtypes": ["Shadowmoor"], "supertypes": [], "text": "All creatures have wither. (They deal damage to creatures in the form of -1/-1 counters.)\nWhenever you roll {CHAOS}, put a -1/-1 counter on target creature, two -1/-1 counters on another target creature, and three -1/-1 counters on a third target creature.", "type": "Plane — Shadowmoor", "types": ["Plane"], "uuid": "2f0eb4c7-7994-5f54-ab28-4f16746ab580"}