{"artist": "Kieran Yanner", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["B", "G", "U"], "colors": ["B", "G", "U"], "convertedManaCost": 4.0, "edhrecRank": 12378, "finishes": ["foil"], "foreignData": [{"language": "German", "multiverseId": 470896, "name": "Rayami, der erste Vampir", "text": "Falls eine Nichtspielsteinkreatur sterben würde, schicke sie stattdessen mit einer Blutmarke ins Exil.\nSolange sich eine Kreaturenkarte mit einer Blutmarke im Exil befindet, die Flugfähigkeit hat, hat Rayami, der erste Vampir, Flugfähigkeit. Das Gleiche gilt für Erstschlag, Doppelschlag, Todesberührung, Eile, Fluchsicherheit, Unzerstörbarkeit, Lebensverknüpfung, Bedrohlichkeit, Schutz, Reichweite, Wachsamkeit sowie das Verursachen von Trampelschaden.", "type": "Legendäre Kreatur — Vampir"}, {"language": "Spanish", "multiverseId": 471198, "name": "Rayami, el Primero de los Caídos", "text": "Si una criatura que no sea ficha fuera a morir, en vez de eso, exilia esa carta con un contador de sangre sobre ella.\nMientras una carta de criatura exiliada con un contador de sangre sobre ella tenga la habilidad de volar, Rayami, el Primero de los Caídos tiene la habilidad de volar. Lo mismo sucede con las habilidades de dañar primero, dañar dos veces, toque mortal, prisa, antimaleficio, indestructible, vínculo vital, amenaza, protección, alcance, arrollar y vigilancia.", "type": "Criatura legendaria — Vampiro"}, {"language": "French", "multiverseId": 471500, "name": "Rayami, première à tomber", "text": "Si une créature non-jeton devait mourir, exilez celle-ci avec un marqueur « sang » sur elle à la place.\nTant qu'une carte de créature exilée avec un marqueur « sang » sur elle a le vol, Rayami, première à tomber a le vol. C'est vrai aussi pour l'initiative, la double initiative, le contact mortel, la célérité, la défense talismanique, l'indestructible, le lien de vie, la menace, la protection, la portée, le piétinement et la vigilance.", "type": "Créature légendaire : vampire"}, {"language": "Italian", "multiverseId": 471802, "name": "Rayami, Primo dei Caduti", "text": "Se una creatura non pedina sta per morire, esilia invece quella carta con un segnalino sangue.\nFintanto che una carta creatura esiliata con un segnalino sangue ha volare, Rayami, Primo dei Caduti ha volare. Lo stesso vale per attacco improvviso, doppio attacco, anti-malocchio, cautela, indistruttibile, legame vitale, minacciare, protezione, raggiungere, rapidità, travolgere e tocco letale.", "type": "Creatura Leggendaria — Vampiro"}, {"language": "Japanese", "multiverseId": 472104, "name": "最初に堕ちし者、ラヤミ", "text": "トークンでないクリーチャーが死亡するなら、代わりにそのカードを血液カウンターを１個置いた状態で追放する。\n追放されていて血液カウンターが置かれているクリーチャー・カードが飛行を持っているかぎり、最初に堕ちし者、ラヤミは飛行を持つ。先制攻撃、二段攻撃、接死、速攻、呪禁、破壊不能、絆魂、威迫、プロテクション、到達、トランプル、警戒についても同様である。", "type": "伝説のクリーチャー — 吸血鬼"}, {"language": "Portuguese (Brazil)", "multiverseId": 472406, "name": "Rayami, Primeiro dos Caídos", "text": "Se uma criatura que não seja ficha morreria, em vez disso, exile aquele card com um marcador de sangue.\nEnquanto um card de criatura exilado com um marcador de sangue tiver voar, Rayami, Primeiro dos Caídos, terá voar. O mesmo vale para iniciativa, golpe duplo, toque mortífero, ímpeto, resistência a magia, indestrutível, vínculo com a vida, ameaçar, proteção, alcance, atropelar e vigilância.", "type": "Criatura Lendária — Vampiro"}, {"language": "Russian", "multiverseId": 472708, "name": "Райами, Первый из Падших", "text": "Если не являющееся фишкой существо должно умереть, вместо этого изгоните ту карту с одним жетоном крови на ней.\nПока у изгнанной карты существа с жетоном крови на ней есть Полет, у Райами, Первого из Падших есть Полет. То же самое относится к Бдительности, Двойному удару, Захвату, Защите, Неразрушимости, Первому удару, Порчеустойчивости, Пробивному удару, Смертельному касанию, Угрозе, Ускорению и Цепи жизни.", "type": "Легендарное Существо — Вампир"}], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "226950", "cardsphereId": "61308", "mcmId": "391242", "mcmMetaId": "278482", "mtgjsonV4Id": "f6e515e5-d311-537c-82c0-bc9ef410b4f4", "mtgoId": "77150", "multiverseId": "470594", "scryfallId": "6997ad62-f34c-4490-aee4-6d5c08e14709", "scryfallIllustrationId": "e56fb6fd-91d6-4607-8766-fae5492d710d", "scryfallOracleId": "f196ae91-be5c-461b-a69f-aecb538923b4", "tcgplayerProductId": "196449"}, "isStarter": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{1}{B}{G}{U}", "manaValue": 4.0, "name": "Rayami, First of the Fallen", "number": "48", "originalText": "If a nontoken creature would die, exile that card with a blood counter on it instead.\nAs long as an exiled creature card with a blood counter on it has flying, Rayami, First of the Fallen has flying. The same is true for first strike, double strike, deathtouch, haste, hexproof, indestructible, lifelink, menace, protection, reach, trample, and vigilance.", "originalType": "Legendary Creature — Vampire", "power": "5", "printings": ["C19"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/f9ff8f89f923feee", "cardmarket": "https://mtgjson.com/links/e609ced498127196", "tcgplayer": "https://mtgjson.com/links/19f684e07cde0162"}, "rarity": "mythic", "rulings": [{"date": "2019-08-23", "text": "Rayami looks at all exiled creature cards with blood counters, not only those exiled with its ability. It even looks at those exiled by an ability of another player’s Rayami, First of the Fallen."}, {"date": "2019-08-23", "text": "If a nontoken creature that isn’t normally a creature (such as a Vehicle) would die, Rayami exiles it with a blood counter on it, although Rayami won’t gain any of its abilities."}, {"date": "2019-08-23", "text": "If an exiled creature card has one or more variants of the listed keywords (for example, protection from black or hexproof from white), Rayami gains those specific variants."}, {"date": "2019-08-23", "text": "If an exiled creature card has one of the listed keywords only if certain conditions are met, the ability granting that keyword doesn’t apply while the card is in exile. Rayami won’t gain that ability from that card."}, {"date": "2019-08-23", "text": "Nontoken creatures that would die at the same time that Rayami leaves the battlefield are exiled with blood counters."}, {"date": "2019-08-23", "text": "If multiple replacement effects try to change where a dying creature would go, the controller of the creature chooses one to apply. If Rayami’s effect doesn’t exile the creature, it won’t have a blood counter on it, even if another effect exiles it. Keep in mind that the effect that allows a player to spare their commander from death is a replacement effect."}], "securityStamp": "oval", "setCode": "C19", "subtypes": ["Vampire"], "supertypes": ["Legendary"], "text": "If a nontoken creature would die, exile that card with a blood counter on it instead.\nAs long as an exiled creature card with a blood counter on it has flying, Rayami, First of the Fallen has flying. The same is true for first strike, double strike, deathtouch, haste, hexproof, indestructible, lifelink, menace, protection, reach, trample, and vigilance.", "toughness": "4", "type": "Legendary Creature — Vampire", "types": ["Creature"], "uuid": "9b8558b7-0e3e-51c2-8724-64b472ddda72"}