{"artist": "Igor Kieryluk", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 3.0, "edhrecRank": 537, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "e91bb963-ce7f-5e39-b326-b7db984fd547", "mtgoId": "88336", "scryfallId": "e9d241c8-fe87-4103-94a0-4be9f29d5984", "scryfallIllustrationId": "d68fcb44-2876-43e1-901b-60f7f16770db", "scryfallOracleId": "b81eaa2f-0554-41c6-bdf6-d1cb73b8f56f"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Changeling"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}", "manaValue": 3.0, "name": "Realmwalker", "number": "88336", "originalReleaseDate": "2021-02-28", "power": "2", "printings": ["KHM", "PKHM", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "You must choose an existing creature type, such as Elk or Advisor. You can’t choose card types (e.g., artifact) or supertypes (e.g., snow)."}, {"date": "2021-02-05", "text": "If Realmwalker is somehow on the battlefield with no choice having been made for it, you may still look at the top card of your library any time. You won’t be able to cast any creature spells from the top of your library, even if they have no creature types."}, {"date": "2021-02-05", "text": "You can look at the top card of your library whenever you want (with one restriction; see below), even if you don’t have priority. This action doesn’t use the stack. Knowing what that card is becomes part of the information you have access to, just like you can look at the cards in your hand."}, {"date": "2021-02-05", "text": "If the top card of your library changes while you’re casting a spell, playing a land, or activating an ability, you can’t look at the new top card until you finish doing so. This means that if you cast a spell from the top of your library, you can’t look at the next one until you’re done paying for that spell."}, {"date": "2021-02-05", "text": "Realmwalker doesn’t change when you can cast creature spells. Normally, this means during your main phase when the stack is empty, although flash may change this."}, {"date": "2021-02-05", "text": "You’ll still pay all costs for the spell, including additional costs. You may also pay alternative costs if any are available."}, {"date": "2021-02-05", "text": "The top card of your library isn’t in your hand, so you can’t foretell it, discard it, or activate any of its activated abilities."}, {"date": "2021-02-05", "text": "Changeling is a characteristic-defining ability. It functions in all zones, not only while a card that has it is on the battlefield."}, {"date": "2021-02-05", "text": "The subtype Shapeshifter that appears on the type line is mostly there to reinforce the flavor. A creature card with changeling is just as much an Elf, a Dwarf, a Sliver, a Goat, a Coward, and a Zombie as it is a Shapeshifter."}, {"date": "2021-02-05", "text": "If an effect causes a creature with changeling to become a new creature type, it will be only that new creature type. It will still have changeling; the effect making it all creature types will simply be overwritten."}, {"date": "2021-02-05", "text": "If an effect causes a creature with changeling to lose all abilities, it will remain all creature types, even though it will no longer have changeling. This is because changeling applies before the effect that removes it."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Shapeshifter"], "supertypes": [], "text": "Changeling (This card is every creature type.)\nAs Realmwalker enters the battlefield, choose a creature type.\nYou may look at the top card of your library any time.\nYou may cast creature spells of the chosen type from the top of your library.", "toughness": "3", "type": "Creature — Shapeshifter", "types": ["Creature"], "uuid": "044164f0-aa2d-54c8-81af-cf31d83e5bef", "variations": ["3ff72040-4c99-5c8c-9941-df37261a32ca"]}