{"artist": "Simon Dominic", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 5297, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "58b3e6fd-6479-5348-b908-c8e8b36418db", "mtgoId": "70723", "scryfallId": "36d42d68-58f5-4618-9c83-e1eedc09437a", "scryfallIllustrationId": "783a547d-7788-40d9-8c32-e6b8ebac6267", "scryfallOracleId": "afad2e76-4b53-4884-8f96-ba68b0808990"}, "isOnlineOnly": true, "isReprint": true, "keywords": ["Retrace"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}{R}", "manaValue": 4.0, "name": "Reality Scramble", "number": "70723", "originalReleaseDate": "2018-12-06", "printings": ["C18", "MB1", "PZ2"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2018-07-13", "text": "The target permanent’s last known existence on the battlefield is checked to determine its types."}, {"date": "2018-07-13", "text": "Reality Scramble can target any permanent you own, including those another player controls. A token’s owner is the player who created it."}, {"date": "2018-07-13", "text": "You’ll stop as soon as you reveal a card that shares any card types with the target permanent. For example, if the target permanent is an artifact creature, you’ll stop as soon as you reveal a card that’s an artifact or a creature."}, {"date": "2018-07-13", "text": "In most cases, at least one card in your library (the card you put on the bottom of your library) will share a card type with the target permanent. However, in some unusual situations, no cards in your library share a card type with the permanent (perhaps because the permanent was a token or its types were changed). In that case, you’ll reveal your entire library, put nothing onto the battlefield, and put the cards back in a random order."}, {"date": "2018-07-13", "text": "Casting a card by using its retrace ability works just like casting any other spell, with two exceptions: You’re casting it from your graveyard rather than your hand, and you must discard a land card in addition to any other costs."}, {"date": "2018-07-13", "text": "Casting a card with retrace from your graveyard follows the normal timing rules for its card type."}, {"date": "2018-07-13", "text": "When a retrace card you cast from your graveyard resolves or is countered, it’s put back into your graveyard. You may use the retrace ability to cast it again. If it’s your turn, you may do so before any other player may take actions to try to remove it from your graveyard."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": [], "supertypes": [], "text": "Put target permanent you own on the bottom of your library. Reveal cards from the top of your library until you reveal a card that shares a card type with that permanent. Put that card onto the battlefield and the rest on the bottom of your library in a random order.\nRetrace (You may cast this card from your graveyard by discarding a land card in addition to paying its other costs.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "c9f0d062-f85f-5f07-befc-cd908c7ea66d"}