{"artist": "Steven Belledin", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "U"], "colors": ["B", "U"], "convertedManaCost": 4.0, "edhrecRank": 22216, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 369393, "name": "Intellekt ernten", "text": "Ein Gegner deiner Wahl zeigt die Karten auf seiner Hand offen vor. Du bestimmst davon bis zu X Karten, die keine Länder sind, und schickst sie ins Exil. Durchsuche für jede auf diese Weise ins Exil geschickte Karte den Friedhof, die Hand und die Bibliothek dieses Spielers nach einer beliebigen Anzahl von Karten mit demselben Namen wie diese Karte und schicke sie alle ins Exil. Dieser Spieler mischt dann seine Bibliothek.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 370284, "name": "Cosechar el intelecto", "text": "El oponente objetivo muestra su mano. Tú eliges de ahí hasta X cartas que no sean de tierra y las exilias. Por cada carta exiliada de esta manera, busca en el cementerio, mano y biblioteca de ese jugador cualquier cantidad de cartas con el mismo nombre que esa carta y exílialas. Luego ese jugador baraja su biblioteca.", "type": "Conjuro"}, {"language": "French", "multiverseId": 369252, "name": "Fenaison d'intelligence", "text": "L'adversaire ciblé révèle sa main. Vous y choisissez jusqu'à X cartes non-terrain et vous les exilez. Pour chaque carte exilée de cette manière, cherchez dans le cimetière, la main et la bibliothèque de ce joueur n'importe quel nombre de cartes ayant le même nom que cette carte et exilez-les. Ce joueur mélange ensuite sa bibliothèque.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 369529, "name": "Mietere Intelletto", "text": "Un avversario bersaglio rivela la sua mano. Scegli fino a X carte non terra da essa ed esiliale. Per ogni carta esiliata in questo modo, passa in rassegna il cimitero, la mano e il grimorio di quel giocatore per un qualsiasi numero di carte con lo stesso nome di quella carta ed esiliale. Poi quel giocatore rimescola il suo grimorio.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 369621, "name": "知力の刈り取り", "text": "対戦相手１人を対象とする。そのプレイヤーは自分の手札を公開する。あなたはその中から土地でないカードをＸ枚選び、それらのカードを追放する。これにより追放されたカード１枚につき、そのプレイヤーの墓地と手札とライブラリーから、そのカードと同じ名前を持つカードを望む枚数探し、それらを追放する。その後、そのプレイヤーは自分のライブラリーを切り直す。", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 369849, "name": "지능 수확", "text": "상대 한 명을 목표로 정한다. 그 플레이어는 자신의 손을 공개한다. 당신은 그중에서 대지가 아닌 카드를 최대 X장까지 골라 추방한다. 이렇게 추방된 카드 한 장 마다 그 플레이어의 무덤, 손 및 서고를 뒤져 그 카드와 이름이 같은 카드를 원하는 만큼 찾아 추방한다. 그러고 나서 그 플레이어는 자신의 서고를 섞는다.", "type": "집중마법"}, {"language": "Russian", "multiverseId": 370075, "name": "Стяжание Интеллекта", "text": "Целевой оппонент показывает свою руку. Вы выбираете из нее не более Х карт, не являющихся землями, и изгоняете их. Для каждой карты, изгнанной таким образом, найдите на кладбище, в руке и в библиотеке того игрока любое количество карт с таким же именем, как у нее, и изгоните их. Затем тот игрок тасует свою библиотеку.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 368670, "name": "剥夺智识", "text": "目标对手展示其手牌。你选择其中至多X张非地牌，并将它们放逐。从该牌手的坟墓场、手牌以及牌库中搜寻任意数量与以此法放逐的任一张牌同名的牌，并将它们放逐。然后该牌手将其牌库洗牌。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 368870, "name": "剝奪智識", "text": "目標對手展示其手牌。你選擇其中至多X張非地牌，並將它們放逐。從該玩家的墳墓場、手牌以及牌庫中搜尋任意數量與以此法放逐的任一張牌同名的牌，並將它們放逐。然後該玩家將其牌庫洗牌。", "type": "巫術"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "189906", "cardKingdomId": "189706", "cardsphereId": "13448", "mcmId": "261553", "mcmMetaId": "207970", "mtgjsonV4Id": "bcbddee9-1185-5d4d-92b4-f49d43301c82", "mtgoFoilId": "48213", "mtgoId": "48212", "multiverseId": "368958", "scryfallId": "c6297df2-c67a-4054-9617-5c6202c76de8", "scryfallIllustrationId": "e5ff41dd-8bd6-480e-9354-593c685ae356", "scryfallOracleId": "aa97eb3d-8b8d-418b-8615-839812d60fe0", "tcgplayerProductId": "68014"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{X}{2}{U}{B}", "manaValue": 4.0, "name": "Reap Intellect", "number": "95", "originalText": "Target opponent reveals his or her hand. You choose up to X nonland cards from it and exile them. For each card exiled this way, search that player's graveyard, hand, and library for any number of cards with the same name as that card and exile them. Then that player shuffles his or her library.", "originalType": "Sorcery", "printings": ["DGM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d93dd5adeda85f33", "cardKingdomFoil": "https://mtgjson.com/links/3638e44c066270ed", "cardmarket": "https://mtgjson.com/links/585c64019a7f2c21", "tcgplayer": "https://mtgjson.com/links/0d606bf41f7f6cda"}, "rarity": "mythic", "rulings": [{"date": "2013-04-15", "text": "Once Reap Intellect begins to resolve, no player can cast spells or activate abilities until it has completely resolved. For example, the opponent can’t cast any cards that would be exiled after their hand is revealed."}, {"date": "2013-04-15", "text": "You can choose to leave cards with those names in the zone they are in. You don’t have to exile them."}, {"date": "2013-04-15", "text": "If you don’t exile any cards from the player’s hand, you don’t search that player’s library."}], "setCode": "DGM", "subtypes": [], "supertypes": [], "text": "Target opponent reveals their hand. You choose up to X nonland cards from it and exile them. For each card exiled this way, search that player's graveyard, hand, and library for any number of cards with the same name as that card and exile them. Then that player shuffles.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "8568c0a5-3aec-54fe-a2ad-19c178402a28", "watermark": "dimir"}