{"artist": "Zoltan Boros & Gabor Szikszai", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 22324, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 210576, "name": "Lichtbrechungs-Falle", "text": "Falls ein Gegner in diesem Zug einen roten Spontanzauber oder eine rote Hexerei gewirkt hat, kannst du {W} bezahlen, anstatt die Manakosten der Lichtbrechungs-Falle zu bezahlen.\nVerhindere die nächsten 3 Schadenspunkte, die in diesem Zug dir und/oder bleibenden Karten, die du kontrollierst, von einer Schadensquelle, die du bestimmst, zugefügt würden. Falls auf diese Weise Schaden verhindert wurde, fügt die Lichtbrechungs-Falle einer Kreatur oder einem Spieler deiner Wahl so viele Schadenspunkte zu.", "type": "Spontanzauber — Falle"}, {"language": "Spanish", "multiverseId": 211591, "name": "Trampa de refracción", "text": "Si un oponente lanza un hechizo instantáneo o conjuro rojo este turno, puedes pagar {W} en lugar de pagar el coste de maná de la Trampa de refracción.\nPrevén los siguientes 3 puntos de daño que una fuente de tu elección fuera a hacerte a ti y/o a permanentes que controlas este turno. Si se previene daño de esta manera, la Trampa de refracción hace esa misma cantidad de daño a la criatura o jugador objetivo.", "type": "Instantáneo — Trampa"}, {"language": "French", "multiverseId": 211301, "name": "Piège à réfraction", "text": "Si un adversaire a lancé un sort d'éphémère ou de rituel rouge ce tour-ci, vous pouvez payer {W} à la place du coût de mana du Piège à réfraction.\nPrévenez, ce tour-ci, les prochaines 3 blessures qu'une source de votre choix infligerait à vous et/ou à des permanents que vous contrôlez. Si des blessures sont prévenues de cette manière, le Piège à réfraction inflige autant de blessures à une cible, créature ou joueur.", "type": "Éphémère : piège"}, {"language": "Italian", "multiverseId": 211156, "name": "Trappola di Rifrazione", "text": "Se un avversario ha lanciato una magia istantaneo o stregoneria rossa in questo turno, puoi pagare {W} invece di pagare il costo di mana della Trappola di Rifrazione.\nPrevieni i prossimi 3 danni che una fonte a tua scelta infliggerebbe a te e/o ai permanenti che controlli in questo turno. Se i danni vengono prevenuti in questo modo, la Trappola di Rifrazione infligge altrettanti danni a una creatura o a un giocatore bersaglio.", "type": "Istantaneo — Trappola"}, {"language": "Japanese", "multiverseId": 210721, "name": "屈折の罠", "text": "このターン、いずれかの対戦相手が赤のインスタント呪文か赤のソーサリー呪文を唱えていた場合、あなたは屈折の罠のマナ・コストを支払うのではなく、{W}を支払ってもよい。\nクリーチャー１体かプレイヤー１人を対象とする。このターン、あなたが選んだ発生源１つが次にあなたやあなたがコントロールするいずれかのパーマネントに与えるダメージを３点軽減する。 これによりダメージが軽減された場合、屈折の罠はその点数に等しい点数のダメージを、そのクリーチャーやプレイヤーに与える。", "type": "インスタント — 罠"}, {"language": "Portuguese (Brazil)", "multiverseId": 210866, "name": "Armadilha de Refração", "text": "Se um oponente conjurar uma mágica instantânea ou um feitiço vermelho neste turno, você poderá pagar {W} em vez de pagar o custo de mana de Armadilha de Refração.\nPrevina os próximos 3 pontos de dano que seriam causados por uma fonte de sua escolha a você e/ou a permanentes sob seu controle neste turno Se o dano for prevenido desta maneira, Armadilha de Refração causará uma quantidade equivalente de dano à criatura ou ao jogador alvo.", "type": "Mágica Instantânea — Armadilha"}, {"language": "Russian", "multiverseId": 211446, "name": "Западня Преломления", "text": "Если оппонент разыграл красное мгновенное заклинание или заклинание волшебства в этом ходу, вы можете заплатить {W} вместо уплаты мана-стоимости Западни Преломления.\nПредотвратите следующие 3 повреждения, которые выбранный вами источник должен нанести вам и (или) перманентам под вашим контролем в этом ходу. Если повреждения предотвращаются таким образом, Западня Преломления наносит столько же повреждений целевому существу или игроку.", "type": "Мгновенное заклинание — Ловушка"}, {"language": "Chinese Simplified", "multiverseId": 211011, "name": "折射陷阱", "text": "如果本回合中某对手施放了红色的瞬间或法术咒语，你可以支付{W}，而不支付折射陷阱的法术力费用。\n选择一个来源，防止该来源本回合接下来将对你和／或由你操控之永久物造成的3点伤害。 如果以此法防止伤害，则折射陷阱对目标生物或牌手造成等量的伤害。", "type": "瞬间～陷阱"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "130299", "cardKingdomId": "130152", "cardsphereId": "47524", "mcmId": "22209", "mcmMetaId": "11045", "mtgjsonV4Id": "2e36cedb-5410-57b0-9b4d-91d0f4516af4", "mtgoFoilId": "35768", "mtgoId": "35767", "multiverseId": "189163", "scryfallId": "bcdceb36-fd36-4315-8ebe-9b8fc3777428", "scryfallIllustrationId": "cbb162c6-60a8-4389-80b9-1b8ca1878aa1", "scryfallOracleId": "0fc0554d-da45-49d2-941b-3f6c6458e823", "tcgplayerProductId": "34421"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}", "manaValue": 4.0, "name": "Refraction Trap", "number": "17", "originalText": "If an opponent cast a red instant or sorcery spell this turn, you may pay {W} rather than pay Refraction Trap's mana cost.\nPrevent the next 3 damage that a source of your choice would deal to you and/or permanents you control this turn. If damage is prevented this way, Refraction Trap deals that much damage to target creature or player.", "originalType": "Instant — Trap", "printings": ["WWK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/155b200aba974dc7", "cardKingdomFoil": "https://mtgjson.com/links/3c5f57f2fffb12d5", "cardmarket": "https://mtgjson.com/links/34583571cb44d880", "tcgplayer": "https://mtgjson.com/links/e7c550b82a865af0"}, "rarity": "uncommon", "rulings": [{"date": "2010-03-01", "text": "Refraction Trap’s only target is the permanent or player it may deal damage to. You choose that target as you cast Refraction Trap, not at the time it prevents damage."}, {"date": "2010-03-01", "text": "Refraction Trap doesn’t target the source of the damage it prevents. You choose that source as Refraction Trap resolves. If you cast Refraction Trap for {W}, the source you choose doesn’t have to be the red instant or sorcery spell an opponent cast."}, {"date": "2010-03-01", "text": "If the targeted permanent or player is an illegal target by the time Refraction Trap resolves, the entire spell doesn’t resolve. No damage will be prevented."}, {"date": "2010-03-01", "text": "Refraction Trap can prevent damage that would be dealt to you, one or more creatures you control, and/or one or more planeswalkers you control."}, {"date": "2010-03-01", "text": "If the chosen source would simultaneously deal damage to multiple permanents you control, or would simultaneously deal damage to you and at least one permanent you control, you choose which of that damage to prevent. For example, if the chosen source is Earthquake, you might choose to prevent the next 2 damage it would deal to you and the next 1 damage it would deal to a creature you control. You don’t decide until the point at which the source would deal its damage."}, {"date": "2010-03-01", "text": "Refraction Trap’s effect is not a redirection effect. If it prevents damage, Refraction Trap (not the chosen source) deals damage to the targeted permanent or player as part of that prevention effect. Refraction Trap is the source of the new damage, so the characteristics of the original source (such as its color, or whether it had lifelink or deathtouch) don’t affect this damage. The new damage is not combat damage, even if the prevented damage was."}, {"date": "2010-03-01", "text": "If the chosen source would deal damage, Refraction Trap prevents 3 of that source’s damage and the source deals its excess damage (if any) at the same time. Immediately afterward, as part of that same prevention effect, Refraction Trap deals its damage. This happens before state-based actions are checked, and before the spell or ability that caused damage to be dealt resumes its resolution."}, {"date": "2010-03-01", "text": "Whether the targeted permanent or player is still a legal target is no longer checked after Refraction Trap resolves. For example, if a creature targeted by Refraction Trap gains shroud after Refraction Trap resolves but before it prevents damage, Refraction Trap will still prevent damage and still deal damage to that creature. If Refraction Trap can’t deal damage to the targeted permanent or player (because the creature is no longer on the battlefield, or is no longer a creature, or the player is no longer in the game, for example), it will still prevent damage. It just won’t deal any damage itself."}, {"date": "2010-03-01", "text": "If Refraction Trap doesn’t prevent any damage (perhaps because a different prevention effect is applied to the damage the source would deal, or because the damage is unpreventable), Refraction Trap won’t deal any damage itself."}], "setCode": "WWK", "subtypes": ["Trap"], "supertypes": [], "text": "If an opponent cast a red instant or sorcery spell this turn, you may pay {W} rather than pay this spell's mana cost.\nPrevent the next 3 damage that a source of your choice would deal to you and/or permanents you control this turn. If damage is prevented this way, Refraction Trap deals that much damage to any target.", "type": "Instant — Trap", "types": ["Instant"], "uuid": "c790eafd-cf9f-5f61-8fd5-a0da4cebf935"}