{"artist": "Ron Spencer", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 20597, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 163604, "name": "Die Ameisen loslassen", "text": "Die Ameisen loslassen fügt einer Kreatur oder einem Spieler deiner Wahl 1 Schadenspunkt zu. Befehde dich mit einem Gegner. Falls du die Fehde gewinnst, bringe Die Ameisen loslassen auf die Hand ihres Besitzers zurück. (Jeder Spieler in einer Fehde deckt die oberste Karte seiner Bibliothek auf und legt diese Karte dann auf oder unter seine Bibliothek. Ein Spieler gewinnt die Fehde, wenn seine Karte die höheren umgewandelten Manakosten hat.)", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 163454, "name": "Liberar las hormigas", "text": "Liberar las hormigas hace 1 punto de daño a la criatura o jugador objetivo. Enfréntate con un oponente. Si ganas, regresa Liberar las hormigas a la mano de su propietario. (Cada jugador enfrentado muestra la primera carta de su biblioteca, luego pone esa carta en la parte superior o inferior. Gana el jugador cuya carta tenga el mayor coste de maná convertido.)", "type": "Instantáneo"}, {"language": "French", "multiverseId": 164354, "name": "Lâcher de fourmis", "text": "Le Lâcher de fourmis inflige 1 blessure à une cible, créature ou joueur. Confrontez un adversaire. Si vous gagnez, renvoyez le Lâcher de fourmis dans la main de son propriétaire. (Chaque joueur impliqué dans la confrontation révèle la carte du dessus de sa bibliothèque et met ensuite cette carte au-dessus ou au-dessous de celle-ci. Un joueur gagne si sa carte a un coût converti de mana plus élevé.)", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 163754, "name": "Liberare le Formiche", "text": "Liberare le Formiche infligge 1 danno a una creatura o a un giocatore bersaglio. Scontrati con un avversario. Se vinci, fai tornare Liberare le Formiche in mano al suo proprietario. (Ogni giocatore che si scontra rivela la prima carta del suo grimorio, poi la mette in cima o in fondo. Un giocatore vince se la sua carta aveva un costo di mana convertito maggiore.)", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 164054, "name": "蟻の解き放ち", "text": "クリーチャー１体かプレイヤー１人を対象とする。蟻の解き放ちはそれに１点のダメージを与える。 いずれかの対戦相手と激突を行う。 あなたが勝った場合、蟻の解き放ちをオーナーの手札に戻す。 （激突を行う各プレイヤーは、自分のライブラリーの一番上のカードを公開し、そのカードを一番上か一番下に置く。 自分のカードの点数で見たマナ・コストの方が大きいプレイヤーが勝つ。）", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 163904, "name": "Liberar as Formigas", "text": "Liberar as Formigas causa 1 ponto de dano à criatura ou ao jogador alvo. Confronte um oponente. Se você vencer, devolva Liberar as Formigas para a mão de seu dono. (Cada jogador confrontante revela o card do topo de seu próprio grimório e depois o coloca no topo ou no fundo deste. Vence o jogador que tiver o card com o maior custo de mana convertido.)", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 164504, "name": "Высадка Муравьев", "text": "Высадка Муравьев наносит 1 повреждение целевому существу или игроку. Столкнитесь с оппонентом. Если вы выиграли, верните Высадку Муравьев в руку ее владельца. (Каждый сталкивающийся игрок показывает верхнюю карту своей библиотеки, затем кладет ту карту на верх или в низ своей библиотеки. Выигрывает тот игрок, чья карта имела большую конвертированную мана-стоимость.)", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 164204, "name": "放蚁咬人", "text": "放蚁咬人对目标生物或牌手造成1点伤害。 与一位对手比点。 若你赢，则将放蚁咬人移回其拥有者手上。 （参与比点的牌手各展示其牌库顶牌，然后将该牌置于牌库顶部或底部。 所展示的牌之总法术力费用比较高的牌手赢得比点。）", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "124412", "cardKingdomId": "124262", "cardsphereId": "32609", "mcmId": "18927", "mcmMetaId": "9514", "mtgjsonV4Id": "5c7376e4-7791-5dd9-be95-76ef6806b424", "mtgoFoilId": "29029", "mtgoId": "29028", "multiverseId": "152619", "scryfallId": "1b6f1afb-2451-4611-ac3e-3513a4651719", "scryfallIllustrationId": "26d11ceb-7b59-4c08-ab47-e369b17a7e7d", "scryfallOracleId": "b420e429-9dec-4993-a45f-3458795e5cbe", "tcgplayerProductId": "18045"}, "keywords": ["Clash"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}", "manaValue": 2.0, "name": "Release the Ants", "number": "98", "originalText": "Release the Ants deals 1 damage to target creature or player. Clash with an opponent. If you win, return Release the Ants to its owner's hand. (Each clashing player reveals the top card of his or her library, then puts that card on the top or bottom. A player wins if his or her card had a higher converted mana cost.)", "originalType": "Instant", "printings": ["MB1", "MOR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/10a7c73250f0a268", "cardKingdomFoil": "https://mtgjson.com/links/f052ba7918567f3a", "cardmarket": "https://mtgjson.com/links/861e670d1a8539c5", "tcgplayer": "https://mtgjson.com/links/a6f453ea30139d0b"}, "rarity": "uncommon", "rulings": [{"date": "2008-04-01", "text": "If you win the clash, the spell moves from the stack to your hand as part of its resolution. It never hits the graveyard. If you don’t win the clash, the spell is put into the graveyard from the stack as normal."}, {"date": "2008-04-01", "text": "If the spell is countered or doesn’t resolve for any reason (for example, if all its targets become illegal), none of its effects happen. There is no clash, and the spell card won’t be returned to your hand."}], "setCode": "MOR", "subtypes": [], "supertypes": [], "text": "Release the Ants deals 1 damage to any target. Clash with an opponent. If you win, return Release the Ants to its owner's hand. (Each clashing player reveals the top card of their library, then puts that card on the top or bottom. A player wins if their card had a higher mana value.)", "type": "Instant", "types": ["Instant"], "uuid": "f203002d-492a-5d11-bfbe-ff1840a80810"}