{"artist": "James Ryman", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 12785, "finishes": ["nonfoil", "foil"], "flavorText": "To truly know a creature, slither a mile in its tentacles.", "foreignData": [{"flavorText": "Um eine Kreatur wirklich kennen zu lernen, sollte man eine Meile auf ihren Tentakeln rutschen.", "language": "German", "multiverseId": 217410, "name": "Abtrünniger Doppelgänger", "text": "Immer wenn eine andere Kreatur unter deiner Kontrolle ins Spiel kommt, kannst du den Abtrünnigen Doppelgänger bis zum Ende des Zuges zu einer Kopie dieser Kreatur werden lassen. (Falls er das tut, verliert er diese Fähigkeit für den Rest des Zuges.)", "type": "Kreatur — Gestaltwandler"}, {"flavorText": "Para realmente conocer una criatura, repta un kilómetro sobre sus tentáculos.", "language": "Spanish", "multiverseId": 217162, "name": "Duplicante renegado", "text": "Siempre que otra criatura entre al campo de batalla bajo tu control, puedes hacer que el Duplicante renegado se convierta en una copia de esa criatura hasta el final del turno. (Si lo hace, pierde esta habilidad por el resto del turno.)", "type": "Criatura — Metamorfo"}, {"flavorText": "Pour vraiment connaître une créature, mettez-vous à sa place.", "language": "French", "multiverseId": 215674, "name": "Doppelganger renégat", "text": "À chaque fois qu'une autre créature arrive sur le champ de bataille sous votre contrôle, vous pouvez faire que le Doppelganger renégat devienne une copie de cette créature jusqu'à la fin du tour. (S'il fait ainsi, il perd cette capacité pour le reste du tour.)", "type": "Créature : changeforme"}, {"flavorText": "Per conoscere veramente una creatura, striscia per un miglio nei suoi tentacoli.", "language": "Italian", "multiverseId": 216418, "name": "Mutaforma Rinnegato", "text": "Ogniqualvolta un'altra creatura entra nel campo di battaglia sotto il tuo controllo, puoi far diventare il Mutaforma Rinnegato una copia di quella creatura fino alla fine del turno. (Se lo fa, perde questa abilità per il resto del turno.)", "type": "Creatura — Polimorfo"}, {"flavorText": "魔物を真に知りたければ、その触手をつけて遠くまで這いずってみればいい。", "language": "Japanese", "multiverseId": 216666, "name": "背教のドッペルゲンガー", "text": "他のクリーチャーが１体あなたのコントロール下で戦場に出るたび、あなたは「背教のドッペルゲンガーはターン終了時までそのクリーチャーのコピーになる。」を選んでもよい。 （そうした場合、それはターンの残りの間この能力を失う。）", "type": "クリーチャー — 多相の戦士"}, {"flavorText": "Para conhecer verdadeiramente uma criatura, deslize um quilômetro em seus tentáculos.", "language": "Portuguese (Brazil)", "multiverseId": 216914, "name": "Doppelganger Renegado", "text": "Toda vez que outra criatura entra no campo de batalha sob o seu controle, você pode fazer com que Doppelganger Renegado se torne uma cópia daquela criatura até o final do turno. (Se ela se tornar, perderá esta habilidade pelo restante do turno.)", "type": "Criatura — Metamorfo"}, {"flavorText": "Чтобы по-настоящему узнать существо, нужно проползти милю-другую в его щупальцах.", "language": "Russian", "multiverseId": 215922, "name": "Двойник-Ренегат", "text": "Каждый раз когда другое существо выходит на поле битвы под вашим контролем, вы можете заставить Двойника-Ренегата стать копией того существа до конца хода. (Если он это делает, он теряет эту способность до окончания хода.)", "type": "Существо — Имитатор"}, {"flavorText": "要真正了解一个生物，得在他触手中滑行一哩。", "language": "Chinese Simplified", "multiverseId": 216170, "name": "反叛化妖", "text": "每当另一个生物在你的操控下进战场时，你可以令反叛化妖成为该生物的复制品直到回合结束。 （如果它如此作，则它在本回合剩下的时段内会失去此异能。）", "type": "生物～变形兽"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "130985", "cardKingdomId": "130744", "cardsphereId": "39736", "mcmId": "22512", "mcmMetaId": "11194", "mtgjsonV4Id": "79a7049b-c78b-57c0-97f8-1bff83c5900f", "mtgoFoilId": "36567", "mtgoId": "36566", "multiverseId": "193582", "scryfallId": "f6453040-38a3-4d3a-8e4b-51b72aa80186", "scryfallIllustrationId": "6f19bb8c-fb62-408c-84bb-036dfea24c59", "scryfallOracleId": "08528c5e-9a01-42a4-a00b-c1ec5eaae64d", "tcgplayerProductId": "34778"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Renegade Doppelganger", "number": "84", "originalText": "Whenever another creature enters the battlefield under your control, you may have Renegade Doppelganger become a copy of that creature until end of turn. (If it does, it loses this ability for the rest of the turn.)", "originalType": "Creature — Shapeshifter", "power": "0", "printings": ["ROE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/a3db734f49b30b9c", "cardKingdomFoil": "https://mtgjson.com/links/a96b0ae688cccf36", "cardmarket": "https://mtgjson.com/links/043610cc47571661", "tcgplayer": "https://mtgjson.com/links/5cf9db7044949bb6"}, "rarity": "rare", "rulings": [{"date": "2010-06-15", "text": "If Renegade Doppelganger becomes a copy of another creature, that doesn’t count as having a creature enter the battlefield. Renegade Doppelganger was already on the battlefield; it only changed its characteristics. If Renegade Doppelganger gains any enters-the-battlefield triggered abilities, they won’t do anything. The same is true of any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities."}, {"date": "2010-06-15", "text": "If Renegade Doppelganger becomes a copy of another creature, it copies exactly what was printed on that card and nothing more (unless that card is copying something else or it’s a token; see below). It doesn’t copy whether the original creature is tapped or untapped, whether it has any counters on it or Auras attached to it, or whether it’s been affected by any noncopy effects that changed its power, toughness, types, color, or so on."}, {"date": "2010-06-15", "text": "If Renegade Doppelganger becomes a copy of a creature that is itself copying something else (for example, if the creature that entered the battlefield is a Clone), then Renegade Doppelganger becomes a copy of whatever that creature is copying."}, {"date": "2010-06-15", "text": "If Renegade Doppelganger becomes a copy of a token, Renegade Doppelganger copies the original characteristics of that token as stated by the effect that put it onto the battlefield. Renegade Doppelganger doesn’t become a token."}, {"date": "2010-06-15", "text": "Noncopy effects that have already applied to Renegade Doppelganger will continue to apply to it after it becomes a copy of something else. For example, if Giant Growth had given it +3/+3 earlier in the turn, then it becomes a copy of Runeclaw Bear (a 2/2 creature), it will be a 5/5 Runeclaw Bear."}, {"date": "2010-06-15", "text": "During the cleanup step, Renegade Doppelganger’s copy effect wears off. It will go back to being a 0/1 blue creature named Renegade Doppelganger, and will have its original ability again. Note that this happens at the same time that damage marked on the Renegade Doppelganger is removed. If it was dealt damage earlier in the turn, this damage will not cause Renegade Doppelganger to be destroyed when its copy effect wears off."}, {"date": "2010-06-15", "text": "When a creature enters the battlefield under your control, you can choose not to copy it. In that case, Renegade Doppelganger remains 0/1 and still has its triggered ability."}, {"date": "2010-06-15", "text": "Renegade Doppelganger’s ability isn’t targeted. It can copy a creature with shroud or protection."}, {"date": "2010-06-15", "text": "If the creature Renegade Doppelganger copies has an ability that triggers at the beginning of the end step, that ability will trigger and resolve before Renegade Doppelganger’s copy effect wears off."}, {"date": "2010-06-15", "text": "If Renegade Doppelganger becomes a copy of a creature with an ability that causes you to make a choice (such as naming a card or choosing a color) as it enters the battlefield, and another ability that refers to that choice, those abilities of the Doppelganger won’t do anything. You won’t have the chance to make a choice since the Doppelganger is already on the battlefield, so the value of that choice is undefined."}, {"date": "2010-06-15", "text": "If Renegade Doppelganger and another creature enter the battlefield under your control at the same time, Renegade Doppelganger’s ability will trigger. When the ability resolves, Renegade Doppelganger can become a copy of that creature."}, {"date": "2010-06-15", "text": "If multiple creatures enter the battlefield under your control at the same time, Renegade Doppelganger’s ability will trigger once for each of them. You choose the order that those abilities will resolve. It’s possible to have Renegade Doppelganger become a copy of something, activate an activated ability of that creature, then have it become a copy of something else under this scenario. The last ability that resolves that you choose to use determines what it ends up a copy of."}, {"date": "2010-06-15", "text": "If a creature enters the battlefield under your control and Renegade Doppelganger’s ability triggers, it can become a copy of that creature when the ability resolves even if that creature has left the battlefield by then. If it has, its last existence on the battlefield is checked to see what it was (specifically, if it was itself or if it was copying something else)."}, {"date": "2013-07-01", "text": "If Renegade Doppelganger becomes a copy of a legendary creature, you will have to put one of them into the graveyard as a state-based action."}], "setCode": "ROE", "subtypes": ["Shapeshifter"], "supertypes": [], "text": "Whenever another creature enters the battlefield under your control, you may have Renegade Doppelganger become a copy of that creature until end of turn. (If it does, it loses this ability for the rest of the turn.)", "toughness": "1", "type": "Creature — Shapeshifter", "types": ["Creature"], "uuid": "db15c2c2-9635-5c96-8768-c41657aec271"}