{"artist": "Dave Dorman", "availability": ["paper"], "borderColor": "gold", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 13822, "finishes": ["nonfoil", "signed"], "foreignData": [], "frameVersion": "2003", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "243472", "mcmId": "249112", "mtgjsonV4Id": "53ffde1c-8ab4-5eab-abfa-61ca37c19d43", "scryfallId": "a9e29314-735e-4fed-9147-0ea963d1e963", "scryfallIllustrationId": "c389cb67-72e2-4ec7-ae87-ec625d9db80f", "scryfallOracleId": "aa4ecefa-808e-4706-af16-4ea5af9743fc", "tcgplayerProductId": "174368"}, "isReprint": true, "isStarter": true, "keywords": ["Cycling"], "language": "English", "layout": "normal", "legalities": {}, "manaCost": "{2}{W}", "manaValue": 3.0, "name": "Renewed Faith", "number": "jn50", "printings": ["A25", "AKH", "AKR", "DMR", "MB1", "ONS", "VMA", "WC03", "WC04"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/478a7d866bbb36c0", "tcgplayer": "https://mtgjson.com/links/2396ff8263e82d59"}, "rarity": "common", "rulings": [{"date": "2008-10-01", "text": "When you cycle this card, first the cycling ability goes on the stack, then the triggered ability goes on the stack on top of it. The triggered ability will resolve before you draw a card from the cycling ability."}, {"date": "2008-10-01", "text": "The cycling ability and the triggered ability are separate. If the triggered ability doesn't resolve (due to being countered with Stifle, for example, or if all its targets have become illegal), the cycling ability will still resolve and you'll draw a card."}, {"date": "2008-10-01", "text": "Cycling is an activated ability. Effects that interact with activated abilities (such as Stifle or Rings of Brighthearth) will interact with cycling. Effects that interact with spells (such as Remove Soul or Faerie Tauntings) will not."}, {"date": "2017-04-18", "text": "Some cards with cycling have an ability that triggers when you cycle them. These triggered abilities resolve before you draw from the cycling ability."}, {"date": "2017-04-18", "text": "Triggered abilities from cycling a card and the cycling ability itself aren't spells. Effects that interact with spells (such as that of Cancel) won't affect them."}, {"date": "2017-04-18", "text": "You can cycle a card even if it has a triggered ability from cycling that won't have a legal target. This is because the cycling ability and the triggered ability are separate. This also means that if either ability doesn't resolve (due to being countered with Disallow, for example, or if the triggered ability's targets have become illegal), the other ability will still resolve."}, {"date": "2018-01-19", "text": "There are many important moments in the story, but the most crucial—called “story spotlights”—are shown on cards. These cards have the Planeswalker symbol in their text box; this symbol has no effect on gameplay. You can read more about these events in the official Magic fiction at http://www.mtgstory.com."}], "setCode": "WC04", "signature": "Julien Nuijten", "subtypes": [], "supertypes": [], "text": "You gain 6 life.\nCycling {1}{W} ({1}{W}, Discard this card: Draw a card.)\nWhen you cycle Renewed Faith, you may gain 2 life.", "type": "Instant", "types": ["Instant"], "uuid": "358d6b14-9e98-550d-8f5a-abeb99636cd4"}