{"artist": "Izzy", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 3857, "finishes": ["foil"], "flavorText": "It's in the nature of fire to grow.", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "226640", "cardsphereId": "61031", "mcmId": "382275", "mtgjsonV4Id": "84f03376-8ab8-56b8-8e42-5e8870f1744e", "scryfallId": "ec25f534-0ed6-46ba-98fe-67bafd30ad4f", "scryfallIllustrationId": "06dbebcd-9bab-4c88-bc99-825d9c5ded5d", "scryfallOracleId": "9a664735-6e38-407f-9d2f-a6d279cd6309", "tcgplayerProductId": "194056"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}{R}", "manaValue": 4.0, "name": "Repeated Reverberation", "number": "156s", "printings": ["M20", "PM20"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/7b35e583424c2393", "tcgplayer": "https://mtgjson.com/links/c59ddeb11b419e86"}, "rarity": "rare", "rulings": [{"date": "2019-07-12", "text": "If you cast one Repeated Reverberation after another, you’ll copy the second Repeated Reverberation twice. Each resolves, creating three delayed triggered abilities. The next spell you cast or loyalty ability you activate after that will be copied six times. If that spell is also a Repeated Reverberation, the following spell or ability will be copied fourteen times. A fourth Repeated Reverberation will copy the next spell or ability thirty times. Reverberations repeated beyond that shall be left as an exercise for the reader."}, {"date": "2019-07-12", "text": "Repeated Reverberation’s ability will copy any instant or sorcery spell or loyalty ability, not just one with targets."}, {"date": "2019-07-12", "text": "Copies are created even if the spell or ability that caused Repeated Reverberation’s ability to trigger has been countered by the time that ability resolves. The copies resolve before the original spell or ability."}, {"date": "2019-07-12", "text": "The copies will have the same targets as the spell or ability they’re copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. The new targets must be legal."}, {"date": "2019-07-12", "text": "If the spell that’s copied is modal (that is, it says “Choose one —” or the like), the copies will have the same mode or modes. You can’t choose different ones."}, {"date": "2019-07-12", "text": "If the spell or ability that’s copied has an X whose value was determined as it was cast, the copies will have the same value of X."}, {"date": "2019-07-12", "text": "You can’t choose to pay any additional costs for the copies. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copies too."}, {"date": "2019-07-12", "text": "The copies made by Repeated Reverberation’s ability are created on the stack, so they’re not “cast” or “activated.” Abilities that trigger when a player casts a spell or activate an ability don’t trigger."}, {"date": "2019-07-12", "text": "Copying a loyalty ability doesn’t add or remove loyalty counters from any object."}], "securityStamp": "oval", "setCode": "PM20", "subtypes": [], "supertypes": [], "text": "When you next cast an instant spell, cast a sorcery spell, or activate a loyalty ability this turn, copy that spell or ability twice. You may choose new targets for the copies.", "type": "Instant", "types": ["Instant"], "uuid": "166d1fc6-52a4-59e4-b3de-c02f10dc7c75", "variations": ["48e9df31-c1fe-5e4f-8bb6-03722a482f15"]}