{"artist": "Raymond Swanland", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 5.0, "edhrecRank": 7613, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 374279, "name": "Errettung aus der Unterwelt", "text": "Opfere eine Kreatur als zusätzliche Kosten, um die Errettung aus der Unterwelt zu wirken.\nBestimme eine Kreaturenkarte deiner Wahl in deinem Friedhof. Bringe diese Karte und die geopferte Karte zu Beginn deines nächsten Versorgungssegments unter deiner Kontrolle ins Spiel zurück. Schicke die Errettung aus der Unterwelt ins Exil.", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 376022, "name": "Rescate del Inframundo", "text": "Como coste adicional para lanzar el Rescate del Inframundo, sacrifica una criatura.\nElige la carta de criatura objetivo de tu cementerio. Regresa esa carta y la carta sacrificada al campo de batalla bajo tu control al comienzo de tu próximo mantenimiento. Exilia el Rescate del Inframundo.", "type": "Instantáneo"}, {"language": "French", "multiverseId": 374528, "name": "Sauvetage dans le Monde souterrain", "text": "En tant que coût supplémentaire pour lancer le Sauvetage dans le Monde souterrain, sacrifiez une créature.\nChoisissez une carte de créature ciblée dans votre cimetière. Renvoyez cette carte et la carte sacrifiée sur le champ de bataille, sous votre contrôle, au début de votre prochain entretien. Exilez le Sauvetage dans le Monde souterrain.", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 374777, "name": "Salvataggio dall'Ade", "text": "Come costo addizionale per lanciare il Salvataggio dall'Ade, sacrifica una creatura.\nScegli una carta creatura bersaglio nel tuo cimitero. Rimetti sul campo di battaglia sotto il tuo controllo quella carta e la carta sacrificata all'inizio del tuo prossimo mantenimento. Esilia il Salvataggio dall'Ade.", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 375026, "name": "死の国からの救出", "text": "死の国からの救出を唱えるための追加コストとして、クリーチャーを１体生け贄に捧げる。\nあなたの墓地にあるクリーチャー・カード１枚を対象とする。あなたの次のアップキープの開始時に、そのカードと生け贄に捧げられたカードをあなたのコントロール下で戦場に戻す。死の国からの救出を追放する。", "type": "インスタント"}, {"language": "Korean", "multiverseId": 375275, "name": "저승에서의 구출", "text": "저승에서의 구출을 발동하기 위한 추가비용으로, 생물 한 개를 희생한다.\n당신의 무덤에 있는 생물 카드 한 장을 목표로 정한다. 당신의 다음 유지단 시작에 그 카드와 희생한 생물 카드를 당신의 조종하에 전장으로 되돌린다. 저승에서의 구출을 추방한다.", "type": "순간마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 375524, "name": "Resgatar do Submundo", "text": "Como custo adicional para conjurar Resgatar do Submundo, sacrifique uma criatura.\nEscolha um card de criatura alvo em seu cemitério. Devolva aquele card e o card sacrificado ao campo de batalha sob o seu controle no início de sua próxima manutenção. Exile Resgatar do Submundo.", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 375773, "name": "Спасение из Подземного Царства", "text": "В качестве дополнительной стоимости разыгрывания Спасения из Подземного Царства пожертвуйте существо.\nВыберите целевую карту существа на вашем кладбище. В начале вашего следующего шага поддержки верните ту карту и пожертвованную карту на поле битвы под вашим контролем. Изгоните Спасение из Подземного Царства.", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 373781, "name": "冥界救援", "text": "牺牲一个生物，以作为施放冥界救援的额外费用。\n选择目标在你坟墓场中的生物牌。在你的下一个维持开始时，将该牌和所牺牲的牌在你的操控下移回战场。放逐冥界救援。", "type": "瞬间"}, {"language": "Chinese Traditional", "multiverseId": 374030, "name": "冥界救援", "text": "犧牲一個生物，以作為施放冥界救援的額外費用。\n選擇目標在你墳墓場中的生物牌。在你的下一個維持開始時，將該牌和所犧牲的牌在你的操控下移回戰場。放逐冥界救援。", "type": "瞬間"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "191504", "cardKingdomId": "191165", "cardsphereId": "43917", "mcmId": "264043", "mcmMetaId": "208643", "mtgjsonV4Id": "c2a96bf1-f5d7-53b1-a39c-134436e3f354", "mtgoFoilId": "50381", "mtgoId": "50380", "multiverseId": "373532", "scryfallId": "2e46aa9c-7a29-4eb4-bc44-a201c22824d2", "scryfallIllustrationId": "0611bf60-d541-4e49-b921-1e8c5a7e327c", "scryfallOracleId": "7217ea53-3685-48d6-9df1-58a551f8c979", "tcgplayerProductId": "71023"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{B}", "manaValue": 5.0, "name": "Rescue from the Underworld", "number": "102", "originalText": "As an additional cost to cast Rescue from the Underworld, sacrifice a creature.\nChoose target creature card in your graveyard. Return that card and the sacrificed card to the battlefield under your control at the beginning of your next upkeep. Exile Rescue from the Underworld.", "originalType": "Instant", "printings": ["FMB1", "THS"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/a0924ac08f4d8c20", "cardKingdomFoil": "https://mtgjson.com/links/76fd8ea074ae5b64", "cardmarket": "https://mtgjson.com/links/2ec3f2ad58494959", "tcgplayer": "https://mtgjson.com/links/26d46cd9d7f08e12"}, "rarity": "uncommon", "rulings": [{"date": "2013-09-15", "text": "Once you announce you’re casting Rescue from the Underworld, no player may attempt to stop you from casting the spell by removing the creature you want to sacrifice."}, {"date": "2013-09-15", "text": "If you sacrifice a creature token to cast Rescue from the Underworld, it won’t return to the battlefield, although the target creature card will."}, {"date": "2013-09-15", "text": "If either the sacrificed creature or the target creature card leaves the graveyard before the delayed triggered ability resolves during your next upkeep, it won’t return."}, {"date": "2013-09-15", "text": "However, if the sacrificed creature is put into another public zone instead of the graveyard, perhaps because it’s your commander or because of another replacement effect, it will return to the battlefield from the zone it went to."}, {"date": "2013-09-15", "text": "Rescue from the Underworld is exiled as it resolves, not later as its delayed trigger resolves."}], "setCode": "THS", "subtypes": [], "supertypes": [], "text": "As an additional cost to cast this spell, sacrifice a creature.\nChoose target creature card in your graveyard. Return that card and the sacrificed card to the battlefield under your control at the beginning of your next upkeep. Exile Rescue from the Underworld.", "type": "Instant", "types": ["Instant"], "uuid": "c3b7a09e-1a81-550d-b8c2-9c580fcc8d5f"}