{"artist": "Jesper Ejsing", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G", "R", "W"], "colors": ["G", "R", "W"], "convertedManaCost": 4.0, "edhrecRank": 16286, "finishes": ["foil"], "flavorText": "For every eye, an eye. For every tooth, a tooth. Griffins are nothing if not fair.", "foreignData": [], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": false, "identifiers": {"mtgjsonV4Id": "35a15c6a-4e3a-5a7a-a190-0ba16411ab81", "mtgoId": "43546", "scryfallId": "b3289594-2a2e-4495-9553-b45c18055775", "scryfallIllustrationId": "c28c0265-fe1a-498e-bca1-8346c699966a", "scryfallOracleId": "dd4b9e5a-b3ab-4b70-b200-228c8add9f52"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}{G}{W}", "manaValue": 4.0, "name": "Retaliator Griffin", "number": "43546", "originalReleaseDate": "2014-10-17", "power": "2", "printings": ["ARB", "PRES", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2009-05-01", "text": "The source of combat damage is the creature that dealt it."}, {"date": "2009-05-01", "text": "If a spell causes damage to be dealt, that spell will always identify the source of the damage. In most cases, the source is the spell itself. For example, Breath of Malfegor says “Breath of Malfegor deals 5 damage to each opponent.”"}, {"date": "2009-05-01", "text": "If an ability causes damage to be dealt, that ability will always identify the source of the damage. The ability itself is never the source. However, the source of the ability is often the source of the damage. For example, Deathbringer Thoctar’s ability says “Deathbringer Thoctar deals 1 damage to any target.”"}, {"date": "2009-05-01", "text": "If the source of the damage is a permanent, Retaliator Griffin checks whether an opponent controls that permanent at the time that damage is dealt. If the permanent has left the battlefield by then, its last known information is used. If the source of the damage is a spell, whether it’s controlled by an opponent is obvious. If the source of the damage is a card in some other zone (such as a cycled Jund Sojourners), Retaliator Griffin checks whether the card’s owner, rather than its controller, is an opponent."}, {"date": "2009-05-01", "text": "If Retaliator Griffin is dealt lethal damage at the same time that you’re dealt damage by a source an opponent controls, Retaliator Griffin will be put into a graveyard before it would receive any counters. Its ability will still trigger, but it will do nothing when it resolves."}], "setCode": "PRM", "subtypes": ["Griffin"], "supertypes": [], "text": "Flying\nWhenever a source an opponent controls deals damage to you, you may put that many +1/+1 counters on Retaliator Griffin.", "toughness": "2", "type": "Creature — Griffin", "types": ["Creature"], "uuid": "535669a4-e434-5d8f-aef2-7fe98f29d4d2"}