{"artist": "Dan Scott", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 4525, "finishes": ["nonfoil", "foil"], "flavorText": "The rifts reach into infinite time streams, bringing the divergent products of alternate pasts into the present.", "foreignData": [{"flavorText": "Die Zeitspalten durchmessen unendlich viele Zeitströme und bringen die abweichenden Ergebnisse unterschiedlicher Vergangenheiten in die Gegenwart.", "language": "German", "multiverseId": 140548, "name": "Neu binden", "text": "Bringe alle Aurenkarten aus deinem Friedhof ins Spiel zurück. Nur Kreaturen können auf diese Weise verzaubert werden. (Aurakarten, die keine der Kreaturen im Spiel verzaubern können, bleiben in deinem Friedhof.)", "type": "Hexerei"}, {"flavorText": "Las grietas alcanzan infinitas líneas temporales, trayendo al presente los resultados de divergentes pasados alternativos.", "language": "Spanish", "multiverseId": 141268, "name": "Volver a atar", "text": "Regresa cada carta de aura de tu cementerio al juego. Sólo se pueden encantar criaturas de esta manera. (Las cartas de aura que no pueden encantar a una criatura en juego permanecen en tu cementerio.)", "type": "Conjuro"}, {"flavorText": "Les failles puisent les produits divergents des passés alternatifs dans des flux temporels infinis et les ramènent dans le présent.", "language": "French", "multiverseId": 140428, "name": "Rattachement", "text": "Renvoyez en jeu chaque carte d'aura de votre cimetière. Vous ne pouvez enchanter que des créatures de cette manière. (Les cartes d'aura qui ne peuvent pas enchanter de créature en jeu restent dans votre cimetière.)", "type": "Rituel"}, {"flavorText": "Gli squarci raggiungono infiniti flussi temporali e portano nel presente i contrastanti prodotti di passati alternativi.", "language": "Italian", "multiverseId": 140668, "name": "Re-imbrigliare", "text": "Rimetti in gioco ogni carta Aura dal tuo cimitero. Solo le creature possono essere incantate in questo modo. (Le carte Aura che non possono incantare una creatura in gioco rimangono nel tuo cimitero.)", "type": "Stregoneria"}, {"flavorText": "裂け目は無限の時の流れにまで到達し、様々に分岐した過去の創造物を現在にもたらしている。", "language": "Japanese", "multiverseId": 140908, "name": "再拘束", "text": "あなたの墓地にある各オーラ・カードを場に出す。 これによりエンチャントできるのはクリーチャーのみである。 （場に出ているクリーチャーにエンチャントできないオーラはあなたの墓地に残る。）", "type": "ソーサリー"}, {"flavorText": "As fendas alcançam rios de tempo infinitos, trazendo para o presente os produtos divergentes de passados alternativos.", "language": "Portuguese (Brazil)", "multiverseId": 141028, "name": "Reamarrar", "text": "Devolva para o jogo cada card de Aura do seu cemitério. Somente as criaturas podem ser encantadas desta forma. (Os cards de Aura que não podem encantar uma criatura em jogo permanecem no seu cemitério)", "type": "Feitiço"}, {"flavorText": "Разломы уходят в бесконечные течения времени, принося разнообразные творения альтернативных прошлых в настоящее.", "language": "Russian", "multiverseId": 141148, "name": "Перепривязать", "text": "Верните каждую карту Ауры из вашего кладбища в игру. Только существа могут быть зачарованы таким путем. (Карты Ауры, которые не могут зачаровать существо в игре остаются на вашем кладбище.)", "type": "Волшебство"}, {"flavorText": "时缝触及无数的时间流，将另类过往产生的不同版本事物都带到现今。", "language": "Chinese Simplified", "multiverseId": 141388, "name": "重新连系", "text": "将所有灵气牌从你的坟墓场移回场上。 只有生物能以此法被结附。 （如果场上每个生物都无法让某灵气牌结附，则此牌会留在你的坟墓场。）", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "122103", "cardKingdomId": "121929", "cardsphereId": "35371", "mcmId": "14192", "mcmMetaId": "8599", "mtgjsonV4Id": "e8dffb81-f784-550e-9fe1-4d0b5843eca8", "mtgoFoilId": "26484", "mtgoId": "26483", "multiverseId": "131007", "scryfallId": "0faa005e-c753-4484-bf64-349350d59094", "scryfallIllustrationId": "da72f98e-b266-4e29-95f9-7b301f7a4325", "scryfallOracleId": "b693c24f-07d9-40fa-aa4a-8f7ba61f3452", "tcgplayerProductId": "14791"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}", "manaValue": 4.0, "name": "Retether", "number": "13", "originalText": "Return each Aura card from your graveyard to play. Only creatures can be enchanted this way. (Aura cards that can't enchant a creature in play remain in your graveyard.)", "originalType": "Sorcery", "printings": ["PLC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/671ddc5d659b9922", "cardKingdomFoil": "https://mtgjson.com/links/69e7aa5c99d44bfe", "cardmarket": "https://mtgjson.com/links/73f40bfb6d2f2c5e", "tcgplayer": "https://mtgjson.com/links/0869be0e4ec8317e"}, "rarity": "rare", "rulings": [{"date": "2007-02-01", "text": "All the Auras return to the battlefield simultaneously. Whether an Aura can be attached to a creature is checked before any of them are returned and doesn’t take into account any simultaneously returning Auras. For example, if Tattoo Ward (which gives enchanted creature protection from enchantments) and Holy Strength are in your graveyard and there’s only one creature on the battlefield, both Auras are returned to the battlefield attached to that creature, then Holy Strength is put into your graveyard the next time state-based actions are checked."}, {"date": "2007-02-01", "text": "Auras don’t need to say “enchant creature” to return to the battlefield. For example, an Aura with “enchant land” will return to the battlefield if there’s an animated land for it to enchant."}], "setCode": "PLC", "subtypes": [], "supertypes": [], "text": "Return each Aura card from your graveyard to the battlefield. Only creatures can be enchanted this way. (Aura cards that can't enchant a creature on the battlefield remain in your graveyard.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "4a0268eb-b606-5eba-bd92-4ba1ace04d61"}