{"artist": "Greg Hildebrandt", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 6.0, "edhrecRank": 14887, "finishes": ["nonfoil", "foil"], "flavorText": "\"Why learn hundreds of spells when you can learn only one and use it to steal hundreds?\"", "foreignData": [{"flavorText": "„Warum hunderte Zaubersprüche lernen, wenn es reicht, einen einzigen zu kennen und diesen zu verwenden, um hunderte zu stehlen?\"", "language": "German", "multiverseId": 80996, "name": "Umkehr des Glücks", "text": "Ein Gegner deiner Wahl zeigt die Karten auf seiner Hand offen vor. Du kannst eine Spontanzauber- oder Hexereikarte darunter kopieren und die Kopie spielen, ohne ihre Manakosten zu bezahlen.", "type": "Hexerei"}, {"flavorText": "\"¿Por qué aprender cientos de hechizos cuando puedes aprender sólo uno y usarlo para robar cientos?\"", "language": "Spanish", "multiverseId": 81161, "name": "Inversión de fortuna", "text": "El oponente objetivo muestra su mano. Puedes copiar una carta de instantáneo o conjuro de allí y jugar la copia sin pagar su coste de maná.", "type": "Conjuro"}, {"flavorText": "« Pourquoi apprendre des centaines de sorts quand il suffit d'un seul pour voler tous les autres ? »", "language": "French", "multiverseId": 80831, "name": "Inversion de fortune", "text": "L'adversaire ciblé révèle sa main. Vous pouvez copier une carte d'éphémère ou de rituel de sa main et jouer cette copie sans payer son coût de mana.", "type": "Rituel"}, {"flavorText": "\"Perché imparare centinaia di magie quando puoi impararne una e usarla per rubarne centinaia?\"", "language": "Italian", "multiverseId": 81326, "name": "Rovescio di Fortuna", "text": "L'avversario bersaglio rivela la propria mano. Puoi copiare una carta istantaneo o stregoneria presente nella sua mano e giocare la copia senza pagarne il costo di mana.", "type": "Stregoneria"}, {"flavorText": "なぜ百も呪文を覚えるのだね？ 一つの呪文だけを学べば、それで百の呪文を盗めるのに。", "language": "Japanese", "multiverseId": 80666, "name": "運命の逆転", "text": "対戦相手１人を対象とする。そのプレイヤーは自分の手札を公開する。あなたはそこにあるインスタント・カード１枚かソーサリー・カード１枚をコピーし、マナ・コストを支払わずにそのコピーをプレイしてよい。", "type": "ソーサリー"}, {"flavorText": "\"Para que aprender centenas de mágicas quando se pode aprender apenas uma e usá-la para roubar centenas?\"", "language": "Portuguese (Brazil)", "multiverseId": 81491, "name": "Inversão do Destino", "text": "O oponente alvo revela sua própria mão. Você pode copiar um card de feitiço ou de mágica instantânea dela e jogar a cópia sem pagar seu custo de mana.", "type": "Feitiço"}, {"flavorText": "「若学会了能用来偷取千百种术法的咒语，又何必习练其它的？」", "language": "Chinese Simplified", "multiverseId": 81656, "name": "命转乾坤", "text": "目标对手展示其手牌。你可以复制其中的一张瞬间或法术牌并使用此复制，且不须支付其法术力费用。", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "111707", "cardKingdomId": "111536", "cardsphereId": "18311", "mcmId": "593", "mcmMetaId": "4677", "mtgjsonV4Id": "279fb82c-068b-526c-bd4a-0e9b1f13b3ef", "mtgoFoilId": "20905", "mtgoId": "20904", "multiverseId": "73564", "scryfallId": "19cf87c0-369e-4ec2-bb9f-e8e29d63d448", "scryfallIllustrationId": "d92f25d2-17ac-4711-8d35-56190b68f6e5", "scryfallOracleId": "938ba053-35f6-4424-a978-bf915709572c", "tcgplayerProductId": "11884"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{R}{R}", "manaValue": 6.0, "name": "Reversal of Fortune", "number": "77", "originalText": "Target opponent reveals his or her hand. You may copy an instant or sorcery card in it and play the copy without paying its mana cost.", "originalType": "Sorcery", "printings": ["5DN"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6ed07e05b05134e8", "cardKingdomFoil": "https://mtgjson.com/links/f683011c797dc8f3", "cardmarket": "https://mtgjson.com/links/04e140055b9b8896", "tcgplayer": "https://mtgjson.com/links/9cf319384e63b881"}, "rarity": "rare", "rulings": [{"date": "2004-12-01", "text": "You cast the copy while this ability is resolving and still on the stack. Normally, you’re not allowed to cast spells or activate abilities at this time. Reversal of Fortune provides an exception."}, {"date": "2004-12-01", "text": "You don’t pay the spell’s mana cost. If the spell has X in its mana cost, X is 0. You do pay any additional costs for that spell. You can’t use any alternative costs."}, {"date": "2004-12-01", "text": "If the copied card is a split card, you may choose to cast either side of the split card but not both."}, {"date": "2004-12-01", "text": "Reversal of Fortune creates a copy of the card in the other player’s hand, then allows you to cast the copy from that player’s hand without paying its mana cost."}, {"date": "2004-12-01", "text": "You can’t cast the copy unless all of its targets, if any, can be chosen."}, {"date": "2004-12-01", "text": "If you don’t want to cast the copy, you can choose not to; the copy ceases to exist the next time state-based actions are checked."}, {"date": "2004-12-01", "text": "The spell is cast from your opponent’s hand, not yours, which can be important for some cards."}, {"date": "2004-12-01", "text": "You can’t cast the copy if an effect prevents you from casting instants or sorceries, or from casting that particular instant or sorcery. It doesn’t matter whether your opponent can cast the card at this time; the only thing that matters is whether you can cast it."}, {"date": "2005-03-01", "text": "The creation of the copy and then the casting of the copy are both optional."}], "setCode": "5DN", "subtypes": [], "supertypes": [], "text": "Target opponent reveals their hand. You may copy an instant or sorcery card in it. If you do, you may cast the copy without paying its mana cost.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "ba5644df-a8e2-5847-bd41-311bff5579bf"}