{"artist": "Alex Horley-Orlandelli", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 6.0, "edhrecRank": 9878, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 86016, "name": "Neuweben", "text": "Der Beherrscher einer bleibenden Karte deiner Wahl opfert sie. Dieser Spieler deckt Karten oben von seiner Bibliothek auf, bis er eine Karte aufdeckt, die einen Kartentyp mit der geopferten bleibenden Karte gemeinsam hat. Der Spieler bringt diese Karte ins Spiel und mischt dann seine Bibliothek.\nArkane Kopplung {2}{U}{U}", "type": "Spontanzauber - Arkan"}, {"language": "Spanish", "multiverseId": 87244, "name": "Retejer", "text": "El controlador del permanente objetivo lo sacrifica. Ese jugador muestra cartas de la parte superior de su biblioteca hasta que muestre una carta que comparta un tipo de carta con el permanente sacrificado. Ese jugador pone esa carta en juego, luego baraja su biblioteca.\nEmpalmar con lo arcano {2}{U}{U}", "type": "Instantáneo - Arcano"}, {"language": "French", "multiverseId": 85709, "name": "Retisser", "text": "Le contrôleur du permanent ciblé le sacrifie. Ce joueur révèle des cartes du dessus de sa bibliothèque jusqu'à ce qu'il révèle une carte qui partage un type de carte avec le permanent sacrifié. Le joueur met cette carte en jeu et mélange ensuite sa bibliothèque.\nImprégnation d'arcane {2}{U}{U}", "type": "Éphémère : arcane"}, {"language": "Italian", "multiverseId": 86323, "name": "Ritessere", "text": "Il controllore di un permanente bersaglio sacrifica quel permanente. Quel giocatore rivela le carte dalla cima del proprio grimorio fino a rivelare una carta che abbia almeno un tipo di carta in comune con il permanente sacrificato. Quel giocatore mette in gioco quella carta, poi rimescola il proprio grimorio.\nUnire nell'Arcano {2}{U}{U}", "type": "Istantaneo - Arcano"}, {"language": "Japanese", "multiverseId": 86630, "name": "編直し", "text": "パーマネント１つを対象とする。それのコントローラーはそれを生け贄に捧げる。そのプレイヤーは自分のライブラリーのカードを一番上から、生け贄に捧げたパーマネントと共通のタイプを持つカードが公開されるまで順に公開する。そのプレイヤーはそのカードを場に出し、その後自分のライブラリーを切り直す。\n連繋（秘儀） {2}{U}{U}", "type": "インスタント — 秘儀"}, {"language": "Portuguese (Brazil)", "multiverseId": 86937, "name": "Tecer Novamente", "text": "O controlador da permanente alvo a sacrifica. Aquele jogador revela cards do topo de seu próprio grimório até revelar um card que compartilhe um tipo de card com a permanente sacrificada. O jogador coloca aquele card em jogo e depois embaralha o seu próprio grimório.\nUnir em Arcana {2}{U}{U}", "type": "Mágica Instantânea - Arcana"}, {"language": "Chinese Simplified", "multiverseId": 85402, "name": "重纺生命", "text": "目标永久物的操控者将之牺牲。该牌手从其牌库顶开始展示牌，直到展示出与所牺牲之永久物有共通牌类别者为止。该牌手将该牌放置进场，然后将其牌库洗牌。\n通联古咒{2}{U}{U}", "type": "瞬间～古咒"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "112267", "cardKingdomId": "111968", "cardsphereId": "8202", "mcmId": "12167", "mcmMetaId": "7134", "mtgjsonV4Id": "02d1ebbb-8527-5671-b40d-c603dd061558", "mtgoFoilId": "21456", "mtgoId": "21455", "multiverseId": "79863", "scryfallId": "4ff68016-80b4-4801-b796-5c5fdbc8faa1", "scryfallIllustrationId": "26a7fb0d-afbb-4d5e-9982-c9709581b250", "scryfallOracleId": "744d6daa-2f93-43e1-88c0-0d9d5f9d111b", "tcgplayerProductId": "12148"}, "keywords": ["Splice"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{5}{U}", "manaValue": 6.0, "name": "Reweave", "number": "82", "originalText": "Target permanent's controller sacrifices it. That player reveals cards from the top of his or her library until he or she reveals a card that shares a card type with the sacrificed permanent. The player puts that card into play, then shuffles his or her library.\nSplice onto Arcane {2}{U}{U}", "originalType": "Instant - Arcane", "printings": ["CHK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/016b87cdfaa54438", "cardKingdomFoil": "https://mtgjson.com/links/c8900ac64290a1f4", "cardmarket": "https://mtgjson.com/links/da281552afb584a8", "tcgplayer": "https://mtgjson.com/links/70de4a5988ecb61e"}, "rarity": "rare", "rulings": [{"date": "2005-04-01", "text": "When Reweave resolves it uses the type(s) that the permanent had right before it was sacrificed."}, {"date": "2005-11-01", "text": "The player reveals cards only if the targeted permanent gets sacrificed."}, {"date": "2008-04-01", "text": "With the introduction of the Tribal type it became possible for an instant or sorcery card to share a type with the sacrificed permanent (ie, a Tribal instant card shares a type with a Tribal Enchantment card). Reweave has received errata so that the effect looks for a *permanent* card that shares a type with the sacrificed permanent. A permanent card is a card that could be put onto the battlefield, which is any card that isn’t an instant or sorcery."}, {"date": "2013-06-07", "text": "You reveal all cards you intend to splice at the same time. Each individual card can be spliced only once onto any one spell."}, {"date": "2013-06-07", "text": "A card with a splice ability can’t be spliced onto itself because the spell is on the stack (and not in your hand) when you reveal the cards you want to splice onto it."}, {"date": "2013-06-07", "text": "You choose all targets for the spell after revealing cards you want to splice, including any targets required by the text of any of those cards. You may choose a different target for each instance of the word “target” on the resulting spell."}, {"date": "2013-06-07", "text": "If all of the spell’s targets are illegal when the spell tries to resolve, it won’t resolve and none of its effects will happen."}], "setCode": "CHK", "subtypes": ["Arcane"], "supertypes": [], "text": "Target permanent's controller sacrifices it. If the player does, they reveal cards from the top of their library until they reveal a permanent card that shares a card type with the sacrificed permanent, put that card onto the battlefield, then shuffle.\nSplice onto Arcane {2}{U}{U} (As you cast an Arcane spell, you may reveal this card from your hand and pay its splice cost. If you do, add this card's effects to that spell.)", "type": "Instant — Arcane", "types": ["Instant"], "uuid": "71d3c3a9-170a-5869-b264-55eef08358c4"}