{"artist": "Gabor Szikszai", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 6.0, "edhrecRank": 16758, "finishes": ["nonfoil", "foil"], "flavorText": "When all you have is a warhammer, every face looks like a nail.", "foreignData": [{"flavorText": "Wenn du nichts als einen Kriegshammer hast, sieht jedes Gesicht aus wie ein Nagel.", "language": "German", "multiverseId": 555617, "name": "Rhox-Prügler", "text": "Der Rhox-Prügler kommt mit einer Schildmarke ins Spiel. (Falls ihm Schaden zugefügt oder er zerstört würde, entferne stattdessen eine Schildmarke von ihm.)\nDer Rhox-Prügler verursacht Trampelschaden, solange eine Schildmarke auf ihm liegt.", "type": "Kreatur — Nashorn, Soldat"}, {"flavorText": "Cuando solo tienes un martillo de guerra, cada cara te parece un clavo.", "language": "Spanish", "multiverseId": 555878, "name": "Machacador rhox", "text": "El Machacador rhox entra al campo de batalla con un contador de escudo sobre él. (Si fuera a recibir daño o a ser destruido, en vez de eso, remueve un contador de escudo de él.)\nEl Machacador rhox tiene la habilidad de arrollar mientras tenga un contador de escudo sobre él.", "type": "Criatura — Soldado rinoceronte"}, {"flavorText": "Quand on n'a qu'un marteau de guerre, tous les visages ressemblent à des clous.", "language": "French", "multiverseId": 556139, "name": "Marteleur rhox", "text": "Le Marteleur rhox arrive sur le champ de bataille avec un marqueur « bouclier » sur lui. (S'il devait subir des blessures ou être détruit, retirez-lui un marqueur « bouclier » à la place.)\nLe Marteleur rhox a le piétinement tant qu'il a au moins un marqueur « bouclier » sur lui.", "type": "Créature : rhinocéros et soldat"}, {"flavorText": "Quando tutto quel che hai è un martello da guerra, ogni faccia sembra un chiodo.", "language": "Italian", "multiverseId": 556400, "name": "Rhox Assaltatore", "text": "Il Rhox Assaltatore entra nel campo di battaglia con un segnalino scudo. (Se sta per subire danno o sta per essere distrutto, rimuovi invece un segnalino scudo da esso.)\nIl Rhox Assaltatore ha travolgere fintanto che ha un segnalino scudo.", "type": "Creatura — Soldato Rinoceronte"}, {"flavorText": "手元にあるのが戦槌ただ一つだと、すべての顔が釘に見える。", "language": "Japanese", "multiverseId": 556661, "name": "ロウクスの打撃手", "text": "ロウクスの打撃手は盾カウンター１個が置かれた状態で戦場に出る。（これがダメージを受けるか破壊されるなら、代わりにこれの上から盾カウンター１個を取り除く。）\nロウクスの打撃手の上に盾カウンターがあるかぎり、これはトランプルを持つ。", "type": "クリーチャー — サイ・兵士"}, {"flavorText": "전쟁망치를 들고 있으면, 얼굴들이 다 못처럼 보이기 마련이다.", "language": "Korean", "multiverseId": 556922, "name": "록스 난투꾼", "text": "록스 난투꾼은 방패 카운터 한 개를 가지고 전장에 들어온다. (이 생물이 피해를 입거나 파괴되려 한다면, 대신 이 생물에서 방패 카운터 한 개를 제거한다.)\n록스 난투꾼은 방패 카운터를 가지고 있는 한 돌진을 가진다.", "type": "생물 — 코뿔소 병사"}, {"flavorText": "Quando você só tem uma marreta, todo mundo tem cara de prego.", "language": "Portuguese (Brazil)", "multiverseId": 557183, "name": "Esmurrador Rhox", "text": "Esmurrador Rhox entra no campo de batalha com um marcador de escudo. (Se ele sofreria dano ou seria destruído, em vez disso, remova um marcador de escudo dele.)\nEsmurrador Rhox terá atropelar enquanto tiver um marcador de escudo.", "type": "Criatura — Rinoceronte Soldado"}, {"flavorText": "Когда у тебя есть только боевой молот, каждое лицо становится похожим на гвоздь.", "language": "Russian", "multiverseId": 557444, "name": "Рокс-Молотобоец", "text": "Рокс-Молотобоец выходит на поле битвы с одним жетоном щита на нем. (Если он должен получить повреждения или быть уничтожен, вместо этого удалите с него один жетон щита.)\nРокс-Молотобоец имеет Пробивной удар, пока на нем есть жетон щита.", "type": "Существо — Носорог Солдат"}, {"flavorText": "如果手上只有一把战锤，那每张脸看上去都像是钉子。", "language": "Chinese Simplified", "multiverseId": 557705, "name": "猛击罗克", "text": "猛击罗克进战场时上面有一个后盾指示物。（如果它将受到伤害或将被消灭，则改为从其上移去一个后盾指示物。）\n只要猛击罗克上有后盾指示物，它便具有践踏异能。", "type": "生物 ～犀牛／士兵"}, {"flavorText": "如果手上只有一把戰鎚，那每張臉看上去都像是釘子。", "language": "Chinese Traditional", "multiverseId": 557966, "name": "猛擊羅克", "text": "猛擊羅克進戰場時上面有一個後盾指示物。（如果它將受到傷害或將被消滅，則改為從其上移去一個後盾指示物。）\n只要猛擊羅克上有後盾指示物，它便具有踐踏異能。", "type": "生物 ～犀牛／士兵"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "259122", "cardKingdomId": "258787", "cardsphereId": "86820", "mcmId": "652200", "mcmMetaId": "406811", "mtgArenaId": "80306", "mtgjsonV4Id": "01975833-7e52-5780-9807-a8a9d3c4d28e", "mtgoId": "98529", "multiverseId": "555356", "scryfallId": "c99f5b02-16b9-4672-b0ec-f77662e9de76", "scryfallIllustrationId": "707cf5a6-281e-4db9-94f4-a5e91a6047e9", "scryfallOracleId": "898c8415-8769-48c4-ad16-a4ba8c3d5d7d", "tcgplayerProductId": "269113"}, "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{5}{G}", "manaValue": 6.0, "name": "Rhox Pummeler", "number": "155", "originalText": "Rhox Pummeler enters the battlefield with a shield counter on it. (If it would be dealt damage or destroyed, remove a shield counter from it instead.)\nRhox Pummeler has trample as long as it has a shield counter on it.", "originalType": "Creature — Rhino Soldier", "power": "6", "printings": ["SNC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d4054070df3a9e79", "cardKingdomFoil": "https://mtgjson.com/links/fb24c5c77aae050c", "cardmarket": "https://mtgjson.com/links/f8d116772dc127d5", "tcgplayer": "https://mtgjson.com/links/b76749e2413e9341"}, "rarity": "common", "rulings": [{"date": "2022-04-29", "text": "Combat damage is assigned to creatures and players and then dealt simultaneously. Notably, this means blocking a Rhox Pummeler with a shield counter on it won't normally prevent Rhox Pummeler from dealing damage to the defending player due to its trample ability."}, {"date": "2022-04-29", "text": "If an attacking Rhox Pummeler with one shield counter on it is blocked by a creature with first strike, the shield counter will be removed in the first combat damage step. In that case, Rhox Pummeler won't have trample when it deals combat damage in the second combat damage step."}, {"date": "2022-04-29", "text": "Shield counters don't prevent players from sacrificing creatures."}, {"date": "2022-04-29", "text": "Removing a shield counter in this way isn't the same as regenerating a creature."}, {"date": "2022-04-29", "text": "If a permanent that would be dealt damage has more than one shield counter on it, that damage is prevented and only one shield counter is removed."}, {"date": "2022-04-29", "text": "If a permanent with a shield counter is dealt unpreventable damage, that damage will be dealt and a shield counter will still be removed."}, {"date": "2022-04-29", "text": "A creature with a shield counter on it may still be destroyed by state-based actions if it has damage marked on it equal to its toughness or has been dealt unpreventable damage by a source with deathtouch."}, {"date": "2022-04-29", "text": "“Shield” is not an ability that creatures have and shield counters are not keyword counters. If a creature with a shield counter loses its abilities, the shield counter will still protect it as normal."}], "setCode": "SNC", "subtypes": ["Rhino", "Soldier"], "supertypes": [], "text": "Rhox Pummeler enters the battlefield with a shield counter on it. (If it would be dealt damage or destroyed, remove a shield counter from it instead.)\nRhox Pummeler has trample as long as it has a shield counter on it.", "toughness": "3", "type": "Creature — Rhino Soldier", "types": ["Creature"], "uuid": "0feb75ff-f8d4-53c4-9b8a-5a6dba31d990", "watermark": "brokers"}