{"artist": "Izzy", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G", "R", "U"], "colors": ["G", "R", "U"], "convertedManaCost": 5.0, "edhrecRank": 5527, "finishes": ["foil"], "foreignData": [], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": false, "identifiers": {"mtgjsonV4Id": "e8ab9ba4-744f-5ff2-90c3-18478bf948b5", "mtgoId": "51536", "scryfallId": "cb07b0b3-8727-4a10-91f6-6ddb3c41c17b", "scryfallIllustrationId": "3adc962b-483d-4b31-8da2-4c1bfad74513", "scryfallOracleId": "f697c78d-7e4f-4320-bfc6-2a25e6d7dc94"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}{U}{R}", "manaValue": 5.0, "name": "Riku of Two Reflections", "number": "51536", "originalReleaseDate": "2014-02-13", "power": "2", "printings": ["2XM", "CMD", "J14", "OCMD", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2011-09-22", "text": "Each time the first ability triggers, you can pay {U}{R} only one time to get one copy of the spell. Each time the second ability triggers, you can pay {G}{U} only one time to get one token."}, {"date": "2011-09-22", "text": "If the spell that caused Riku's first ability to trigger has left the stack by the time the ability resolves, you can still pay {U}{R}. If you do, you'll copy the spell as it last existed on the stack."}, {"date": "2011-09-22", "text": "Riku's first ability triggers whenever you cast any instant or sorcery spell, regardless of whether that spell has targets."}, {"date": "2011-09-22", "text": "If the copied spell has {X} in its mana cost, the value of X is copied."}, {"date": "2011-09-22", "text": "If the copied spell is modal (that is, it says “Choose one —” or the like), the copy has the same mode as the original spell. You can't choose a different one."}, {"date": "2011-09-22", "text": "You can't pay any additional costs for the copy. However, effects based on any additional costs paid for the original spell are copied as though those same costs were paid for the copy. Notably, if the original spell was kicked (or kicked a certain number of times), the copy will also be kicked (or kicked that many times)."}, {"date": "2011-09-22", "text": "If the creature that caused Riku's second ability to trigger has already left the battlefield by the time the ability resolves, you can still pay {G}{U}. If you do, you'll still put a token onto the battlefield. That token has the copiable values of the characteristics of that creature as it last existed on the battlefield."}, {"date": "2011-09-22", "text": "As the token is created, it checks the printed values of the creature it's copying, as well as any copy effects that have been applied to it."}, {"date": "2011-09-22", "text": "The copiable values of the token's characteristics are the same as the copiable values of the characteristics of the creature it's copying."}, {"date": "2011-09-22", "text": "If the creature had {X} in its mana cost, X must be 0. Note this is different from an {X} found in the mana cost of a copied spell."}], "setCode": "PRM", "subtypes": ["Human", "Wizard"], "supertypes": ["Legendary"], "text": "Whenever you cast an instant or sorcery spell, you may pay {U}{R}. If you do, copy that spell. You may choose new targets for the copy.\nWhenever another nontoken creature enters the battlefield under your control, you may pay {G}{U}. If you do, create a token that's a copy of that creature.", "toughness": "2", "type": "Legendary Creature — Human Wizard", "types": ["Creature"], "uuid": "650960cb-814e-53e0-b685-1dc20c52f66b"}