{"artist": "Franz Vohwinkel", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R", "U"], "colors": ["R", "U"], "convertedManaCost": 2.0, "edhrecRank": 23789, "finishes": ["nonfoil", "foil"], "flavorText": "Mimics don't hide their natural form well, but their disguises work well enough on boggarts.", "foreignData": [{"flavorText": "Nachäffer können ihre natürliche Gestalt nur schwer verbergen, doch zum Täuschen von Boggarts reicht es dennoch.", "language": "German", "multiverseId": 181639, "name": "Wasserfall-Nachäffer", "text": "Immer wenn du einen Zauberspruch spielst, der sowohl blau als auch rot ist, wird der Wasserfall-Nachäffer 3/3 und ist unblockbar (beides bis zum Ende des Zuges).", "type": "Kreatur — Gestaltwandler"}, {"flavorText": "Los mímicos no esconden bien su forma natural, pero sus disfraces funcionan muy bien con los boggarts.", "language": "Spanish", "multiverseId": 180739, "name": "Mímico de la cascada", "text": "Siempre que juegues un hechizo que sea azul y rojo, el Mímico de la cascada se convierte en 3/3 y es imbloqueable hasta el final del turno.", "type": "Criatura — Metamorfo"}, {"flavorText": "Les mimiques ne dissimulent pas particulièrement bien leur forme naturelle, mais leurs déguisements suffisent à bluffer les boggarts.", "language": "French", "multiverseId": 181819, "name": "Mimique de la cascade", "text": "À chaque fois que vous jouez un sort qui est à la fois bleu et rouge, le Mimique de la cascade devient 3/3 et il est imblocable jusqu'à la fin du tour.", "type": "Créature : changeforme"}, {"flavorText": "I mimic non nascondono molto bene la loro forma naturale, ma i loro mascheramenti funzionano abbastanza bene coi boggart.", "language": "Italian", "multiverseId": 181459, "name": "Mimic della Cascata", "text": "Ogniqualvolta giochi una magia blu e rossa, il Mimic della Cascata diventa 3/3 e non può essere bloccato fino alla fine del turno.", "type": "Creatura — Polimorfo"}, {"flavorText": "ミミックは元の姿をうまく隠さないが、ボガートに対しては十分にうまく化ける。", "language": "Japanese", "multiverseId": 181099, "name": "川滝のミミック", "text": "あなたが青であり赤である呪文をプレイするたび、川滝のミミックはターン終了時まで３/３になるとともにブロックされない。", "type": "クリーチャー — 多相の戦士"}, {"flavorText": "Os mímicos não sabem esconder bem sua verdadeira forma, mas seu disfarce funciona bem com os papões.", "language": "Portuguese (Brazil)", "multiverseId": 181999, "name": "Mímico da Cachoeira", "text": "Toda vez que você joga uma mágica que é azul e vermelha, Mímico da Cachoeira torna-se 3/3 e não pode ser bloqueado até o final do turno.", "type": "Criatura — Metamorfo"}, {"flavorText": "Подражатели не очень искусно скрывают свой истинный облик, но их маскировка вполне срабатывает на боггартов.", "language": "Russian", "multiverseId": 181279, "name": "Подражатель Водопада", "text": "Каждый раз, когда вы разыгрываете заклинание, которое одновременно является и синим и красным, Подражатель Водопада становится 3/3 и не может быть заблокирован до конца хода.", "type": "Существо — Имитатор"}, {"flavorText": "拟态妖不太擅长隐藏原形，但其伪装已足以对付波尬。", "language": "Chinese Simplified", "multiverseId": 180919, "name": "河瀑拟态妖", "text": "每当你使用一个含蓝红双色的咒语时，河瀑拟态妖成为3/3 且不能被阻挡直到回合结束。", "type": "生物～变形兽"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "125465", "cardKingdomId": "125259", "cardsphereId": "17065", "mcmId": "19573", "mcmMetaId": "9961", "mtgjsonV4Id": "dd225dbb-cca8-5e7a-a8a1-550ea4040439", "mtgoFoilId": "29963", "mtgoId": "29962", "multiverseId": "151068", "scryfallId": "bc5ed3ce-d7f7-4275-baef-edc5127475d7", "scryfallIllustrationId": "592d3230-dc98-40ab-ac96-253ee22a13e9", "scryfallOracleId": "16948dd9-959b-4972-b337-37ecc2b141bd", "tcgplayerProductId": "27191"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U/R}", "manaValue": 2.0, "name": "Riverfall Mimic", "number": "111", "originalText": "Whenever you play a spell that's both blue and red, Riverfall Mimic becomes 3/3 and is unblockable until end of turn.", "originalType": "Creature - Shapeshifter", "power": "2", "printings": ["EVE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6e8da0f648d14f9f", "cardKingdomFoil": "https://mtgjson.com/links/95a03f89c62dd262", "cardmarket": "https://mtgjson.com/links/c91efb98a04d4efb", "tcgplayer": "https://mtgjson.com/links/9c6686d53d40e38f"}, "rarity": "common", "rulings": [{"date": "2008-08-01", "text": "The ability triggers whenever you cast a spell that’s both of its listed colors. It doesn’t matter whether that spell also happens to be any other colors."}, {"date": "2008-08-01", "text": "If you cast a spell that’s the two appropriate colors for the second time in a turn, the ability triggers again. The Mimic will once again become the power and toughness stated in its ability, which could overwrite power- and toughness-setting effects that have been applied to it in the meantime."}, {"date": "2008-08-01", "text": "Any other abilities the Mimic may have gained are not affected."}, {"date": "2009-10-01", "text": "The effect from the ability overwrites other effects that set power and/or toughness if and only if those effects existed before the ability resolved. It will not overwrite effects that modify power or toughness (whether from a static ability, counters, or a resolved spell or ability), nor will it overwrite effects that set power and toughness which come into existence after the ability resolves. Effects that switch the creature’s power and toughness are always applied after any other power or toughness changing effects, including this one, regardless of the order in which they are created."}], "setCode": "EVE", "subtypes": ["Shapeshifter"], "supertypes": [], "text": "Whenever you cast a spell that's both blue and red, Riverfall Mimic has base power and toughness 3/3 until end of turn and can't be blocked this turn.", "toughness": "1", "type": "Creature — Shapeshifter", "types": ["Creature"], "uuid": "7427aa05-545a-549a-8970-c91685109622"}