{"artist": "John Avon", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 5.0, "edhrecRank": 19082, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 140551, "name": "Eintrübender Schrecken", "text": "Stärke und Widerstandskraft des Eintrübenden Schreckens sind gleich der Anzahl deiner Lebenspunkte minus der Lebenspunkte des Gegners mit den meisten Lebenspunkten.\nAussetzen X {X}{B}{B}{B}. X kann nicht 0 betragen.\nImmer wenn eine Zeitmarke vom Eintrübenden Schrecken entfernt wird, während er ganz aus dem Spiel entfernt ist, verliert ein Gegner deiner Wahl 1 Lebenspunkt, und du erhältst 1 Lebenspunkt dazu.", "type": "Kreatur — Schrecken"}, {"language": "Spanish", "multiverseId": 141271, "name": "Horror enojado", "text": "Tanto la fuerza como la resistencia del Horror enojado son iguales a tu total de vidas menos el total de vidas del oponente con más vidas.\nSuspender X—{X}{B}{B}{B}. X no puede ser 0.\nSiempre que se remueva un contador de tiempo del Horror enojado mientras está removido del juego, el jugador objetivo pierde 1 vida y tú ganas 1 vida.", "type": "Criatura — Horror"}, {"language": "French", "multiverseId": 140431, "name": "Horreur turbide", "text": "La force et l'endurance de l'Horreur turbide sont chacune égale à votre total de points de vie, moins le total de points de vie de l'adversaire qui a le plus de points de vie.\nSuspension X — {X}{B}{B}{B} X ne peut pas être 0.\nÀ chaque fois qu'un marqueur « temps » est retiré de l'Horreur turbide pendant qu'elle est retirée de la partie, le joueur ciblé perd 1 point de vie et vous gagnez 1 point de vie.", "type": "Créature : horreur"}, {"language": "Italian", "multiverseId": 140671, "name": "Orrore Irritante", "text": "La forza e la costituzione dell'Orrore Irritante sono pari ai tuoi punti vita meno i punti vita dell'avversario con più punti vita.\nSospendere X—{X}{B}{B}{B}. X non può essere 0.\nOgniqualvolta un segnalino tempo viene rimosso dall'Orrore Irritante mentre è rimosso dal gioco, un giocatore bersaglio perde 1 punto vita e tu guadagni 1 punto vita.", "type": "Creatura — Orrore"}, {"language": "Japanese", "multiverseId": 140911, "name": "掻き乱す恐怖", "text": "掻き乱す恐怖のパワーとタフネスは、それぞれあなたのライフの総量から最も多いライフを持つ対戦相手１人のライフの総量を引いた点数に等しい。\n待機 Ｘ―{X}{B}{B}{B}. Ｘは０にできない。\n掻き乱す恐怖がゲームから取り除かれている間にそれの上から時間カウンターが取り除かれるたび、プレイヤー１人を対象とする。そのプレイヤーは１点のライフを失い、あなたは１点のライフを得る。", "type": "クリーチャー — ホラー"}, {"language": "Portuguese (Brazil)", "multiverseId": 141031, "name": "Horror Enervante", "text": "O poder e a resistência de Horror Enervante são ambos iguais ao seu total de pontos de vida menos o total de pontos de vida de um oponente com o maior número de pontos.\nSuspender X {X}{B}{B}{B}. X não pode ser igual a 0.\nToda vez que um marcador temporal for removido de Horror Enervante enquanto ele estiver removido do jogo, o jogador alvo perderá 1 ponto de vida e você ganhará 1 ponto de vida.", "type": "Criatura — Horror"}, {"language": "Russian", "multiverseId": 141151, "name": "Досаждающий Ужас", "text": "Сила и защита Досаждающего Ужаса равны вашему количеству жизни минус количество жизни у оппонента с наибольшим количеством жизни.\nОтсрочка X {X}{B}{B}{B}. X не может равняться нулю.\nКогда удаляется жетон времени с Досаждающего Ужаса, пока он удален из игры, целевой игрок теряет 1 жизнь, а вы получаете 1 жизнь.", "type": "Существо — Ужас"}, {"language": "Chinese Simplified", "multiverseId": 141391, "name": "翻搅惊惧兽", "text": "将你的总生命减去生命值最多的对手之总生命，翻搅惊惧兽的力量和防御力各等同于此数字。\n延缓X～{X}{B}{B}{B}。 X不能为0。\n于翻搅惊惧兽被移出对战的期间，每当移去其上一个计时指示物时，目标牌手失去1点生命且你获得1点生命。", "type": "生物～惊惧兽"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "122169", "cardKingdomId": "121995", "cardsphereId": "35381", "mcmId": "14258", "mcmMetaId": "8665", "mtgjsonV4Id": "aaac4a64-b836-5fc5-9d4a-2162f9efc84b", "mtgoFoilId": "26284", "mtgoId": "26283", "multiverseId": "122431", "scryfallId": "f83006a5-c42b-4083-a246-f46b25412150", "scryfallIllustrationId": "d9f96c3c-7292-4b1a-bfee-798758c054de", "scryfallOracleId": "52be9dd0-72f4-408b-ae3b-17a0362c2681", "tcgplayerProductId": "14796"}, "keywords": ["Suspend"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}{B}", "manaValue": 5.0, "name": "Roiling Horror", "number": "79", "originalText": "Roiling Horror's power and toughness are each equal to your life total minus the life total of an opponent with the most life.\nSuspend X—{X}{B}{B}{B}. X can't be 0.\nWhenever a time counter is removed from Roiling Horror while it's removed from the game, target player loses 1 life and you gain 1 life.", "originalType": "Creature - Horror", "power": "*", "printings": ["PLC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7071c0dd98877aee", "cardKingdomFoil": "https://mtgjson.com/links/7b571525b0d749a2", "cardmarket": "https://mtgjson.com/links/eabe51c4b9ada7f2", "tcgplayer": "https://mtgjson.com/links/8e2b065e963e9276"}, "rarity": "rare", "rulings": [{"date": "2007-02-01", "text": "You never choose an opponent, and the opponent that Roiling Horror looks at is never “locked in.” Roiling Horror continuously looks at the life totals of all opponents and uses whichever value is the largest."}, {"date": "2007-02-01", "text": "If your life total is less than or equal to the life total of the opponent with the most life, Roiling Horror’s toughness is 0 or less. It will be put into its owner’s graveyard as a state-based action."}, {"date": "2021-06-18", "text": "If this is suspended, then when the last time counter is removed from it, both its triggered ability and the “cast this spell” part of the suspend ability will trigger. They can be put on the stack in either order."}, {"date": "2021-06-18", "text": "The mana value of a spell cast without paying its mana cost is determined by its mana cost, even though that cost wasn’t paid."}, {"date": "2021-06-18", "text": "A creature cast using suspend will enter the battlefield with haste. It will have haste until another player gains control of it. (In some rare cases, another player may gain control of the creature spell itself. If this happens, the creature won’t enter the battlefield with haste.)"}, {"date": "2021-06-18", "text": "Suspend is a keyword that represents three abilities. The first is a static ability that allows you to exile the card from your hand with the specified number of time counters (the number before the dash) on it by paying its suspend cost (listed after the dash). The second is a triggered ability that removes a time counter from the suspended card at the beginning of each of your upkeeps. The third is a triggered ability that causes you to cast the card when the last time counter is removed. If you cast a creature spell this way, it gains haste until you lose control of that creature (or, in rare cases, you lose control of the creature spell while it’s on the stack)."}, {"date": "2021-06-18", "text": "You can exile a card in your hand using suspend any time you could cast that card. Consider its card type, any effects that modify when you could cast it (such as flash) and any other effects that stop you from casting it (such as from Meddling Mage’s ability) to determine if and when you can do this. Whether you could actually complete all steps in casting the card is irrelevant. For example, you can exile a card with suspend that has no mana cost or that requires a target even if no legal targets are available at that time."}, {"date": "2021-06-18", "text": "Cards exiled with suspend are exiled face up."}, {"date": "2021-06-18", "text": "Exiling a card with suspend isn’t casting that card. This action doesn’t use the stack and can’t be responded to."}, {"date": "2021-06-18", "text": "If the spell requires any targets, those targets are chosen when the spell is finally cast, not when it’s exiled."}, {"date": "2021-06-18", "text": "If an effect refers to a “suspended card,” that means a card that (1) has suspend, (2) is in exile, and (3) has one or more time counters on it."}, {"date": "2021-06-18", "text": "If the first triggered ability of suspend (the one that removes time counters) is countered, no time counter is removed. The ability will trigger again at the beginning of the card’s owner’s next upkeep."}, {"date": "2021-06-18", "text": "When the last time counter is removed, the second triggered ability of suspend (the one that lets you cast the card) triggers. It doesn’t matter why the last time counter was removed or what effect removed it."}, {"date": "2021-06-18", "text": "If the second triggered ability is countered, the card can’t be cast. It remains exiled with no time counters on it, and it’s no longer suspended."}, {"date": "2021-06-18", "text": "As the second triggered ability resolves, you must cast the card if able. You must do so even if it requires targets and the only legal targets are ones that you really don’t want to target. Timing permissions based on the card’s type are ignored."}, {"date": "2021-06-18", "text": "If you can’t cast the card, perhaps because there are no legal targets available, it remains exiled with no time counters on it, and it’s no longer suspended."}, {"date": "2021-06-18", "text": "If you cast a card “without paying its mana cost,” such as with suspend, you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those if you want to cast the card."}, {"date": "2021-06-18", "text": "You are never forced to activate mana abilities to pay costs, so if there is a mandatory additional mana cost (such as from Thalia, Guardian of Thraben), you can decline to activate mana abilities to pay for it and hence fail to cast the suspended card, leaving it in exile."}, {"date": "2021-06-18", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}], "setCode": "PLC", "subtypes": ["Horror"], "supertypes": [], "text": "Roiling Horror's power and toughness are each equal to your life total minus the life total of an opponent with the most life.\nSuspend X—{X}{B}{B}{B}. X can't be 0. (Rather than cast this card from your hand, you may pay {X}{B}{B}{B} and exile it with X time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost. It has haste.)\nWhenever a time counter is removed from Roiling Horror while it's exiled, target player loses 1 life and you gain 1 life.", "toughness": "*", "type": "Creature — Horror", "types": ["Creature"], "uuid": "71bf23ea-9a1f-545b-9a42-5f8b30767261"}