{"artist": "Mathias Kollros", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R", "U"], "colors": ["R", "U"], "convertedManaCost": 3.0, "edhrecRank": 5259, "finishes": ["nonfoil", "foil"], "flavorText": "Uthlon the Wise scandalized sphinx society, hooting the answers to riddles as he rampaged through Tin Street. Grangle, on the other hand, sat for hours, deep in thought, largely ignored by fellow goblins.", "foreignData": [{"flavorText": "Uthlon der Weise schockierte die Sphinx-Gesellschaft, weil er durch die Zinnstraße polterte und dabei Rätselantworten hinausposaunte. Grangle dagegen saß stundenlang gedankenversunken da und wurde von anderen Goblins bestenfalls ignoriert.", "language": "German", "multiverseId": 461405, "name": "Rollentausch", "text": "Tausche die Kontrolle über zwei bleibende Karten deiner Wahl, die einen Typ bleibender Karten gemeinsam haben.", "type": "Hexerei"}, {"flavorText": "Uthlon el Sabio escandalizó a todas las esfinges cuando salió a arrasar la Calle Hojalata mientras vociferaba las respuestas de los acertijos. Por su parte, Grangle se quedó sentado durante horas, sumido en sus pensamientos e ignorado por los demás trasgos.", "language": "Spanish", "multiverseId": 461669, "name": "Inversión de papeles", "text": "Intercambia el control de dos permanentes objetivo que compartan un tipo de permanente.", "type": "Conjuro"}, {"flavorText": "Uthlon le sage fit scandale chez les sphinx, tonitruant les réponses à des énigmes tandis qu'il saccageait la rue d'étain. Grangleuh, en revanche, resta plongé dans ses pensées pendant des heures, largement ignoré par les autres gobelins.", "language": "French", "multiverseId": 461933, "name": "Inversion des rôles", "text": "Échangez le contrôle de deux permanents ciblés qui partagent un type de permanent.", "type": "Rituel"}, {"flavorText": "Uthlon il Saggio scandalizzò la società delle sfingi gridando risposte di enigmi mentre imperversava per Via Latta. Grangle, al contrario, rimase seduto per ore, immerso nei suoi pensieri e del tutto ignorato dagli altri goblin.", "language": "Italian", "multiverseId": 462197, "name": "Inversione di Ruoli", "text": "Scambia il controllo di due permanenti bersaglio che condividono un tipo di permanente.", "type": "Stregoneria"}, {"flavorText": "賢きウスロンはスフィンクス社会の不評を買った。ブリキ通りに殴り込んだばかりか謎かけの答えを言いふらしたからだ。グラングルの方はというと、何時間も座り込んで深く冥想し、仲間のゴブリンから無視されただけだった。", "language": "Japanese", "multiverseId": 462461, "name": "役割交代", "text": "共通のパーマネント・タイプを持つパーマネント２つを対象とし、それらのコントロールを交換する。", "type": "ソーサリー"}, {"flavorText": "현자 우슬란은 깡통 거리에서 날뛰며 수수께끼들의 대답에 폭소를 터뜨리며 스핑크스 사회를 아연실색하게 만들었다. 이와는 정반대로, 그랑글은 오래도록 생각에 잠긴 채로 앉아 있었고, 다른 고블린들은 대체로 그를 무시했다.", "language": "Korean", "multiverseId": 462725, "name": "역할 반전", "text": "지속물 유형을 공유하는 지속물 두 개를 목표로 정한다. 두 지속물의 조종권을 교환한다.", "type": "집중마법"}, {"flavorText": "Uthlon, o Sábio, escandalizou a sociedade esfíngica berrando respostas de enigmas enquanto aterrorizava a Rua do Estanho. Grengo, por outro lado, ficou horas sentado, perdido em pensamentos, praticamente ignorado pelos outros goblins.", "language": "Portuguese (Brazil)", "multiverseId": 462989, "name": "Inversão de Papéis", "text": "Permute o controle de duas permanentes alvo que compartilhem um tipo de permanente.", "type": "Feitiço"}, {"flavorText": "Утлон Мудрый вызвал пересуды в обществе сфинксов, беснуясь на улице Жестянщиков и выкрикивая ответы на загадки. Грангель, с другой стороны, много часов сидел, погруженный в раздумья, и остальные гоблины его не особенно замечали.", "language": "Russian", "multiverseId": 463253, "name": "Обмен Ролями", "text": "Обменяйте контроль над двумя целевыми перманентами, у которых есть один и тот же тип перманента.", "type": "Волшебство"}, {"flavorText": "智者乌斯隆的作为大出所有史芬斯的意料：他在锡街上四处跳窜，尖啸着喊出谜语的答案。而戈兰格则蹲坐数小时，陷入沉思，很多鬼怪同胞无视他的存在。", "language": "Chinese Simplified", "multiverseId": 463517, "name": "角色反转", "text": "选择两个目标具共通永久物类别的永久物。交换两者的操控权。", "type": "法术"}, {"flavorText": "智者烏斯隆的作為大出所有史芬斯的意料：他在錫街上四處跳竄，尖嘯著喊出謎語的答案。而戈蘭格則蹲坐數小時，陷入沉思，很多鬼怪同胞無視他的存在。", "language": "Chinese Traditional", "multiverseId": 463781, "name": "角色反轉", "text": "選擇兩個目標具共通永久物類別的永久物。交換兩者的操控權。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "224455", "cardKingdomId": "224143", "cardsphereId": "59447", "mcmId": "371977", "mcmMetaId": "269393", "mtgArenaId": "69663", "mtgjsonV4Id": "83e7abfe-18d6-5913-ae07-07f9cc04e00c", "mtgoId": "72034", "multiverseId": "461141", "scryfallId": "59b47017-d982-4d4c-94fc-f265a5b7f36a", "scryfallIllustrationId": "a619b93d-03de-4735-abcb-98d417652666", "scryfallOracleId": "8be783b2-7394-411a-8ab5-a8fffe8d714c", "tcgplayerProductId": "188125"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{U}{U}{R}", "manaValue": 3.0, "name": "Role Reversal", "number": "214", "originalText": "Exchange control of two target permanents that share a permanent type.", "originalType": "Sorcery", "printings": ["PWAR", "WAR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/34ef9e2b492bb06a", "cardKingdomFoil": "https://mtgjson.com/links/bd2bf04b67c934e1", "cardmarket": "https://mtgjson.com/links/d834febec2b2a737", "tcgplayer": "https://mtgjson.com/links/959e7a818a3bc688"}, "rarity": "rare", "rulings": [{"date": "2019-05-03", "text": "Gaining control of a permanent doesn’t cause you to gain control of any Auras or Equipment attached to it."}, {"date": "2019-05-03", "text": "If one of the target permanents is an illegal target when Role Reversal resolves, the exchange won’t happen."}, {"date": "2019-05-03", "text": "Role Reversal’s effect lasts indefinitely. It doesn’t wear off during the cleanup step, and it doesn’t expire if the permanents stop sharing a permanent type after Role Reversal has resolved."}, {"date": "2019-05-03", "text": "You don’t have to control either target permanent."}, {"date": "2019-05-03", "text": "If the same player controls both permanents when Role Reversal resolves, nothing happens."}, {"date": "2019-05-03", "text": "The permanent types are artifact, creature, enchantment, land, and planeswalker. Supertypes, like legendary, aren’t permanent types. For example, you can’t exchange control of a legendary creature with a legendary planeswalker."}], "securityStamp": "oval", "setCode": "WAR", "subtypes": [], "supertypes": [], "text": "Exchange control of two target permanents that share a permanent type.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "fc24aaad-c086-589a-b869-f38c18b35193"}