{"artist": "Steve Prescott", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "flavorText": "\"Don't come back until you've got brains in your teeth.\"", "foreignData": [], "frameVersion": "2003", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "131278", "mcmId": "240652", "mtgjsonV4Id": "96df2f09-7373-5f9c-a49d-e30ef6105ffd", "multiverseId": "212583", "scryfallId": "5fedc387-8479-4bff-9378-93789f3ce8a0", "scryfallIllustrationId": "3d997abc-f9c0-48d2-bf0b-e3d3ed48bfe4", "scryfallOracleId": "5056d7df-aebf-4a2b-b782-05a630302759", "tcgplayerProductId": "37214"}, "isOversized": true, "isStarter": true, "language": "English", "layout": "scheme", "legalities": {}, "manaValue": 0.0, "name": "Rotted Ones, Lay Siege", "number": "38★", "originalText": "When you set this scheme in motion, for each opponent, put a 2/2 black Zombie creature token onto the battlefield that attacks that player each combat if able.", "originalType": "Scheme", "printings": ["OARC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/405133f5c44d39f7", "tcgplayer": "https://mtgjson.com/links/28d719f8fdc93ea3"}, "rarity": "common", "rulings": [{"date": "2010-06-15", "text": "For each Zombie token you put onto the battlefield this way, make sure it’s clear who its designated player is. A token’s designated player won’t change for the rest of the game."}, {"date": "2010-06-15", "text": "Each of these Zombies must attack its designated player, not a planeswalker that player controls."}, {"date": "2010-06-15", "text": "If, during your declare attackers step, one of these Zombies is tapped or is affected by a spell or ability that says it can’t attack, then it doesn’t attack. If there’s a cost associated with having that creature attack, you aren’t forced to pay that cost, so it doesn’t have to attack in that case either."}, {"date": "2010-06-15", "text": "If one of these Zombies can’t attack its designated player during any given turn (because that player has left the game, due to a spell or ability such as Chronomantic Escape, or because a player on the opposing team has gained control of it, for example), it may attack another player, attack a planeswalker an opponent controls, or not attack at all. If there’s a cost with having that creature attack its designated player, you aren’t forced to pay that cost, so it may attack another player, attack a planeswalker an opponent controls, or not attack at all."}, {"date": "2010-06-15", "text": "If there are multiple combat phases in a turn, each of these Zombies must attack its designated player in each of them that it’s able to."}], "setCode": "OARC", "subtypes": [], "supertypes": [], "text": "When you set this scheme in motion, for each opponent, create a 2/2 black Zombie creature token that attacks that player each combat if able.", "type": "Scheme", "types": ["Scheme"], "uuid": "2370bfdc-639c-5a94-9c07-4e4263f01f93"}