{"artist": "Izzy", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 5.0, "edhrecRank": 3006, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "6ab4780c-051d-51a8-b840-d9884cdc1af7", "mtgoId": "90110", "scryfallId": "21a521a4-3834-47ec-a0ae-37497bf46f80", "scryfallIllustrationId": "66991033-d446-43bc-a829-4d70f4802c1a", "scryfallOracleId": "515c522f-51d5-4f6d-b9b1-ea3c7f6a378e"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Suspend"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}{R}", "manaValue": 5.0, "name": "Rousing Refrain", "number": "90110", "originalReleaseDate": "2021-05-01", "printings": ["C21", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-04-16", "text": "You can exile a card in your hand using suspend any time you could cast that card. Consider its card type, any effect that affects when you could cast it (such as flash) and any other effects that could stop you from casting it (such as Revel in Silence’s effect) to determine if and when you can do this. Whether or not you could actually complete all steps in casting the card is irrelevant. For example, you can exile a card with suspend that has no mana cost or requires a target even if no legal targets are available at that time."}, {"date": "2021-04-16", "text": "Exiling a card with suspend isn’t casting that card. This action doesn’t use the stack and can’t be responded to."}, {"date": "2021-04-16", "text": "If the spell requires any targets, those targets are chosen when the spell is finally cast, not when it’s exiled."}, {"date": "2021-04-16", "text": "If the first triggered ability of suspend (the one that removes time counters) is countered, no time counter is removed. The ability will trigger again during the card’s owner’s next upkeep."}, {"date": "2021-04-16", "text": "When the last time counter is removed, the second triggered ability of suspend will trigger. It doesn’t matter why the last time counter was removed or what effect removed it."}, {"date": "2021-04-16", "text": "If the second triggered ability of suspend (the one that lets you cast the card) is countered, the card can’t be cast. It remains exiled with no time counters on it, and it’s no longer suspended."}, {"date": "2021-04-16", "text": "As the second triggered ability resolves, you must cast the card if able. Timing restrictions based on the card’s type are ignored."}, {"date": "2021-04-16", "text": "If you can’t cast the card, perhaps because there are no legal targets available, it remains exiled with no time counters on it, and it’s no longer suspended."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Add {R} for each card in target opponent's hand. Until end of turn, you don't lose this mana as steps and phases end. Exile Rousing Refrain with three time counters on it.\nSuspend 3—{1}{R} (Rather than cast this card from your hand, you may pay {1}{R} and exile it with three time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "20ec9d1c-3bc5-5853-9406-d955fedfe310"}