{"artist": "Anna Steinbauer", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 6.0, "edhrecRank": 7245, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "245148", "cardsphereId": "77035", "mcmId": "557947", "mcmMetaId": "262742", "mtgjsonV4Id": "5ea05be1-89cd-5888-bca6-0fd234038f26", "scryfallId": "74374ac4-87e8-4872-b7b2-6cc009acd6d9", "scryfallIllustrationId": "055a61b6-bc7a-4689-ad35-59d6b6cb1f62", "scryfallOracleId": "e191976c-6ab1-4a23-aeb8-8a88bd4bd203", "tcgplayerProductId": "235263"}, "isReprint": true, "keywords": ["Partner", "Partner with"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "loyalty": "4", "manaCost": "{4}{R}{R}", "manaValue": 6.0, "name": "Rowan Kenrith", "number": "370", "originalReleaseDate": "2021-04-24", "printings": ["BBD", "CLB", "PBBD", "PLIST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/787977089b9f34b4", "cardmarket": "https://mtgjson.com/links/1591bd5311de36e2", "tcgplayer": "https://mtgjson.com/links/21157ac8bc84d2b9"}, "rarity": "mythic", "rulings": [{"date": "2018-06-08", "text": "Rowan's second ability targets only the player. Tapped creatures with hexproof that player controls will be dealt damage as that ability resolves."}, {"date": "2018-06-08", "text": "The ability of Will's emblem can copy any instant or sorcery spell, not just one with targets. Similarly, the ability of Rowan's emblem can copy any activated ability that isn't a mana ability. A mana ability is an ability that produces mana, not an ability that costs mana."}, {"date": "2018-06-08", "text": "The copy of the spell created by Will's emblem resolves before the original spell. The same is true of the copy of the activated ability created by Rowan's emblem."}, {"date": "2018-06-08", "text": "If you have two of Will's emblems, perhaps because Rowan's emblem copied Will's last ability, each one will copy a spell you cast. The same is true of Rowan's emblem in regard to abilities you activate."}, {"date": "2018-06-08", "text": "The ability of either Kenrith's emblem can copy the spell or ability even if that spell or ability is countered before the emblem's triggered ability resolves."}, {"date": "2018-06-08", "text": "The copy is created on the stack, so it's not “cast” or “activated.” Abilities that trigger when a player casts a spell or activates an ability (such as either emblem's own ability) won't trigger."}, {"date": "2018-06-08", "text": "The copy will have the same targets as the spell or ability it's copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can't choose a new legal target, then it remains unchanged (even if the current target is illegal)."}, {"date": "2018-06-08", "text": "If the spell or ability that's copied is modal (that is, it says “Choose one —” or the like), the copy will have the same mode. A different mode can't be chosen."}, {"date": "2018-06-08", "text": "If the spell or ability that's copied has an X whose value was determined as it was cast or activated (like Blaze does), the copy will have the same value of X."}, {"date": "2018-06-08", "text": "If the spell or ability has damage divided as it was cast or activated (like Chandra's Pyrohelix), the division can't be changed (although the targets receiving that damage still can)."}, {"date": "2018-06-08", "text": "The controller of a copied spell can't choose to pay any alternative or additional costs for the copy. However, effects based on any alternative or additional costs that were paid for the original spell are copied as though those same costs were paid for the copy. Similarly, for Rowan's emblem, effects based on non-mana costs that were paid for the original ability are copied as though those same costs were paid for the copy."}, {"date": "2018-06-08", "text": "The last abilities of Will and Rowan apply to Commander games only. They have no effect in other games."}, {"date": "2018-06-08", "text": "“Partner with [name]” represents two abilities. The first is a triggered ability: “When this permanent enters the battlefield, target player may search their library for a card named [name], reveal it, put it into their hand, then shuffle their library.”"}, {"date": "2018-06-08", "text": "Note that the target player searches their library (which may be affected by effects such as that of Stranglehold) and that the card they find is revealed, even though these words aren't included in the ability's reminder text."}, {"date": "2018-06-08", "text": "The second ability represented by the “partner with [name]” keyword modifies the rules for deck construction in the Commander variant and has no function outside of that variant. If a legendary creature card with “partner with [name]” is designated as your commander, the named legendary creature card can also be designated as your commander. For more information on the Commander variant, please visit Wizards.com/Commander."}, {"date": "2018-06-08", "text": "If your Commander deck has two commanders, you can only include cards whose own color identities are also found in your commanders' combined color identities. If Khorvath and Sylvia are your commanders, your deck may contain cards with red and/or white in their color identity, but not blue, black, or green."}, {"date": "2018-06-08", "text": "Both commanders start in the command zone, and the remaining 98 cards of your deck are shuffled to become your library."}, {"date": "2018-06-08", "text": "To have two commanders, both must have the partner ability (featured in the Magic: The Gathering—Commander™ (2016 Edition) set) or corresponding “partner with” abilities as the game begins. A creature with a “partner with” ability can't partner with any creature other than its designated partner. Losing a partner ability during the game doesn't cause either to cease to be your commander."}, {"date": "2018-06-08", "text": "Once the game begins, your two commanders are tracked separately. If you cast one, you won't have to pay an additional {2} the first time you cast the other. A player loses the game after having been dealt 21 damage from one of them, not from both of them combined. Command Beacon's effect puts one into your hand from the command zone, not both."}, {"date": "2018-06-08", "text": "An effect that checks whether you control your commander is satisfied if you control one or both of your two commanders."}, {"date": "2018-06-08", "text": "The triggered ability of the “partner with” keyword still triggers in a Commander game. If your other commander has somehow ended up in your library, you can find it. You can also target another player who might have that card in their library."}, {"date": "2018-06-08", "text": "Will's first ability overwrites all previous effects that set a creature's base power and toughness to specific values. Any power- or toughness-setting effects that start to apply after that ability resolves will overwrite this effect."}, {"date": "2018-06-08", "text": "If an affected creature gains an ability after Will's first ability resolves, it will keep that ability."}, {"date": "2018-06-08", "text": "Effects that raise or lower a creature's power and/or toughness, such as the effect of Titanic Growth, will apply to the creature no matter when they started to take effect. The same is true for any counters that change its power and/or toughness and effects that switch its power and toughness."}, {"date": "2018-06-08", "text": "If a creature affected by Rowan's first ability can't attack for any reason (such as being tapped or having come under that player's control that turn), then it doesn't attack. If there's a cost associated with having it attack, the player isn't forced to pay that cost, so it doesn't have to attack in that case either."}], "securityStamp": "oval", "setCode": "PLIST", "subtypes": ["Rowan"], "supertypes": ["Legendary"], "text": "[+2]: During target player's next turn, each creature that player controls attacks if able.\n[−2]: Rowan Kenrith deals 3 damage to each tapped creature target player controls.\n[−8]: Target player gets an emblem with \"Whenever you activate an ability that isn't a mana ability, copy it. You may choose new targets for the copy.\"\nPartner with Will Kenrith\nRowan Kenrith can be your commander.", "type": "Legendary Planeswalker — Rowan", "types": ["Planeswalker"], "uuid": "0be33ee1-940e-5918-9845-c17e5fa2f61d"}