{"artist": "Slawomir Maniak", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 7.0, "edhrecRank": 11371, "finishes": ["nonfoil", "foil"], "flavorText": "The Eldrazi continue to sweep through the wastes, compounding destruction that already seemed absolute.", "foreignData": [{"flavorText": "Die Eldrazi schweifen weiter durch die Ödnis und mehren die Zerstörung, die schon vollkommen schien.", "language": "German", "multiverseId": 402914, "name": "Trümmerverwerter", "text": "Wenn du den Trümmerverwerter wirkst, kannst du eine Karte, die ein Gegner besitzt, aus dem Exil auf den Friedhof dieses Spielers legen. Falls du dies tust, erhältst du 5 Lebenspunkte dazu.", "type": "Kreatur — Eldrazi, Verwerter"}, {"flavorText": "Los Eldrazi siguen barriendo los terrenos devastados, perfilando una destrucción que ya parecía absoluta.", "language": "Spanish", "multiverseId": 405007, "name": "Metabolizador de ruina", "text": "Cuando lances el Metabolizador de ruina, puedes poner en el cementerio de un oponente una carta del exilio de la que ese jugador sea propietario. Si lo haces, ganas 5 vidas.", "type": "Criatura — Metabolizador eldrazi"}, {"flavorText": "Les Eldrazi arpentent inlassablement les landes, détruisant à nouveau des lieux qu'ils ont déjà anéantis.", "language": "French", "multiverseId": 403213, "name": "Convertisseur de ruine", "text": "Quand vous lancez le Convertisseur de ruine, vous pouvez mettre une carte qu'un adversaire possède dans le cimetière de ce joueur depuis l'exil. Si vous faites ainsi, vous gagnez 5 points de vie.", "type": "Créature : eldrazi et convertisseur"}, {"flavorText": "Gli Eldrazi continuano a battere le distese desolate, aggravando una distruzione che già sembrava assoluta.", "language": "Italian", "multiverseId": 403512, "name": "Metabolizzatore della Rovina", "text": "Quando lanci il Metabolizzatore della Rovina, puoi mettere una carta posseduta da un avversario dall'esilio nel cimitero di quel giocatore. Se lo fai, guadagni 5 punti vita.", "type": "Creatura — Metabolizzatore Eldrazi"}, {"flavorText": "エルドラージは相変わらず荒れ地を徘徊している。すでに破壊し尽くされたように見える地をさらに荒らしながら。", "language": "Japanese", "multiverseId": 403811, "name": "破滅の昇華者", "text": "あなたが破滅の昇華者を唱えたとき、あなたは追放領域から対戦相手がオーナーであるカードを１枚そのプレイヤーの墓地に置いてもよい。そうしたなら、あなたは５点のライフを得る。", "type": "クリーチャー — エルドラージ・昇華者"}, {"flavorText": "엘드라지는 이미 파괴할 것이 없어 보이는데도 황무지를 휩쓸고 다니며 끊임 없이 파괴를 자행한다.", "language": "Korean", "multiverseId": 404110, "name": "폐허 처리자", "text": "폐허 처리자를 발동할 때, 당신은 추방 영역에서 상대가 소유한 카드 한 장을 그 플레이어의 무덤에 넣을 수 있다. 그렇게 한다면, 당신은 생명 5점을 얻는다.", "type": "생물 — 엘드라지 처리자"}, {"flavorText": "Os Eldrazi continuam avançando pelos ermos, agravando uma destruição que já parecia absoluta.", "language": "Portuguese (Brazil)", "multiverseId": 404409, "name": "Processador da Ruína", "text": "Quando você conjura Processador da Ruína, você pode colocar um card exilado de um oponente no cemitério dele. Se fizer isso, você ganhará 5 pontos de vida.", "type": "Criatura — Eldrazi Processador"}, {"flavorText": "Эльдрази прочесывают пустоши, творя разрушения там, где, казалось бы, уже не осталось камня на камне.", "language": "Russian", "multiverseId": 404708, "name": "Переработчик Разрушений", "text": "Когда вы разыгрываете Переработчика Разрушений, вы можете положить принадлежащую оппоненту карту из изгнания на кладбище того игрока. Если вы это делаете, вы получаете 5 жизней.", "type": "Существо — Эльдрази Переработчик"}, {"flavorText": "奥札奇持续扫荡，将夷为平地的废墟彻底毁灭。", "language": "Chinese Simplified", "multiverseId": 402316, "name": "遗迹噬体", "text": "当你施放遗迹噬体时，你可以将一张由对手拥有的牌从放逐区置入该牌手的坟墓场。若你如此作，你获得5点生命。", "type": "生物～奥札奇／噬体"}, {"flavorText": "奧札奇持續掃蕩，將夷為平地的廢墟徹底毀滅。", "language": "Chinese Traditional", "multiverseId": 402615, "name": "遺跡噬體", "text": "當你施放遺跡噬體時，你可以將一張由對手擁有的牌從放逐區置入該玩家的墳墓場。若你如此作，你獲得5點生命。", "type": "生物～奧札奇／噬體"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "202963", "cardKingdomId": "202639", "cardsphereId": "6782", "mcmId": "284794", "mcmMetaId": "220732", "mtgjsonV4Id": "fcefc4cf-b765-5d73-8e97-3eb964e24847", "mtgoFoilId": "58296", "mtgoId": "58295", "multiverseId": "402017", "scryfallId": "d997088b-f8f9-4e4c-ba64-aa7f43cc7505", "scryfallIllustrationId": "592899e6-90db-4e58-8a5d-0ca6dcaeb432", "scryfallOracleId": "1cf82e44-99dd-48d3-a272-8df9835ebc0d", "tcgplayerProductId": "105671"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{7}", "manaValue": 7.0, "name": "Ruin Processor", "number": "12", "originalText": "When you cast Ruin Processor, you may put a card an opponent owns from exile into that player's graveyard. If you do, you gain 5 life.", "originalType": "Creature — Eldrazi Processor", "power": "7", "printings": ["BFZ"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/e6b3ddfeb989eb5c", "cardKingdomFoil": "https://mtgjson.com/links/d4c8525a2e65442b", "cardmarket": "https://mtgjson.com/links/44f8529df126491d", "tcgplayer": "https://mtgjson.com/links/d6ebc22a23d15230"}, "rarity": "common", "rulings": [{"date": "2015-08-25", "text": "If a spell or ability requires that you put more than one exiled card into the graveyard, you may choose cards owned by different opponents. Each card chosen will be put into its owner’s graveyard."}, {"date": "2015-08-25", "text": "If a replacement effect will cause cards that would be put into a graveyard from anywhere to be exiled instead (such as the one created by Anafenza, the Foremost), you can still put an exiled card into its opponent’s graveyard. The card becomes a new object and remains in exile. In this situation, you can’t use a single exiled card if required to put more than one exiled card into the graveyard. Conversely, you could use the same card in this situation if two separate spells or abilities each required you to put a single exiled card into its owner’s graveyard."}, {"date": "2015-08-25", "text": "You can’t look at face-down cards in exile unless an effect allows you to."}, {"date": "2015-08-25", "text": "Face-down cards in exile are grouped using two criteria: what caused them to be exiled face down and when they were exiled face down. If you want to put a face-down card in exile into its owner’s graveyard, you must first choose one of these groups and then choose a card from within that group at random. For example, say an artifact causes your opponent to exile their hand of three cards face down. Then on a later turn, that artifact causes your opponent to exile another two cards face down. If you use Wasteland Strangler to put one of those cards into their graveyard, you would pick the first or second pile and put a card chosen at random from that pile into the graveyard."}], "setCode": "BFZ", "subtypes": ["Eldrazi", "Processor"], "supertypes": [], "text": "When you cast this spell, you may put a card an opponent owns from exile into that player's graveyard. If you do, you gain 5 life.", "toughness": "8", "type": "Creature — Eldrazi Processor", "types": ["Creature"], "uuid": "94f4e266-6ecc-5ac6-903f-57dc7100d634"}