{"artist": "Sean Murray", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "silver", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 5.0, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "215632", "cardKingdomId": "215341", "cardsphereId": "52764", "mcmId": "313645", "mcmMetaId": "235218", "mtgjsonV4Id": "b8d5b1fa-e971-59c5-85f4-b1463de3f17c", "multiverseId": "439409", "scryfallId": "6c02c575-5685-44f5-8b47-89d888529d1b", "scryfallIllustrationId": "0ae3a404-e067-423e-96f8-f4010d956a19", "scryfallOracleId": "0a3d3d5e-fb77-4940-9ece-7ed62bd6413e", "tcgplayerProductId": "152433"}, "isFunny": true, "language": "English", "layout": "normal", "legalities": {}, "manaCost": "{3}{W}{W}", "manaValue": 5.0, "name": "Rules Lawyer", "number": "20", "originalText": "State-based actions don't apply to you or other permanents you control. (You don't lose the game due to having 0 or less life or drawing from an empty library. Your creatures aren't destroyed due to damage or deathtouch and aren't put into a graveyard due to having 0 or less toughness. Your planeswalkers aren't put into a graveyard if they have 0 loyalty. You don't put a legendary permanent into a graveyard if you control two with the same name. Counters aren't removed from your permanents due to game rules. Permanents you control attached or combined illegally remain on the battlefield. For complete rules and regulations, see rule 704.)", "originalType": "Artifact Creature — Cyborg Advisor", "power": "1", "printings": ["J17", "UPLIST", "UST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ddcbfb855a0ff2a2", "cardKingdomFoil": "https://mtgjson.com/links/75574806afb038f9", "cardmarket": "https://mtgjson.com/links/b194ed982ca3763d", "tcgplayer": "https://mtgjson.com/links/ab8ec91df18cd286"}, "rarity": "rare", "rulings": [{"date": "2018-01-19", "text": "While you control Rules Lawyer, the following is true, with the exception of not affecting Rules Lawyer itself (Comprehensive Rules references in parentheses):"}, {"date": "2018-01-19", "text": "You don’t lose the game if you’re at or below 0 life. (704.5a)"}, {"date": "2018-01-19", "text": "If you try to draw from an empty library, nothing happens. (704.5b)"}, {"date": "2018-01-19", "text": "You could hit up an all-you-can-eat poison counter buffet no problem. (704.5c)"}, {"date": "2018-01-19", "text": "Creatures you control with toughness of 0 or less remain on the battlefield. (704.5f)"}, {"date": "2018-01-19", "text": "Creatures you control that have been dealt lethal damage remain on the battlefield. (704.5g)"}, {"date": "2018-01-19", "text": "Creatures you control shrug off opposing creatures with deathtouch. (704.5h)"}, {"date": "2018-01-19", "text": "Your planeswalkers remain on the battlefield even if they have no loyalty counters. (704.5i)"}, {"date": "2018-01-19", "text": "You can control as many legendary permanents (including planeswalkers) with the same name as you want. It’s like your own personal Mirror Gallery! (704.5j)"}, {"date": "2018-01-19", "text": "You can control multiple permanents with the supertype world. So, that opens up some deck ideas, I’d imagine. (704.5k)"}, {"date": "2018-01-19", "text": "Auras you control stay on the battlefield if they’re attached to an illegal permanent or if they aren’t attached to a permanent (but should be). They may not do much because there probably won’t be an “enchanted [whatever],” but they’ll stay on the battlefield! (704.5m) Similarly, thanks to an un-documented silver-bordered state-based action no longer applying, your creatures with augment can now survive even if not attached to a host. If this happens, its power and toughness are 0/0. (704.5m)"}, {"date": "2018-01-19", "text": "Equipment and Fortifications you control can stay attached to an illegal permanent. (704.5n)"}, {"date": "2018-01-19", "text": "If you somehow control a creature that’s attached to another permanent, that creature can stay attached. It can attack and block, even if another creature is carrying it. Similarly, if you control a permanent that isn’t an Aura, an Equipment, or a Fortification, it can stay attached to whatever you manage to get it attached to. Strange. (704.5p)"}, {"date": "2018-01-19", "text": "+1/+1 counters and -1/-1 counters on permanents you control no longer annihilate each other. (704.5q)"}, {"date": "2018-01-19", "text": "Good news for Rasputin Dreamweaver fans: you can ignore abilities of permanents you control that say it can’t have more than a certain number of a certain kind of counter. (704.5r)"}, {"date": "2018-01-19", "text": "Your Two-Headed Giant team can no longer lose because you have 0 or less life or fifteen or more poison counters. (704.5s and 704.5t)"}, {"date": "2018-01-19", "text": "In Commander, you’re immune to the “commander damage rule” that says you lose if a single commander deals 21 or more combat damage to you. (704.5u)"}, {"date": "2018-01-19", "text": "Because Rules Lawyer applies only to you and other permanents you control, tokens that leave the battlefield will continue to cease to exist. This is also true for copies of cards that might exist off the battlefield."}, {"date": "2018-01-19", "text": "Any ability that says a player wins or loses the game still works."}, {"date": "2018-01-19", "text": "Rules Lawyer’s ability doesn’t apply to itself. It can die for any number of reasons. If you’re at 0 or less life and you lose control of Rules Lawyer, you’ll immediately lose the game."}, {"date": "2018-01-19", "text": "A creature with toughness 0 or less can still attack and block. It blocks an attacking creature with trample, treat its toughness as 0 when determining how to assign combat damage."}], "securityStamp": "oval", "setCode": "UST", "subtypes": ["Cyborg", "Advisor"], "supertypes": [], "text": "State-based actions don't apply to you or other permanents you control. (You don't lose the game due to having 0 or less life or drawing from an empty library. Your creatures aren't destroyed due to damage or deathtouch and aren't put into a graveyard due to having 0 or less toughness. Your planeswalkers aren't put into a graveyard if they have 0 loyalty. You don't put a legendary permanent into a graveyard if you control two with the same name. Counters aren't removed from your permanents due to game rules. Permanents you control attached or combined illegally remain on the battlefield. For complete rules and regulations, see rule 704.)", "toughness": "1", "type": "Artifact Creature — Cyborg Advisor", "types": ["Artifact", "Creature"], "uuid": "99cb1a66-a4d8-55c5-b48a-5a8ee5e96724", "watermark": "orderofthewidget"}