{"artist": "Ilse Gort", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 4.0, "edhrecRank": 4619, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "1a394dd4-e3f0-5945-a0de-6925ccd0de9b", "mtgoId": "90154", "scryfallId": "6179e0e6-f9f7-402d-aa07-7cbd86949129", "scryfallIllustrationId": "f172c7d7-64ef-4efd-b693-10035ee0a099", "scryfallOracleId": "d760f2f0-6653-47c4-bd7b-aab2f398ddf2"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}{G}", "manaValue": 4.0, "name": "Ruxa, Patient Professor", "number": "90154", "originalReleaseDate": "2021-05-01", "power": "4", "printings": ["C21", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-04-16", "text": "A creature or creature card with no abilities is one with no rules text at all. This includes true vanilla creatures (including Grizzly Bears, Runeclaw Bear, Bear Cub, and other adorable bear students), face-down creatures, many tokens, and creatures that have lost their abilities. Abilities that function only in zones other than the battlefield count. For example, a creature with cycling {2} is not a creature with no abilities."}, {"date": "2021-04-16", "text": "Notably, neither of Ruxa’s last two abilities give any creatures an ability."}, {"date": "2021-04-16", "text": "Auras and Equipment that grant abilities will use the words “gains” or “has,” and they’ll list a keyword ability or an ability in quotation marks. A creature with no abilities affected by such an Aura or Equipment would no longer get the +1/+1 bonus or be able to assign combat damage as though it weren’t blocked. If the Aura or Equipment does not give the creature any abilities, the creature will continue to benefit from Ruxa’s last two abilities."}, {"date": "2021-04-16", "text": "For each attacking creature you control with no abilities, you decide whether it will assign combat damage to the blocking creatures or if it will assign combat damage to the player or planeswalker it’s attacking. You can’t split damage assignment between them. You make this decision individually for each qualifying creature just before it deals combat damage."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Bear", "Druid"], "supertypes": ["Legendary"], "text": "Whenever Ruxa, Patient Professor enters the battlefield or attacks, return target creature card with no abilities from your graveyard to your hand.\nCreatures you control with no abilities get +1/+1.\nYou may have creatures you control with no abilities assign their combat damage as though they weren't blocked.", "toughness": "4", "type": "Legendary Creature — Bear Druid", "types": ["Creature"], "uuid": "3774eee9-577a-5d9d-b127-767d35b1a7f0"}