{"artist": "Christopher Rush", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "edhrecRank": 12062, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 131333, "name": "Sicherer Zufluchtsort", "text": "{2}, {T}: Entferne eine Kreatur deiner Wahl, die du kontrollierst, ganz aus dem Spiel.\nZu Beginn deines Versorgungssegments kannst du den Sicheren Zufluchtsort opfern. Falls du dies tust, bringe alle Karten, die du mit dem Sicheren Zufluchtsort ganz aus dem Spiel entfernt hast, unter der Kontrolle ihrer Besitzer ins Spiel zurück.", "type": "Land"}, {"language": "Spanish", "multiverseId": 131938, "name": "Refugio seguro", "text": "{2}, {T}: Remueve del juego la criatura objetivo que controlas.\nAl comienzo de tu mantenimiento, puedes sacrificar el Refugio seguro. Si lo haces, regresa al juego bajo el control de su propietario cada carta removida del juego con el Refugio seguro.", "type": "Tierra"}, {"language": "French", "multiverseId": 131212, "name": "Havre de paix", "text": "{2}, {T} : Retirez de la partie une créature ciblée que vous contrôlez.\nAu début de votre entretien, vous pouvez sacrifier le Havre de paix. Si vous faites ainsi, renvoyez en jeu chaque carte retirée de la partie par le Havre de paix sous le contrôle de son propriétaire.", "type": "Terrain"}, {"language": "Italian", "multiverseId": 131454, "name": "Rifugio Sicuro", "text": "{2}, {T}: Rimuovi dal gioco una creatura bersaglio che controlli.\nAll'inizio del tuo mantenimento, puoi sacrificare il Rifugio Sicuro. Se lo fai, rimetti in gioco tutte le carte rimosse dal gioco con Rifugio Sicuro sotto il controllo dei loro proprietari.", "type": "Terra"}, {"language": "Japanese", "multiverseId": 131575, "name": "隠れ家", "text": "{2}, {T}：あなたがコントロールするクリーチャー１体を対象とし、それをゲームから取り除く。\nあなたのアップキープの開始時に、あなたは隠れ家を生け贄に捧げてもよい。 そうした場合、隠れ家によってゲームから取り除かれた各カードを、それぞれのオーナーのコントロール下で場に出す。", "type": "土地"}, {"language": "Portuguese (Brazil)", "multiverseId": 131696, "name": "Porto Seguro", "text": "{2}, {T}: Remova do jogo a criatura alvo que você controla.\nNo início de sua manutenção, você pode sacrificar Porto Seguro Se fizer isso, devolva cada card removido do jogo com Porto Seguro para o jogo sob o controle de seu dono.", "type": "Terreno"}, {"language": "Russian", "multiverseId": 131817, "name": "Надежное Убежище", "text": "{2}, {T}: Удалите целевое существо под вашим контролем из игры.\nВ начале вашего шага поддержки вы можете пожертвовать Надежное Убежище. Если вы это сделаете, то верните все карты, удаленные из игры Надежным Убежищем, в игру под контролем их владельца.", "type": "Земля"}, {"language": "Chinese Simplified", "multiverseId": 131091, "name": "安全庇护地", "text": "{2}，{T}：将目标由你操控的生物移出对战。\n在你的维持开始时，你可以牺牲安全庇护地。 若你如此作，将所有以安全庇护地移出对战的牌在其拥有者的操控下放置进场。", "type": "地"}], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "121819", "cardKingdomId": "121122", "cardsphereId": "44630", "mcmId": "14134", "mtgjsonV4Id": "47c3004b-91ea-5ab9-89a5-88fc423c083f", "mtgoFoilId": "26028", "mtgoId": "26027", "multiverseId": "107275", "scryfallId": "d130205f-53e3-4c04-967c-4808d7945880", "scryfallIllustrationId": "970f1b73-5d8a-421c-bd6d-ca9532776f63", "scryfallOracleId": "8f7f4061-8998-40e9-b980-c63f27e7a5cd", "tcgplayerProductId": "14633"}, "isReprint": true, "isTimeshifted": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "oldschool": "Legal", "penny": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaValue": 0.0, "name": "Safe Haven", "number": "121", "originalText": "{2}, {T}: Remove target creature you control from the game.\nAt the beginning of your upkeep, you may sacrifice Safe Haven. If you do, return each card removed from the game with Safe Haven to play under its owner's control.", "originalType": "Land", "printings": ["CHR", "DRK", "PTC", "TSB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/b15a2ef325892e67", "cardKingdomFoil": "https://mtgjson.com/links/1bae36de00806c48", "tcgplayer": "https://mtgjson.com/links/459efaa950b4642c"}, "rarity": "special", "rulings": [{"date": "2004-10-04", "text": "When creatures return to the battlefield, they are put onto the battlefield as if just cast. Creatures with X in the mana cost are treated as X is zero. Creatures which can pay costs when put onto the battlefield to determine abilities must have those costs paid at this time."}, {"date": "2004-10-04", "text": "Token creatures cease to exist when they leave the battlefield, so this effect just exiles them with no chance to bring them back like you can with cards."}, {"date": "2004-10-04", "text": "If changed to another land type, the creature cards are not lost but can’t be released until the land reverts to normal."}, {"date": "2004-10-04", "text": "When the creature leaves the battlefield any damage or “will be destroyed at some future time” effects are removed from the creature."}, {"date": "2004-10-04", "text": "Auras on creatures are put into the graveyard and counters on creatures are removed when the creatures are sent to the Haven."}, {"date": "2004-10-04", "text": "Creatures return to the control of their owners, regardless of who controls the Haven when it is sacrificed."}, {"date": "2004-10-04", "text": "All cards in the Haven stay there even if they cease to be creatures. When the Haven is sacrificed, the cards come back onto the battlefield whether or not they are creatures."}, {"date": "2004-10-04", "text": "Creatures return to the battlefield simultaneously."}], "setCode": "TSB", "subtypes": [], "supertypes": [], "text": "{2}, {T}: Exile target creature you control.\nAt the beginning of your upkeep, you may sacrifice Safe Haven. If you do, return each card exiled with Safe Haven to the battlefield under its owner's control.", "type": "Land", "types": ["Land"], "uuid": "d5ba9ec2-9bd1-5f21-9a82-c558fb648dd8"}