{"artist": "Kev Walker", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G", "U"], "colors": ["G", "U"], "convertedManaCost": 5.0, "edhrecRank": 17447, "finishes": ["nonfoil", "foil"], "flavorText": "Godtrackers found new pantheons of beast-gods beyond Naya's borders.", "foreignData": [{"flavorText": "Göttersucher fanden auch außerhalb von Naya neue Pantheons von Bestien, die sie als Götter verehren konnten.", "language": "German", "multiverseId": 196925, "name": "Weise der Anima", "text": "Falls du eine Karte ziehen würdest, zeige stattdessen die obersten drei Karten deiner Bibliothek offen vor. Nimm alle Kreaturenkarten, die auf diese Weise aufgedeckt wurden, auf deine Hand und lege den Rest der Karten in beliebiger Reihenfolge unter deine Bibliothek.", "type": "Kreatur — Elf, Zauberer"}, {"flavorText": "Los siguedioses encontraron nuevos panteones de dioses-bestia más allá de las fronteras de Naya.", "language": "Spanish", "multiverseId": 196780, "name": "Sabios del Ánima", "text": "Si fueras a robar una carta, en vez de eso, muestra las primeras tres cartas de tu biblioteca. Pon todas las cartas de criatura mostradas de esta manera en tu mano y el resto en la parte inferior de tu biblioteca en cualquier orden.", "type": "Criatura — Hechicero elfo"}, {"flavorText": "Les pistedieux découvrirent de nouveaux panthéons de divinités animales au-delà des frontières de Naya.", "language": "French", "multiverseId": 196345, "name": "Sages de l'Anima", "text": "Si vous deviez piocher une carte, révélez les trois cartes du dessus de votre bibliothèque à la place. Mettez toutes les cartes de créature révélées de cette manière dans votre main et le reste au-dessous de votre bibliothèque dans n'importe quel ordre.", "type": "Créature : elfe et sorcier"}, {"flavorText": "Oltre i confini di Naya, i battipista divini trovarono nuovi panteon di bestiali divinità.", "language": "Italian", "multiverseId": 195910, "name": "Saggi dell'Anima", "text": "Se stai per pescare una carta, rivela invece le prime tre carte del tuo grimorio. Aggiungi alla tua mano tutte le carte creatura rivelate in questo modo e metti le altre in fondo al tuo grimorio in qualsiasi ordine.", "type": "Creatura — Mago Elfo"}, {"flavorText": "神追いは新たな獣神の神殿を、ナヤの国境を越えた場所に見つけた。", "language": "Japanese", "multiverseId": 196200, "name": "アニマの賢者", "text": "あなたがカードを引く場合、代わりにあなたのライブラリーの一番上から３枚のカードを公開する。 これにより公開されたすべてのクリーチャー・カードをあなたの手札に加え、残りをあなたのライブラリーの一番下に望む順番で置く。", "type": "クリーチャー — エルフ・ウィザード"}, {"flavorText": "Os sacro-rastreadores encontraram novos panteões de deuses bestiais além das fronteiras de Naya.", "language": "Portuguese (Brazil)", "multiverseId": 196635, "name": "Sábios da Anima", "text": "Se você for comprar um card, em vez disso revele os três cards do topo de seu grimório. Coloque em sua mão todos os cards de criatura revelados desta maneira e o resto no fundo de seu grimório em qualquer ordem.", "type": "Criatura — Elfo Mago"}, {"flavorText": "Боговоды обнаружили новые пантеоны зверей-богов за пределами Найи.", "language": "Russian", "multiverseId": 196055, "name": "Мудрецы Анимы", "text": "Если вы должны взять карту, вместо этого покажите три верхние карты вашей библиотеки. Положите все показанные таким образом карты существ в вашу руку, а остальные в низ вашей библиотеки в любом порядке.", "type": "Существо — Эльф Чародей"}, {"flavorText": "溯神师在纳雅边境彼方找到新的万兽神殿。", "language": "Chinese Simplified", "multiverseId": 196490, "name": "谕灵的智者", "text": "若你将抓一张牌，则改为展示你牌库顶的三张牌。 将所有以此法展示的生物牌置于你手上，其余则以任意顺序置于你的牌库底。", "type": "生物～地精／法术师"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "126883", "cardKingdomId": "126722", "cardsphereId": "4637", "mcmId": "20982", "mcmMetaId": "10516", "mtgjsonV4Id": "be3236d0-5aea-5a6a-94fd-758024ccc651", "mtgoFoilId": "32369", "mtgoId": "32368", "multiverseId": "180601", "scryfallId": "f98a21af-cd1a-4438-a4c2-0c92ad92efef", "scryfallIllustrationId": "e2c13e96-bada-48fd-b0aa-a8dc4aa2a4bf", "scryfallOracleId": "d6c008c7-6c87-4677-ba0e-6d95f10d10bc", "tcgplayerProductId": "31795"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{G}{U}", "manaValue": 5.0, "name": "Sages of the Anima", "number": "103", "originalText": "If you would draw a card, instead reveal the top three cards of your library. Put all creature cards revealed this way into your hand and the rest on the bottom of your library in any order.", "originalType": "Creature — Elf Wizard", "power": "3", "printings": ["ARB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/f40149a9cb673725", "cardKingdomFoil": "https://mtgjson.com/links/5993893d8cd5a4b3", "cardmarket": "https://mtgjson.com/links/7f006951d190bf27", "tcgplayer": "https://mtgjson.com/links/da1d422e102a414c"}, "rarity": "rare", "rulings": [{"date": "2009-05-01", "text": "Other players don’t get to see the order that you put the cards on the bottom of your library."}, {"date": "2009-05-01", "text": "If an effect would cause you to draw multiple cards, each individual draw is replaced by Sages of the Anima’s effect. Process the draws one at a time."}, {"date": "2009-05-01", "text": "If there are fewer than three cards in your library, you’ll reveal all of them."}, {"date": "2009-05-01", "text": "This effect is mandatory. Even if there are no more creature cards in your library, you have to do this instead of drawing a card."}, {"date": "2009-05-01", "text": "If a spell or ability causes you to put cards in your hand without specifically using the word “draw,” Sages of the Anima’s ability won’t affect it."}, {"date": "2009-05-01", "text": "If two or more replacement effects would apply to a card-drawing event, the player who’s drawing the card chooses what order to apply them. It’s possible that after applying one of them, the others will no longer be applicable because the player would no longer draw a card. For example, if you have more than one Sages of the Anima on the battlefield and you would draw a card, each Sages of the Anima’s replacement effect could apply. Once you use one, the rest are no longer applicable."}], "setCode": "ARB", "subtypes": ["Elf", "Wizard"], "supertypes": [], "text": "If you would draw a card, instead reveal the top three cards of your library. Put all creature cards revealed this way into your hand and the rest on the bottom of your library in any order.", "toughness": "4", "type": "Creature — Elf Wizard", "types": ["Creature"], "uuid": "5ed9e023-d658-5506-8f98-e94a9af84812"}