{"artist": "Wesley Burt", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 6.0, "edhrecRank": 2938, "finishes": ["foil"], "flavorText": "\"From the first touch, I know exactly what the metal wants to be.\"", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"mtgjsonV4Id": "b501424e-1ee6-5d3e-bce4-dd71f955f4d6", "mtgoId": "62207", "scryfallId": "ff80f5bc-7cf6-498c-93c7-144999a34fc1", "scryfallIllustrationId": "86655476-ab3e-4f5d-8bf7-301a969710bf", "scryfallOracleId": "0038e74a-b950-47ff-8853-dba6a3b31091"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U}{U}", "manaValue": 6.0, "name": "Saheeli's Artistry", "number": "62207", "originalReleaseDate": "2017-05-31", "printings": ["C18", "KLD", "PKLD", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2016-09-20", "text": "The token copies exactly what was printed on the original permanent and nothing else (unless that permanent is copying something else or is a token; see below). It doesn't copy whether that permanent is tapped or untapped, whether it has any counters on it or Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, or so on."}, {"date": "2016-09-20", "text": "If you chose the second mode, the token is an artifact in addition to its other types. This is a copiable value of the token that other effects may copy."}, {"date": "2016-09-20", "text": "If the copied permanent has {X} in its mana cost, X is considered to be 0."}, {"date": "2016-09-20", "text": "If the copied permanent is copying something else (for example, if the copied permanent is an Altered Ego), then the token enters the battlefield as whatever that permanent copied."}, {"date": "2016-09-20", "text": "If the copied permanent is a token, the token created with Saheeli's Artistry copies the original characteristics of that token as stated by the effect that that created that token."}, {"date": "2016-09-20", "text": "Any enters-the-battlefield abilities of the copied permanent will trigger when the token enters the battlefield. Any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities of the chosen permanent will also work."}, {"date": "2016-09-20", "text": "If you choose both modes, you may target a single artifact creature twice and get two copies of that artifact creature."}, {"date": "2016-09-20", "text": "If you choose both modes, the tokens enter one at a time. Thus, if the token created by the second mode has an ability that triggers “whenever an artifact enters the battlefield,” the token created by the first mode will already be on the battlefield and won't cause that ability to trigger."}, {"date": "2016-09-20", "text": "Any abilities that trigger during the resolution of Saheeli's Artistry will wait to be put onto the stack until Saheeli's Artistry finishes resolving. An ability that triggers on the first token entering the battlefield may target the second token and vice versa."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Choose one or both —\n• Create a token that's a copy of target artifact.\n• Create a token that's a copy of target creature, except it's an artifact in addition to its other types.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "834ea9b1-0204-5527-8d58-53f36fc99caa"}