{"artist": "Tyler Walpole", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 6.0, "edhrecRank": 2958, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "f82d7502-a815-57ff-b13c-1b25ac9b0da1", "mtgoId": "86038", "scryfallId": "0254c5ac-35a9-4e81-94d0-4fb8cea1de64", "scryfallIllustrationId": "3f2122c5-8498-4c89-ae3d-6aa1120f1b38", "scryfallOracleId": "cf127842-5fb1-44df-8d91-8cc0f48c559a"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Cascade", "Flash"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U}{U}", "manaValue": 6.0, "name": "Sakashima's Protege", "number": "86038", "originalReleaseDate": "2020-12-15", "power": "3", "printings": ["CMR", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-11-10", "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."}, {"date": "2020-11-10", "text": "Countering the spell with cascade has no effect on the cascade ability."}, {"date": "2020-11-10", "text": "You exile the cards face up. All players will be able to see them."}, {"date": "2020-11-10", "text": "If you cast a permanent spell using the cascade ability of Sakashima’s Protege, that permanent will be on the battlefield in time to be copied by Sakashima’s Protege."}, {"date": "2020-11-10", "text": "Sakashima’s Protege copies exactly what was printed on the original permanent (unless that permanent is copying something else or is a token; see below). It doesn’t copy whether that permanent is tapped or untapped, whether it has any counters on it or any Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, or so on."}, {"date": "2020-11-10", "text": "If Sakashima’s Protege enters the battlefield as a copy of a planeswalker, it will enter with a number of loyalty counters on it equal to the loyalty printed in the lower right corner of the planeswalker. It won’t copy the number of counters currently on that planeswalker."}, {"date": "2020-11-10", "text": "If the chosen permanent has {X} in its mana cost, X is considered to be 0."}, {"date": "2020-11-10", "text": "If the chosen permanent is copying something else (for example, if the chosen permanent is another Sakashima’s Protege), then Sakashima’s Protege enters the battlefield as whatever the chosen permanent copied."}, {"date": "2020-11-10", "text": "If the chosen permanent is a token, Sakashima’s Protege copies the original characteristics of that token as stated by the effect that put that token onto the battlefield. Sakashima’s Protege doesn’t become a token in this case."}, {"date": "2020-11-10", "text": "Any enters-the-battlefield abilities of the copied permanent will trigger when Sakashima’s Protege enters the battlefield. Any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities of the chosen permanent will also work."}, {"date": "2020-11-10", "text": "If Sakashima’s Protege somehow enters the battlefield at the same time as another creature, it can’t become a copy of that creature. You may choose only a creature that’s already on the battlefield and entered the battlefield this turn."}, {"date": "2020-11-10", "text": "The cascade ability triggers when you cast the spell, meaning that it resolves before that spell. If you cast the card exiled by the cascade ability, that spell will go on the stack above the spell with cascade."}, {"date": "2020-11-10", "text": "You don’t have to cast the last card exiled by a cascade ability. If you choose to do so, you’re casting it as a spell. This means that it can be countered, and appropriate abilities trigger (such as if that spell also has cascade)."}, {"date": "2020-11-10", "text": "If you cast a spell “without paying its mana cost,” you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those to cast the spell."}, {"date": "2020-11-10", "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2020-11-10", "text": "The converted mana cost of a spell with cascade is determined only by its mana cost, no matter what the total cost to cast the spell was."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Shapeshifter"], "supertypes": [], "text": "Flash\nCascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)\nYou may have Sakashima's Protege enter the battlefield as a copy of any permanent that entered the battlefield this turn.", "toughness": "1", "type": "Creature — Shapeshifter", "types": ["Creature"], "uuid": "2c0aecd2-5c9a-5be3-a934-965ffe61bf2e"}