{"artist": "rk post", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 1659, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 105342, "name": "Sakashima der Hochstapler", "text": "Du kannst eine Kreatur im Spiel bestimmen, sowie Sakashima der Hochstapler ins Spiel kommt. Falls du dies tust, kommt Sakashima als Kopie dieser Kreatur ins Spiel, außer dass sein Name immer noch Sakashima der Hochstapler ist, er immer noch legendär ist und „{2}{U}{U}: Bringe Sakashima den Hochstapler am Ende des Zuges auf die Hand seines Besitzers zurück.\" erhält.", "type": "Legendäre Kreatur - Mensch, Räuber"}, {"language": "Spanish", "multiverseId": 106002, "name": "Sakashima el impostor", "text": "En cuanto Sakashima el impostor entre en juego, puedes elegir una criatura en juego. Si lo haces, Sakashima entra en juego como una copia de esa criatura, excepto que su nombre sigue siendo Sakashima el impostor, sigue siendo legendaria, y gana \"{2}{U}{U}: Regresa a Sakashima el impostor a la mano de su propietario al final del turno.\"", "type": "Criatura legendaria - Bribón humano"}, {"language": "French", "multiverseId": 105177, "name": "Sakashima l'imposteur", "text": "Au moment où Sakashima l'imposteur arrive en jeu, vous pouvez choisir une créature en jeu. Si vous faites ainsi, Sakashima l'imposteur arrive en jeu comme une copie de cette créature, excepté que son nom est toujours Sakashima l'imposteur, qu'il est toujours légendaire et qu'il acquiert « {2}{U}{U} : Renvoyez Sakashima l'imposteur dans la main de son propriétaire à la fin du tour. »", "type": "Créature légendaire : humain et gredin"}, {"language": "Italian", "multiverseId": 105507, "name": "Sakashima l'Impostore", "text": "Mentre Sakashima l'Impostore entra in gioco, puoi scegliere una creatura in gioco. Se lo fai, Sakashima entra in gioco come una copia di quella creatura, tranne che il suo nome è ancora Sakashima l'Impostore, è ancora leggendario e guadagna \"{2}{U}{U}: Il proprietario riprende in mano Sakashima l'Impostore alla fine del turno.\"", "type": "Creatura Leggendaria - Farabutto Umano"}, {"language": "Japanese", "multiverseId": 105672, "name": "騙り者、逆嶋", "text": "騙り者、逆嶋が場に出るに際し、あなたは場に出ているクリーチャー１体を選んでもよい。 そうした場合、騙り者、逆嶋はそのクリーチャーのコピーとして場に出る。ただし、カード名は「騙り者、逆嶋」のままであり、伝説のままであり、「{2}{U}{U}：ターン終了時に、騙り者、逆嶋をオーナーの手札に戻す。」の能力を得る。", "type": "伝説のクリーチャー — 人間・ならず者"}, {"language": "Portuguese (Brazil)", "multiverseId": 105837, "name": "Sakashima, o Impostor", "text": "Conforme Sakashima, o Impostor entra em jogo, você pode escolher uma criatura em jogo. Se o fizer, Sakashima entra em jogo como uma cópia daquela criatura, a não ser pelo nome que ainda é Sakashima, o Impostor, ela ainda é lendária, e ganha \"{2}{U}{U}: Devolve Sakashima, o Impostor para a mão de seu dono no final do turno.\"", "type": "Criatura Lendária - Ladino Humano"}, {"language": "Chinese Simplified", "multiverseId": 105012, "name": "冒名客逆岛", "text": "于冒名客逆岛进场时，你可以选择场上的一个生物。 若你如此作，则冒名客逆岛进场时为该生物的复制；但其名称仍是冒名客逆岛，仍是传奇，且获得「{2}{U}{U}：在回合结束时，将冒名客逆岛移回其拥有者手上」。", "type": "传奇生物～人类／浪客"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "117462", "cardKingdomId": "117131", "cardsphereId": "40141", "mcmId": "12752", "mcmMetaId": "7343", "mtgjsonV4Id": "3616fbae-5be0-5584-8b76-d37c9e513f69", "mtgoFoilId": "22093", "mtgoId": "22092", "multiverseId": "74509", "scryfallId": "61dc2f54-3637-4caa-9741-36ff14dc5527", "scryfallIllustrationId": "add45f03-37b7-4f3b-b2ce-87150a4adfaa", "scryfallOracleId": "a7243d25-22a2-4df5-adaf-1f40f5330ec1", "tcgplayerProductId": "12524"}, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{U}", "manaValue": 4.0, "name": "Sakashima the Impostor", "number": "53", "originalText": "As Sakashima the Impostor comes into play, you may choose a creature in play. If you do, Sakashima comes into play as a copy of that creature, except its name is still Sakashima the Impostor, it's still legendary, and it gains \"{2}{U}{U}: Return Sakashima the Impostor to its owner's hand at end of turn.\"", "originalType": "Legendary Creature - Human Rogue", "power": "3", "printings": ["MB1", "PHED", "SOK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/de4a8dfc2ceafc94", "cardKingdomFoil": "https://mtgjson.com/links/7884b1d9f94d9228", "cardmarket": "https://mtgjson.com/links/72fea49d46c27cb2", "tcgplayer": "https://mtgjson.com/links/bdaa6dd65c80e12c"}, "rarity": "rare", "rulings": [{"date": "2005-06-01", "text": "If there is no creature on the battlefield or if you don’t choose a creature as Sakashima enters the battlefield, Sakashima remains a 3/1 Human Rogue."}, {"date": "2005-06-01", "text": "Sakashima doesn’t get the return to hand ability unless a creature is copied as Sakashima enters the battlefield. Sakashima can’t copy itself because the choice is made as part of the event that puts it onto the battlefield, and whatever will be copied must already be on the battlefield."}, {"date": "2005-06-01", "text": "Sakashima must be on the battlefield at the end of turn in order to return to hand. If Sakashima leaves the battlefield after the ability is activated but before the at-end-of-turn ability resolves, the ability does nothing."}], "setCode": "SOK", "subtypes": ["Human", "Rogue"], "supertypes": ["Legendary"], "text": "You may have Sakashima the Impostor enter the battlefield as a copy of any creature on the battlefield, except its name is Sakashima the Impostor, it's legendary in addition to its other types, and it has \"{2}{U}{U}: Return this creature to its owner's hand at the beginning of the next end step.\"", "toughness": "1", "type": "Legendary Creature — Human Rogue", "types": ["Creature"], "uuid": "f77bd69d-3a33-59d8-b9e4-ca8d89f6fe9c"}