{"artist": "Jason A. Engle", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 589, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "4f37c5f4-9c08-54b4-a3cf-4bf8e5f0fad8", "mtgoId": "86236", "scryfallId": "a9d6aa92-b70b-4eca-8366-1ba3347ab24a", "scryfallIllustrationId": "633543d7-60b3-4bc6-ba5d-e6ef062a340b", "scryfallOracleId": "8ecdaf4b-4442-42da-9714-4257a83faf50"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Partner"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Sakashima of a Thousand Faces", "number": "86236", "originalReleaseDate": "2020-12-15", "power": "3", "printings": ["CMR", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2020-11-10", "text": "The “legend rule” is the rule that states that if a player controls two or more legendary permanents with the same name, that player chooses one of them, and the rest are put into their owners’ graveyards. (704.5j at the time of this document’s creation for those of you scoring at home.)"}, {"date": "2020-11-10", "text": "While the “legend rule” doesn’t apply to permanents you control, you can control any number of legendary permanents with the same name and none of them will be put into the graveyard."}, {"date": "2020-11-10", "text": "If you control more than one legendary permanent with the same name and the “legend rule” begins applying again (perhaps because Sakashima of a Thousand Faces leaves the battlefield), you’ll immediately have to comply with the rule and put all but one of those permanents into the graveyard."}, {"date": "2020-11-10", "text": "Sakashima of a Thousand Faces copies exactly what was printed on the original creature (unless that creature is copying something else or is a token; see below), except that it also has Sakashima’s other abilities. It doesn’t copy whether that creature is tapped or untapped, whether it has any counters on it or any Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, or so on. Most notably, if it copies a creature that’s not normally a creature, it won’t be a creature."}, {"date": "2020-11-10", "text": "If the chosen creature has {X} in its mana cost, X is considered to be 0."}, {"date": "2020-11-10", "text": "If the chosen creature is copying something else, then Sakashima enters the battlefield as whatever the chosen creature copied."}, {"date": "2020-11-10", "text": "If another creature becomes a copy of Sakashima, that creature also has Sakashima’s other abilities."}, {"date": "2020-11-10", "text": "If the chosen creature is a token, Sakashima copies the original characteristics of that token as stated by the effect that put that token onto the battlefield. Sakashima doesn’t become a token in this case."}, {"date": "2020-11-10", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when Sakashima enters the battlefield. Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities of the chosen creature will also work."}, {"date": "2020-11-10", "text": "If Sakashima somehow enters the battlefield at the same time as another creature, it can’t become a copy of that creature. You may choose only a creature that’s already on the battlefield."}, {"date": "2020-11-10", "text": "If Sakashima is your commander, it remains your commander even if it’s copying another creature. If Sakashima is not your commander, it remains not your commander even if it’s copying your commander."}, {"date": "2020-11-10", "text": "If your Commander deck has two commanders, you can only include cards whose own color identities are also found in your commanders’ combined color identities. If Falthis and Kediss are your commanders, your deck may contain cards with black and/or red in their color identity, but not cards with green, white, or blue."}, {"date": "2020-11-10", "text": "Both commanders start in the command zone, and the remaining 98 cards (or 58 cards in a Commander Draft game) of your deck are shuffled to become your library."}, {"date": "2020-11-10", "text": "To have two commanders, both must have the partner ability as the game begins. Losing the ability during the game doesn’t cause either to cease to be your commander."}, {"date": "2020-11-10", "text": "Once the game begins, your two commanders are tracked separately. If you cast one, you won’t have to pay an additional {2} the first time you cast the other. A player loses the game after having been dealt 21 damage from any one of them, not from both of them combined."}, {"date": "2020-11-10", "text": "If something refers to your commander while you have two commanders, it refers to one of them of your choice. If you are instructed to perform an action on your commander (e.g. put it from the command zone into your hand due to Command Beacon), you choose one of your commanders at the time the effect happens."}, {"date": "2020-11-10", "text": "An effect that checks whether you control your commander is satisfied if you control one or both of your two commanders."}, {"date": "2020-11-10", "text": "You can choose two commanders with partner that are the same color or colors. In Commander Draft, you can even choose two of the same commander with partner if you drafted them. If you do this, make sure you keep the number of times you’ve cast each from the command zone clear for “commander tax” purposes."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Human", "Rogue"], "supertypes": ["Legendary"], "text": "You may have Sakashima of a Thousand Faces enter the battlefield as a copy of another creature you control, except it has Sakashima of a Thousand Faces's other abilities.\nThe \"legend rule\" doesn't apply to permanents you control.\nPartner (You can have two commanders if both have partner.)", "toughness": "1", "type": "Legendary Creature — Human Rogue", "types": ["Creature"], "uuid": "a4f4ec7a-7ca1-5dd9-81eb-f0876181188c"}