{"artist": "Brian Snõddy", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 2775, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "256549", "cardsphereId": "85816", "mcmId": "609559", "mcmMetaId": "205669", "mtgjsonV4Id": "7ea4759b-2222-58ea-a7f4-f72f73009b8a", "scryfallId": "be819c83-5534-44ec-aa44-d3365bfc89db", "scryfallIllustrationId": "2b05607d-fbef-4f87-a930-6473ff11f70b", "scryfallOracleId": "afcc68e2-3634-43ce-ae99-dd2ec735d146", "tcgplayerProductId": "262927"}, "isReprint": true, "isStarter": true, "keywords": ["Ninjutsu"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{U}", "manaValue": 4.0, "name": "Sakashima's Student", "number": "669", "originalReleaseDate": "2022-02-18", "power": "0", "printings": ["PC2", "PCA", "PLIST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/823921a75e40b587", "cardmarket": "https://mtgjson.com/links/81b23fa4ce4debaf", "tcgplayer": "https://mtgjson.com/links/24c283a56f481e39"}, "rarity": "rare", "rulings": [{"date": "2012-06-01", "text": "If the chosen creature has {X} in its mana cost, X is zero."}, {"date": "2012-06-01", "text": "Because you return the unblocked attacking creature to its owner’s hand while activating the ninjutsu ability, you can’t have Sakashima’s Student enter the battlefield as a copy of that creature."}, {"date": "2012-06-01", "text": "Sakashima’s Student copies exactly what was printed on the original creature (unless that creature is copying something else or is a token; see below) and it is a Ninja in addition to its other types. It doesn’t copy whether that creature is tapped or untapped, whether it has any counters on it or any Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, or so on."}, {"date": "2012-06-01", "text": "If the chosen creature is copying something else (for example, if the chosen creature is another Sakashima’s Student), then your Sakashima’s Student enters the battlefield as whatever the chosen creature copied."}, {"date": "2012-06-01", "text": "If the chosen creature is a token, Sakashima’s Student copies the original characteristics of that token as stated by the effect that put the token onto the battlefield. Sakashima’s Student is not a token."}, {"date": "2012-06-01", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when Sakashima’s Student enters the battlefield. Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities of the chosen creature (like devour) will also work."}, {"date": "2012-06-01", "text": "If Sakashima’s Student somehow enters the battlefield at the same time as another creature, Sakashima’s Student can’t become a copy of that creature. You may choose only a creature that’s already on the battlefield."}, {"date": "2012-06-01", "text": "You can choose not to copy anything. In that case, Sakashima’s Student enters the battlefield as a 0/0 creature, and is probably put into the graveyard immediately."}], "securityStamp": "oval", "setCode": "PLIST", "subtypes": ["Human", "Ninja"], "supertypes": [], "text": "Ninjutsu {1}{U} ({1}{U}, Return an unblocked attacker you control to hand: Put this card onto the battlefield from your hand tapped and attacking.)\nYou may have Sakashima's Student enter the battlefield as a copy of any creature on the battlefield, except it's a Ninja in addition to its other creature types.", "toughness": "0", "type": "Creature — Human Ninja", "types": ["Creature"], "uuid": "b98d9806-8947-58d0-92c2-2a0d50557518"}