{"artist": "Rob Alexander", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210274", "mcmId": "294462", "mtgjsonV4Id": "4206a7a8-4d09-5a05-b277-8b8730e2e87e", "multiverseId": "423648", "scryfallId": "4c20e1cd-c541-4b44-8e20-adaa45a989a2", "scryfallIllustrationId": "95980fcd-ee4b-47b5-9153-0da76860065a", "scryfallOracleId": "f0c8ce35-b627-485c-bd64-d7eae47b8efa", "tcgplayerProductId": "125624"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Sanctum of Serra", "number": "67", "originalText": "When you planeswalk away from Sanctum of Serra, destroy all nonland permanents.\nWhenever you roll {Chaos}, you may have your life total become 20.", "originalType": "Plane — Serra's Realm", "printings": ["OHOP", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ace03f8e83cc7803", "tcgplayer": "https://mtgjson.com/links/e975c87d72c40f08"}, "rarity": "common", "rulings": [{"date": "2009-10-01", "text": "A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"}, {"date": "2009-10-01", "text": "A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."}, {"date": "2009-10-01", "text": "The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."}, {"date": "2009-10-01", "text": "If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}, {"date": "2009-10-01", "text": "If you planeswalk away from Sanctum of Serra because the player who owns Sanctum of Serra leaves the game, its first ability will still trigger and resolve."}, {"date": "2009-10-01", "text": "For a player’s life total to become 20, what actually happens is that the player gains or loses the appropriate amount of life. For example, if your life total is 14 when this ability resolves, it will cause you to gain 6 life. Other cards that interact with life gain or life loss will interact with this effect accordingly."}], "setCode": "OPCA", "subtypes": ["Serra's Realm"], "supertypes": [], "text": "When you planeswalk away from Sanctum of Serra, destroy all nonland permanents.\nWhenever you roll {CHAOS}, you may have your life total become 20.", "type": "Plane — Serra's Realm", "types": ["Plane"], "uuid": "af727b24-d4e0-5793-9326-7c2847e921da"}