{"artist": "Franz Vohwinkel", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 16606, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 154667, "name": "Zerstreuender Hieb", "text": "Neutralisiere einen Zauberspruch deiner Wahl. Befehde dich mit einem Gegner. Falls du die Fehde gewinnst, kannst du zu Beginn deiner nächsten Hauptphase deinen Manavorrat um {X} erhöhen, wobei X gleich den umgewandelten Manakosten jenes Zaubers ist. (Jeder Spieler in einer Fehde deckt die oberste Karte seiner Bibliothek auf und legt diese Karte dann auf oder unter seine Bibliothek. Ein Spieler gewinnt die Fehde, wenn seine Karte die höheren umgewandelten Manakosten hat.)", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 156784, "name": "Golpe esparcidor", "text": "Contrarresta el hechizo objetivo. Enfréntate con un oponente. Si ganas, al comienzo de tu próxima fase principal, puedes agregar {X} a tu reserva de maná, donde X es el coste de maná convertido de ese hechizo. (Cada jugador enfrentado muestra la primera carta de su biblioteca, luego pone esa carta en la parte superior o inferior. Gana el jugador cuya carta tenga el mayor coste de maná convertido.)", "type": "Instantáneo"}, {"language": "French", "multiverseId": 155580, "name": "Botte de dispersion", "text": "Contrecarrez le sort ciblé. Confrontez un adversaire. Si vous gagnez, au début de votre prochaine phase principale, vous pouvez ajouter {X} à votre réserve, X étant le coût converti de mana de ce sort. (Chaque joueur impliqué dans la confrontation révèle la carte du dessus de sa bibliothèque et met ensuite cette carte au-dessus ou au-dessous de celle-ci. Un joueur gagne si sa carte a un coût converti de mana plus élevé.)", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 155881, "name": "Pulsazione Dispersiva", "text": "Neutralizza una magia bersaglio. Scontrati con un avversario. Se vinci, all'inizio della tua prossima fase principale, puoi aggiungere {X} alla tua riserva di mana, dove X è il costo di mana convertito di quella magia. (Ogni giocatore che si scontra rivela la prima carta del suo grimorio, poi la mette in cima o in fondo. Un giocatore vince se la sua carta aveva un costo di mana convertito maggiore.)", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 156182, "name": "まき散らす殴打", "text": "呪文１つを対象とし、それを打ち消す。 いずれかの対戦相手と激突を行う。 あなたが勝った場合、あなたの次のメイン・フェイズの開始時に、あなたは自分のマナ・プールに{X}を加えてもよい。Ｘはその呪文の点数で見たマナ・コストに等しい。 （激突を行う各プレイヤーは、自分のライブラリーの一番上のカードを公開し、そのカードを一番上か一番下に置く。 自分のカードの点数で見たマナ・コストの方が大きいプレイヤーが勝つ。）", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 157085, "name": "Braçada Difusora", "text": "Anule a mágica alvo. Confronte um oponente. Se você vencer, no início da sua próxima fase principal, você pode adicionar {X} à sua reserva de mana, sendo X igual ao custo de mana convertido daquela mágica. (Cada jogador confrontante revela o card do topo de seu próprio grimório, e então coloca aquele card no topo ou no fundo deste. Vence o jogador que tiver o card com o maior custo de mana convertido.)", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 156483, "name": "Рассеивающий Удар", "text": "Отмените целевое заклинание. Столкнитесь с оппонентом. Если вы выиграли, в начале вашей следующей главной фазы вы можете добавить {X} в ваше хранилище маны, где X конвертированная мана-стоимость того заклинания. (Каждый сталкивающийся игрок показывает верхнюю карту своей библиотеки, затем кладет ту карту на верх или в низ своей библиотеки. Выигрывает тот игрок, чья карта имела большую конвертированную мана-стоимость.)", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 154968, "name": "离散击", "text": "反击目标咒语。 与一位对手比点。 若你赢，则在你下一个行动阶段开始时，你可以加{X}到你的法术力池中，X为该咒语的总法术力费用。 （参与比点的牌手各展示其牌库顶牌，然后将该牌置于牌库顶部或底部。 所展示的牌之总法术力费用比较高的牌手赢得比点。）", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "123961", "cardKingdomId": "123585", "cardsphereId": "25568", "mcmId": "17823", "mcmMetaId": "9194", "mtgjsonV4Id": "a9628cf1-7f93-573d-b73d-434c2d49fc10", "mtgoFoilId": "28358", "mtgoId": "28357", "multiverseId": "139668", "scryfallId": "c536c1ce-a012-4d77-ab29-8574be164731", "scryfallIllustrationId": "08254dcc-1180-4535-b5bb-a35924a9e2b3", "scryfallOracleId": "314a9604-34ec-4529-bd14-7b63be28669f", "tcgplayerProductId": "15615"}, "keywords": ["Clash"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{U}", "manaValue": 4.0, "name": "Scattering Stroke", "number": "82", "originalText": "Counter target spell. Clash with an opponent. If you win, at the beginning of your next main phase, you may add {X} to your mana pool, where X is that spell's converted mana cost. (Each clashing player reveals the top card of his or her library, then puts that card on the top or bottom. A player wins if his or her card had a higher converted mana cost.)", "originalType": "Instant", "printings": ["CMD", "LRW"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/bc99970b420d97a5", "cardKingdomFoil": "https://mtgjson.com/links/786c5d9f0238d68c", "cardmarket": "https://mtgjson.com/links/12d9fc03e506f193", "tcgplayer": "https://mtgjson.com/links/6beee7aa5986fe2f"}, "rarity": "uncommon", "rulings": [{"date": "2007-10-01", "text": "You decide whether or not to add that much {C} to your mana pool as the delayed triggered ability resolves at the beginning of your next main phase. You don’t decide before then."}, {"date": "2007-10-01", "text": "You can’t add just some of the mana to your mana pool. You either add all the mana to your mana pool or none of it."}], "setCode": "LRW", "subtypes": [], "supertypes": [], "text": "Counter target spell. Clash with an opponent. If you win, at the beginning of your next main phase, you may add an amount of {C} equal to that spell's mana value. (Each clashing player reveals the top card of their library, then puts that card on the top or bottom. A player wins if their card had a higher mana value.)", "type": "Instant", "types": ["Instant"], "uuid": "76cc8370-eee1-51cd-846e-4c6c15275ff5"}