{"artist": "Heather Hudson", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 797, "finishes": ["nonfoil", "foil"], "flavorText": "An artificer once dropped one in a vault full of coins. She has yet to find it.", "foreignData": [{"flavorText": "Ein Tüftler lagerte eine Stange in einem Verließ voller Münzen. Bisher hat er sie noch nicht wiederfinden können.", "language": "German", "multiverseId": 73458, "name": "Formbarer Stahl", "text": "Sobald der Formbare Stahl ins Spiel kommt, kannst du ein Artefakt im Spiel bestimmen. Falls du dies tust, kommt der Formbare Stahl als eine Kopie dieses Artefakts ins Spiel.", "type": "Artefakt"}, {"flavorText": "Un artífice dejó caer uno en una bóveda llena de monedas. Todavía está buscándolo.", "language": "Spanish", "multiverseId": 162118, "name": "Acero esculpido", "text": "Mientras el Acero esculpido entra en juego, puedes elegir un artefacto en juego. Si lo haces, el Acero esculpido entra en juego como una copia de ese artefacto.", "type": "Artefacto"}, {"flavorText": "Une artificière en a laisser tomber un dans un coffre empli de pièces de cuivre… Elle l'y cherche encore.", "language": "French", "multiverseId": 161740, "name": "Acier sculpteur", "text": "Au moment où l'Acier sculpteur arrive en jeu, vous pouvez choisir un artefact en jeu. Si vous faites ainsi, l'Acier sculpteur arrive en jeu comme une copie de cet artefact.", "type": "Artefact"}, {"flavorText": "Un artefice una volta ne fece cadere uno in una stanza piena di monete. Deve ancora ritrovarlo.", "language": "Italian", "multiverseId": 160209, "name": "Acciaio da Scolpire", "text": "Mentre l'Acciaio da Scolpire entra in gioco, puoi scegliere un artefatto in gioco. Se lo fai, l'Acciaio da Scolpire entra in gioco come una copia di quell'artefatto.", "type": "Artefatto"}, {"flavorText": "ある時、一人の工匠がこいつを金貨の倉庫に落とした。 彼女は未だにそれを見つけられていない。", "language": "Japanese", "multiverseId": 73811, "name": "彫り込み鋼", "text": "彫り込み鋼が場に出る際に、あなたは場に出ているアーティファクトを１つ選んでもよい。 そうした場合、彫り込み鋼はそのアーティファクトのコピーとして場に出る。", "type": "アーティファクト"}, {"flavorText": "Uma vez, uma artíficie derrubou um desses num cofre cheio de moedas. Ela ainda não o encontrou.", "language": "Portuguese (Brazil)", "multiverseId": 162434, "name": "Aço Esculpível", "text": "Conforme Aço Esculpível entra em jogo, você pode escolher um artefato em jogo. Se o fizer, Aço Esculpível entra em jogo como uma cópia daquele artefato.", "type": "Artefato"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "73237", "cardKingdomId": "72237", "cardsphereId": "30887", "mcmId": "238", "mcmMetaId": "4990", "mtgjsonV4Id": "824d682a-f74c-587f-8bf7-0ae870eacfec", "mtgoFoilId": "20060", "mtgoId": "20059", "multiverseId": "46720", "scryfallId": "3aac5f6f-97c1-4546-94ed-016292e98c9d", "scryfallIllustrationId": "b032c6fe-3dc7-41f2-868c-e576f2456e06", "scryfallOracleId": "6c85271c-c711-49b0-a72e-9e576c33714d", "tcgplayerProductId": "11548"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Sculpting Steel", "number": "238", "originalText": "As Sculpting Steel comes into play, you may choose an artifact in play. If you do, Sculpting Steel comes into play as a copy of that artifact.", "originalType": "Artifact", "printings": ["10E", "2XM", "40K", "BRR", "C21", "KLR", "MPS", "MRD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/25680e48281bf03f", "cardKingdomFoil": "https://mtgjson.com/links/885d1e3772020e36", "cardmarket": "https://mtgjson.com/links/5131b5d859e96d89", "tcgplayer": "https://mtgjson.com/links/9e87554b08403d7e"}, "rarity": "rare", "rulings": [{"date": "2004-12-01", "text": "Any enters-the-battlefield abilities of the copied artifact will trigger when Sculpting Steel enters the battlefield. Any “as enters the battlefield” or “enters the battlefield with” abilities of the chosen artifact will also work. For example, if Sculpting Steel copies an artifact creature with sunburst, the copy will get +1/+1 counters based on the number of different colors of mana used to pay Sculpting Steel's total cost. If Sculpting Steel copies a noncreature artifact with sunburst, the copy will get charge counters based on the number of different colors of mana used to pay Sculpting Steel's total cost."}, {"date": "2007-07-15", "text": "Sculpting Steel doesn't copy whether the original artifact is tapped or untapped. It also doesn't copy any counters on that artifact, any Auras or Equipment attached to that artifact, or any effects that are currently affecting that artifact — you get exactly what's printed on the chosen card and nothing more. So if you copy an animated Chimeric Staff, for example, you get a normal, nonanimated Chimeric Staff."}, {"date": "2007-07-15", "text": "If the chosen artifact is copying something else (for example, if the chosen artifact is another Sculpting Steel), then your Sculpting Steel enters the battlefield as whatever the chosen artifact copied."}, {"date": "2007-07-15", "text": "If the chosen artifact is a token, your Sculpting Steel copies the original characteristics of that token as stated by the effect that put it onto the battlefield. Your Sculpting Steel is not considered to be a token."}, {"date": "2007-07-15", "text": "You can choose not to copy anything. In that case, Sculpting Steel stays on the battlefield as an artifact that doesn't do much of anything."}], "setCode": "MRD", "subtypes": [], "supertypes": [], "text": "You may have Sculpting Steel enter the battlefield as a copy of any artifact on the battlefield.", "type": "Artifact", "types": ["Artifact"], "uuid": "52ad0c9d-ea18-5244-b305-e1b254d9767d"}