{"artist": "James Paick", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 12914, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 210649, "name": "Sengende Strahlen", "text": "Die Sengenden Strahlen fügen einem Spieler deiner Wahl 1 Schadenspunkt und einer Kreatur deiner Wahl, die dieser Spieler kontrolliert, 1 Schadenspunkt zu.\nLandung — Falls ein Land unter deiner Kontrolle in diesem Zug ins Spiel gekommen ist, fügen die Sengenden Strahlen stattdessen diesem Spieler 3 Schadenspunkte und dieser Kreatur 3 Schadenspunkte zu.", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 211664, "name": "Llamarada abrasadora", "text": "La Llamarada abrasadora hace 1 punto de daño al jugador objetivo y 1 punto de daño a la criatura objetivo que controla ese jugador.\nAterrizaje — Si una tierra entró al campo de batalla bajo tu control este turno, en vez de eso, la Llamarada abrasadora hace 3 puntos de daño a ese jugador y 3 puntos de daño a esa criatura.", "type": "Instantáneo"}, {"language": "French", "multiverseId": 211374, "name": "Brasier calcinant", "text": "Le Brasier calcinant inflige 1 blessure au joueur ciblé et 1 blessure à la créature ciblée que ce joueur contrôle.\nToucheterre — Si vous avez fait arriver un terrain sur le champ de bataille sous votre contrôle ce tour-ci, le Brasier calcinant inflige 3 blessures à ce joueur et 3 blessures à cette créature à la place.", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 211229, "name": "Fiamma Ustionante", "text": "La Fiamma Ustionante infligge 1 danno a un giocatore bersaglio e 1 danno a una creatura bersaglio controllata da quel giocatore.\nTerraferma — Se hai fatto entrare nel campo di battaglia una terra sotto il tuo controllo in questo turno, la Fiamma Ustionante infligge invece 3 danni a quel giocatore e 3 danni a quella creatura.", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 210794, "name": "焼尽の猛火", "text": "プレイヤー１人と、そのプレイヤーがコントロールしているクリーチャー１体を対象とする。焼尽の猛火はその前者に１点、その後者に１点のダメージを与える。\n上陸 ― このターン、あなたのコントロール下で土地が戦場に出ている場合、代わりに焼尽の猛火はその前者に３点、その後者に３点のダメージを与える。", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 210939, "name": "Labareda Cauterizante", "text": "Labareda Cauterizante causa 1 ponto de dano ao jogador alvo e 1 ponto de dano à criatura alvo que aquele jogador controla.\nAterragem — Se você teve um terreno que entrou no campo de batalha sob o seu controle neste turno, em vez disso, Labareda Cauterizante causa 3 pontos de dano àquele jogador e 3 pontos de dano àquela criatura.", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 211519, "name": "Жаркое Пламя", "text": "Жаркое Пламя наносит 1 повреждение целевому игроку и 1 повреждение целевому существу под контролем того игрока.\nЗемлепад — Если земля вышла на поле битвы под вашим контролем в этом ходу, то вместо этого Жаркое Пламя наносит 3 повреждения тому игроку и 3 повреждения тому существу.", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 211084, "name": "炙热火光", "text": "炙热火光对目标牌手造成1点伤害，并对目标由该牌手操控的生物造成1点伤害。\n地落～如果本回合中有地在你的操控下进战场，则改为炙热火光对该牌手造成3点伤害，并对该生物造成3点伤害。", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "130254", "cardKingdomId": "130105", "cardsphereId": "47539", "mcmId": "22240", "mcmMetaId": "11076", "mtgjsonV4Id": "4e038342-7b39-5943-a020-66d735b5f1bd", "mtgoFoilId": "35560", "mtgoId": "35559", "multiverseId": "193982", "scryfallId": "301f13dd-39b8-4a93-9c05-3dc4fa1f1c75", "scryfallIllustrationId": "53d96dba-c78a-4ad2-ac52-46c6d3804bf1", "scryfallOracleId": "74b08a70-b0bb-4340-98a0-b1d5b7c9d2cc", "tcgplayerProductId": "34429"}, "keywords": ["Landfall"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "vintage": "Legal"}, "manaCost": "{R}{R}", "manaValue": 2.0, "name": "Searing Blaze", "number": "90", "originalText": "Searing Blaze deals 1 damage to target player and 1 damage to target creature that player controls.\nLandfall — If you had a land enter the battlefield under your control this turn, Searing Blaze deals 3 damage to that player and 3 damage to that creature instead.", "originalType": "Instant", "printings": ["DDI", "P11", "PRM", "WWK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/71a305e07a1e89ee", "cardKingdomFoil": "https://mtgjson.com/links/37f7ff63f4c815ea", "cardmarket": "https://mtgjson.com/links/00b59c9d07c448f5", "tcgplayer": "https://mtgjson.com/links/0ca57d734051e38f"}, "rarity": "common", "rulings": [{"date": "2010-03-01", "text": "Whether you had a land enter the battlefield under your control this turn is checked as this spell resolves, not as you cast it."}, {"date": "2010-03-01", "text": "Having more than one land enter the battlefield under your control this turn provides no additional benefit."}, {"date": "2010-03-01", "text": "The landfall ability checks for an action that has happened in the past. It doesn’t matter if a land that entered the battlefield under your control previously in the turn is still on the battlefield, is still under your control, or is still a land."}, {"date": "2010-03-01", "text": "Once the spell resolves, having a land enter the battlefield under your control provides no further benefit."}, {"date": "2010-03-01", "text": "The effect of this spell’s landfall ability replaces its normal effect. If you had a land enter the battlefield under your control this turn, only the landfall-based effect happens."}, {"date": "2010-03-01", "text": "You must choose two targets as you cast Searing Blaze: a player and a creature that player controls. If you can’t (because there are no creatures on the battlefield, perhaps), then you can’t cast the spell."}, {"date": "2010-03-01", "text": "If either target is illegal by the time Searing Blaze resolves, it still deals damage to the other target."}], "setCode": "WWK", "subtypes": [], "supertypes": [], "text": "Searing Blaze deals 1 damage to target player or planeswalker and 1 damage to target creature that player or that planeswalker's controller controls.\nLandfall — If you had a land enter the battlefield under your control this turn, Searing Blaze deals 3 damage to that player or planeswalker and 3 damage to that creature instead.", "type": "Instant", "types": ["Instant"], "uuid": "4ca819cb-a58e-5578-a4d6-3a492ba2122c"}