{"artist": "Matt Warren", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B", "R", "U"], "colors": ["B", "R", "U"], "convertedManaCost": 3.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "250121", "cardsphereId": "83008", "mcmId": "415184", "mtgjsonV4Id": "1fb90a2e-2142-5bfb-ae3d-6877901766b4", "scryfallId": "edf62ee7-1800-4748-87a8-0432635b4f60", "scryfallIllustrationId": "840d3126-d106-44e0-af2b-c1b0f8851bc1", "scryfallOracleId": "022667d0-60f2-4e37-bc50-53198fc933ab", "tcgplayerProductId": "246950"}, "isFunny": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {}, "manaCost": "{U}{B}{R}", "manaValue": 3.0, "name": "Seek Bolas's Counsel", "number": "98", "printings": ["CMB1", "CMB2"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/208c5e25fa83597f", "tcgplayer": "https://mtgjson.com/links/0cc10b3130e42d44"}, "rarity": "rare", "rulings": [{"date": "2019-11-12", "text": "You can’t choose to roll a planar die (which would allow you to leave the Pools of Becoming or trigger its last ability) unless you’re playing a Planechase game."}, {"date": "2019-11-12", "text": "There’s no way to leave Pools of Becoming other than by rolling a planar die or finding an effect that instructs you to planeswalk."}, {"date": "2019-11-12", "text": "One a spell or ability has had a random mode chosen, a player can’t choose to not finish casting or activating that spell or ability unless there’s no way for the player to complete the process. For example, the player can’t choose to not activate mana abilities to pay for the spell."}, {"date": "2019-11-12", "text": "Pools of Becoming is a plane card that reads “At the beginning of your end step, put the cards in your hand on the bottom of your library in any order, then draw that many cards” and “Whenever you roll CHAOS, reveal the top three cards of your planar deck. Each of the revealed cards' CHAOS abilities triggers. Then put the revealed cards on the bottom of your planar deck in any order.” The second ability can’t trigger unless you roll a planar die."}, {"date": "2019-11-12", "text": "You planeswalk to Pools of Becoming even if you’re not playing a Planechase game. This planeswalk isn’t represented by a plane card. If you are playing a Planechase game, you planeswalk away from the current plane but you don’t reveal the top card of any planar deck."}, {"date": "2019-11-12", "text": "Each player controls the current plane card during their turn."}, {"date": "2019-11-12", "text": "One card (Fractured Powerstone) allows you to roll the planar die even if you’re not playing a Planechase game as long as you’ve already planeswalked to a plane card. If you roll the Planeswalker symbol outside of a Planechase game, you’ll planeswalk away from Pools of Becoming, but you won’t planeswalk to a new plane. You’re totally lost, which tends to work out well."}, {"date": "2019-11-12", "text": "If Bolas has you choose the fourth mode, you can’t play land cards exiled this way."}, {"date": "2019-11-12", "text": "You must cast any of the exiled cards you wish to cast while Seek Bolas’s Counsel is resolving. You can’t cast them later in the turn."}, {"date": "2019-11-12", "text": "If a spell has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}, {"date": "2019-11-12", "text": "If you cast a card “without paying its mana cost,” you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, such as that of Tormenting Voice, you must pay those to cast the card."}, {"date": "2019-11-12", "text": "The last mode’s emblem doesn’t change when you can cast cards from your sideboard."}, {"date": "2019-11-12", "text": "In a Limited event, each card a player opened (in a Sealed Deck event) or drafted (in a Booster Draft event) is their sideboard."}], "setCode": "CMB2", "subtypes": [], "supertypes": [], "text": "Choose one at random —\n• You get an emblem with \"At the beginning of your upkeep, pay {U}{B}{R}. If you don't, you lose the game.\"\n• Each player discards their hand.\n• Planeswalk to Pools of Becoming. (Once there, you can roll the planar die only if you're playing Planechase.)\n• For each opponent, exile cards from the top of their library until you exile a nonland card. You may cast those cards without paying their mana costs.\n• Destroy all creatures and non-Bolas planeswalkers.\n• You get an emblem with \"You can cast nonland cards from your sideboard.\"", "type": "Sorcery", "types": ["Sorcery"], "uuid": "575869f9-a77f-5484-8944-7bb3d85d01e8"}