{"artist": "Ryan Pancoast", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B", "U", "W"], "colors": ["B", "U", "W"], "convertedManaCost": 3.0, "edhrecRank": 4231, "finishes": ["foil"], "foreignData": [], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "249505", "mcmId": "573163", "mtgjsonV4Id": "e8ac29fa-8e1e-50ba-99c5-f6eea0ce3c43", "scryfallId": "87464c37-09cf-4fc7-ad71-9c35c3b7ff76", "scryfallIllustrationId": "88109ae6-acc8-4cff-8b80-c59474ae3077", "scryfallOracleId": "9b21e056-57e7-4e39-b2b4-2fdf8719d0d2", "tcgplayerProductId": "243687"}, "isReprint": true, "isStarter": true, "keywords": ["Venture into the dungeon"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {}, "manaCost": "{W}{U}{B}", "manaValue": 3.0, "name": "Sefris of the Hidden Ways", "number": "3", "power": "2", "printings": ["AFC", "OAFC"], "promoTypes": ["thick"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/03d0ee63015e4821", "tcgplayer": "https://mtgjson.com/links/7c1c2231cb9a928a"}, "rarity": "mythic", "rulings": [{"date": "2021-07-23", "text": "To venture into the dungeon, a player moves their venture marker into the next room of the dungeon they are currently in. If they aren't currently in a dungeon, that player instead chooses a dungeon card from outside the game, puts it into the command zone, and moves their venture marker onto the first room."}, {"date": "2021-07-23", "text": "Moving into a dungeon room will cause its room ability to trigger."}, {"date": "2021-07-23", "text": "Once you resolve the last room ability of a dungeon, that dungeon is now completed and is removed from the game."}, {"date": "2021-07-23", "text": "A player may only have one dungeon in the command zone at a time."}, {"date": "2021-07-23", "text": "The player venturing into the dungeon chooses which dungeon they will venture into. They may choose a dungeon that they have already completed this game."}, {"date": "2021-07-23", "text": "Sefris of the Hidden Ways' first ability looks only at the type the card has in the graveyard, not the type it had in any other zone. For example, animated lands dying won't cause the ability to trigger. The opposite is also true. For example, if a creature that was cast as an Adventure is countered, it's a creature card in the graveyard and the first ability will trigger."}, {"date": "2021-07-23", "text": "You can only move forward (well, downward) in a dungeon, never backwards or sideways."}, {"date": "2021-07-23", "text": "Dungeons are removed from the game as a state-based action."}, {"date": "2021-07-23", "text": "If you somehow venture into the dungeon while a room's ability is on the stack, you will continue on in the dungeon. If you're already in the last room, complete that dungeon and start a new one."}, {"date": "2021-07-23", "text": "Choosing the dungeon or room to venture into is part of resolving the venture into the dungeon keyword action. Once that choice is made, players may not respond until after the appropriate room ability has triggered."}, {"date": "2021-07-23", "text": "Dungeon cards are not part of a player's deck or sideboard. In both constructed and limited formats, players can use any dungeon card when they venture into the dungeon."}, {"date": "2021-09-24", "text": "Sefris of the Hidden Ways must be on the battlefield for its first ability to trigger. It does not trigger when Sefris goes to the graveyard from the battlefield, even if other creature cards also went to the graveyard at the same time."}], "securityStamp": "oval", "setCode": "OAFC", "subtypes": ["Human", "Wizard"], "supertypes": ["Legendary"], "text": "Whenever one or more creature cards are put into your graveyard from anywhere, venture into the dungeon. This ability triggers only once each turn. (To venture into the dungeon, enter the first room or advance to the next room.)\nCreate Undead — Whenever you complete a dungeon, return target creature card from your graveyard to the battlefield.", "toughness": "3", "type": "Legendary Creature — Human Wizard", "types": ["Creature"], "uuid": "e6c1b475-314a-517d-9eff-6b05482962f2"}