{"artist": "Deruchenko Alexander", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 5.0, "edhrecRank": 11889, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 535254, "name": "Nutze den Sturm", "text": "Erzeuge einen roten Elementarwesen-Kreaturenspielstein, der Trampelschaden verursacht, mit „Stärke und Widerstandskraft dieser Kreatur sind gleich der Anzahl an Spontanzauber- und Hexereikarten in deinem Friedhof plus der Anzahl an Karten mit Rückblende, die du besitzt und die sich im Exil befinden.\"\nRückblende {6}{R} (Du kannst diese Karte aus deinem Friedhof für ihre Rückblendekosten wirken. Schicke sie danach ins Exil.)", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 535570, "name": "Hacerse con la tormenta", "text": "Crea una ficha de criatura Elemental roja con la habilidad de arrollar y \"Tanto la fuerza como la resistencia de esta criatura son iguales a la cantidad de cartas de instantáneo y de conjuro en tu cementerio más la cantidad de cartas con la habilidad de retrospectiva de las cuales eres propietario en el exilio\".\nRetrospectiva {6}{R}. (Puedes lanzar esta carta desde tu cementerio pagando su coste de retrospectiva. Luego exíliala.)", "type": "Conjuro"}, {"language": "French", "multiverseId": 535886, "name": "S'emparer de la tempête", "text": "Créez un jeton de créature rouge Élémental avec le piétinement et « La force et l'endurance de cette créature sont chacune égales au nombre de cartes d'éphémère et de rituel dans votre cimetière plus le nombre de cartes avec le flashback que vous possédez en exil. »\nFlashback {6}{R} (Vous pouvez lancer cette carte depuis votre cimetière pour son coût de flashback. Exilez-la ensuite.)", "type": "Rituel"}, {"language": "Italian", "multiverseId": 536202, "name": "Catturare la Tempesta", "text": "Crea una pedina creatura Elementale rossa con travolgere e \"La forza e la costituzione di questa creatura sono pari al numero di carte istantaneo e stregoneria nel tuo cimitero più il numero di carte con flashback che possiedi in esilio\".\nFlashback {6}{R} (Puoi lanciare questa carta dal tuo cimitero pagando il suo costo di flashback. Poi esiliala.)", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 536518, "name": "嵐の捕縛", "text": "トランプルと「このクリーチャーのパワーとタフネスはそれぞれ、あなたの墓地にありインスタントやソーサリーであるカードの枚数と追放領域にありあなたがオーナーでありフラッシュバックを持つカードの枚数を足した値に等しい。」を持つ赤のエレメンタル・クリーチャー・トークン１体を生成する。\nフラッシュバック{6}{R}（あなたはあなたの墓地から、このカードをフラッシュバック・コストで唱えてもよい。その後、これを追放する。）", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 536834, "name": "폭풍 붙잡기", "text": "돌진 및 \"이 생물의 공격력 및 방어력은 각각 당신의 무덤에 있는 순간마법 및 집중마법의 수에 추방 영역에 있는 카드들 중 당신이 소유한 회상을 가진 카드의 수를 더한 것과 같다.\"를 가진 적색 정령 생물 토큰 한 개를 만든다.\n회상 {6}{R} (당신은 이 카드의 회상 비용을 지불해 이 카드를 당신의 무덤에서 발동할 수 있다. 그 후 이 카드를 추방한다.)", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 537150, "name": "Apreender a Tempestade", "text": "Crie uma ficha de criatura Elemental vermelha com atropelar e \"O poder e a resistência desta criatura são ambos iguais ao número de cards de mágica instantânea e feitiço em seu cemitério mais o número de cards com recapitular seus no exílio\".\nRecapitular {6}{R} (Você pode conjurar este card de seu cemitério pagando seu custo de recapitular. Depois, exile-o.)", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 537466, "name": "Покорить Бурю", "text": "Создайте одну фишку существа красный Элементаль с Пробивным ударом и способностью «Сила и выносливость этого существа равны количеству карт волшебства и мгновенных заклинаний на вашем кладбище в сумме с количеством принадлежащих вам карт с Воспоминанием в изгнании».\nВоспоминание {6}{R} (Вы можете разыграть эту карту из вашего кладбища за ее стоимость Воспоминания. Затем изгоните ее.)", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 537782, "name": "掌握风暴", "text": "派出一个红色元素衍生生物，且具有践踏与「此生物的力量和防御力各等同于你坟墓场中瞬间与法术牌数量和放逐区中由你拥有且具返照异能的牌数量之总和。」\n返照{6}{R}（你可以从你坟墓场中施放此牌，并支付其返照费用，然后将它放逐。）", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 538098, "name": "掌握風暴", "text": "派出一個紅色元素衍生生物，且具有踐踏與「此生物的力量和防禦力各等同於你墳墓場中瞬間與巫術牌數量和放逐區中由你擁有且具返照異能的牌數量之總和。」\n返照{6}{R}（你可以從你墳墓場中施放此牌，並支付其返照費用，然後將它放逐。）", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "250838", "cardKingdomId": "250406", "cardsphereId": "80646", "mcmId": "574786", "mcmMetaId": "345324", "mtgArenaId": "78509", "mtgjsonV4Id": "853a4ff4-bef7-57cd-a26e-44a8ce82ff41", "mtgoId": "93290", "multiverseId": "534938", "scryfallId": "532e079f-55b7-4b92-b489-aed4d3becae7", "scryfallIllustrationId": "639b6b91-221b-4ac9-8d31-89bc25b5a95c", "scryfallOracleId": "d3455e93-3a05-42db-945d-c4c85f4ac827", "tcgplayerProductId": "247960"}, "keywords": ["Flashback"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{4}{R}", "manaValue": 5.0, "name": "Seize the Storm", "number": "158", "originalText": "Create a red Elemental creature token with trample and \"This creature's power and toughness are each equal to the number of instant and sorcery cards in your graveyard plus the number of cards with flashback you own in exile.\"\nFlashback {6}{R} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", "originalType": "Sorcery", "printings": ["DBL", "J22", "MID"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6fbe93cdad94dfbb", "cardKingdomFoil": "https://mtgjson.com/links/0e1a46961c30efd3", "cardmarket": "https://mtgjson.com/links/19741a9f955f5de6", "tcgplayer": "https://mtgjson.com/links/dcd33d640ae1160f"}, "rarity": "uncommon", "rulings": [{"date": "2021-09-24", "text": "The power and toughness of the Elemental token will change as the number of instant and sorcery cards in your graveyard and the number of cards with flashback you own in exile change."}, {"date": "2021-09-24", "text": "If you cast Seize the Storm with no instant or sorcery cards in your graveyard and no cards with flashback in exile, the Elemental will start as a 0/0 creature. However, state-based actions won't be checked until after Seize the Storm has finished resolving. The Elemental will then be a 1/1 creature and survive because Seize the Storm will either be in your graveyard or in exile."}, {"date": "2021-09-24", "text": "While a spell is on the stack, it is neither in your graveyard nor in exile, so it won't contribute to the Elemental's power and toughness. For example, with Seize the Storm in your graveyard and no cards in exile, the 1/1 Elemental in the above scenario will become 0/0 and die if you cast Seize the Storm from your graveyard using flashback."}, {"date": "2021-09-24", "text": "“Flashback [cost]” means “You may cast this card from your graveyard by paying [cost] rather than paying its mana cost” and “If the flashback cost was paid, exile this card instead of putting it anywhere else any time it would leave the stack.”"}, {"date": "2021-09-24", "text": "You must still follow any timing restrictions and permissions, including those based on the card's type. For instance, you can cast a sorcery using flashback only when you could normally cast a sorcery."}, {"date": "2021-09-24", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a flashback cost) you're paying, add any cost increases, then apply any cost reductions. The mana value of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2021-09-24", "text": "A spell cast using flashback will always be exiled afterward, whether it resolves, is countered, or leaves the stack in some other way."}, {"date": "2021-09-24", "text": "You can cast a spell using flashback even if it was somehow put into your graveyard without having been cast."}, {"date": "2021-09-24", "text": "If a card with flashback is put into your graveyard during your turn, you can cast it if it's legal to do so before any other player can take any actions."}], "setCode": "MID", "subtypes": [], "supertypes": [], "text": "Create a red Elemental creature token with trample and \"This creature's power and toughness are each equal to the number of instant and sorcery cards in your graveyard plus the number of cards with flashback you own in exile.\"\nFlashback {6}{R} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "535db88a-d4e3-5ad6-8d06-36a5fa0fece5"}