{"artist": "Tomasz Jedruszek", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 6.0, "edhrecRank": 9550, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 484963, "name": "Selektive Anpassung", "text": "Decke die obersten sieben Karten deiner Bibliothek auf. Bestimme davon je eine Karte mit Flugfähigkeit, Erstschlag, Doppelschlag, Todesberührung, Eile, Fluchsicherheit, Unzerstörbarkeit, Lebensverknüpfung, Bedrohlichkeit, Reichweite, Wachsamkeit sowie verursacht Trampelschaden. Bringe eine der bestimmten Karten ins Spiel, die anderen bestimmten Karten auf deine Hand und lege den Rest auf deinen Friedhof.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 485014, "name": "Adaptación selectiva", "text": "Muestra las siete primeras cartas de tu biblioteca. Elige de entre ellas una carta con la habilidad de volar, una carta con la habilidad de dañar primero, y así sucesivamente con dañar dos veces, toque mortal, prisa, antimaleficio, indestructible, vínculo vital, amenaza, alcance, arrollar y vigilancia. Pon una de las cartas elegidas en el campo de batalla, las otras cartas elegidas en tu mano y el resto en tu cementerio.", "type": "Conjuro"}, {"language": "French", "multiverseId": 485065, "name": "Adaptation sélective", "text": "Révélez les sept cartes du dessus de votre bibliothèque. Parmi elles, choisissez une carte avec le vol, une carte avec l'initiative et ainsi de suite pour la double initiative, le contact mortel, la célérité, la défense talismanique, l'indestructible, le lien de vie, la menace, la portée, le piétinement et la vigilance. Mettez une des cartes choisies sur le champ de bataille, les autres cartes choisies dans votre main, et le reste dans votre cimetière.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 485116, "name": "Adattamento Selettivo", "text": "Rivela le prime sette carte del tuo grimorio. Scegli tra esse una carta con volare, una carta con attacco improvviso e così via per doppio attacco, tocco letale, rapidità, anti-malocchio, indistruttibile, legame vitale, minacciare, raggiungere, travolgere e cautela. Metti sul campo di battaglia una delle carte scelte, aggiungi alla tua mano le altre carte scelte e metti le altre nel tuo cimitero.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 485167, "name": "選択的順応", "text": "あなたのライブラリーの一番上からカードを７枚公開する。あなたはその中から、飛行を持つカード１枚と、先制攻撃を持つカード１枚と、二段攻撃、接死、速攻、呪禁、破壊不能、絆魂、威迫、到達、トランプル、警戒についてもそれぞれそれを持つカード１枚を選ぶ。それらの選ばれたカードのうち１枚を戦場に出し、他の選ばれたカードをあなたの手札に加え、残りをあなたの墓地に置く。", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 485218, "name": "Adaptação Seletiva", "text": "Revele os sete cards do topo de seu grimório. Escolha dentre eles um card com voar, um card com iniciativa e assim por diante para golpe duplo, toque mortífero, ímpeto, resistência a magia, indestrutível, vínculo com a vida, ameaçar, alcance, atropelar e vigilância. Coloque um dos cards escolhidos no campo de batalha. Coloque os outros cards escolhidos em sua mão e o restante em seu cemitério.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 485269, "name": "Избирательная Адаптация", "text": "Покажите семь верхних карт вашей библиотеки. Выберите находящуюся среди них карту с Полетом, карту с Первым ударом и так далее для Бдительности, Двойного удара, Захвата, Неразрушимости, Порчеустойчивости, Пробивного удара, Смертельного касания, Угрозы, Ускорения и Цепи жизни. Положите одну из выбранных карт на поле битвы, остальные выбранные карты — в вашу руку, а оставшиеся — на ваше кладбище.", "type": "Волшебство"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "232335", "cardsphereId": "66357", "mcmId": "452253", "mtgjsonV4Id": "f50cca1a-a251-5517-8725-4da3d7d3d955", "mtgoId": "80711", "multiverseId": "484912", "scryfallId": "adbd8ffa-c7d3-4ef6-b3a7-8a967b50ce49", "scryfallIllustrationId": "f6a8b274-9ce0-4d31-9a92-bfb043851b48", "scryfallOracleId": "b68df6d7-d69e-446f-9b1b-7a6ca56efbec", "tcgplayerProductId": "212184"}, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{G}{G}", "manaValue": 6.0, "name": "Selective Adaptation", "number": "65", "originalText": "Reveal the top seven cards of your library. Choose from among them a card with flying, a card with first strike, and so on for double strike, deathtouch, haste, hexproof, indestructible, lifelink, menace, reach, trample, and vigilance. Put one of the chosen cards onto the battlefield, the other chosen cards into your hand, and the rest into your graveyard.", "originalType": "Sorcery", "printings": ["C20"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/592f18b51f22d5f5", "tcgplayer": "https://mtgjson.com/links/69980c79735bbaff"}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "If a card has more than one of the listed keywords, you pick which keyword you’re choosing it for. For example, if you choose a card with flying and first strike, you may choose it as the card with flying and choose another card with first strike, or you may choose it as the card with first strike and choose another card with flying."}], "securityStamp": "oval", "setCode": "C20", "subtypes": [], "supertypes": [], "text": "Reveal the top seven cards of your library. Choose from among them a card with flying, a card with first strike, and so on for double strike, deathtouch, haste, hexproof, indestructible, lifelink, menace, reach, trample, and vigilance. Put one of the chosen cards onto the battlefield, the other chosen cards into your hand, and the rest into your graveyard.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "596797bb-9f38-55ac-8530-7d2e8e018d7a"}