{"artist": "Svetlin Velinov", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 6.0, "edhrecRank": 3699, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "1831f4c6-811a-56a3-83f5-189c6a993795", "mtgoId": "65787", "scryfallId": "2344d20d-542a-4fd6-9876-0f35beb1cd5c", "scryfallIllustrationId": "c3170536-c5c3-4e4a-909f-9282e9cd4bb8", "scryfallOracleId": "9d2aea05-f55c-4355-950f-bfdc4e985e80"}, "isOnlineOnly": true, "isReprint": true, "isStarter": true, "keywords": ["Council's dilemma"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{G}{G}", "manaValue": 6.0, "name": "Selvala's Stampede", "number": "65787", "printings": ["CN2", "PZ2"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2016-08-23", "text": "You must vote for one of the available options. You can’t abstain."}, {"date": "2016-08-23", "text": "The creature cards revealed for the wild votes all enter the battlefield at the same time, followed by the permanent cards put onto the battlefield from your hand for the free votes."}, {"date": "2016-08-23", "text": "Any abilities that trigger because of any of those cards entering the battlefield are put onto the stack at the same time, after Selvala’s Stampede finishes resolving. You choose the order that abilities you control go on the stack, followed by each other player in turn order choosing the order for abilities they control. The last ability to be put on the stack will resolve first."}, {"date": "2016-08-23", "text": "Unlike the will of the council cards from the original Conspiracy set, where a majority of votes determined what happened, each vote made for a council’s dilemma card adds to the ultimate effect."}, {"date": "2016-08-23", "text": "The effects of each council’s dilemma ability happen in the stated order. First the vote occurs, then the first effect, and finally the second effect."}, {"date": "2016-08-23", "text": "Because the votes are made in turn order, each player will know the votes of players who voted beforehand."}, {"date": "2016-08-23", "text": "If a creature with an enters-the-battlefield council’s dilemma ability leaves the battlefield before that ability resolves, players can still vote for any option that would put +1/+1 counters on that creature, even though—or perhaps especially because—those votes won’t generate an effect."}, {"date": "2016-08-23", "text": "No player votes until the spell or ability resolves. Any responses to that spell or ability must be made without knowing the outcome of the vote."}, {"date": "2016-08-23", "text": "Players can’t do anything between voting and finishing the resolution of the spell or ability that included the vote."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": [], "supertypes": [], "text": "Council's dilemma — Starting with you, each player votes for wild or free. Reveal cards from the top of your library until you reveal a creature card for each wild vote. Put those creature cards onto the battlefield, then shuffle the rest into your library. You may put a permanent card from your hand onto the battlefield for each free vote.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "c44ad5d5-5844-5f18-bddd-80a7d28ec5ac"}