{"artist": "Pete Venters", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 6.0, "edhrecRank": 4704, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "7bc2b574-5a84-5fe8-b03e-0ccdb0e6b5a7", "mtgoId": "86358", "scryfallId": "ddd05096-c220-484b-922e-41f4fe06f499", "scryfallIllustrationId": "ef6fec51-3b08-4490-80ea-ac0c2b8b4db4", "scryfallOracleId": "f49f84f9-616e-495b-8d87-4de7941f230e"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Flying", "Partner"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{B}{B}", "manaValue": 6.0, "name": "Sengir, the Dark Baron", "number": "86358", "originalReleaseDate": "2020-12-15", "power": "4", "printings": ["CMR", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-11-10", "text": "If Sengir, the Dark Baron is dealt lethal damage at the same time as other creatures, they die at the same time. The second ability won’t resolve in time to save Sengir, the Dark Baron."}, {"date": "2020-11-10", "text": "Sengir, the Dark Baron’s third ability will trigger no matter how the player lost the game: due to a state-based action (having 0 or less life, trying to draw a card from an empty library, having 10 or more poison counters), because of a spell or effect that states they lose the game, because your awesome might has left them with no choice other than concession, or for any other reason."}, {"date": "2020-11-10", "text": "If you and another player lose the game at the same time, the third ability won’t resolve in time to save you."}, {"date": "2020-11-10", "text": "If your Commander deck has two commanders, you can only include cards whose own color identities are also found in your commanders’ combined color identities. If Falthis and Kediss are your commanders, your deck may contain cards with black and/or red in their color identity, but not cards with green, white, or blue."}, {"date": "2020-11-10", "text": "Both commanders start in the command zone, and the remaining 98 cards (or 58 cards in a Commander Draft game) of your deck are shuffled to become your library."}, {"date": "2020-11-10", "text": "To have two commanders, both must have the partner ability as the game begins. Losing the ability during the game doesn’t cause either to cease to be your commander."}, {"date": "2020-11-10", "text": "Once the game begins, your two commanders are tracked separately. If you cast one, you won’t have to pay an additional {2} the first time you cast the other. A player loses the game after having been dealt 21 damage from any one of them, not from both of them combined."}, {"date": "2020-11-10", "text": "If something refers to your commander while you have two commanders, it refers to one of them of your choice. If you are instructed to perform an action on your commander (e.g. put it from the command zone into your hand due to Command Beacon), you choose one of your commanders at the time the effect happens."}, {"date": "2020-11-10", "text": "An effect that checks whether you control your commander is satisfied if you control one or both of your two commanders."}, {"date": "2020-11-10", "text": "You can choose two commanders with partner that are the same color or colors. In Commander Draft, you can even choose two of the same commander with partner if you drafted them. If you do this, make sure you keep the number of times you’ve cast each from the command zone clear for “commander tax” purposes."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Vampire", "Noble"], "supertypes": ["Legendary"], "text": "Flying\nWhenever another creature dies, put two +1/+1 counters on Sengir, the Dark Baron.\nWhenever another player loses the game, you gain life equal to that player's life total as the turn began.\nPartner (You can have two commanders if both have partner.)", "toughness": "4", "type": "Legendary Creature — Vampire Noble", "types": ["Creature"], "uuid": "509381e5-bf0d-506a-b871-d0b74586a57f", "variations": ["071acc0d-aead-55a9-9c36-b2dd65836f31"]}