{"artist": "Christopher Rush", "availability": ["mtgo"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 7.0, "edhrecRank": 21123, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "5c55ea22-0482-5832-b796-47659fd44aa4", "mtgoFoilId": "28066", "mtgoId": "28065", "multiverseId": "159245", "scryfallId": "b1c34789-3927-4547-b6fb-e121bacc7e78", "scryfallIllustrationId": "0ca5eff2-c34f-4536-a2c6-de1cf8e4772e", "scryfallOracleId": "a1c50bd1-120d-44ac-af20-13a90fc991e6"}, "isOnlineOnly": true, "isReprint": true, "keywords": ["Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "penny": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{6}{W}", "manaValue": 7.0, "name": "Seraph", "number": "26", "originalText": "Flying\nWhenever a creature dealt damage by Seraph this turn is put into a graveyard, put that card into play under your control at end of turn. Sacrifice the creature when you lose control of Seraph.", "originalType": "Creature - Angel", "power": "4", "printings": ["5ED", "ICE", "ME1"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "You do not get the creature back if the creature is not still in the graveyard at the end of the turn."}, {"date": "2007-09-16", "text": "If Seraph isn’t on the battlefield at the time the other creature is put into a graveyard, the ability won’t trigger. However, the ability does trigger if Seraph and the other creature are put into the graveyard at the same time."}, {"date": "2007-09-16", "text": "If the other creature is a token, it will cease to exist after being exiled. It won’t be returned to the battlefield."}, {"date": "2007-09-16", "text": "If the other creature ceases to be a creature card after it leaves the battlefield (it’s an animated Mishra’s Factory, for example), it will be returned to the battlefield by this ability and you will have to sacrifice it when you lose control of Seraph."}, {"date": "2007-09-16", "text": "Once the ability triggers, you’ll return the card to the battlefield under your control at the end of the turn even if you no longer control Seraph at that time. In fact, if Seraph leaves the battlefield before the card is returned to the battlefield, you’ll never have to sacrifice it as a result of this ability. If Seraph remains on the battlefield but changes controllers before the card is returned, you’ll still get the returned card. However, in that scenario, you’ll still have to sacrifice it if you later regain control Seraph and then lose control of it once more."}], "setCode": "ME1", "subtypes": ["Angel"], "supertypes": [], "text": "Flying\nWhenever a creature dealt damage by Seraph this turn dies, put that card onto the battlefield under your control at the beginning of the next end step. Sacrifice the creature when you lose control of Seraph.", "toughness": "4", "type": "Creature — Angel", "types": ["Creature"], "uuid": "99bf0b13-e8c4-5149-8c79-74b0550550ac"}