{"artist": "Zoltan Boros", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 535, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameEffects": ["tombstone"], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "272785", "cardKingdomId": "272424", "mcmId": "688512", "mcmMetaId": "277867", "mtgjsonV4Id": "a4ab37ed-a427-5675-ac88-62ed45f52b04", "scryfallId": "02ec5dc4-a40d-41d4-ba50-47c494632037", "scryfallIllustrationId": "3451d9e7-5f45-4988-b078-db626e2461f1", "scryfallOracleId": "1b9f9f5b-8712-4f00-90cb-1b7b9970eccc", "tcgplayerProductId": "457195"}, "isReprint": true, "isStarter": true, "keywords": ["Flashback"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}", "manaValue": 3.0, "name": "Sevinne's Reclamation", "number": "273", "printings": ["C19", "CLB", "DMR"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/3b2e38b5bdebefc2", "cardKingdomFoil": "https://mtgjson.com/links/822454017873452a", "cardmarket": "https://mtgjson.com/links/e5527e72dcb78e81", "tcgplayer": "https://mtgjson.com/links/daecb722ed5127b8"}, "rarity": "rare", "rulings": [{"date": "2019-08-23", "text": "If a card in a graveyard has {X} in its mana cost, X is considered to be 0."}, {"date": "2019-08-23", "text": "If the target card is an illegal target by the time Sevinne's Reclamation tries to resolve, the spell doesn't resolve. You won't copy it if you cast it from a graveyard."}, {"date": "2019-08-23", "text": "The copy that Sevinne's Reclamation creates is created on the stack, so it's not “cast.” Abilities that trigger when a player casts a spell won't trigger. The copy wasn't cast from a graveyard, so it won't make another copy of itself."}, {"date": "2019-08-23", "text": "If you cast Sevinne's Reclamation from your graveyard, any abilities that trigger as the permanent card returns to the battlefield will resolve before the copy of Sevinne's Reclamation resolves but after new targets for the copy have been chosen."}, {"date": "2019-08-23", "text": "A permanent card is an artifact, creature, enchantment, land, or planeswalker card."}, {"date": "2021-03-19", "text": "If a card with flashback is put into your graveyard during your turn, you can cast it if it's legal to do so before any other player can take any actions."}, {"date": "2021-03-19", "text": "“Flashback [cost]” means “You may cast this card from your graveyard by paying [cost] rather than paying its mana cost” and “If the flashback cost was paid, exile this card instead of putting it anywhere else any time it would leave the stack.”"}, {"date": "2021-03-19", "text": "You must still follow any timing restrictions and permissions, including those based on the card's type. For instance, you can cast a sorcery using flashback only when you could normally cast a sorcery."}, {"date": "2021-03-19", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a flashback cost) you're paying, add any cost increases, then apply any cost reductions. The mana value of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2021-03-19", "text": "A spell cast using flashback will always be exiled afterward, whether it resolves, is countered, or leaves the stack in some other way."}, {"date": "2021-03-19", "text": "You can cast a spell using flashback even if it was somehow put into your graveyard without having been cast."}], "setCode": "DMR", "subtypes": [], "supertypes": [], "text": "Return target permanent card with mana value 3 or less from your graveyard to the battlefield. If this spell was cast from a graveyard, you may copy this spell and may choose a new target for the copy.\nFlashback {4}{W} (You may cast this card from your graveyard for its flashback cost. Then exile it.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "7c32fff9-5c9c-5d98-826b-8c1fb3e7e522", "variations": ["9452982f-c6c0-58d3-ae37-f5efaa551f2c"]}