{"artist": "Jason Felix", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 2.0, "edhrecRank": 17405, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 435704, "name": "Schattensegel-Karavelle", "text": "Immer wenn eine Kreatur, die du kontrollierst, erkundet, lege eine +1/+1-Marke auf die Schattensegel-Karavelle.\nBemannen 2 (Tappe eine beliebige Anzahl an Kreaturen, die du kontrollierst und die zusammen Stärke 2 oder mehr haben: Dieses Fahrzeug wird bis zum Ende des Zuges zu einer Artefaktkreatur.)", "type": "Artefakt — Fahrzeug"}, {"language": "Spanish", "multiverseId": 437797, "name": "Carabela sombría", "text": "Siempre que una criatura que controlas explore, pon un contador +1/+1 sobre la Carabela sombría.\nTripular 2. (Girar cualquier cantidad de criaturas que controlas con una fuerza total de 2 o más: Este Vehículo se convierte en una criatura artefacto hasta el final del turno.)", "type": "Artefacto — Vehículo"}, {"language": "French", "multiverseId": 436003, "name": "Caravelle enténébrée", "text": "À chaque fois qu'une créature que vous contrôlez explore, mettez un marqueur +1/+1 sur la Caravelle enténébrée.\nPilotage 2 (Engagez n'importe quel nombre de créatures que vous contrôlez dont la force totale est supérieure ou égale à 2 : Ce véhicule devient une créature-artefact jusqu'à la fin du tour.)", "type": "Artefact : véhicule"}, {"language": "Italian", "multiverseId": 436302, "name": "Caravella Adombrata", "text": "Ogniqualvolta una creatura che controlli esplora, metti un segnalino +1/+1 sulla Caravella Adombrata.\nManovrare 2 (TAPpa un qualsiasi numero di creature che controlli con forza totale pari o superiore a 2: Questo Veicolo diventa una creatura artefatto fino alla fine del turno.)", "type": "Artefatto — Veicolo"}, {"language": "Japanese", "multiverseId": 436601, "name": "陰鬱な帆船", "text": "あなたがコントロールしているクリーチャーが１体探検を行うたび、陰鬱な帆船の上に＋１/＋１カウンターを１個置く。\n搭乗２（あなたがコントロールしている望む数のクリーチャーを、パワーの合計が２以上になるように選んでタップする：ターン終了時まで、この機体はアーティファクト・クリーチャーになる。）", "type": "アーティファクト — 機体"}, {"language": "Korean", "multiverseId": 436900, "name": "그림자를 드리운 쾌속선", "text": "당신이 조종하는 생물이 탐험을 할 때마다, 그림자를 드리운 쾌속선에 +1/+1 카운터 한 개를 올려놓는다.\n탑승 2 (당신이 조종하는 생물을 공격력 총합이 2 이상이 되도록 원하는 수만큼 탭한다: 이 탑승물은 턴종료까지 마법물체 생물이 된다.)", "type": "마법물체 — 탑승물"}, {"language": "Portuguese (Brazil)", "multiverseId": 437199, "name": "Caravela Ensombrecida", "text": "Toda vez que uma criatura que você controla explorar, coloque um marcador +1/+1 em Caravela Ensombrecida.\nTripular 2 (Vire qualquer número de criaturas que você controla com total de poder igual ou superior a 2: Este Veículo torna-se uma criatura artefato até o final do turno.)", "type": "Artefato — Veículo"}, {"language": "Russian", "multiverseId": 437498, "name": "Каравелла Теней", "text": "Каждый раз, когда существо под вашим контролем использует Разведку, положите один жетон +1/+1 на Каравеллу Теней.\nЭкипаж 2 (Поверните любое количество существ под вашим контролем с суммарной силой 2 или более: эта Машина становится артефактом существом до конца хода.)", "type": "Артефакт — Машина"}, {"language": "Chinese Simplified", "multiverseId": 438096, "name": "影笼轻帆船", "text": "每当一个由你操控的生物勘察时，在影笼轻帆船上放置一个+1/+1指示物。\n搭载2（横置任意数量由你操控且力量总和等于或大于2的生物：此载具成为神器生物直到回合结束。）", "type": "神器 ～载具"}, {"language": "Chinese Traditional", "multiverseId": 438395, "name": "影籠輕帆船", "text": "每當一個由你操控的生物勘察時，在影籠輕帆船上放置一個+1/+1指示物。\n搭載2（橫置任意數量由你操控且力量總和等於或大於2的生物：此載具成為神器生物直到回合結束。）", "type": "神器 ～載具"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "214384", "cardKingdomId": "214095", "cardsphereId": "51441", "mcmId": "301723", "mcmMetaId": "226957", "mtgArenaId": "66467", "mtgjsonV4Id": "32ba469d-4be5-5b2e-b5be-f8b9e8a3e03c", "mtgoFoilId": "65519", "mtgoId": "65518", "multiverseId": "435405", "scryfallId": "b28ab3ed-32cd-4168-9763-96884491aaa1", "scryfallIllustrationId": "99e2a737-0fb8-4022-946e-f57d45079019", "scryfallOracleId": "7986fcb6-bafb-4bbc-9f2f-fd9e2a5fcad1", "tcgplayerProductId": "145615"}, "keywords": ["Crew"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}", "manaValue": 2.0, "name": "Shadowed Caravel", "number": "246", "originalText": "Whenever a creature you control explores, put a +1/+1 counter on Shadowed Caravel.\nCrew 2 (Tap any number of creatures you control with total power 2 or more: This Vehicle becomes an artifact creature until end of turn.)", "originalType": "Artifact — Vehicle", "power": "2", "printings": ["PXLN", "XLN"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/83011f8bdce294a2", "cardKingdomFoil": "https://mtgjson.com/links/bfe434824198ba3f", "cardmarket": "https://mtgjson.com/links/52e7d0cd3e3ac9f6", "tcgplayer": "https://mtgjson.com/links/408c4e4483bb19ec"}, "rarity": "rare", "rulings": [{"date": "2017-09-29", "text": "Noncreature permanents such as Shadowed Caravel can have +1/+1 counters put on them. Those counters remain on it while it’s not a creature, and will apply if it becomes a creature."}, {"date": "2017-09-29", "text": "If a resolving spell or ability instructs a specific creature to explore but that creature has left the battlefield, the creature still explores. Effects that trigger when a creature you control explores, such as that of Shadowed Caravel, trigger if appropriate."}, {"date": "2017-09-29", "text": "Each Vehicle is printed with a power and toughness, but it’s not a creature. If it becomes a creature (most likely through its crew ability), it will have that power and toughness."}, {"date": "2017-09-29", "text": "If an effect causes a Vehicle to become an artifact creature with a specified power and toughness, that effect overwrites the Vehicle’s printed power and toughness."}, {"date": "2017-09-29", "text": "Vehicle is an artifact type, not a creature type. A Vehicle that’s crewed won’t normally have any creature type."}, {"date": "2017-09-29", "text": "Once a player announces that they are activating a crew ability, no player may take other actions until the ability has been paid for. Notably, players can’t try to stop the ability by changing a creature’s power or by removing or tapping a creature."}, {"date": "2017-09-29", "text": "Any untapped creature you control can be tapped to pay a crew cost, even one that just came under your control."}, {"date": "2017-09-29", "text": "You may tap more creatures than necessary to activate a crew ability."}, {"date": "2017-09-29", "text": "Creatures that crew a Vehicle aren’t attached to it or related in any other way. Effects that affect the Vehicle, such as by destroying it or giving it a +1/+1 counter, don’t affect the creatures that crewed it."}, {"date": "2017-09-29", "text": "Once a Vehicle becomes a creature, it behaves exactly like any other artifact creature. It can’t attack unless you’ve controlled it continuously since your turn began, it can block if it’s untapped, it can be tapped to pay a Vehicle’s crew cost, and so on."}, {"date": "2017-09-29", "text": "You may activate a crew ability of a Vehicle even if it’s already an artifact creature. Doing so has no effect on the Vehicle. It doesn’t change its power and toughness."}, {"date": "2017-09-29", "text": "For a Vehicle to be able to attack, it must be a creature as the declare attackers step begins, so the latest you can activate its crew ability to attack with it is during the beginning of combat step. For a Vehicle to be able to block, it must be a creature as the declare blockers step begins, so the latest you can activate its crew ability to block with it is during the declare attackers step. In either case, players may take actions after the crew ability resolves but before the Vehicle has been declared as an attacking or blocking creature."}, {"date": "2017-09-29", "text": "When a Vehicle becomes a creature, that doesn’t count as having a creature enter the battlefield. The permanent was already on the battlefield; it only changed its types. Abilities that trigger whenever a creature enters the battlefield won’t trigger."}, {"date": "2017-09-29", "text": "If a permanent becomes a copy of a Vehicle, the copy won’t be a creature, even if the Vehicle it’s copying has become an artifact creature."}], "securityStamp": "oval", "setCode": "XLN", "subtypes": ["Vehicle"], "supertypes": [], "text": "Whenever a creature you control explores, put a +1/+1 counter on Shadowed Caravel.\nCrew 2 (Tap any number of creatures you control with total power 2 or more: This Vehicle becomes an artifact creature until end of turn.)", "toughness": "2", "type": "Artifact — Vehicle", "types": ["Artifact"], "uuid": "47414e80-bd37-53f1-bb5b-f41ca48e3a64"}