{"artist": "Oleksandr Kozachenko", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 7.0, "edhrecRank": 3565, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 546876, "name": "Schattenhof-Erzdämon", "text": "Wenn der Schattenhof-Erzdämon ins Spiel kommt, opfert jeder Gegner eine Kreatur mit der höchsten Stärke unter den Kreaturen, die er kontrolliert. Du erhältst so viele Lebenspunkte dazu, wie die höchste Stärke unter den Kreaturen, die auf diese Weise geopfert wurden, beträgt.\nWahnsinn — {2}{B}, bezahle 8 Lebenspunkte.", "type": "Kreatur — Dämon"}, {"language": "French", "multiverseId": 546914, "name": "Archifielleux d'Ombregrange", "text": "Quand l'Archifielleux d'Ombregrange arrive sur le champ de bataille, chaque adversaire sacrifie une créature avec la force la plus élevée parmi les créatures qu'il contrôle. Vous gagnez un nombre de points de vie égal à la force la plus élevée parmi les créatures sacrifiées de cette manière.\nFolie — {2}{B}, payez 8 points de vie.", "type": "Créature : démon"}, {"language": "Japanese", "multiverseId": 546952, "name": "シャドーグランジの魔神", "text": "シャドーグランジの魔神が戦場に出たとき、各対戦相手はそれぞれ自分がコントロールしているクリーチャーの中で最大のパワーを持つクリーチャー１体を生け贄に捧げる。あなたは、これにより生け贄に捧げられたクリーチャーの中で最大のパワーに等しい点数のライフを得る。\nマッドネス―{2}{B}, ８点のライフを支払う。", "type": "クリーチャー — デーモン"}], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "253537", "cardsphereId": "83145", "mcmId": "584039", "mtgjsonV4Id": "253bcb3c-43f6-5f0b-97e1-b0311e371173", "multiverseId": "546838", "scryfallId": "598bf482-99ce-4b39-a969-7685752382ed", "scryfallIllustrationId": "cd3fbaa6-cee1-41f6-92ee-f855b87285b0", "scryfallOracleId": "8f3705ff-e8e5-48e7-ab68-df6849d78867", "tcgplayerProductId": "254672"}, "isStarter": true, "keywords": ["Madness"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{6}{B}", "manaValue": 7.0, "name": "Shadowgrange Archfiend", "number": "60", "originalText": "When Shadowgrange Archfiend enters the battlefield, each opponent sacrifices a creature with the greatest power among creatures they control. You gain life equal to the greatest power among creatures sacrificed this way.\nMadness—{2}{B}, Pay 8 life.", "originalType": "Creature — Demon", "power": "8", "printings": ["VOC"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/4f8ce404e8142f37", "tcgplayer": "https://mtgjson.com/links/bc33fa020440d012"}, "rarity": "rare", "rulings": [{"date": "2021-11-19", "text": "If a player controls more than one creature tied for the greatest power among creatures they control while Shadowgrange Archfiend's first ability is resolving, that player chooses which one of those creatures to sacrifice."}, {"date": "2021-11-19", "text": "Cards are discarded in a Magic game only from a player's hand. Effects that put cards into a player's graveyard from anywhere else do not cause those cards to be discarded."}, {"date": "2021-11-19", "text": "Madness works independently of why you're discarding the card. You could discard it to pay a cost, because a spell or ability tells you to, or because you have too many cards in your hand during your cleanup step. You can't discard a card with madness just because you want to, though."}, {"date": "2021-11-19", "text": "A card with madness that's discarded counts as having been discarded even though it's put into exile rather than a graveyard. If it was discarded to pay a cost, that cost is still paid. Abilities that trigger when a card is discarded will still trigger."}, {"date": "2021-11-19", "text": "A spell cast for its madness cost is put onto the stack like any other spell. It can be countered, copied, and so on. As it resolves, it's put onto the battlefield if it's a permanent card or into its owner's graveyard if it's an instant or sorcery card."}, {"date": "2021-11-19", "text": "Casting a spell with madness ignores the timing rules based on the card's card type. For example, you can cast a creature with madness if you discard it during an opponent's turn."}, {"date": "2021-11-19", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a madness cost) you're paying, add any cost increases, then apply any cost reductions. The mana value of the spell is determined by only its mana cost, no matter what the total cost to cast that spell was."}, {"date": "2021-11-19", "text": "If you choose not to cast a card with madness when the madness triggered ability resolves, it's put into your graveyard. Madness doesn't give you another chance to cast it later."}, {"date": "2021-11-19", "text": "If you discard a card with madness to pay the cost of a spell or activated ability, that card's madness triggered ability (and the spell that card becomes, if you choose to cast it) will resolve before the spell or ability the discard paid for."}, {"date": "2021-11-19", "text": "If you discard a card with madness while a spell or ability is resolving, it moves immediately to exile. Continue resolving that spell or ability, noting that the card you discarded is not in your graveyard at this time. Its madness triggered ability will be placed onto the stack once that spell or ability has completely resolved."}], "securityStamp": "oval", "setCode": "VOC", "subtypes": ["Demon"], "supertypes": [], "text": "When Shadowgrange Archfiend enters the battlefield, each opponent sacrifices a creature with the greatest power among creatures they control. You gain life equal to the greatest power among creatures sacrificed this way.\nMadness—{2}{B}, Pay 8 life. (If you discard this card, discard it into exile. When you do, cast it for its madness cost or put it into your graveyard.)", "toughness": "4", "type": "Creature — Demon", "types": ["Creature"], "uuid": "4817c847-9136-57a8-9c8d-106288cb3ec0", "variations": ["8f66de7a-12df-5542-83f0-a7fcf648ed14"]}