{"artist": "Tyler Jacobson", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 3.0, "edhrecRank": 2883, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 395480, "name": "Schamane der alten Gebräuche", "text": "{T}: Erhöhe deinen Manavorrat um zwei Mana in einer beliebigen Kombination von Farben. Verwende dieses Mana nur, um Kreaturenzauber zu wirken.\nGewaltig — {9}{G}{G}, {T}: Der Lebenspunktestand jedes Spielers ist gleich der Anzahl an Kreaturen, die er kontrolliert. Aktiviere diese Fähigkeit nur, falls die Kreaturen, die du kontrollierst, eine Gesamtstärke von 8 oder mehr haben.", "type": "Kreatur — Mensch, Schamane"}, {"language": "Spanish", "multiverseId": 397328, "name": "Chamán de las tradiciones olvidadas", "text": "{T}: Agrega dos manás de cualquier combinación de color a tu reserva de maná. Usa este maná solo para lanzar hechizos de criatura.\nFormidable — {9}{G}{G}, {T}: El total de vidas de cada jugador se convierte en la cantidad de criaturas que controla. Activa esta habilidad solo si las criaturas que controlas tienen una fuerza total de 8 o más.", "type": "Criatura — Chamán humano"}, {"language": "French", "multiverseId": 395744, "name": "Shamane des traditions oubliées", "text": "{T} : Ajoutez deux manas de la combinaison de mana coloré de votre choix à votre réserve. Ne dépensez ce mana que pour lancer des sorts de créature.\nRedoutable — {9}{G}{G}, {T} : Le total de points de vie de chaque joueur devient égal au nombre de créatures qu'il contrôle. N'activez cette capacité que si les créatures que vous contrôlez ont une force totale supérieure ou égale à 8.", "type": "Créature : humain et shamane"}, {"language": "Italian", "multiverseId": 396008, "name": "Sciamano delle Tradizioni Dimenticate", "text": "{T}: Aggiungi due mana in qualsiasi combinazione di colori alla tua riserva di mana. Spendi questo mana solo per lanciare magie creatura.\nFormidabile — {9}{G}{G}, {T}: I punti vita di ogni giocatore diventano pari al numero di creature che controlla. Attiva questa abilità solo se le creature che controlli hanno una forza totale pari o superiore a 8.", "type": "Creatura — Sciamano Umano"}, {"language": "Japanese", "multiverseId": 396272, "name": "失われた業の巫師", "text": "{T}：あなたのマナ・プールに、望む色の組み合わせのマナ２点を加える。このマナは、クリーチャー・呪文を唱えるためにのみ使用できる。\n圧倒 ― {9}{G}{G}, {T}：各プレイヤーのライフの総量は、そのプレイヤーがコントロールするクリーチャーの総数に等しくなる。この能力は、あなたがコントロールするクリーチャーのパワーの合計が８以上であるときにのみ起動できる。", "type": "クリーチャー — 人間・シャーマン"}, {"language": "Korean", "multiverseId": 396536, "name": "잊혀진 도의 주술사", "text": "{T}: 원하는 색의 조합으로 마나 두 개를 당신의 마나풀에 담는다. 이 마나는 생물 주문을 발동하는 데에만 사용할 수 있다.\n강대 — {9}{G}{G}, {T}: 각 플레이어의 생명 총점은 자신이 조종하는 생물의 개수가 된다. 당신이 조종하는 생물들의 공격력 총합이 8 이상인 경우에만 이 능력을 활성화한다.", "type": "생물 — 인간 주술사"}, {"language": "Portuguese (Brazil)", "multiverseId": 396800, "name": "Xamã dos Costumes Esquecidos", "text": "{T}: Adicione dois manas em qualquer combinação de cores à sua reserva de mana. Gaste este mana somente para conjurar mágicas de criatura.\nFormidável — {9}{G}{G}, {T}: O total de pontos de vida de cada jogador torna-se igual ao número de criaturas que ele controla. Ative esta habilidade somente se as criaturas que você controla tiverem um total de poder igual ou superior a 8.", "type": "Criatura — Humano Xamã"}, {"language": "Russian", "multiverseId": 397064, "name": "Шаман Забытых Обрядов", "text": "{T}: добавьте две маны в любой комбинации цветов в ваше хранилище маны. Тратьте эту ману только на разыгрывание заклинаний существ.\nВнушительность — {9}{G}{G}, {T}: количество жизней каждого игрока становится равным количеству существ под его контролем. Активируйте эту способность, только если сумма значений силы существ под вашим контролем равна 8 или больше.", "type": "Существо — Человек Шаман"}, {"language": "Chinese Simplified", "multiverseId": 394952, "name": "佚道祭师", "text": "{T}：加两点法术力到你的法术力池中，其颜色组合由你选择。此法术力只能用来施放生物咒语。\n强横～{9}{G}{G}，{T}：每位牌手的总生命各成为由其操控的生物数量。只能于由你操控之生物的力量总和等于或大于8时起动此异能。", "type": "生物～人类／祭师"}, {"language": "Chinese Traditional", "multiverseId": 395216, "name": "佚道祭師", "text": "{T}：加兩點魔法力到你的魔法力池中，其顏色組合由你選擇。此魔法力只能用來施放生物咒語。\n強橫～{9}{G}{G}，{T}：每位玩家的總生命各成為由其操控的生物數量。只能於由你操控之生物的力量總和等於或大於8時起動此異能。", "type": "生物～人類／祭師"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "199724", "cardKingdomId": "199294", "cardsphereId": "13965", "mcmId": "273085", "mcmMetaId": "211136", "mtgjsonV4Id": "9e75e8fd-9fbe-5e49-8a6c-604da5b53483", "mtgoFoilId": "56361", "mtgoId": "56360", "multiverseId": "394688", "scryfallId": "a3e9c8f7-2232-4a2a-8a00-0a2908bc7543", "scryfallIllustrationId": "ffc6a6ee-4ec4-4502-9505-b79e0e72b976", "scryfallOracleId": "ca405696-8c30-4c01-bf90-11cdf8837942", "tcgplayerProductId": "96400"}, "keywords": ["Formidable"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}", "manaValue": 3.0, "name": "Shaman of Forgotten Ways", "number": "204", "originalText": "{T}: Add two mana in any combination of colors to your mana pool. Spend this mana only to cast creature spells.\nFormidable — {9}{G}{G}, {T}: Each player's life total becomes the number of creatures he or she controls. Activate this ability only if creatures you control have total power 8 or greater.", "originalType": "Creature — Human Shaman", "power": "2", "printings": ["DTK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/3dc43a85aa005aa7", "cardKingdomFoil": "https://mtgjson.com/links/084a0224ea93efc0", "cardmarket": "https://mtgjson.com/links/860d5a1ce77b456e", "tcgplayer": "https://mtgjson.com/links/0c3501e1ce72457f"}, "rarity": "mythic", "rulings": [{"date": "2015-02-25", "text": "The first ability of Shaman of Forgotten Ways is a mana ability. It doesn’t use the stack and can’t be responded to."}, {"date": "2015-02-25", "text": "The mana produced by Shaman of Forgotten Ways can be used to cast face-down creature spells with morph or megamorph."}, {"date": "2015-02-25", "text": "Count the number of creatures each player controls when the last ability resolves to determine what number each player’s life total will become."}, {"date": "2015-02-25", "text": "For a player’s life total to become a specific number, the player gains or loses the appropriate amount of life. For example, if a player’s life total is 12 and that player controls three creatures as the ability resolves, they will lose 9 life. Other effects that interact with life gain or loss will interact with this effect accordingly."}, {"date": "2015-02-25", "text": "If a player controls no creatures as the last ability resolves, their life total will become 0, causing that player to lose the game. If all players’ life totals become 0 this way, the game will be a draw."}, {"date": "2015-02-25", "text": "If you control a creature with power less than 0, use its actual power when calculating the total power of creatures you control. For example, if you control three creatures with powers 4, 5, and -2, the total power of creatures you control is 7."}, {"date": "2015-02-25", "text": "Some formidable abilities are activated abilities that require creatures you control to have total power 8 or greater. Once you activate these abilities, it doesn’t matter what happens to the total power of creatures you control."}, {"date": "2015-02-25", "text": "Other formidable abilities are triggered abilities with an “intervening ‘if’” clause. Such abilities check the total power of creatures you control twice: once at the appropriate time to see if the ability will trigger, and again as the ability tries to resolve. If, at that time, the total power of creatures you control is no longer 8 or greater, the ability will have no effect."}], "securityStamp": "oval", "setCode": "DTK", "subtypes": ["Human", "Shaman"], "supertypes": [], "text": "{T}: Add two mana in any combination of colors. Spend this mana only to cast creature spells.\nFormidable — {9}{G}{G}, {T}: Each player's life total becomes the number of creatures they control. Activate only if creatures you control have total power 8 or greater.", "toughness": "3", "type": "Creature — Human Shaman", "types": ["Creature"], "uuid": "368a0177-98c1-5a8c-947b-6203b3bd9aa7", "watermark": "atarka"}