{"artist": "Jim Nelson", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 17353, "finishes": ["nonfoil", "foil"], "flavorText": "\"Stand back. I know just what to do.\"\n—Kiki-Jiki, Mirror Breaker", "foreignData": [{"flavorText": "„Weg da. Ich weiß genau, was ich tun muss.\"Kiki-Jiki, Spiegelsplitterer", "language": "German", "multiverseId": 105350, "name": "Umrissentreißer", "text": "Immer wenn der Umrissentreißer blockt oder von einer Kreatur geblockt wird, ändere seine Stärke und Widerstandskraft bis zum Ende des Zuges in die Stärke und Widerstandskraft dieser Kreatur.", "type": "Kreatur - Gestaltwandler, Geist"}, {"flavorText": "\"Quédense atrás. Sé exactamente qué hacer.\" Kiki-Jiki, el rompe espejos", "language": "Spanish", "multiverseId": 106010, "name": "Ladrón de forma", "text": "Siempre que el Ladrón de forma bloque o sea bloqueado por una criatura, cambia la fuerza y la resistencia del Ladrón de forma a la fuerza y la resistencia de esa criatura hasta el final del turno.", "type": "Criatura - Espíritu metamorfo"}, {"flavorText": "« Reculez. Je sais exactement quoi faire. »Kiki-Jiki, brise-miroir", "language": "French", "multiverseId": 105185, "name": "Voleur de forme", "text": "À chaque fois que le Voleur de forme bloque ou devient bloqué par une créature, remplacez la force et l'endurance du Voleur de forme par la force et l'endurance de cette créature jusqu'à la fin du tour.", "type": "Créature : changeforme et esprit"}, {"flavorText": "\"State indietro. So esattamente cosa fare.\"Kiki-Jiki, Spaccaspecchi", "language": "Italian", "multiverseId": 105515, "name": "Rubaforma", "text": "Ogniqualvolta il Rubaforma blocca o viene bloccato da una creatura, cambia la forza e la costituzione del Rubaforma nella forza e costituzione di quella creatura fino alla fine del turno.", "type": "Creatura - Spirito Polimorfo"}, {"flavorText": "下がってろ。 やり方はわかってる。――鏡割りのキキジキ", "language": "Japanese", "multiverseId": 105680, "name": "姿奪い", "text": "姿奪いがいずれかのクリーチャーのブロックに参加するかブロックされるたび、姿奪いのパワーとタフネスはターン終了時までそれぞれそのクリーチャーのパワーとタフネスの値に等しくなる。", "type": "クリーチャー — 多相の戦士・スピリット"}, {"flavorText": "\"Afaste-se. Sei o que fazer.\" Kiki-Jiki, o Estilhaçador de Espelhos", "language": "Portuguese (Brazil)", "multiverseId": 105845, "name": "Ladrão de Formas", "text": "Toda vez que Ladrão de Formas bloquear ou for bloqueado por uma criatura, permute o poder e a resistência de Ladrão de Formas com o poder e a resistência daquela criatura até o final do turno.", "type": "Criatura - Espírito Metamorfo"}, {"flavorText": "「退下。我知道怎么对付他。」 ～裂镜奇奇几奇", "language": "Chinese Simplified", "multiverseId": 105020, "name": "摹态精", "text": "每当摹态精阻挡生物或被生物阻挡时，将摹态精的力量与防御力改为该生物的力量与防御力直到回合结束。", "type": "生物～变形兽／精怪"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "117470", "cardKingdomId": "117139", "cardsphereId": "40157", "mcmId": "12760", "mcmMetaId": "7351", "mtgjsonV4Id": "755ad866-2991-5dba-917c-5e5cc619bcf2", "mtgoFoilId": "22231", "mtgoId": "22230", "multiverseId": "88823", "scryfallId": "da2a4871-8bc3-4db0-9f9e-b2e96b90ebd5", "scryfallIllustrationId": "0892fd96-0c51-48a4-84fe-95e158db9c0d", "scryfallOracleId": "fa9a6617-fd89-490e-9ca5-8e6da99d89ed", "tcgplayerProductId": "12532"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{U}{U}", "manaValue": 2.0, "name": "Shape Stealer", "number": "55", "originalText": "Whenever Shape Stealer blocks or becomes blocked by a creature, change Shape Stealer's power and toughness to that creature's power and toughness until end of turn.", "originalType": "Creature - Shapeshifter Spirit", "power": "1", "printings": ["SOK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/360a016897b01afa", "cardKingdomFoil": "https://mtgjson.com/links/ed7c9b2b0afa0786", "cardmarket": "https://mtgjson.com/links/e335d405f51d63f2", "tcgplayer": "https://mtgjson.com/links/b1602825d4af7853"}, "rarity": "uncommon", "rulings": [{"date": "2005-06-01", "text": "Once the ability resolves, changing the other creature’s power or toughness doesn’t affect Shape Stealer."}, {"date": "2005-06-01", "text": "This ability triggers once for each creature blocked by or blocking Shape Stealer. If multiple creatures block it, Shape Stealer’s power and toughness will change for each one in succession. The first trigger put on the stack will be the last to resolve, so that will set Shape Stealer’s final power and toughness."}, {"date": "2005-06-01", "text": "The other creature’s power and toughness are determined as the triggered ability resolves."}, {"date": "2005-06-01", "text": "If the other creature has bushido, whether Shape Stealer gets the bushido bonus depends on whose turn it is. If Shape Stealer is blocking, it won’t get the attacker’s bushido bonus. If the Shape Stealer is being blocked, the bushido ability will resolve just before Shape Stealer determines what the creature’s power and toughness are."}, {"date": "2005-06-01", "text": "If Shape Stealer’s new toughness is less than any damage on Shape Stealer, Shape Stealer will be destroyed as a state-based action once the triggered ability resolves."}, {"date": "2009-10-01", "text": "You apply power/toughness changing effects in a series of sublayers in the following order: (a) effects from characteristic-defining abilities; (b) effects that set power and/or toughness to a specific number or value; (c) effects that modify power and/or toughness but don’t set power and/or toughness to a specific number or value; (d) changes from counters; (e) effects that switch a creature’s power and toughness. This card’s effect is always applied in (b), which means that effects applied in sublayer (c), (d), or (e) will not be overwritten; they will be applied to the new value."}], "setCode": "SOK", "subtypes": ["Shapeshifter", "Spirit"], "supertypes": [], "text": "Whenever Shape Stealer blocks or becomes blocked by a creature, change Shape Stealer's base power and toughness to that creature's power and toughness until end of turn.", "toughness": "1", "type": "Creature — Shapeshifter Spirit", "types": ["Creature"], "uuid": "0cb46eb0-f1fe-5720-ad7a-fa8661021644"}