{"artist": "Sidharth Chaturvedi", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 3669, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 531579, "name": "Beute teilen", "text": "Wenn Beute teilen ins Spiel kommt oder ein Gegner die Partie verliert, schicke die oberste Karte der Bibliothek jedes Spielers ins Exil.\nJeder Spieler kann in seinem Zug von den mit Beute teilen ins Exil geschickten Karten ein Land spielen oder einen Zauberspruch wirken, und um ihn zu wirken kann er Mana ausgeben, als wäre es Mana einer beliebigen Farbe. Wenn er dies tut, schicke die oberste Karte seiner Bibliothek ins Exil.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 531635, "name": "Compartir el botín", "text": "Cuando Compartir el botín entre al campo de batalla o un oponente pierda el juego, exilia la primera carta de la biblioteca de cada jugador.\nDurante el turno de cada jugador, ese jugador puede jugar una tierra o lanzar un hechizo de entre las cartas exiliadas con Compartir el botín y puede usar maná como si fuera maná de cualquier color para lanzar ese hechizo. Cuando lo haga, exilia la primera carta de su biblioteca.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 531691, "name": "Partage du butin", "text": "Quand le Partage du butin arrive sur le champ de bataille ou quand un adversaire perd la partie, exilez la carte du dessus de la bibliothèque de chaque joueur.\nPendant le tour de chaque joueur, ce joueur peut jouer un terrain ou lancer un sort parmi les cartes exilées par le Partage du butin, et il peut dépenser du mana comme si c'était du mana de n'importe quelle couleur pour lancer ce sort. Quand il fait ainsi, exilez la carte du dessus de sa bibliothèque.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 531747, "name": "Condividere il Bottino", "text": "Quando Condividere il Bottino entra nel campo di battaglia o un avversario perde la partita, esilia la prima carta del grimorio di ogni giocatore.\nDurante il turno di ogni giocatore, quel giocatore può giocare una terra o lanciare una magia scelta tra le carte esiliate con Condividere il Bottino e può spendere mana come se fosse mana di qualsiasi colore per lanciare quella magia. Quando lo fa, esilia la prima carta del suo grimorio.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 531803, "name": "戦利品の山分け", "text": "戦利品の山分けが戦場に出るか、対戦相手１人がこのゲームに敗北したとき、各プレイヤーのライブラリーの一番上にあるカードをそれぞれ追放する。\n各プレイヤーのターン中に、そのプレイヤーは、戦利品の山分けによって追放されているカードのうち、土地１つをプレイするか呪文１つを唱えてもよい。そのプレイヤーは、その呪文を唱えるために任意のマナを望む色のマナであるかのように支払ってもよい。そのプレイヤーがそうしたとき、そのプレイヤーのライブラリーの一番上にあるカードを追放する。", "type": "エンチャント"}], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "249356", "cardsphereId": "80262", "mcmId": "572656", "mtgjsonV4Id": "26165dff-f087-5d81-98f5-7ec674f6c6bd", "multiverseId": "531523", "scryfallId": "0d21e0de-317d-4378-aec2-30f832af3b0a", "scryfallIllustrationId": "127f5083-e2da-4eda-ae77-18bd08336b44", "scryfallOracleId": "d39af66c-4997-48b8-a704-f21d93247d7d", "tcgplayerProductId": "244239"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}", "manaValue": 2.0, "name": "Share the Spoils", "number": "303", "originalText": "When Share the Spoils enters the battlefield or an opponent loses the game, exile the top card of each player's library.\nDuring each player's turn, that player may play a land or cast a spell from among cards exiled with Share the Spoils, and they may spend mana as though it were mana of any color to cast that spell. When they do, exile the top card of their library.", "originalType": "Enchantment", "printings": ["AFC"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/688b5fd33b2071fe", "tcgplayer": "https://mtgjson.com/links/498ea4d969f1f286"}, "rarity": "rare", "rulings": [{"date": "2021-07-23", "text": "Once a player plays a land or casts a spell from among the exiled cards, they can't play any more of those cards that turn. That is, it's one land or one spell, not one of each."}, {"date": "2021-07-23", "text": "Playing a card this way follows all the normal timing rules for that card. For example, if you play a land this way, you may do so only during your main phase while the stack is empty and only if you havem't yet played a land (unless another effect allows you to play additional lands)."}, {"date": "2021-07-23", "text": "If you control an opponent's Share the Spoils and that player loses the game, Share the Spoils leaves the game with them and the first ability won't trigger."}, {"date": "2021-07-23", "text": "Once Share the Spoils leaves the battlefield, players may no longer play the exiled cards. If Share the Spoils is destroyed and somehow returns to the battlefield, it's a new object with no memory of the previously exiled cards."}], "securityStamp": "oval", "setCode": "AFC", "subtypes": [], "supertypes": [], "text": "When Share the Spoils enters the battlefield or an opponent loses the game, exile the top card of each player's library.\nDuring each player's turn, that player may play a land or cast a spell from among cards exiled with Share the Spoils, and they may spend mana as though it were mana of any color to cast that spell. When they do, exile the top card of their library.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "653b00e5-c37f-53a6-9dc0-0eaee4fe80cd", "variations": ["b284a2fc-9cdd-5d11-85f8-5aa2d5cdeb4d"]}