{"artist": "Matt Cavotta", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 10613, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 73464, "name": "Geteiltes Schicksal", "text": "Falls ein Spieler eine Karte ziehen würde, entfernt dieser Spieler stattdessen die oberste Karte von der Bibliothek eines Gegners verdeckt ganz aus dem Spiel.\nJeder Spieler kann sich die Karten, die er durch das Geteilte Schicksal ganz aus dem Spiel entfernt hat, anschauen und sie spielen, als ob sie auf seiner Hand wären.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 161929, "name": "Destino compartido", "text": "Si un jugador fuera a robar una carta, en vez de eso, ese jugador remueve del juego boca abajo la carta de la parte superior de la biblioteca de un oponente\nCada jugador puede mirar y jugar las cartas que haya removido del juego con Destino compartido como si estuvieran en su mano.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 161551, "name": "Destin partagé", "text": "Si un joueur devait piocher une carte, il retire à la place de la partie, face cachée, la carte du dessus de la bibliothèque d'un adversaire.\nChaque joueur peut regarder et jouer les cartes qu'il a retirées de la partie avec le Destin partagé comme si elles étaient dans sa main.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 160020, "name": "Destino Comune", "text": "Se un giocatore pesca una carta, invece quel giocatore rimuove dal gioco a faccia in giù la carta in cima al grimorio di un avversario.\nOgni giocatore può guardare e giocare qualsiasi carta che ha rimosso dal gioco con il Destino Comune come se fosse nella sua mano.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 73817, "name": "分かち合う運命", "text": "いずれかのプレイヤーがカードを引く場合、代わりにそのプレイヤーは、いずれかの対戦相手のライブラリーの一番上のカードを裏向きの状態でゲームから取り除く。\n各プレイヤーは、分かち合う運命によって自分が取り除いたカードを、手札にあるかのように見たりプレイしたりできる。", "type": "エンチャント（場）"}, {"language": "Portuguese (Brazil)", "multiverseId": 162245, "name": "Destino Compartilhado", "text": "Se um jogador fosse comprar um card, ao invés disso aquele jogador remove de jogo o card do topo do grimório de um oponente com a face voltada para baixo.\nCada jogador pode olhar e jogar cards que ele próprio tiver removido de jogo com Destino Compartilhado como se eles estivessem em sua própria mão.", "type": "Encantamento"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "73048", "cardKingdomId": "72048", "cardsphereId": "30899", "mcmId": "49", "mcmMetaId": "5114", "mtgjsonV4Id": "deee0f63-5644-5dd4-bda9-3822732e6af1", "mtgoFoilId": "20276", "mtgoId": "20275", "multiverseId": "49764", "scryfallId": "ad0d5b02-ef38-4dab-8ac6-78814ef27b55", "scryfallIllustrationId": "f55821c4-cce8-4514-b645-e5a67792feb4", "scryfallOracleId": "e23bf5fe-e494-473e-8502-606106ee1820", "tcgplayerProductId": "11372"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U}", "manaValue": 5.0, "name": "Shared Fate", "number": "49", "originalText": "If a player would draw a card, that player removes the top card of an opponent's library from the game face down instead.\nEach player may look at and play cards he or she removed from the game with Shared Fate as though they were in his or her hand.", "originalType": "Enchantment", "printings": ["MRD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/09fdece939590753", "cardKingdomFoil": "https://mtgjson.com/links/0257176076152af4", "cardmarket": "https://mtgjson.com/links/835268b36f5ff546", "tcgplayer": "https://mtgjson.com/links/9da33f08ea63b904"}, "rarity": "rare", "rulings": [{"date": "2004-12-01", "text": "You need to pay the costs of any cards you play from the Exile zone. This could be a problem if you don’t have the right colors of mana available."}, {"date": "2004-12-01", "text": "Replacing your draws isn’t optional. You can’t draw cards from your own library, even if all your opponents’ libraries are empty."}, {"date": "2004-12-01", "text": "If more than one Shared Fate is on the battlefield, you choose which one replaces each card draw, but you can replace a draw only once."}, {"date": "2004-12-01", "text": "The cards are exiled, not put onto the players’ hands. Players can look at and play the exiled cards, but can’t do anything else with them (the exiled cards can’t be discarded or cycled, for example)."}, {"date": "2008-08-01", "text": "Each Shared Fate tracks only the cards it exiled. If the Shared Fate which was responsible for a card being exiled leaves the battlefield, putting another Shared Fate onto the battlefield will not allow you to look at or play that card again."}], "setCode": "MRD", "subtypes": [], "supertypes": [], "text": "If a player would draw a card, that player exiles the top card of one of their opponents' libraries face down instead.\nEach player may look at cards they exiled with Shared Fate, and they may play lands and cast spells from among those cards.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "881f48d0-870a-5c40-af38-aac6b3e5faa8"}