{"artist": "Johannes Voss", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 6.0, "edhrecRank": 7878, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 503935, "name": "Hüterin des Kosmos", "text": "Fliegend\nWenn die Hüterin des Kosmos ins Spiel kommt, bringe eine bleibende Karte deiner Wahl mit umgewandelten Manakosten von 2 oder weniger aus deinem Friedhof ins Spiel zurück.\nVorherbestimmung {3}{W} (Während deines Zuges kannst du {2} bezahlen und diese Karte aus deiner Hand verdeckt ins Exil schicken. Wirke sie in einem späteren Zug für ihre Vorherbestimmungskosten.)", "type": "Kreatur — Engel, Krieger"}, {"language": "Spanish", "multiverseId": 504236, "name": "Pastora del cosmos", "text": "Vuela.\nCuando la Pastora del cosmos entre al campo de batalla, regresa la carta de permanente objetivo con coste de maná convertido de 2 o menos de tu cementerio al campo de batalla.\nProfetizar {3}{W}. (Durante tu turno, puedes pagar {2} y exiliar esta carta de tu mano boca abajo. Puedes lanzarla en un turno posterior pagando su coste de profetizar.)", "type": "Criatura — Guerrero ángel"}, {"language": "French", "multiverseId": 504537, "name": "Bergère du cosmos", "text": "Vol\nQuand la Bergère du cosmos arrive sur le champ de bataille, renvoyez sur le champ de bataille une carte de permanent avec un coût converti de mana inférieur ou égal à 2 ciblée depuis votre cimetière.\nPrédiction {3}{W} (Pendant votre tour, vous pouvez payer {2} et exiler cette carte depuis votre main face cachée. Lancez-la pendant un autre tour pour son coût de prédiction.)", "type": "Créature : ange et guerrier"}, {"language": "Italian", "multiverseId": 504838, "name": "Pastora del Cosmo", "text": "Volare\nQuando la Pastora del Cosmo entra nel campo di battaglia, rimetti sul campo di battaglia una carta permanente bersaglio con costo di mana convertito pari o inferiore a 2 dal tuo cimitero.\nPredire {3}{W} (Durante il tuo turno, puoi pagare {2} ed esiliare questa carta dalla tua mano a faccia in giù. Lanciala in un turno successivo per il suo costo di predire.)", "type": "Creatura — Guerriero Angelo"}, {"language": "Japanese", "multiverseId": 505139, "name": "星界の番人", "text": "飛行\n星界の番人が戦場に出たとき、あなたの墓地から点数で見たマナ・コストが２以下のパーマネント・カード１枚を対象とする。それを戦場に戻す。\n予顕{3}{W}（あなたのターンの間、あなたは{2}を支払って、あなたの手札からこのカードを裏向きに追放してもよい。後のターンに、これの予顕コストでこれを唱えてもよい。）", "type": "クリーチャー — 天使・戦士"}, {"language": "Korean", "multiverseId": 505440, "name": "우주의 목동", "text": "비행\n우주의 목동이 전장에 들어올 때, 당신의 무덤에 있는 전환마나비용이 2 이하인 지속물 카드를 목표로 정한다. 그 카드를 전장으로 되돌린다.\n예고 {3}{W} (당신의 턴 동안, 당신은 {2}를 지불하고 이 카드를 당신의 손에서 뒷면 상태로 추방할 수 있다. 다음 턴부터 예고 비용을 지불해 이 카드를 발동할 수 있다.)", "type": "생물 — 천사 전사"}, {"language": "Portuguese (Brazil)", "multiverseId": 505741, "name": "Pastora do Cosmos", "text": "Voar\nQuando Pastora do Cosmos entrar no campo de batalha, devolva o card de permanente alvo com custo de mana convertido igual ou inferior a 2 de seu cemitério para o campo de batalha.\nProfetizar {3}{W} (Durante o seu turno, você pode pagar {2} e exilar este card de sua mão voltado para baixo. Conjure-o em um turno posterior pagando seu custo de profetizar.)", "type": "Criatura — Anjo Guerreiro"}, {"language": "Russian", "multiverseId": 506042, "name": "Пастырь Мироздания", "text": "Полет\nКогда Пастырь Мироздания выходит на поле битвы, верните целевую карту перманента с конвертированной мана-стоимостью не более 2 из вашего кладбища на поле битвы.\nПророчество {3}{W} (Во время вашего хода вы можете заплатить {2} и изгнать эту карту из вашей руки рубашкой вверх. Разыграйте ее во время одного из последующих ходов за ее стоимость Пророчества.)", "type": "Существо — Ангел Воин"}, {"language": "Chinese Simplified", "multiverseId": 506343, "name": "寰宇牧生使", "text": "飞行\n当寰宇牧生使进战场时，将目标总法术力费用等于或小于2的永久物牌从你的坟墓场移回战场。\n预示{3}{W}（在你的回合中，你可以支付{2}并从你手上牌面朝下地放逐此牌。过了该回合后，便可利用其预示费用来施放之。）", "type": "生物 ～天使／战士"}, {"language": "Chinese Traditional", "multiverseId": 506644, "name": "寰宇牧生使", "text": "飛行\n當寰宇牧生使進戰場時，將目標總魔法力費用等於或小於2的永久物牌從你的墳墓場移回戰場。\n預示{3}{W}（在你的回合中，你可以支付{2}並從你手上牌面朝下地放逐此牌。過了該回合後，便可利用其預示費用來施放之。）", "type": "生物 ～天使／戰士"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "240993", "cardKingdomId": "240539", "cardsphereId": "73369", "mcmId": "530952", "mcmMetaId": "328987", "mtgArenaId": "75065", "mtgjsonV4Id": "f37d7e69-d84e-5cd7-9ffb-364849a1ed5a", "mtgoId": "87379", "multiverseId": "503634", "scryfallId": "ce33c84e-008c-48d8-a8e8-77cd19cc4f1f", "scryfallIllustrationId": "b80cd898-c362-49a1-861c-14de55a8a226", "scryfallOracleId": "2c5aa155-646c-47f6-ba5c-6e1b41fd4bb2", "tcgplayerProductId": "230434"}, "keywords": ["Flying", "Foretell"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{W}{W}", "manaValue": 6.0, "name": "Shepherd of the Cosmos", "number": "28", "originalText": "Flying\nWhen Shepherd of the Cosmos enters the battlefield, return target permanent card with converted mana cost 2 or less from your graveyard to the battlefield.\nForetell {3}{W} (During your turn, you may pay {2} and exile this card from your hand face down. Cast it on a later turn for its foretell cost.)", "originalType": "Creature — Angel Warrior", "power": "3", "printings": ["KHM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/95cf41ec9232d4dd", "cardKingdomFoil": "https://mtgjson.com/links/034384bf3a9a62b2", "cardmarket": "https://mtgjson.com/links/205cac0a141376f8", "tcgplayer": "https://mtgjson.com/links/4540e514c3a7fcdf"}, "rarity": "uncommon", "rulings": [{"date": "2021-02-05", "text": "A permanent card is an artifact, creature, enchantment, land, or planeswalker card."}, {"date": "2021-02-05", "text": "If the mana cost of a card in your graveyard includes {X}, X is considered to be 0."}, {"date": "2021-02-05", "text": "If you return an Aura this way, you choose what the Aura will enchant just before it enters the battlefield. An Aura returning to the battlefield this way doesn’t target the player or permanent it will enchant, so permanents or players with hexproof may be chosen; however, the chosen recipient must be able to legally be enchanted by the Aura, so a player or permanent with protection from one of the Aura’s qualities can’t be chosen this way. If there’s nothing legal for the Aura to enchant, it stays in the graveyard."}, {"date": "2021-02-05", "text": "Because exiling a card with foretell from your hand is a special action, you can do so any time you have priority during your turn, including in response to spells and abilities. Once you announce you’re taking the action, no other player can respond by trying to remove the card from your hand."}, {"date": "2021-02-05", "text": "Casting a foretold card from exile follows the timing rules for that card. If you foretell an instant card, you can cast it as soon as the next player’s turn. In most cases, if you foretell a card that isn’t an instant (or doesn’t have flash), you’ll have to wait until your next turn to cast it."}, {"date": "2021-02-05", "text": "If you’re casting a foretold card from exile for its foretell cost, you can’t choose to cast it for any other alternative costs. You can, however, pay additional costs, such as kicker costs. If the card has any mandatory additional costs, those must be paid to cast the spell."}], "setCode": "KHM", "subtypes": ["Angel", "Warrior"], "supertypes": [], "text": "Flying\nWhen Shepherd of the Cosmos enters the battlefield, return target permanent card with mana value 2 or less from your graveyard to the battlefield.\nForetell {3}{W} (During your turn, you may pay {2} and exile this card from your hand face down. Cast it on a later turn for its foretell cost.)", "toughness": "3", "type": "Creature — Angel Warrior", "types": ["Creature"], "uuid": "c9afcddd-da73-5f8f-9cf4-985a91481149", "watermark": "foretell"}