{"artist": "James Ryman", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 6.0, "edhrecRank": 13865, "finishes": ["nonfoil", "foil"], "flavorText": "\"Show the enemy the true path, and the spirit will yearn to follow it.\"\n—Houn, Jeskai elder", "foreignData": [{"flavorText": "„Zeige dem Feind den wahren Pfad und der Geist wird danach trachten, ihm zu folgen.\" —Houn, Jeskai-Ältester", "language": "German", "multiverseId": 392474, "name": "Loyalitätsverlagerung", "text": "Tausche die Kontrolle über zwei bleibende Karten deiner Wahl aus, die einen Kartentyp gemeinsam haben. (Artefakt, Kreatur, Verzauberung, Land und Planeswalker sind Kartentypen.)", "type": "Hexerei"}, {"flavorText": "\"Muéstrale el camino verdadero al enemigo y el espíritu anhelará seguirlo\". —Hun, anciana jeskai", "language": "Spanish", "multiverseId": 393769, "name": "Lealtades cambiantes", "text": "Intercambia el control de dos permanentes objetivo que compartan un tipo de carta. (Artefacto, criatura, encantamiento, tierra y planeswalker son tipos de carta.)", "type": "Conjuro"}, {"flavorText": "« Montrez le chemin à votre ennemi, et l'esprit désirera le suivre. » —Houn, doyen jeskaï", "language": "French", "multiverseId": 392659, "name": "Loyautés changeantes", "text": "Échangez le contrôle de deux permanents ciblés qui partagent un type de carte. (Artefact, créature, enchantement, terrain et planeswalker sont des types de cartes.)", "type": "Rituel"}, {"flavorText": "\"Mostra al nemico il sentiero della verità e lo spiritò anelerà a seguirlo.\" —Houn, anziano Jeskai", "language": "Italian", "multiverseId": 392844, "name": "Lealtà Mutevoli", "text": "Scambia il controllo di due permanenti bersaglio che condividono un tipo di carta. (Artefatto, creatura, incantesimo, terra e planeswalker sono tipi di carta.)", "type": "Stregoneria"}, {"flavorText": "「敵に真理の道を示せば、その魂がそれを進むことを欲するようになる。」 ――ジェスカイの長老、フーン", "language": "Japanese", "multiverseId": 393029, "name": "変容する忠誠", "text": "共通のカード・タイプを持つパーマネント２つを対象とし、それらのコントロールを交換する。（「アーティファクト」「クリーチャー」「エンチャント」「土地」「プレインズウォーカー」はカード・タイプである。）", "type": "ソーサリー"}, {"flavorText": "\"적에게 진정한 길을 보여주어라. 그러면 그의 영혼이 그 길을 따르려 할 것이다.\" —제스카이 장로 훈", "language": "Korean", "multiverseId": 393214, "name": "변덕스러운 충성심", "text": "카드 유형을 공유하는 지속물 두 개를 목표로 정한다. 두 지속물의 조종권을 교환한다. (카드 유형은 마법물체, 생물, 부여마법, 대지 및 플레인즈워커이다.)", "type": "집중마법"}, {"flavorText": "\"Mostre ao inimigo o verdadeiro caminho e o espírito desejará segui-lo.\" — Houn, ancião Jeskai", "language": "Portuguese (Brazil)", "multiverseId": 393399, "name": "Lealdades Mutáveis", "text": "Permute o controle de duas permanentes alvo que compartilhem um tipo de card. (Artefato, criatura, encantamento, terreno e planeswalker são tipos de card.)", "type": "Feitiço"}, {"flavorText": "«Покажи врагу истинный путь, и его дух возжелает пройти по нему». — Хун, старейшина джескайцев", "language": "Russian", "multiverseId": 393584, "name": "Изменчивая Преданность", "text": "Поменяйте контроль над двумя целевыми перманентами, у которых есть один и тот же тип карты. (Артефакт, существо, чары, земля и planeswalker являются типами карт.)", "type": "Волшебство"}, {"flavorText": "「示敌正道所在，灵魂自会追随。」 ～洁斯凯长老侯恩", "language": "Chinese Simplified", "multiverseId": 392104, "name": "移志换心", "text": "选择两个目标具共通牌类别的永久物。交换两者的操控权。（牌的类别包括神器、生物、结界、地以及鹏洛客。）", "type": "法术"}, {"flavorText": "「示敵正道所在，靈魂自會追隨。」 ～潔斯凱長老侯恩", "language": "Chinese Traditional", "multiverseId": 392289, "name": "移志換心", "text": "選擇兩個目標具共通牌類別的永久物。交換兩者的操控權。（牌的類別包括神器、生物、結界、地以及鵬洛客。）", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "198918", "cardKingdomId": "198596", "cardsphereId": "17977", "mcmId": "271662", "mcmMetaId": "210805", "mtgjsonV4Id": "922c2dad-0f38-5996-8b49-ae1a44a9e22f", "mtgoFoilId": "55519", "mtgoId": "55518", "multiverseId": "391919", "scryfallId": "ed9ff175-2e4c-4658-813e-1bfb4b9a6ca0", "scryfallIllustrationId": "34da6ff7-3f47-4a06-9507-838091be0fcb", "scryfallOracleId": "0ee9a743-c678-4a76-b106-53f57a84848d", "tcgplayerProductId": "95403"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{5}{U}", "manaValue": 6.0, "name": "Shifting Loyalties", "number": "51", "originalText": "Exchange control of two target permanents that share a card type. (Artifact, creature, enchantment, land, and planeswalker are card types.)", "originalType": "Sorcery", "printings": ["FRF"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/60422476e9cea16a", "cardKingdomFoil": "https://mtgjson.com/links/a9a1edf061557c31", "cardmarket": "https://mtgjson.com/links/892d0e4d908b2ed2", "tcgplayer": "https://mtgjson.com/links/15216175156b7cfe"}, "rarity": "uncommon", "rulings": [{"date": "2014-11-24", "text": "If one of the target permanents is an illegal target when Shifting Loyalties resolves, the exchange won’t happen. If both permanents are illegal targets (perhaps because they no longer share a card type), Shifting Loyalties won’t resolve."}, {"date": "2014-11-24", "text": "Either target can have card types the other does not, as long as they share at least one card type. For example, you could target a creature and an artifact creature."}, {"date": "2014-11-24", "text": "You don’t have to control either target permanent."}, {"date": "2014-11-24", "text": "If the same player controls both permanents when Shifting Loyalties resolves, nothing happens."}, {"date": "2014-11-24", "text": "Gaining control of an Aura or Equipment doesn’t cause it to move, though gaining control of an Equipment will allow you to activate its equip ability later to attach it to a creature you control."}, {"date": "2014-11-24", "text": "If another spell or ability allows you to change the targets of Shifting Loyalties (or perhaps copy it and choose new targets for the copy), you can change the targets only such that the final set of targets is still legal. For example, if Shifting Loyalties targets a creature you control and a creature an opponent controls, you couldn’t change just the second target to a noncreature permanent controlled by that player. You could, however, change just the second target to a creature controlled by a different opponent. The two new targets can share a different card type than the two original targets did."}], "setCode": "FRF", "subtypes": [], "supertypes": [], "text": "Exchange control of two target permanents that share a card type. (Artifact, creature, enchantment, land, and planeswalker are card types.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "9040f0fe-1f30-5609-8ce5-ef2a8aef46a3"}