{"artist": "Christopher Burdett", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 8336, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "6cda61df-5da7-55cd-a624-fec8dbced67f", "mtgoId": "65703", "scryfallId": "802211eb-f9d5-484c-952f-be73ba0b9191", "scryfallIllustrationId": "6a9102c2-5b0c-443b-8ab1-b4a969747ea1", "scryfallOracleId": "564b1253-2e1f-46c5-b5ae-3932127ca614"}, "isOnlineOnly": true, "isReprint": true, "isStarter": true, "keywords": ["Enchant"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}", "manaValue": 3.0, "name": "Shifting Shadow", "number": "65703", "printings": ["C17", "NEC", "PZ2"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2017-08-25", "text": "If you don't reveal a creature card this way, you'll just reveal and randomize your library and Shifting Shadow becomes attached to nothing. It will be put into its owner's graveyard as a state-based action."}, {"date": "2017-08-25", "text": "If Shifting Shadow can't become attached to the creature you put onto the battlefield, most likely because that creature has protection from red, it becomes attached to nothing. It will be put into its owner's graveyard as a state-based action."}, {"date": "2017-08-25", "text": "If the Shifting Shadow leaves the battlefield after the triggered ability it grants has triggered but before it resolves, you'll destroy the creature it enchanted before it left the battlefield, then reveal cards and put a creature card onto the battlefield. Shifting Shadow won't become attached to it. The same is true if the enchanted creature leaves the battlefield rather than just Shifting Shadow, except that you won't destroy the creature it enchanted in that case."}, {"date": "2017-08-25", "text": "If the enchanted creature can't be destroyed, most likely because that creature has indestructible, you'll still get a new creature and attach Shifting Shadow to the new creature."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": ["Aura"], "supertypes": [], "text": "Enchant creature\nEnchanted creature has haste and \"At the beginning of your upkeep, destroy this creature. Reveal cards from the top of your library until you reveal a creature card. Put that card onto the battlefield and attach Shifting Shadow to it, then put all other cards revealed this way on the bottom of your library in a random order.\"", "type": "Enchantment — Aura", "types": ["Enchantment"], "uuid": "3d6c8aaa-9ba7-55ad-88ba-a861f5db9d6b"}