{"artist": "Anthony S. Waters", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 16259, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 332156, "name": "Shimianisches Gespenst", "text": "Fliegend\nImmer wenn das Shimianische Gespenst einem Spieler Kampfschaden zufügt, zeigt dieser Spieler die Karten auf seiner Hand offen vor. Bestimme davon eine Karte, die kein Land ist. Durchsuche den Friedhof, die Hand und die Bibliothek dieses Spielers nach Karten mit demselben Namen wie diese Karte und schicke sie alle ins Exil. Dieser Spieler mischt dann seine Bibliothek.", "type": "Kreatur — Specter"}, {"language": "Spanish", "multiverseId": 332405, "name": "Espectro shimiano", "text": "Vuela.\nSiempre que el Espectro shimiano haga daño de combate a un jugador, ese jugador muestra su mano. Eliges de ahí una carta que no sea tierra. Busca en el cementerio, mano y biblioteca de ese jugador todas las cartas con el mismo nombre que esa carta y exílialas. Luego ese jugador baraja su biblioteca.", "type": "Criatura — Espectro"}, {"language": "French", "multiverseId": 331658, "name": "Spectre de Shimia", "text": "Vol\nÀ chaque fois que le Spectre de Shimia inflige des blessures de combat à un joueur, ce joueur révèle sa main. Choisissez-y une carte non-terrain. Cherchez dans le cimetière, la main et la bibliothèque de ce joueur toutes les cartes ayant le même nom que cette carte et exilez-les. Ce joueur mélange ensuite sa bibliothèque.", "type": "Créature : spectre"}, {"language": "Italian", "multiverseId": 332654, "name": "Spettro Shimiano", "text": "Volare\nOgniqualvolta lo Spettro Shimiano infligge danno da combattimento a un giocatore, quel giocatore rivela la sua mano. Scegli una carta non terra da quella mano. Passa in rassegna il cimitero, la mano e il grimorio di quel giocatore per tutte le carte con lo stesso nome di quella carta ed esiliale. Poi quel giocatore rimescola il suo grimorio.", "type": "Creatura — Spettro"}, {"language": "Japanese", "multiverseId": 332903, "name": "シミアの死霊", "text": "飛行\nシミアの死霊がいずれかのプレイヤーに戦闘ダメージを与えるたび、そのプレイヤーは自分の手札を公開する。あなたはその中の土地でないカードを１枚選ぶ。そのプレイヤーの墓地と手札とライブラリーから、そのカードと同じ名前を持つカードをすべて探し、それらを追放する。その後、そのプレイヤーは自分のライブラリーを切り直す。", "type": "クリーチャー — スペクター"}, {"language": "Korean", "multiverseId": 330662, "name": "시미안 스펙터", "text": "비행\n시미안 스펙터가 플레이어에게 전투피해를 입힐 때마다, 그 플레이어는 자신의 손을 공개한다. 그 중 대지가 아닌 카드 한 장을 선택한다. 그 플레이어의 무덤과 손, 서고에서 선택한 카드와 같은 이름을 가진 카드를 모두 찾아서 추방한다. 그러고 나서 그 플레이어는 자신의 서고를 섞는다.", "type": "생물 — 스펙터"}, {"language": "Portuguese (Brazil)", "multiverseId": 331409, "name": "Espectro Shimiano", "text": "Voar\nToda vez que o Espectro Shimiano causa dano de combate a um jogador, aquele jogador revela sua própria mão. Você escolhe um card que não seja um terreno da mão dele. Procure na mão, no cemitério e no grimório daquele jogador todo os cards com o mesmo nome daquele card e exile-os. Depois, aquele jogador embaralha seu próprio grimório.", "type": "Criatura — Espectro"}, {"language": "Russian", "multiverseId": 331907, "name": "Шимийский Призрак", "text": "Полет\nКаждый раз, когда Шимийский Призрак наносит боевые повреждения игроку, тот игрок показывает свою руку. Вы выбираете из нее карту, не являющуюся землей. Найдите на кладбище, в руке и в библиотеке того игрока все карты с таким же именем, что и у той карты, и изгоните их. Затем тот игрок тасует свою библиотеку.", "type": "Существо — Призрак"}, {"language": "Chinese Simplified", "multiverseId": 330413, "name": "希米安幽灵", "text": "飞行\n每当希米安幽灵向任一牌手造成战斗伤害时，该牌手展示其手牌。你选择其中一张非地的牌。从该牌手的坟墓场、手牌、以及牌库中搜寻所有与该牌同名的牌并将它们放逐。然后该牌手将其牌库洗牌。", "type": "生物～幽灵"}, {"language": "Chinese Traditional", "multiverseId": 330911, "name": "希米安幽靈", "text": "飛行\n每當希米安幽靈向任一玩家造成戰鬥傷害時，該玩家展示其手牌。你選擇其中一張非地的牌。從該玩家的墳墓場、手牌、以及牌庫中搜尋所有與該牌同名的牌並將它們放逐。然後該玩家將其牌庫洗牌。", "type": "生物～幽靈"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "187877", "cardKingdomId": "187630", "cardsphereId": "27631", "mcmId": "257074", "mcmMetaId": "8997", "mtgjsonV4Id": "579f5058-feee-5852-9587-f406b901bdc4", "mtgoFoilId": "45223", "mtgoId": "45222", "multiverseId": "278072", "scryfallId": "1ca9e99b-e46c-4f7a-9c51-e2cfe8810450", "scryfallIllustrationId": "f82e3b36-8ca0-4d35-a55e-7712cbde7049", "scryfallOracleId": "f20f0bf4-c74b-4df7-a849-270c35f5d99e", "tcgplayerProductId": "59976"}, "isReprint": true, "keywords": ["Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}{B}", "manaValue": 4.0, "name": "Shimian Specter", "number": "109", "originalText": "Flying\nWhenever Shimian Specter deals combat damage to a player, that player reveals his or her hand. You choose a nonland card from it. Search that player's graveyard, hand, and library for all cards with the same name as that card and exile them. Then that player shuffles his or her library.", "originalType": "Creature — Specter", "power": "2", "printings": ["FUT", "M13"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2ffb2cdbe9b946a4", "cardKingdomFoil": "https://mtgjson.com/links/bab6b4fb7d7068a6", "cardmarket": "https://mtgjson.com/links/d4e7d340e4ce56bd", "tcgplayer": "https://mtgjson.com/links/35ecb5147d67b423"}, "rarity": "rare", "rulings": [{"date": "2012-07-01", "text": "The cards you’re searching for must be found and exiled if they’re in the graveyard because it’s a public zone. Finding those cards in the hand and library is optional, because those zones are hidden (even if the hand is temporarily revealed)."}, {"date": "2012-07-01", "text": "If the player has no nonland cards in their hand, you can still search that player’s library and have them shuffle it."}], "setCode": "M13", "subtypes": ["Specter"], "supertypes": [], "text": "Flying\nWhenever Shimian Specter deals combat damage to a player, that player reveals their hand. You choose a nonland card from it. Search that player's graveyard, hand, and library for all cards with the same name as that card and exile them. Then that player shuffles.", "toughness": "2", "type": "Creature — Specter", "types": ["Creature"], "uuid": "1389690c-8159-58c2-9596-41d508cc02ed"}