{"artist": "Steven Belledin", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R", "W"], "colors": ["R", "W"], "convertedManaCost": 4.0, "edhrecRank": 4562, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "241542", "cardsphereId": "74301", "mcmId": "535867", "mtgjsonV4Id": "a8d14cc7-64ae-5af6-84da-dd340196b24e", "scryfallId": "f31d5885-35bc-455a-a824-22d8b4b459ef", "scryfallIllustrationId": "bd74b81f-dada-42be-8865-173691fbdf2a", "scryfallOracleId": "6107f9aa-3373-4166-b4b8-a26fd6d69c72", "tcgplayerProductId": "231620"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "saga", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}{W}", "manaValue": 4.0, "name": "Showdown of the Skalds", "number": "229s", "printings": ["KHM", "PKHM"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/5d8100217ad4aa03", "tcgplayer": "https://mtgjson.com/links/d10f2246d5ff1d06"}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "Removing lore counters won’t cause a previous chapter ability to trigger. If lore counters are removed from a Saga, the appropriate chapter abilities will trigger again when the Saga receives more lore counters."}, {"date": "2021-02-05", "text": "The cards you exile because of the chapter I ability are exiled face up."}, {"date": "2021-02-05", "text": "Playing a card this way follows the normal rules for playing the card. You must pay its costs, and you must follow all applicable timing rules. For example, if one of the cards is a sorcery card, you can cast it only during your main phase while the stack is empty."}, {"date": "2021-02-05", "text": "Under normal circumstances, you can play a land from among the exiled cards only if you haven’t played a land yet that turn."}, {"date": "2021-02-05", "text": "Any cards you don’t play by the end of your next turn will remain exiled."}, {"date": "2021-02-05", "text": "As a Saga enters the battlefield, its controller puts a lore counter on it. As your precombat main phase begins (immediately after your draw step), you put another lore counter on each Saga you control. Putting a lore counter on a Saga in either of these ways doesn’t use the stack."}, {"date": "2021-02-05", "text": "Each symbol on the left of a Saga’s text box represents a chapter ability. A chapter ability is a triggered ability that triggers when a lore counter that is put on the Saga causes the number of lore counters on the Saga to become equal to or greater than the ability’s chapter number. Chapter abilities are put onto the stack and may be responded to."}, {"date": "2021-02-05", "text": "A chapter ability doesn’t trigger if a lore counter is put on a Saga that already had a number of lore counters greater than or equal to that chapter’s number. For example, the third lore counter put on a Saga causes the chapter III ability to trigger, but chapters I and II won’t trigger again."}, {"date": "2021-02-05", "text": "Once a chapter ability has triggered, the ability on the stack won’t be affected if the Saga gains or loses counters, or if it leaves the battlefield."}, {"date": "2021-02-05", "text": "If multiple chapter abilities trigger at the same time, their controller puts them on the stack in any order. If any of them require targets, those targets are chosen as you put the abilities on the stack, before any of those abilities resolve."}, {"date": "2021-02-05", "text": "Once the number of lore counters on a Saga is greater than or equal to the greatest number among its chapter abilities, the Saga’s controller sacrifices it as soon as its chapter ability has left the stack, most likely by resolving or being countered. This state-based action doesn’t use the stack."}], "securityStamp": "oval", "setCode": "PKHM", "subtypes": ["Saga"], "supertypes": [], "text": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI — Exile the top four cards of your library. Until the end of your next turn, you may play those cards.\nII, III — Whenever you cast a spell this turn, put a +1/+1 counter on target creature you control.", "type": "Enchantment — Saga", "types": ["Enchantment"], "uuid": "a5b69e59-a2a6-5b06-b418-da982df34dcc", "variations": ["1abc7d82-31ae-546a-a20a-fff479c0ffc3"]}