{"artist": "Evan Shipard", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 21085, "finishes": ["nonfoil", "foil"], "flavorText": "The Sultai distinguish between pet and slave by the material of the chain.", "foreignData": [{"flavorText": "Die Sultai unterscheiden zwischen Schoßtier und Sklave anhand des Materials seiner Kette.", "language": "German", "multiverseId": 387472, "name": "Sidisis Schoßtier", "text": "Lebensverknüpfung (Schaden, der von dieser Kreatur zugefügt wird, lässt dich ebenso viele Lebenspunkte dazuerhalten.)\nMorph {1}{B} (Du kannst diese Karte verdeckt für {3} als eine 2/2 Kreatur wirken. Decke sie zu einem beliebigen Zeitpunkt für ihre Morph-Kosten auf.)", "type": "Kreatur — Zombie, Menschenaffe"}, {"flavorText": "Los Sultai distinguen entre mascota y esclavo por el material de la cadena.", "language": "Spanish", "multiverseId": 389355, "name": "Mascota de Sidisi", "text": "Vínculo vital. (El daño hecho por esta criatura también hace que ganes esa misma cantidad de vidas.)\nMetamorfosis {1}{B}. (Puedes lanzar esta carta boca abajo como una criatura 2/2 pagando {3}. Ponla boca arriba en cualquier momento pagando su coste de metamorfosis.)", "type": "Criatura — Simio zombie"}, {"flavorText": "Le métal dont sont faites les chaînes différencie les familiers des esclaves sultaï.", "language": "French", "multiverseId": 387741, "name": "Mascotte de Sidisi", "text": "Lien de vie (Les blessures infligées par cette créature vous font aussi gagner autant de points de vie.)\nMue {1}{B} (Vous pouvez lancer cette carte face cachée comme une créature 2/2 pour {3}. Retournez-la à tout moment pour son coût de mue.)", "type": "Créature : zombie et grand singe"}, {"flavorText": "I Sultai distinguono gli animali domestici dagli schiavi in base al materiale della catena.", "language": "Italian", "multiverseId": 388010, "name": "Bestia da Compagnia di Sidisi", "text": "Legame vitale (Il danno inflitto da questa creatura ti fa anche guadagnare altrettanti punti vita.)\nMetamorfosi {1}{B} (Puoi lanciare questa carta a faccia in giù come una creatura 2/2 pagando {3}. Girala a faccia in su in qualsiasi momento pagando il suo costo di metamorfosi.)", "type": "Creatura — Scimpanzé Zombie"}, {"flavorText": "スゥルタイは鎖の材質によってペットと奴隷を区別している。", "language": "Japanese", "multiverseId": 388279, "name": "シディシのペット", "text": "絆魂（このクリーチャーがダメージを与えると、さらにあなたはその点数分のライフを得る。）\n変異{1}{B}（あなたはこのカードを、{3}で２/２クリーチャーとして裏向きに唱えてもよい。これの変異コストで、これをいつでも表向きにしてよい。）", "type": "クリーチャー — ゾンビ・類人猿"}, {"flavorText": "술타이인들은 사슬의 재질로 애완동물과 노예를 구별한다.", "language": "Korean", "multiverseId": 388548, "name": "시디시의 애완동물", "text": "생명연결 (이 생물이 피해를 입히면, 당신은 그 피해만큼의 생명점을 얻는다.)\n변이 {1}{B} (당신은 {3}을 지불해서 이 카드를 뒷면 상태의 2/2 생물로 발동할 수 있다. 언제든지 변이 비용을 지불하고 앞면이 보이도록 뒤집을 수 있다.)", "type": "생물 — 좀비 유인원"}, {"flavorText": "Os Sultai diferenciam as mascotes dos escravos pelo material das correntes.", "language": "Portuguese (Brazil)", "multiverseId": 388817, "name": "Mascote de Sidisi", "text": "Vínculo com a vida (O dano causado por esta criatura faz com que você ganhe uma quantidade equivalente de pontos de vida.)\nMetamorfose {1}{B} (Você pode conjurar este card com a face voltada para baixo como uma criatura 2/2 por {3}. Volte sua face para cima a qualquer momento pagando seu custo de metamorfose.)", "type": "Criatura — Zumbi Símio"}, {"flavorText": "Султайцы различают рабов и домашних любимцев по материалу, из которого сделана цепь.", "language": "Russian", "multiverseId": 389086, "name": "Питомец Сидиси", "text": "Цепь жизни (Повреждения, наносимые этим существом, также заставляют вас получить такое же количество жизней.)\nОборотень {1}{B} (Вы можете разыграть эту карту рубашкой вверх как существо 2/2 за {3}. Переверните ее рубашкой вниз в любой момент за ее стоимость Оборотня.)", "type": "Существо — Зомби Обезьяна"}, {"flavorText": "苏勒台为他们的宠物和奴隶都拴上链条，两者身份全凭材质区分。", "language": "Chinese Simplified", "multiverseId": 386934, "name": "谢迪西的宠物", "text": "系命（此生物所造成的伤害会让你获得等量的生命。）\n变身{1}{B}（你可牌面朝下地施放此牌并支付{3}，将其当成2/2生物。可随时支付其变身费用使其翻回正面。）", "type": "生物～灵俑／猿猴"}, {"flavorText": "蘇勒台為他們的寵物和奴隸都拴上鏈條，兩者身份全憑材質區分。", "language": "Chinese Traditional", "multiverseId": 387203, "name": "謝迪西的寵物", "text": "繫命（此生物所造成的傷害會讓你獲得等量的生命。）\n變身{1}{B}（你可牌面朝下地施放此牌並支付{3}，將其當成2/2生物。可隨時支付其變身費用使其翻回正面。）", "type": "生物～殭屍／猿猴"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "196305", "cardKingdomId": "195888", "cardsphereId": "23722", "mcmId": "269393", "mcmMetaId": "210291", "mtgjsonV4Id": "30671bc2-cbea-5377-8dc9-51009c52e830", "mtgoFoilId": "53995", "mtgoId": "53994", "multiverseId": "386665", "scryfallId": "e6e02a99-da37-4cea-9182-39ccb1e35ee9", "scryfallIllustrationId": "606fcbbc-a651-41ef-ac87-611e8ad625ce", "scryfallOracleId": "9b183d76-1dee-4ecf-9226-e1aa600b1247", "tcgplayerProductId": "93025"}, "keywords": ["Lifelink", "Morph"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}", "manaValue": 4.0, "name": "Sidisi's Pet", "number": "90", "originalText": "Lifelink (Damage dealt by this creature also causes you to gain that much life.)\nMorph {1}{B} (You may cast this card face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.)", "originalType": "Creature — Zombie Ape", "power": "1", "printings": ["KTK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1a6c441ec29c720a", "cardKingdomFoil": "https://mtgjson.com/links/020b6d8df8f53cd1", "cardmarket": "https://mtgjson.com/links/b06b1629284845c4", "tcgplayer": "https://mtgjson.com/links/39e1305c3b931fba"}, "rarity": "common", "rulings": [{"date": "2014-09-20", "text": "Morph lets you cast a card face down by paying {3}, and lets you turn the face-down permanent face up any time you have priority by paying its morph cost."}, {"date": "2014-09-20", "text": "The face-down spell has no mana cost and has a converted mana cost of 0. When you cast a face-down spell, put it on the stack face down so no other player knows what it is, and pay {3}. This is an alternative cost."}, {"date": "2014-09-20", "text": "When the spell resolves, it enters the battlefield as a 2/2 creature with no name, mana cost, creature types, or abilities. It’s colorless and has a converted mana cost of 0. Other effects that apply to the creature can still grant it any of these characteristics."}, {"date": "2014-09-20", "text": "Any time you have priority, you may turn the face-down creature face up by revealing what its morph cost is and paying that cost. This is a special action. It doesn’t use the stack and can’t be responded to. Only a face-down permanent can be turned face up this way; a face-down spell cannot."}, {"date": "2014-09-20", "text": "Because the permanent is on the battlefield both before and after it’s turned face up, turning a permanent face up doesn’t cause any enters-the-battlefield abilities to trigger."}, {"date": "2014-09-20", "text": "A permanent that turns face up or face down changes characteristics but is otherwise the same permanent. Spells and abilities that were targeting that permanent, as well as Auras and Equipment that were attached to the permanent, aren’t affected."}, {"date": "2014-09-20", "text": "At any time, you can look at a face-down spell or permanent you control. You can’t look at face-down spells or permanents you don’t control unless an effect instructs you to do so."}, {"date": "2014-09-20", "text": "You must ensure that your face-down spells and permanents can easily be differentiated from each other. You’re not allowed to mix up the cards that represent them on the battlefield in order to confuse other players. The order they entered the battlefield should remain clear. Common methods for doing this include using markers or dice, or simply placing them in order on the battlefield."}, {"date": "2014-09-20", "text": "If a face-down permanent leaves the battlefield, you must reveal it. You must also reveal all face-down spells and permanents you control if you leave the game or if the game ends."}], "setCode": "KTK", "subtypes": ["Zombie", "Ape"], "supertypes": [], "text": "Lifelink (Damage dealt by this creature also causes you to gain that much life.)\nMorph {1}{B} (You may cast this card face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.)", "toughness": "4", "type": "Creature — Zombie Ape", "types": ["Creature"], "uuid": "08e321c9-82b1-57eb-b207-ea85b683aa84", "watermark": "sultai"}