{"artist": "Carl Critchlow", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 7.0, "edhrecRank": 13056, "finishes": ["nonfoil", "foil"], "flavorText": "The Rubblefield was once among the wealthiest districts in Ravnica. All it took was a single wurm to reduce it to ruins.", "foreignData": [{"flavorText": "Das Schotterfeld war einst unter den wohlhabendsten Bezirken von Ravnica. Einen Wurm später bestand es nur noch aus Ruinen.", "language": "German", "multiverseId": 111829, "name": "Belagerungswurm", "text": "Einberufen (Jede Kreatur, die du tappst, während du diesen Zauberspruch spielst, reduziert dessen Kosten um {1} oder um ein Mana der Farbe jener Kreatur.)\nVerursacht Trampelschaden", "type": "Kreatur — Wurm"}, {"flavorText": "Antaño el Campo de ruinas fue uno de los distritos más ricos de Rávnica. Todo lo que hizo falta fue una sierpe para reducirlo a escombros.", "language": "Spanish", "multiverseId": 113359, "name": "Sierpe de asedio", "text": "Convocar (Cada criatura que gires al jugar este hechizo reduce su coste en {1} o en un maná del color de esa criatura.)\nArrolla.", "type": "Criatura — Sierpe"}, {"flavorText": "Le Champ aux gravats était autrefois l'un des quartiers les plus riches de Ravnica. Une seule guivre suffit à le mettre en ruines.", "language": "French", "multiverseId": 112135, "name": "Guivre de siège", "text": "Convocation (Chaque créature que vous engagez en jouant ce sort réduit son coût de {1} ou d'un mana de la couleur de cette créature.)\nPiétinement", "type": "Créature : guivre"}, {"flavorText": "Un tempo, Campobreccia figurava tra i quartieri più ricchi di Ravnica. È bastato un solo wurm per ridurlo a un cumulo di macerie.", "language": "Italian", "multiverseId": 112441, "name": "Wurm da Assedio", "text": "Convocazione (Ciascuna creatura che TAPpi mentre giochi questa magia riduce il suo costo di {1} o di un mana del colore di quella creatura.)\nTravolgere", "type": "Creatura — Wurm"}, {"flavorText": "残骸地区はかつてはラヴニカで最も栄えた区域だった。 それを残骸と化したのはたった一匹のワームだった。", "language": "Japanese", "multiverseId": 112747, "name": "包囲ワーム", "text": "召集 （あなたがこの呪文をプレイする段階であなたがタップした各クリーチャーにつき、この呪文のコストはそのクリーチャーの色のマナ１点か{1}少なくなる。）\nトランプル", "type": "クリーチャー — ワーム"}, {"flavorText": "O Campo de Escombros já foi um dos bairros mais ricos de Ravnica. Bastou um único vorme para transformar tudo em ruínas.", "language": "Portuguese (Brazil)", "multiverseId": 113053, "name": "Vorme de Cerco", "text": "Convocar (Cada criatura que você vira ao jogar esta mágica reduz seu custo em {1} ou em um mana da cor daquela criatura.)\nAtropelar", "type": "Criatura — Vorme"}, {"flavorText": "Когда-то Мусорная свалка была одним из самых процветающих кварталов Равники. Один единственный вурм превратил его в руины.", "language": "Russian", "multiverseId": 114461, "name": "Осадный вурм", "text": "Созыв (Когда вы разыгрываете это заклинание, каждое повернутое существо уменьшает стоимость заклинания на {1} или на один пункт маны цвета этого существа).\nПробивающий удар", "type": "Существо — Вурм"}, {"flavorText": "瓦砾城区曾是拉尼卡最富裕的地段； 而这堆废墟都是一匹亚龙的杰作。", "language": "Chinese Simplified", "multiverseId": 111523, "name": "攻城亚龙", "text": "召集（使用此咒语时，你每为它横置一个生物，便可以少支付{1}，或一点所横置生物颜色的法术力。）\n践踏", "type": "生物～亚龙"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "118874", "cardKingdomId": "118583", "cardsphereId": "38333", "mcmId": "13533", "mcmMetaId": "8092", "mtgjsonV4Id": "22c979de-3ec6-5a5c-b6bf-0228fc20a728", "mtgoFoilId": "23199", "mtgoId": "23198", "multiverseId": "87932", "scryfallId": "ae199825-563e-4837-a6d2-7b009b93cd4d", "scryfallIllustrationId": "ac9ee47f-d4af-4af4-8848-3c94a0275303", "scryfallOracleId": "8a802eae-abfb-47fd-8458-1689055531ef", "tcgplayerProductId": "13418"}, "keywords": ["Convoke", "Trample"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{5}{G}{G}", "manaValue": 7.0, "name": "Siege Wurm", "number": "183", "originalText": "Convoke (Each creature you tap while playing this spell reduces its cost by {1} or by one mana of that creature's color.)\nTrample", "originalType": "Creature - Wurm", "power": "5", "printings": ["GRN", "M15", "MB1", "RAV"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/a06547f12848cdef", "cardKingdomFoil": "https://mtgjson.com/links/0fef4dc85f975010", "cardmarket": "https://mtgjson.com/links/6089d58ed32c9408", "tcgplayer": "https://mtgjson.com/links/5ee6c0dbe4d705bf"}, "rarity": "common", "rulings": [{"date": "2018-10-05", "text": "You can tap an untapped creature you haven’t controlled continuously since the beginning of your most recent turn to convoke a spell."}, {"date": "2018-10-05", "text": "Convoke doesn’t change a spell’s mana cost or converted mana cost."}, {"date": "2018-10-05", "text": "When calculating a spell’s total cost, include any alternative costs, additional costs, or anything else that increases or reduces the cost to cast the spell. Convoke applies after the total cost is calculated."}, {"date": "2018-10-05", "text": "Because convoke isn’t an alternative cost, it can be used in conjunction with alternative costs."}, {"date": "2018-10-05", "text": "Tapping a multicolored creature using convoke will pay for {1} or one mana of your choice of any of that creature’s colors."}, {"date": "2018-10-05", "text": "When using convoke to cast a spell with {X} in its mana cost, first choose the value for X. That choice, plus any cost increases or decreases, will determine the spell’s total cost. Then you can tap creatures you control to help pay that cost. For example, if you cast Worldsoul Colossus (a spell with convoke and mana cost {X}{G}{W}) and choose X to be 3, the total cost is {3}{G}{W}. If you tap two green creatures and two white creatures, you’ll have to pay {1}."}, {"date": "2018-10-05", "text": "If a creature you control has a mana ability with {T} in the cost, activating that ability while casting a spell with convoke will result in the creature being tapped before you pay the spell’s costs. You won’t be able to tap it again for convoke. Similarly, if you sacrifice a creature to activate a mana ability while casting a spell with convoke, that creature won’t be on the battlefield when you pay the spell’s costs, so you won’t be able to tap it for convoke."}], "setCode": "RAV", "subtypes": ["Wurm"], "supertypes": [], "text": "Convoke (Your creatures can help cast this spell. Each creature you tap while casting this spell pays for {1} or one mana of that creature's color.)\nTrample", "toughness": "5", "type": "Creature — Wurm", "types": ["Creature"], "uuid": "12d36672-1455-5c7a-a7a7-47ea8757134a", "watermark": "selesnya"}