{"artist": "Chris Rallis", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G", "W"], "colors": ["G", "W"], "convertedManaCost": 3.0, "edhrecRank": 4820, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 476731, "name": "Siona, Kapitänin der Pyleas", "text": "Wenn Siona, Kapitänin der Pyleas, ins Spiel kommt, schaue dir die obersten sieben Karten deiner Bibliothek an. Du kannst davon eine Aura-Karte offen vorzeigen und auf deine Hand nehmen. Lege den Rest in zufälliger Reihenfolge unter deine Bibliothek.\nImmer wenn eine Aura, die du kontrollierst, an eine Kreatur, die du kontrollierst, angelegt wird, erzeuge einen 1/1 weißen Mensch-Soldat-Kreaturenspielstein.", "type": "Legendäre Kreatur — Mensch, Soldat"}, {"language": "Spanish", "multiverseId": 476985, "name": "Siona, capitana del Pyleas", "text": "Cuando Siona, capitana del Pyleas entre al campo de batalla, mira las siete primeras cartas de tu biblioteca. Puedes mostrar una carta de Aura que se encuentre entre ellas y ponerla en tu mano. Pon el resto en el fondo de tu biblioteca en un orden aleatorio.\nSiempre que un Aura que controlas se anexe a una criatura que controlas, crea una ficha de criatura Soldado Humano blanca 1/1.", "type": "Criatura legendaria — Soldado humano"}, {"language": "French", "multiverseId": 477239, "name": "Siona, capitaine du Pyléas", "text": "Quand Siona, capitaine du Pyléas arrive sur le champ de bataille, regardez les sept cartes du dessus de votre bibliothèque. Vous pouvez révéler une carte d'aura parmi elles et la mettre dans votre main. Mettez le reste au-dessous de votre bibliothèque dans un ordre aléatoire.\nÀ chaque fois qu'une aura que vous contrôlez devient attachée à une créature que vous contrôlez, créez un jeton de créature 1/1 blanche Humain et Soldat.", "type": "Créature légendaire : humain et soldat"}, {"language": "Italian", "multiverseId": 477493, "name": "Siona, Capitana della Pyleas", "text": "Quando Siona, Capitana della Pyleas entra nel campo di battaglia, guarda le prime sette carte del tuo grimorio. Puoi rivelare una carta Aura scelta tra esse e aggiungerla alla tua mano. Metti le altre in fondo al tuo grimorio in ordine casuale.\nOgniqualvolta un'Aura che controlli viene assegnata a una creatura che controlli, crea una pedina creatura Soldato Umano 1/1 bianca.", "type": "Creatura Leggendaria — Soldato Umano"}, {"language": "Japanese", "multiverseId": 477747, "name": "ピレアス号の艦長、シオーナ", "text": "ピレアス号の艦長、シオーナが戦場に出たとき、あなたのライブラリーの一番上からカードを７枚見る。あなたはその中からオーラ・カード１枚を公開してあなたの手札に加えてもよい。残りをあなたのライブラリーの一番下に無作為の順番で置く。\nあなたがコントロールしているオーラが１つ、あなたがコントロールしているクリーチャーにつけられるたび、白の１/１の人間・兵士・クリーチャー・トークンを１体生成する。", "type": "伝説のクリーチャー — 人間・兵士"}, {"language": "Korean", "multiverseId": 478001, "name": "필리아스 호의 선장, 시오나", "text": "필리아스 호의 선장, 시오나가 전장에 들어올 때, 당신의 서고 맨 위 카드 일곱 장을 본다. 당신은 그중에서 마법진 카드 한 장을 공개하고 당신의 손으로 가져갈 수 있다. 나머지 카드들은 무작위 순서로 당신의 서고 맨 밑에 놓는다.\n당신이 조종하는 마법진이 당신이 조종하는 생물에 부착될 때마다, 1/1 백색 인간 병사 생물 토큰 한 개를 만든다.", "type": "전설적 생물 — 인간 병사"}, {"language": "Portuguese (Brazil)", "multiverseId": 478255, "name": "Siona, Capitã do Píleas", "text": "Quando Siona, Capitã do Píleas entrar no campo de batalha, olhe os sete cards do topo de seu grimório. Você pode revelar um card de Aura dentre eles e colocá-lo em sua mão. Coloque o restante no fundo de seu grimório em ordem aleatória.\nToda vez que uma Aura que você controla se tornar anexada a uma criatura que você controla, crie uma ficha de criatura branca 1/1 do tipo Humano Soldado.", "type": "Criatura Lendária — Humano Soldado"}, {"language": "Russian", "multiverseId": 478509, "name": "Сиона, Капитан «Пилея»", "text": "Когда Сиона, Капитан «Пилея» выходит на поле битвы, посмотрите семь верхних карт вашей библиотеки. Вы можете показать находящуюся среди них карту Ауры и положить ее в вашу руку. Положите остальные карты в низ вашей библиотеки в случайном порядке.\nКаждый раз, когда Аура под вашим контролем прикрепляется к существу под вашим контролем, создайте одну фишку существа 1/1 белый Человек Солдат.", "type": "Легендарное Существо — Человек Солдат"}, {"language": "Chinese Simplified", "multiverseId": 478763, "name": "皮勒阿斯号船长西俄娜", "text": "当皮勒阿斯号船长西俄娜进战场时，检视你牌库顶的七张牌。你可以展示其中的一张灵气牌，并将它置于你手上。将其余的牌以随机顺序置于你的牌库底。\n每当一个由你操控的灵气新结附在由你操控的生物上时，派出一个1/1白色人类／士兵衍生生物。", "type": "传奇生物 ～人类／士兵"}, {"language": "Chinese Traditional", "multiverseId": 479017, "name": "皮勒阿斯號船長西俄娜", "text": "當皮勒阿斯號船長西俄娜進戰場時，檢視你牌庫頂的七張牌。你可以展示其中的一張靈氣牌，並將它置於你手上。將其餘的牌以隨機順序置於你的牌庫底。\n每當一個由你操控的靈氣新結附在由你操控的生物上時，派出一個1/1白色人類／士兵衍生生物。", "type": "傳奇生物 ～人類／士兵"}], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "231142", "cardKingdomId": "230843", "cardsphereId": "65362", "mcmId": "430599", "mcmMetaId": "291134", "mtgArenaId": "70737", "mtgjsonV4Id": "c432e646-9ecb-5556-8bc4-482df4a7b2b1", "mtgoId": "79576", "multiverseId": "476477", "scryfallId": "2b1d890f-7ef8-47b9-9ec8-f3884a1d09db", "scryfallIllustrationId": "57aeb7cf-bf2a-4d45-9458-f80ff96238dd", "scryfallOracleId": "89e17ccf-cde7-428d-bd64-47e2f79b40d7", "tcgplayerProductId": "206819"}, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}{W}", "manaValue": 3.0, "name": "Siona, Captain of the Pyleas", "number": "226", "originalText": "When Siona, Captain of the Pyleas enters the battlefield, look at the top seven cards of your library. You may reveal an Aura card from among them and put it into your hand. Put the rest on the bottom of your library in a random order.\nWhenever an Aura you control becomes attached to a creature you control, create a 1/1 white Human Soldier creature token.", "originalType": "Legendary Creature — Human Soldier", "power": "2", "printings": ["THB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/c2c33e2fc2df4b7d", "cardKingdomFoil": "https://mtgjson.com/links/012f0260216be52a", "cardmarket": "https://mtgjson.com/links/5a645b9cff23a57c", "tcgplayer": "https://mtgjson.com/links/d04224431beb903d"}, "rarity": "uncommon", "rulings": [{"date": "2020-01-24", "text": "If an Aura becomes attached to Siona that causes it to lose all abilities, Siona’s last ability won’t trigger."}, {"date": "2020-01-24", "text": "Siona’s last ability triggers both whenever an Aura enters the battlefield attached to a creature you control and whenever an Aura on the battlefield attached to a different object becomes attached to a creature you control. It doesn’t trigger if an effect tries to attach an Aura to the creature it already enchants."}, {"date": "2020-01-24", "text": "If an Aura becomes attached to Siona that causes another player to gain control of it, that player will control the triggered ability that creates a Soldier."}, {"date": "2020-01-24", "text": "If an Aura becomes attached to a noncreature permanent you control that causes it to become a creature, Siona’s last ability triggers. If an Aura becomes attached to a creature you don’t control that causes it to become a creature you do control, Siona’s last ability triggers. If an Aura becomes attached to a creature you control that causes it to no longer be a creature or to no longer be under your control, Siona’s last ability doesn’t trigger."}], "setCode": "THB", "subtypes": ["Human", "Soldier"], "supertypes": ["Legendary"], "text": "When Siona, Captain of the Pyleas enters the battlefield, look at the top seven cards of your library. You may reveal an Aura card from among them and put it into your hand. Put the rest on the bottom of your library in a random order.\nWhenever an Aura you control becomes attached to a creature you control, create a 1/1 white Human Soldier creature token.", "toughness": "2", "type": "Legendary Creature — Human Soldier", "types": ["Creature"], "uuid": "b20c0aaf-5b35-5d82-8dad-0f0aa6e435eb"}