{"artist": "Livia Prima", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B", "U"], "colors": ["B", "U"], "convertedManaCost": 2.0, "edhrecRank": 3437, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "631a2c9f-8b31-586d-ad5f-7068a494f748", "mtgoId": "94066", "scryfallId": "4004074e-c91c-4151-9adf-3f4df6479f0a", "scryfallIllustrationId": "1a41b22a-65f8-45c0-9ab9-e5b82ad11fea", "scryfallOracleId": "aee82122-d13e-4175-b499-9dde718e4da9"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Flashback"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{U}{B}", "manaValue": 2.0, "name": "Siphon Insight", "number": "94066", "originalReleaseDate": "2022-01-28", "printings": ["DBL", "MID", "PMID", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-09-24", "text": "Only you get to look at the exiled card. Its owner doesn't get to know what it is while it is in exile unless you tell them."}, {"date": "2021-09-24", "text": "You don't have to disclose which card you exiled and which card you put on the bottom of the library. For example, if your opponent knows what the top card of their library is and you cast Siphon Insight, you don't have to tell them where you put that card."}, {"date": "2021-09-24", "text": "You may play the card even if it is a land."}, {"date": "2021-09-24", "text": "You must still follow all normal timing rules to play a card exiled with Siphon Insight."}, {"date": "2021-09-24", "text": "“Flashback [cost]” means “You may cast this card from your graveyard by paying [cost] rather than paying its mana cost” and “If the flashback cost was paid, exile this card instead of putting it anywhere else any time it would leave the stack.”"}, {"date": "2021-09-24", "text": "You must still follow any timing restrictions and permissions, including those based on the card's type. For instance, you can cast a sorcery using flashback only when you could normally cast a sorcery."}, {"date": "2021-09-24", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a flashback cost) you're paying, add any cost increases, then apply any cost reductions. The mana value of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2021-09-24", "text": "A spell cast using flashback will always be exiled afterward, whether it resolves, is countered, or leaves the stack in some other way."}, {"date": "2021-09-24", "text": "You can cast a spell using flashback even if it was somehow put into your graveyard without having been cast."}, {"date": "2021-09-24", "text": "If a card with flashback is put into your graveyard during your turn, you can cast it if it's legal to do so before any other player can take any actions."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Look at the top two cards of target opponent's library. Exile one of them face down and put the other on the bottom of that library. You may look at and play the exiled card for as long as it remains exiled, and you may spend mana as though it were mana of any color to cast that spell.\nFlashback {1}{U}{B}", "type": "Instant", "types": ["Instant"], "uuid": "8be26531-4090-56d1-a292-b2d76540e4f6"}