{"artist": "Shelly Wan", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 16035, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 187523, "name": "Fähigkeitsausleiher", "text": "Die oberste Karte deiner Bibliothek ist offen.\nSolange die oberste Karte deiner Bibliothek eine Artefakt- oder Kreaturenkarte ist, hat der Fähigkeitsausleiher alle aktivierten Fähigkeiten dieser Karte. (Verwenden einige dieser Fähigkeiten den Namen jener Karte, verwende stattdessen den Namen dieser Kreatur.)", "type": "Artefaktkreatur — Mensch, Zauberer"}, {"language": "Spanish", "multiverseId": 187772, "name": "Apropiadora de destrezas", "text": "Juega mostrando la primera carta de tu biblioteca.\nMientras la primera carta de tu biblioteca sea una carta de criatura o artefacto, la Apropiadora de destrezas tiene todas las habilidades activadas de esa carta. (Si alguna de las habilidades usa el nombre de esa carta, en vez de eso, usa el nombre de esta carta.)", "type": "Criatura artefacto — Hechicero humano"}, {"language": "French", "multiverseId": 188519, "name": "Emprunteuse de talent", "text": "Jouez avec la carte du dessus de votre bibliothèque révélée.\nTant que la carte du dessus de votre bibliothèque est une carte d'artefact ou de créature, l'Emprunteuse de talent a toutes les capacités activées de cette carte. (Si l'une de ces capacités utilise le nom de cette carte, utilisez le nom de cette créature à la place.)", "type": "Créature-artefact : humain et sorcier"}, {"language": "Italian", "multiverseId": 188270, "name": "Prestatrice di Abilità", "text": "Gioca con la prima carta del tuo grimorio rivelata.\nFintanto che la prima carta del tuo grimorio è una carta artefatto o creatura, la Prestatrice di Abilità ha tutte le abilità attivate di quella carta. (Se una delle abilità usa il nome di quella carta, usa invece il nome di questa creatura.)", "type": "Creatura Artefatto — Mago Umano"}, {"language": "Japanese", "multiverseId": 187025, "name": "技を借りる者", "text": "あなたのライブラリーの一番上のカードを公開したままプレイする。\nあなたのライブラリーの一番上のカードがアーティファクト・カードかクリーチャー・カードであるかぎり、技を借りる者はそのカードのすべての起動型能力を持つ。 （それらの能力がそのカードの名前を用いている場合、代わりにこのクリーチャーの名前を用いる。）", "type": "アーティファクト・クリーチャー — 人間・ウィザード"}, {"language": "Portuguese (Brazil)", "multiverseId": 188021, "name": "Prestador de Habilidades", "text": "Jogue com o card do topo de seu grimório revelado.\nEnquanto o card do topo de seu grimório for um card de artefato ou de criatura, Prestador de Habilidades terá todas as habilidades ativadas daquele card. (Se uma das habilidades usar o nome daquele card, em vez disso, use o nome desta criatura.)", "type": "Criatura Artefato — Humano Mago"}, {"language": "Russian", "multiverseId": 188768, "name": "Заемщица Умений", "text": "Играйте с открытой верхней картой вашей библиотеки.\nПока верхняя карта вашей библиотеки карта артефакта или существа, Заемщица Умений имеет все активируемые способности той карты. (Если в каких-либо из тех способностей используется имя той карты, вместо него используйте имя этого существа.)", "type": "Артефактное Существо — Человек Чародей"}, {"language": "Chinese Simplified", "multiverseId": 187274, "name": "借招法师", "text": "你以展示牌库顶牌的方式进行对战。\n只要你的牌库顶牌是神器或生物牌，借招法师便具有该牌的所有起动式异能。 （若任何异能用到了该牌的名称，则改为用此生物的名称）", "type": "神器生物～人类／法术师"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "126004", "cardKingdomId": "125766", "cardsphereId": "42645", "mcmId": "19825", "mcmMetaId": "10139", "mtgjsonV4Id": "a8d46b4d-7a87-573a-ac0d-7ea9dc56db6e", "mtgoFoilId": "31342", "mtgoId": "31341", "multiverseId": "179428", "scryfallId": "ac7ac7c8-8e01-4f80-a3fa-d533cb594d7c", "scryfallIllustrationId": "d9dab877-cd02-47ba-b90f-63f211d06015", "scryfallOracleId": "9e862e4a-254d-4d39-b2cf-4beed6db761f", "tcgplayerProductId": "27804"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}", "manaValue": 3.0, "name": "Skill Borrower", "number": "56", "originalText": "Play with the top card of your library revealed.\nAs long as the top card of your library is an artifact or creature card, Skill Borrower has all activated abilities of that card. (If any of the abilities use that card's name, use this creature's name instead.)", "originalType": "Artifact Creature - Human Wizard", "power": "1", "printings": ["ALA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/c421f78a7da4501d", "cardKingdomFoil": "https://mtgjson.com/links/c068cb42725922cc", "cardmarket": "https://mtgjson.com/links/e47df07cba3b7068", "tcgplayer": "https://mtgjson.com/links/fce318e97c078c80"}, "rarity": "rare", "rulings": [{"date": "2008-10-01", "text": "The only difference between a colored artifact and a colorless artifact is, obviously, its color. Unlike most artifacts, a colored artifact requires colored mana to cast. Also unlike most artifacts, a colored artifact has a color in all zones. It will interact with cards that care about color. Other than that, a colored artifact behaves just like any other artifact. It will interact as normal with any card that cares about artifacts, such as Shatter or Arcbound Ravager."}, {"date": "2008-10-01", "text": "Activated abilities contain a colon. They’re generally written “[Cost]: [Effect].” Some keywords are activated abilities; they have colons in their reminder text."}, {"date": "2008-10-01", "text": "If an effect tells you to draw several cards, reveal each one before you draw it. Skill Borrower will momentarily gain the activated abilities of artifact and creature cards revealed this way, but you won’t be able to activate those abilities while the effect is still happening."}, {"date": "2008-10-01", "text": "If the top card of your library changes while you’re activating one of Skill Borrower’s activated abilities gained from that card, the ability will still be activated and will resolve normally even though Skill Borrower has lost that ability."}, {"date": "2008-10-01", "text": "Skill Borrower may gain activated abilities that it can’t use. For example, if the top card of your library is an artifact or creature card with cycling, Skill Borrower will have cycling. However, since cycling can’t be activated from the battlefield, this won’t have any significant benefit. The same is true for unearth."}], "setCode": "ALA", "subtypes": ["Human", "Wizard"], "supertypes": [], "text": "Play with the top card of your library revealed.\nAs long as the top card of your library is an artifact or creature card, Skill Borrower has all activated abilities of that card. (If any of the abilities use that card's name, use this creature's name instead.)", "toughness": "3", "type": "Artifact Creature — Human Wizard", "types": ["Artifact", "Creature"], "uuid": "a1e35fb7-0614-5790-8605-304cecdf6811"}