{"artist": "Dave Kendall", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 10609, "finishes": ["nonfoil", "foil"], "flavorText": "The lawmage's argument was clever and well reasoned, but Blunk's response proved irrefutable.", "foreignData": [{"flavorText": "Das Argument des Gesetzesmagiers war klug und wohldurchdacht, aber Blunks Erwiderung erwies sich als unwiderlegbar.", "language": "German", "multiverseId": 366894, "name": "Schädelbrecher", "text": "Spieler können in diesem Zug keine Lebenspunkte dazuerhalten. Schaden kann in diesem Zug nicht verhindert werden. Der Schädelbrecher fügt einem Spieler deiner Wahl 3 Schadenspunkte zu.", "type": "Spontanzauber"}, {"flavorText": "El argumento del mago de la ley fue inteligente y razonado, pero la respuesta de Blunk demostró ser irrefutable.", "language": "Spanish", "multiverseId": 368017, "name": "Rompecráneos", "text": "Los jugadores no pueden ganar vidas este turno. El daño no puede ser prevenido este turno. El Rompecráneos hace 3 puntos de daño al jugador objetivo.", "type": "Instantáneo"}, {"flavorText": "La plaidoirie du mageloi était adroite et judicieuse, mais la réponse de Blunk s'avéra irréfutable.", "language": "French", "multiverseId": 366586, "name": "Défoncecrâne", "text": "Les joueurs ne peuvent pas gagner de points de vie ce tour-ci. Les blessures ne peuvent être prévenues ce tour-ci. Le Défoncecrâne inflige 3 blessures au joueur ciblé.", "type": "Éphémère"}, {"flavorText": "Gli argomenti del mago della legge erano intelligenti e ragionati, ma la risposta di Blunk si rivelò inconfutabile.", "language": "Italian", "multiverseId": 367191, "name": "Spaccacranio", "text": "I giocatori non possono guadagnare punti vita in questo turno. Il danno non può essere prevenuto in questo turno. Lo Spaccacranio infligge 3 danni a un giocatore bersaglio.", "type": "Istantaneo"}, {"flavorText": "法魔道士の主張は鋭く理にかなっていた。しかしブルンクの反論には抗弁できなかった。", "language": "Japanese", "multiverseId": 368302, "name": "頭蓋割り", "text": "このターン、プレイヤーはライフを得られない。このターン、ダメージは軽減できない。プレイヤー１人を対象とする。頭蓋割りはそのプレイヤーに３点のダメージを与える。", "type": "インスタント"}, {"flavorText": "법치술사는 재치있게 논리를 펼쳤지만 블렁크의 투박한 반론은 당해낼 수 없었다.", "language": "Korean", "multiverseId": 367469, "name": "해골 파쇄", "text": "플레이어들은 이 턴에 생명점을 얻을 수 없다. 이 턴에는 피해를 방지할 수 없다. 플레이어 한 명을 목표로 정한다. 해골 파쇄는 그 플레이어에게 피해 3점을 입힌다.", "type": "순간마법"}, {"flavorText": "O argumento do mago-legista era perspicaz e bastante razoável, mas a resposta de Blunk se mostrou irrefutável.", "language": "Portuguese (Brazil)", "multiverseId": 367630, "name": "Quebra-crânio", "text": "Os jogadores não podem ganhar pontos de vida neste turno. Nenhum dano pode ser prevenido neste turno. Quebra-crânio causa 3 pontos de dano ao jogador alvo.", "type": "Mágica Instantânea"}, {"flavorText": "Аргументы мага-законника были вполне обоснованными и разумными, но ответ Блунка сразил его наповал.", "language": "Russian", "multiverseId": 367941, "name": "Пролом Черепа", "text": "Игроки не могут получать жизни в этом ходу. Повреждения не могут быть предотвращены в этом ходу. Пролом Черепа наносит 3 повреждения целевому игроку.", "type": "Мгновенное заклинание"}, {"flavorText": "律法师的论点巧妙且理由充分，但布郎克的回击却无可辩驳。", "language": "Chinese Simplified", "multiverseId": 365874, "name": "碎颅击", "text": "本回合中，牌手不能获得生命。本回合中，伤害不能被防止。碎颅击对目标牌手造成3点伤害。", "type": "瞬间"}, {"flavorText": "律法師的論點巧妙且理由充分，但布郎克的回擊卻無可辯駁。", "language": "Chinese Traditional", "multiverseId": 366064, "name": "碎顱擊", "text": "本回合中，玩家不能獲得生命。本回合中，傷害不能被防止。碎顱擊對目標玩家造成3點傷害。", "type": "瞬間"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "189184", "cardKingdomId": "188880", "cardsphereId": "19371", "mcmId": "259848", "mcmMetaId": "207112", "mtgjsonV4Id": "d8167a2c-0042-515b-8b1b-29eec81e8d7c", "mtgoFoilId": "47902", "mtgoId": "47901", "multiverseId": "366238", "scryfallId": "8068a146-f6fe-46f3-a42e-822fbc3502e6", "scryfallIllustrationId": "86e5ba66-2a67-487b-bc9a-3b3ac480d61a", "scryfallOracleId": "a6fc0b0c-9ba2-47f2-ab92-26fd20d0f86d", "tcgplayerProductId": "67373"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}", "manaValue": 2.0, "name": "Skullcrack", "number": "106", "originalText": "Players can't gain life this turn. Damage can't be prevented this turn. Skullcrack deals 3 damage to target player.", "originalType": "Instant", "printings": ["GTC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6ee3216bc96b80f1", "cardKingdomFoil": "https://mtgjson.com/links/616fcb9e04ad75a9", "cardmarket": "https://mtgjson.com/links/2f588629e3de86ae", "tcgplayer": "https://mtgjson.com/links/1c5a98252533fd1a"}, "rarity": "uncommon", "rulings": [{"date": "2013-01-24", "text": "Skullcrack targets only the player. If that player is an illegal target when Skullcrack tries to resolve, it won’t resolve and none of its effects will happen."}, {"date": "2013-01-24", "text": "Spells and abilities that would cause a player to gain life or that would prevent damage still resolve, but the life-gain and damage-prevention parts have no effect."}, {"date": "2013-01-24", "text": "Effects that would replace gaining life with another effect won’t apply because it’s impossible for players to gain life."}, {"date": "2013-01-24", "text": "If an effect says to set a player’s life total to a certain number and that number is higher than the player’s current life total, that part of the effect won’t do anything. (If the number is lower than the player’s current life total, the effect will work as normal.)"}], "setCode": "GTC", "subtypes": [], "supertypes": [], "text": "Players can't gain life this turn. Damage can't be prevented this turn. Skullcrack deals 3 damage to target player or planeswalker.", "type": "Instant", "types": ["Instant"], "uuid": "61b3ae38-ad0a-54b6-8a26-aad0567cf6d4"}