{"artist": "Igor Kieryluk", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 5.0, "edhrecRank": 9209, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 380995, "name": "Himmelsbindung", "text": "Konstellation — Immer wenn die Himmelsbindung oder eine andere Verzauberung unter deiner Kontrolle ins Spiel kommt, schicke eine bleibende Karte deiner Wahl, die keine Verzauberung ist, ins Exil. Bringe diese Karte zu Beginn des nächsten Endsegments unter der Kontrolle ihres Besitzers ins Spiel zurück.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 382150, "name": "Vínculo celeste", "text": "Constelación — Siempre que el Vínculo celeste u otro encantamiento entre al campo de batalla bajo tu control, exilia el permanente objetivo que no sea un encantamiento. Regresa esa carta al campo de batalla bajo el control de su propietario al comienzo del próximo paso final.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 381160, "name": "Lien céleste", "text": "Constellation — À chaque fois que le Lien céleste ou un autre enchantement arrive sur le champ de bataille sous votre contrôle, exilez un permanent non-enchantement ciblé. Renvoyez cette carte sur le champ de bataille sous le contrôle de son propriétaire au début de la prochaine étape de fin.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 381325, "name": "Vincolo Celeste", "text": "Costellazione — Ogniqualvolta il Vincolo Celeste o un altro incantesimo entrano nel campo di battaglia sotto il tuo controllo, esilia un permanente non incantesimo bersaglio. Rimetti sul campo di battaglia quella carta sotto il controllo del suo proprietario all'inizio della prossima sottofase finale.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 381490, "name": "空封じ", "text": "星座 ― 空封じか他のエンチャントが１つあなたのコントロール下で戦場に出るたび、エンチャントでないパーマネント１つを対象とし、それを追放する。次の終了ステップの開始時に、そのカードをオーナーのコントロール下で戦場に戻す。", "type": "エンチャント"}, {"language": "Korean", "multiverseId": 381655, "name": "하늘 결박", "text": "성좌 — 하늘 결박이나 다른 부여마법이 당신의 조종 하에 전장에 들어올 때마다, 부여마법이 아닌 지속물을 목표로 정한다. 그 지속물을 추방한다. 다음 종료단 시작에 그렇게 추방된 카드를 소유자의 조종 하에 전장으로 되돌린다.", "type": "부여마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 381820, "name": "Prisão Celeste", "text": "Constelação — Toda vez que Prisão Celeste ou outro encantamento entrar no campo de batalha sob seu controle, exile a permanente alvo que não seja encantamento. Devolva aquele card ao campo de batalha sob o controle de seu dono no início da próxima etapa final.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 381985, "name": "Небесное Связывание", "text": "Созвездие — Каждый раз, когда Небесное Связывание или другие чары выходят на поле битвы под вашим контролем, изгоните целевой не являющийся чарами перманент. Верните ту карту на поле битвы под контролем ее владельца в начале следующего заключительного шага.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 380665, "name": "缚空咒", "text": "星彩～每当缚空咒或另一个结界在你的操控下进战场时，放逐目标非结界的永久物。在下一个结束步骤开始时，将所放逐的牌在其拥有者的操控下返回战场。", "type": "结界"}, {"language": "Chinese Traditional", "multiverseId": 380830, "name": "縛空咒", "text": "星彩～每當縛空咒或另一個結界在你的操控下進戰場時，放逐目標非結界的永久物。在下一個結束步驟開始時，將所放逐的牌在其擁有者的操控下返回戰場。", "type": "結界"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "194297", "cardKingdomId": "194051", "cardsphereId": "22252", "mcmId": "266680", "mcmMetaId": "209566", "mtgjsonV4Id": "bf31a693-fa05-57f0-973b-b0db1d1cbb57", "mtgoFoilId": "52223", "mtgoId": "52222", "multiverseId": "380500", "scryfallId": "91e3117a-0955-47fc-81c0-7a662c8c487f", "scryfallIllustrationId": "0efd26a6-9bd5-49da-a86d-304934f53732", "scryfallOracleId": "13d34f21-f0ce-4e59-ac3e-6635bf7292d3", "tcgplayerProductId": "82306"}, "keywords": ["Constellation"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}{W}", "manaValue": 5.0, "name": "Skybind", "number": "25", "originalText": "Constellation — Whenever Skybind or another enchantment enters the battlefield under your control, exile target nonenchantment permanent. Return that card to the battlefield under its owner's control at the beginning of the next end step.", "originalType": "Enchantment", "printings": ["JOU"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/fbb4ef654d52a739", "cardKingdomFoil": "https://mtgjson.com/links/5685fe7abeb6a592", "cardmarket": "https://mtgjson.com/links/b720cc2d0a1c3625", "tcgplayer": "https://mtgjson.com/links/92f4da192fc0ab53"}, "rarity": "rare", "rulings": [{"date": "2014-04-26", "text": "A constellation ability triggers whenever an enchantment enters the battlefield under your control for any reason. Enchantments with other card types, such as enchantment creatures, will also cause constellation abilities to trigger."}, {"date": "2014-04-26", "text": "An Aura spell without bestow that has an illegal target when it tries to resolve won't resolve and will be put into its owner's graveyard. It won't enter the battlefield and constellation abilities won't trigger. An Aura spell with bestow won't be countered this way. It will revert to being an enchantment creature and resolve, entering the battlefield and triggering constellation abilities."}, {"date": "2014-04-26", "text": "When an enchantment enters the battlefield under your control, each constellation ability of permanents you control will trigger. You can put these abilities on the stack in any order. The last ability you put on the stack will be the first one that resolves."}], "setCode": "JOU", "subtypes": [], "supertypes": [], "text": "Constellation — Whenever Skybind or another enchantment enters the battlefield under your control, exile target nonenchantment permanent. Return that card to the battlefield under its owner's control at the beginning of the next end step.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "37485e19-54db-52da-9900-07876c605c72"}