{"artist": "Wayne England", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210277", "mcmId": "294466", "mtgjsonV4Id": "81634996-8803-5283-aa8d-70d7dac67e45", "multiverseId": "423652", "scryfallId": "24ad1b98-17ef-4c58-a947-384ef39f1193", "scryfallIllustrationId": "3e90db1f-bf4d-41f1-b261-fb366a247055", "scryfallOracleId": "61006acf-de38-420b-ab7a-685fbd64141c", "tcgplayerProductId": "125628"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Skybreen", "number": "71", "originalText": "Players play with the top card of their libraries revealed.\nSpells that share a card type with the top card of a library can't be cast.\nWhenever you roll {Chaos}, target player loses life equal to the number of cards in his or her hand.", "originalType": "Plane — Kaldheim", "printings": ["OHOP", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/986ff5912e5f0cdc", "tcgplayer": "https://mtgjson.com/links/ce6b4f8d230db139"}, "rarity": "common", "rulings": [{"date": "2009-10-01", "text": "A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"}, {"date": "2009-10-01", "text": "A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."}, {"date": "2009-10-01", "text": "The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."}, {"date": "2009-10-01", "text": "If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}, {"date": "2009-10-01", "text": "When playing with the top card of your library revealed, if an effect tells you to draw several cards, reveal each one before you draw it."}, {"date": "2009-10-01", "text": "If the top card of your library changes during the process of casting a spell or activating an ability, the new top card won’t be revealed until the process of casting the spell or activating the ability ends (all targets are chosen, all costs are paid, and so on)."}, {"date": "2009-10-01", "text": "Skybreen’s second ability prevents each player from casting spells that share a card type with a card on top of any library, not just the one on top of that player’s own library. This includes permanent spells (artifacts, creatures, enchantments, and planeswalkers), not just instant and sorcery spells. It doesn’t stop players from playing lands or activating abilities (such as cycling or unearth)."}], "setCode": "OPCA", "subtypes": ["Kaldheim"], "supertypes": [], "text": "Players play with the top card of their libraries revealed.\nSpells that share a card type with the top card of a library can't be cast.\nWhenever you roll {CHAOS}, target player loses life equal to the number of cards in their hand.", "type": "Plane — Kaldheim", "types": ["Plane"], "uuid": "c5783205-0ae2-5fd0-97bc-21ae59e1bc67"}