{"artist": "YW Tang", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 13462, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 492029, "name": "Plünderung der Himmelsfestung", "text": "Schaue dir die obersten X Karten deiner Bibliothek an, wobei X gleich drei plus der Anzahl an Kreaturen in deiner Abenteurergruppe ist. Nimm drei der Karten auf deine Hand und lege den Rest in zufälliger Reihenfolge unter deine Bibliothek. (Deine Abenteurergruppe besteht aus bis zu je einem Kleriker, Krieger, Räuber und Zauberer)", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 492345, "name": "Botín de aerorruina", "text": "Mira las X primeras cartas de tu biblioteca, donde X es tres más la cantidad de criaturas en tu grupo. Pon tres de esas cartas en tu mano y el resto en el fondo de tu biblioteca en un orden aleatorio. (Tu grupo consiste en hasta un Clérigo, un Bribón, un Guerrero y un Hechicero.)", "type": "Conjuro"}, {"language": "French", "multiverseId": 492661, "name": "Butin du fort céleste", "text": "Regardez les X cartes du dessus de votre bibliothèque, X étant trois plus le nombre de créatures dans votre groupe. Mettez trois de ces cartes dans votre main et le reste au-dessous de votre bibliothèque, dans un ordre aléatoire. (Votre groupe est composé de jusqu'à un clerc, un gredin, un guerrier et un sorcier.)", "type": "Rituel"}, {"language": "Italian", "multiverseId": 492977, "name": "Saccheggio dell'Enclave Celeste", "text": "Guarda le prime X carte del tuo grimorio, dove X è tre più il numero di creature nella tua compagnia. Aggiungi tre di quelle carte alla tua mano e metti le altre in fondo al tuo grimorio in ordine casuale. (La tua compagnia può includere fino a un Chierico, un Farabutto, un Guerriero e un Mago.)", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 493293, "name": "スカイクレイブの略奪", "text": "あなたのライブラリーの一番上からカードをＸ枚見る。Ｘはあなたのパーティーを構成しているクリーチャーの総数に３を足した数に等しい。それらのカードのうち３枚をあなたの手札に加え、残りをあなたのライブラリーの一番下に無作為の順番で置く。（あなたのパーティーは、ウィザードとクレリックと戦士とならず者それぞれ最大１体から構成される。）", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 493609, "name": "하늘거주지 약탈", "text": "당신의 서고 맨 위 카드 X장을 본다. X는 당신의 파티에 있는 생물의 수에 3을 더한 수이다. 그 카드들 중 세 장을 당신의 손으로 가져가고 나머지 카드들은 무작위 순서로 당신의 서고 맨 밑에 놓는다. (당신의 파티에는 성직자, 도적, 전사, 마법사가 각각 최대 한 개씩 포함된다.)", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 493925, "name": "Saque do Enclave Celeste", "text": "Olhe os X cards do topo de seu grimório, sendo X três mais o número de criaturas em seu grupo. Coloque três daqueles cards em sua mão e o restante no fundo de seu grimório em ordem aleatória. (Seu grupo consiste em até um membro de cada um dos seguintes tipos: Clérigo, Ladino, Guerreiro e Mago.)", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 494241, "name": "Разграбление Небесного Анклава", "text": "Посмотрите X верхних карт вашей библиотеки, где X равен трем плюс количество существ в вашем отряде. Положите три из тех карт в вашу руку, а остальные — в низ вашей библиотеки в случайном порядке. (В вашем отряде может быть не более одного Бродяги, Воина, Священника и Чародея.)", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 494557, "name": "空境劫夺", "text": "检视你牌库顶的X张牌，X为你冒险团中的生物数量加三。将其中三张置于你手上，其余的牌则以随机顺序置于你的牌库底。（冒险团由僧侣、浪客、战士和法术师组成，每种类别至多只计入一个。）", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 494873, "name": "空境劫奪", "text": "檢視你牌庫頂的X張牌，X為你冒險團中的生物數量加三。將其中三張置於你手上，其餘的牌則以隨機順序置於你的牌庫底。（冒險團由僧侶、浪客、戰士和魔法師組成，每種類別至多只計入一個。）", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "237776", "cardKingdomId": "237190", "cardsphereId": "70457", "mcmId": "496385", "mcmMetaId": "316985", "mtgArenaId": "73274", "mtgjsonV4Id": "6cce48a7-293c-5521-ac0e-22af2422aa2d", "mtgoId": "83119", "multiverseId": "491713", "scryfallId": "3ff05312-787e-4e5e-a0d5-8f3fb576fc49", "scryfallIllustrationId": "7a7da93a-5576-4351-b076-8e5e6a0c7e8b", "scryfallOracleId": "d2d5f9b8-7caf-42c8-934b-3f4b81468914", "tcgplayerProductId": "222099"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U}", "manaValue": 5.0, "name": "Skyclave Plunder", "number": "81", "originalText": "Look at the top X cards of your library, where X is three plus the number of creatures in your party. Put three of those cards into your hand and the rest on the bottom of your library in a random order. (Your party consists of up to one each of Cleric, Rogue, Warrior, and Wizard.)", "originalType": "Sorcery", "printings": ["ZNR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/b48e90d6d6948181", "cardKingdomFoil": "https://mtgjson.com/links/cd8b0e82f9ead541", "cardmarket": "https://mtgjson.com/links/63664415a8858f28", "tcgplayer": "https://mtgjson.com/links/fa7ff64d3c0dd55e"}, "rarity": "uncommon", "rulings": [{"date": "2020-09-25", "text": "To determine “the number of creatures in your party,” check whether you control a Cleric, whether you control a Rogue, whether you control a Warrior, and whether you control a Wizard. The number is the total number of those checks to which you answered yes. Each creature you control can be counted for only one of those checks."}, {"date": "2020-09-25", "text": "If a creature has more than one party creature type, and there are multiple ways to count that creature that could result in a different number of creatures in your party, the highest such number is used. For example, if you control a Cleric and a Cleric Wizard, the number of creatures in your party is two. You can’t choose to have it be just one by counting the Cleric Wizard first as a Cleric."}, {"date": "2020-09-25", "text": "An ability referring to the number of creatures in your party gets a number from zero to four. Such abilities never ask which creatures are in your party, and you never have to designate specific creatures as being in your party. You can’t choose to exclude creatures from this count to lower the number."}], "setCode": "ZNR", "subtypes": [], "supertypes": [], "text": "Look at the top X cards of your library, where X is three plus the number of creatures in your party. Put three of those cards into your hand and the rest on the bottom of your library in a random order. (Your party consists of up to one each of Cleric, Rogue, Warrior, and Wizard.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "54cbe878-7ebd-5235-986b-60ed7b3d13d7"}