{"artist": "Denys Tsiperko", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 10440, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "260301", "cardsphereId": "88122", "mcmId": "659259", "mtgjsonV4Id": "c2618a29-217b-5f47-860d-6a70d3237e7e", "scryfallId": "270c4881-47fa-4f1f-9e16-943747b051e3", "scryfallIllustrationId": "9876d6ba-dc94-4a7e-a36b-2f20a56d5d8d", "scryfallOracleId": "58aac732-3f03-4551-a684-6cb0e3b31c09", "tcgplayerProductId": "270613"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Escape", "Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Skyway Robber", "number": "31p", "power": "3", "printings": ["NCC", "PNCC"], "promoTypes": ["promopack", "stamped", "planeswalkerstamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/c4ca65066049fb58", "tcgplayer": "https://mtgjson.com/links/202bdb7653858111"}, "rarity": "rare", "rulings": [{"date": "2022-04-29", "text": "Escape's permission doesn't change when you may cast the spell from your graveyard."}, {"date": "2022-04-29", "text": "The ability Skyway Robber escapes with only allows you to cast cards exiled with its escape ability the last time it escaped. If it dies and escapes again later, or if it moves to another zone and returns to the battlefield, you won't be able to cast any of the cards exiled with it before."}, {"date": "2022-04-29", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost you're paying (such as an escape cost), add any cost increases, then apply any cost reductions. The mana value of the spell remains unchanged, no matter what the total cost to cast it was and no matter whether an alternative cost was paid."}, {"date": "2022-04-29", "text": "After an escaped spell resolves, it returns to its owner's graveyard if it's not a permanent spell. If it is a permanent spell, it enters the battlefield and will return to its owner's graveyard if it dies later."}, {"date": "2022-04-29", "text": "If a card has multiple abilities giving you permission to cast it, such as two escape abilities or an escape ability and a flashback ability, you choose which one to apply. The others have no effect."}, {"date": "2022-04-29", "text": "If you cast a spell with its escape permission, you can't choose to apply any other alternative costs or to cast it without paying its mana cost. If it has any additional costs, you must pay those."}, {"date": "2022-04-29", "text": "If a card with escape is put into your graveyard during your turn, you'll be able to cast it right away if it's legal to do so, before an opponent can take any actions."}, {"date": "2022-04-29", "text": "Once you begin casting a spell with escape, it immediately moves to the stack. Players can't take any other actions until you're done casting the spell."}], "securityStamp": "oval", "setCode": "PNCC", "subtypes": ["Bird", "Rogue"], "supertypes": [], "text": "Flying\nEscape—{3}{U}, Exile five other cards from your graveyard. (You may cast this card from your graveyard for its escape cost.)\nSkyway Robber escapes with \"Whenever Skyway Robber deals combat damage to a player, you may cast an artifact, instant, or sorcery spell from among cards exiled with Skyway Robber without paying its mana cost.\"", "toughness": "3", "type": "Creature — Bird Rogue", "types": ["Creature"], "uuid": "c04aa104-368d-5f08-bc28-bb3cb0c37c28"}