{"artist": "Mark Winters", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 12425, "finishes": ["nonfoil", "foil"], "flavorText": "The pirates had left the open sea behind, but they were still in their element: reckless adventure.", "foreignData": [{"flavorText": "Piraten sind auf dem offenen Meer zu Hause, und überall sonst, wo sie sich in waghalsige Abenteuer stürzen können.", "language": "German", "multiverseId": 435705, "name": "Schnittiger Schoner", "text": "Bemannen 1 (Tappe eine beliebige Anzahl an Kreaturen, die du kontrollierst und die zusammen Stärke 1 oder mehr haben: Dieses Fahrzeug wird bis zum Ende des Zuges zu einer Artefaktkreatur.)", "type": "Artefakt — Fahrzeug"}, {"flavorText": "Los piratas habían dejado el mar abierto a sus espaldas, pero seguían en su elemento: la aventura despreocupada.", "language": "Spanish", "multiverseId": 437798, "name": "Goleta eficaz", "text": "Tripular 1. (Girar cualquier cantidad de criaturas que controlas con una fuerza total de 1 o más: Este Vehículo se convierte en una criatura artefacto hasta el final del turno.)", "type": "Artefacto — Vehículo"}, {"flavorText": "Les pirates avaient peut-être dit adieu au grand large, mais ils étaient toujours dans leur élément : l'aventure.", "language": "French", "multiverseId": 436004, "name": "Goélette élégante", "text": "Pilotage 1 (Engagez n'importe quel nombre de créatures que vous contrôlez dont la force totale est supérieure ou égale à 1 : Ce véhicule devient une créature-artefact jusqu'à la fin du tour.)", "type": "Artefact : véhicule"}, {"flavorText": "I pirati si erano lasciati il mare aperto alle spalle, ma si trovavano ancora nel loro elemento naturale: un'avventura spericolata.", "language": "Italian", "multiverseId": 436303, "name": "Goletta Agile", "text": "Manovrare 1 (TAPpa un qualsiasi numero di creature che controlli con forza totale pari o superiore a 1: Questo Veicolo diventa una creatura artefatto fino alla fine del turno.)", "type": "Artefatto — Veicolo"}, {"flavorText": "その海賊たちは大海原を離れたが、自分たちの本分を守っていた。無鉄砲な冒険である。", "language": "Japanese", "multiverseId": 436602, "name": "小綺麗なスクーナー船", "text": "搭乗１（あなたがコントロールしている望む数のクリーチャーを、パワーの合計が１以上になるように選んでタップする：ターン終了時まで、この機体はアーティファクト・クリーチャーになる。）", "type": "アーティファクト — 機体"}, {"flavorText": "해적들은 망망대해를 뒤로 하고 떠났지만, 무모한 모험이라는 그들의 본질은 변하지 않았다.", "language": "Korean", "multiverseId": 436901, "name": "날렵한 범선", "text": "탑승 1 (당신이 조종하는 생물을 공격력 총합이 1 이상이 되도록 원하는 수만큼 탭한다: 이 탑승물은 턴종료까지 마법물체 생물이 된다.)", "type": "마법물체 — 탑승물"}, {"flavorText": "Os piratas haviam deixado para trás o mar aberto, mas ainda estavam em seu elemento natural: a aventura temerária.", "language": "Portuguese (Brazil)", "multiverseId": 437200, "name": "Escuna Ligeira", "text": "Tripular 1 (Vire qualquer número de criaturas que você controla com total de poder igual ou superior a 1: Este Veículo torna-se uma criatura artefato até o final do turno.)", "type": "Artefato — Veículo"}, {"flavorText": "Открытое море осталось за спиной, но пираты все равно были в своей стихии: безрассудном приключении.", "language": "Russian", "multiverseId": 437499, "name": "Резвая Шхуна", "text": "Экипаж 1 (Поверните любое количество существ под вашим контролем с суммарной силой 1 или более: эта Машина становится артефактом существом до конца хода.)", "type": "Артефакт — Машина"}, {"flavorText": "虽然海盗已远离他们熟悉的苍茫大海，但他们生活中的一个重要元素仍在：鲁莽冒险。", "language": "Chinese Simplified", "multiverseId": 438097, "name": "华贵纵帆船", "text": "搭载1（横置任意数量由你操控且力量总和等于或大于1的生物：此载具成为神器生物直到回合结束。）", "type": "神器 ～载具"}, {"flavorText": "雖然海盜已遠離他們熟悉的蒼茫大海，但他們生活中的一個重要元素仍在：魯莽冒險。", "language": "Chinese Traditional", "multiverseId": 438396, "name": "華貴縱帆船", "text": "搭載1（橫置任意數量由你操控且力量總和等於或大於1的生物：此載具成為神器生物直到回合結束。）", "type": "神器 ～載具"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "214271", "cardKingdomId": "213964", "cardsphereId": "51002", "mcmId": "301237", "mcmMetaId": "226788", "mtgArenaId": "66469", "mtgjsonV4Id": "3bb3a951-3865-5d6a-9173-5eb6a77ef2c8", "mtgoFoilId": "65521", "mtgoId": "65520", "multiverseId": "435406", "scryfallId": "767e2bfb-bcf5-442c-b092-bdb1f4f13561", "scryfallIllustrationId": "ae881c89-206e-4fa3-8477-5fdf03604d28", "scryfallOracleId": "3284010f-aeb2-493e-9252-3b953a192a94", "tcgplayerProductId": "144536"}, "keywords": ["Crew"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Sleek Schooner", "number": "247", "originalText": "Crew 1 (Tap any number of creatures you control with total power 1 or more: This Vehicle becomes an artifact creature until end of turn.)", "originalType": "Artifact — Vehicle", "power": "4", "printings": ["XLN"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/913feb6953e4b532", "cardKingdomFoil": "https://mtgjson.com/links/00dbbfa641a7c610", "cardmarket": "https://mtgjson.com/links/5f68ad908060233f", "tcgplayer": "https://mtgjson.com/links/3ee99ddbae06a971"}, "rarity": "uncommon", "rulings": [{"date": "2017-09-29", "text": "Each Vehicle is printed with a power and toughness, but it’s not a creature. If it becomes a creature (most likely through its crew ability), it will have that power and toughness."}, {"date": "2017-09-29", "text": "If an effect causes a Vehicle to become an artifact creature with a specified power and toughness, that effect overwrites the Vehicle’s printed power and toughness."}, {"date": "2017-09-29", "text": "Vehicle is an artifact type, not a creature type. A Vehicle that’s crewed won’t normally have any creature type."}, {"date": "2017-09-29", "text": "Once a player announces that they are activating a crew ability, no player may take other actions until the ability has been paid for. Notably, players can’t try to stop the ability by changing a creature’s power or by removing or tapping a creature."}, {"date": "2017-09-29", "text": "Any untapped creature you control can be tapped to pay a crew cost, even one that just came under your control."}, {"date": "2017-09-29", "text": "You may tap more creatures than necessary to activate a crew ability."}, {"date": "2017-09-29", "text": "Creatures that crew a Vehicle aren’t attached to it or related in any other way. Effects that affect the Vehicle, such as by destroying it or giving it a +1/+1 counter, don’t affect the creatures that crewed it."}, {"date": "2017-09-29", "text": "Once a Vehicle becomes a creature, it behaves exactly like any other artifact creature. It can’t attack unless you’ve controlled it continuously since your turn began, it can block if it’s untapped, it can be tapped to pay a Vehicle’s crew cost, and so on."}, {"date": "2017-09-29", "text": "You may activate a crew ability of a Vehicle even if it’s already an artifact creature. Doing so has no effect on the Vehicle. It doesn’t change its power and toughness."}, {"date": "2017-09-29", "text": "For a Vehicle to be able to attack, it must be a creature as the declare attackers step begins, so the latest you can activate its crew ability to attack with it is during the beginning of combat step. For a Vehicle to be able to block, it must be a creature as the declare blockers step begins, so the latest you can activate its crew ability to block with it is during the declare attackers step. In either case, players may take actions after the crew ability resolves but before the Vehicle has been declared as an attacking or blocking creature."}, {"date": "2017-09-29", "text": "When a Vehicle becomes a creature, that doesn’t count as having a creature enter the battlefield. The permanent was already on the battlefield; it only changed its types. Abilities that trigger whenever a creature enters the battlefield won’t trigger."}, {"date": "2017-09-29", "text": "If a permanent becomes a copy of a Vehicle, the copy won’t be a creature, even if the Vehicle it’s copying has become an artifact creature."}], "setCode": "XLN", "subtypes": ["Vehicle"], "supertypes": [], "text": "Crew 1 (Tap any number of creatures you control with total power 1 or more: This Vehicle becomes an artifact creature until end of turn.)", "toughness": "3", "type": "Artifact — Vehicle", "types": ["Artifact"], "uuid": "695546f1-c67b-50d0-bcb3-efeaac1fbe19"}