{"artist": "Dan Scott", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 6250, "finishes": ["nonfoil", "foil"], "flavorText": "\"I'd rather be caught red-handed than leave empty-handed!\"", "foreignData": [{"flavorText": "„Ich riskiere es lieber, geschnappt zu werden, als leer auszugehen!\"", "language": "German", "multiverseId": 439915, "name": "Ausgefuchste Halunkin", "text": "Aufstieg (Falls du zehn oder mehr bleibende Karten kontrollierst, erhältst du für den Rest der Partie den Segen der Stadt.)\nSolange du den Segen der Stadt hast, hat die Ausgefuchste Halunkin Fluchsicherheit und kann nicht geblockt werden.", "type": "Kreatur — Mensch, Pirat"}, {"flavorText": "\"¡Mejor que me atrapen con las manos en la masa que irme con las manos vacías!\".", "language": "Spanish", "multiverseId": 440118, "name": "Truhana escurridiza", "text": "Ascender. (Si controlas diez o más permanentes, obtienes la bendición de la ciudad durante el resto del juego.)\nMientras tengas la bendición de la ciudad, la Truhana escurridiza tiene la habilidad de antimaleficio y no puede ser bloqueada.", "type": "Criatura — Pirata humano"}, {"flavorText": "« Je préfère encore être prise la main dans le sac que la main vide ! »", "language": "French", "multiverseId": 440321, "name": "Vaurienne insaisissable", "text": "Ascension (Si vous contrôlez au moins dix permanents, vous gagnez l'agrément de la cité pour le reste de la partie.)\nTant que vous avez l'agrément de la cité, la Vaurienne insaisissable a la défense talismanique et elle ne peut pas être bloquée.", "type": "Créature : humain et pirate"}, {"flavorText": "\"Meglio essere colta con le mani nel sacco che andarmene a mani vuote!\"", "language": "Italian", "multiverseId": 440524, "name": "Canaglia Sfuggevole", "text": "Ascesa (Se controlli dieci o più permanenti, ottieni la benedizione della città per il resto della partita.)\nFintanto che hai la benedizione della città, la Canaglia Sfuggevole ha anti-malocchio e non può essere bloccata.", "type": "Creatura — Pirata Umano"}, {"flavorText": "「手ぶらで戻るくらいなら、手が後ろに回った方がましだわ。」", "language": "Japanese", "multiverseId": 440727, "name": "捕らえ難い悪漢", "text": "昇殿（あなたがパーマネントを10個以上コントロールしているなら、このゲームの間、あなたは都市の承認を得る。）\nあなたが都市の承認を持っているかぎり、捕らえ難い悪漢は呪禁を持つとともにブロックされない。", "type": "クリーチャー — 人間・海賊"}, {"flavorText": "\"빈 손으로 떠나느니 차라리 현행범으로 붙잡히겠어!\"", "language": "Korean", "multiverseId": 440930, "name": "약삭빠른 악당", "text": "승격 (당신이 지속물을 열 개 이상 조종한다면, 당신은 이 게임이 끝날 때까지 도시의 축복을 받는다.)\n당신이 도시의 축복을 가진 한 약삭빠른 악당은 방호를 가지며 방어될 수 없다.", "type": "생물 — 인간 해적"}, {"flavorText": "\"Prefiro ser pega com a mão na massa do que sair com as mãos abanando!\"", "language": "Portuguese (Brazil)", "multiverseId": 441133, "name": "Canalha Ardilosa", "text": "Ascender (Se você controla dez ou mais permanentes, você recebe a bênção da cidade pelo restante do jogo.)\nEnquanto você tiver a bênção da cidade, Canalha Ardilosa terá resistência a magia e não poderá ser bloqueada.", "type": "Criatura — Humano Pirata"}, {"flavorText": "«Уж лучше пусть меня поймают с поличным, чем я этого самого поличного вовсе не увижу!»", "language": "Russian", "multiverseId": 441336, "name": "Скользкая Прохвостка", "text": "Возвышение (Если под вашим контролем есть десять или больше перманентов, вы получаете благословение города до конца партии.)\nПока у вас есть благословение города, Скользкая Прохвостка имеет Порчеустойчивость и не может быть заблокирована.", "type": "Существо — Человек Пират"}, {"flavorText": "「我宁可被人逮住现行，也不愿空手先行！」", "language": "Chinese Simplified", "multiverseId": 441539, "name": "矫捷恶棍", "text": "登殿（如果你操控十个或更多永久物，则于这盘游戏接下来的时段中，你得到黄金城祝福。）\n只要你有黄金城祝福，矫捷恶棍便具有辟邪异能且不能被阻挡。", "type": "生物 ～人类／海盗"}, {"flavorText": "「我寧可被人逮住現行，也不願空手先行！」", "language": "Chinese Traditional", "multiverseId": 441742, "name": "矯捷惡棍", "text": "登殿（如果你操控十個或更多永久物，則於這盤遊戲接下來的時段中，你得到黃金城祝福。）\n只要你有黃金城祝福，矯捷惡棍便具有辟邪異能且不能被阻擋。", "type": "生物 ～人類／海盜"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "216421", "cardKingdomId": "216209", "cardsphereId": "53262", "mcmId": "315391", "mcmMetaId": "236190", "mtgArenaId": "66727", "mtgjsonV4Id": "bac457f7-345d-5a24-bc56-f0cd65186a8f", "mtgoId": "66563", "multiverseId": "439712", "scryfallId": "262f3c10-f29a-494f-88c6-0d44b2cbdc82", "scryfallIllustrationId": "b76c1bdd-a3b1-4385-9303-c372197c8980", "scryfallOracleId": "3c7ea8d0-d866-4c02-bdfc-13bbc87c094a", "tcgplayerProductId": "155811"}, "keywords": ["Ascend"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}", "manaValue": 3.0, "name": "Slippery Scoundrel", "number": "55", "originalText": "Ascend (If you control ten or more permanents, you get the city's blessing for the rest of the game.)\nAs long as you have the city's blessing, Slippery Scoundrel has hexproof and can't be blocked.", "originalType": "Creature — Human Pirate", "power": "2", "printings": ["RIX"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1883b2b0cea18c9c", "cardKingdomFoil": "https://mtgjson.com/links/c876db24624aac4d", "cardmarket": "https://mtgjson.com/links/eecfa8c320ed15f7", "tcgplayer": "https://mtgjson.com/links/26dbb4ca1f953726"}, "rarity": "uncommon", "rulings": [{"date": "2018-01-19", "text": "Once Slippery Scoundrel has become blocked, getting the city’s blessing won’t cause it to become unblocked."}, {"date": "2018-01-19", "text": "Once you have the city’s blessing, you have it for the rest of the game, even if you lose control of some or all of your permanents. The city’s blessing isn’t a permanent itself and can’t be removed by any effect."}, {"date": "2018-01-19", "text": "A permanent is any object on the battlefield, including tokens and lands. Spells and emblems aren’t permanents."}, {"date": "2018-01-19", "text": "If you cast a spell with ascend, you don’t get the city’s blessing until it resolves. Players may respond to that spell by trying to change whether you get the city’s blessing."}, {"date": "2018-01-19", "text": "If you control ten permanents but don’t control a permanent or resolving spell with ascend, you don’t get the city’s blessing. For example, if you control ten permanents, lose control of one, then cast Golden Demise, you won’t have the city’s blessing and the spell will affect creatures you control."}, {"date": "2018-01-19", "text": "If your tenth permanent enters the battlefield and then a permanent leaves the battlefield immediately afterwards (most likely due to the “Legend Rule” or due to being a creature with 0 toughness), you get the city’s blessing before it leaves the battlefield."}, {"date": "2018-01-19", "text": "Ascend on a permanent isn’t a triggered ability and doesn’t use the stack. Players can respond to a spell that will give you your tenth permanent, but they can’t respond to getting the city’s blessing once you control that tenth permanent. This means that if your tenth permanent is a land you play, players can’t respond before you get the city’s blessing."}, {"date": "2018-01-19", "text": "Some cards get power, toughness, and/or abilities once you have the city’s blessing. If another card has an ability that triggers when creatures with certain characteristics enter the battlefield (such as Mentor of the Meek or Elemental Bond do), use the entering permanent’s characteristics after you have the city’s blessing to determine whether those abilities trigger. This is true even if the entering permanent is your tenth permanent."}], "setCode": "RIX", "subtypes": ["Human", "Pirate"], "supertypes": [], "text": "Ascend (If you control ten or more permanents, you get the city's blessing for the rest of the game.)\nAs long as you have the city's blessing, Slippery Scoundrel has hexproof and can't be blocked.", "toughness": "2", "type": "Creature — Human Pirate", "types": ["Creature"], "uuid": "be317768-3acc-5477-a51b-c1ef754499d3"}