{"artist": "Steven Belledin", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 10544, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 163556, "name": "Schlittermuse", "text": "Wenn die Schlittermuse das Spiel verlässt, bestimme einen Gegner. Falls dieser Spieler mehr Karten als du auf der Hand hast, ziehe so viele Karten, wie die Differenz beträgt.\nHerbeirufen {3}{U} (Du kannst diesen Zauber für seine Herbeirufungskosten spielen. Falls du das tust, wird die Kreatur geopfert, wenn sie ins Spiel kommt.)", "type": "Kreatur — Elementarwesen"}, {"language": "Spanish", "multiverseId": 163406, "name": "Musa escurridiza", "text": "Cuando la Musa escurridiza deje el juego, elige un oponente. Si ese jugador tiene más cartas en la mano que tú, roba una cantidad de cartas igual a la diferencia.\nEvocar {3}{U}. (Puedes jugar este hechizo por su coste de evocar. Si lo haces, sacrifícalo cuando entre en juego.)", "type": "Criatura — Elemental"}, {"language": "French", "multiverseId": 164306, "name": "Rampemuse", "text": "Quand la Rampemuse quitte le jeu, choisissez un adversaire. Si ce joueur a plus de cartes en main que vous, piochez un nombre de cartes égal à la différence.\nÉvocation {3}{U} (Vous pouvez jouer ce sort pour son coût d'évocation. Si vous faites ainsi, il est sacrifié quand il arrive en jeu.)", "type": "Créature : élémental"}, {"language": "Italian", "multiverseId": 163706, "name": "Estro Strisciante", "text": "Quando l'Estro Strisciante lascia il gioco, scegli un avversario. Se quel giocatore ha più carte in mano di te, pesca un ammontare di carte pari alla differenza.\nApparire {3}{U} (Puoi giocare questa magia pagando il suo costo di apparire. Se lo fai, viene sacrificata quando entra in gioco.)", "type": "Creatura — Elementale"}, {"language": "Japanese", "multiverseId": 164006, "name": "這い耽り", "text": "這い耽りが場を離れたとき、対戦相手を１人選ぶ。 そのプレイヤーの手札のカードの枚数があなたより多い場合、その差に等しい枚数のカードを引く。\n想起 {3}{U} （あなたはこの呪文を、その想起コストを支払ってプレイしてもよい。 そうした場合、場に出たときにそれを生け贄に捧げる。）", "type": "クリーチャー — エレメンタル"}, {"language": "Portuguese (Brazil)", "multiverseId": 163856, "name": "Meditador Rastejante", "text": "Quando Meditador Rastejante deixar o jogo, escolha um oponente. Se aquele jogador tiver mais cards na mão do que você, compre um número de cards igual à diferença.\nEvocar {3}{U} (Você pode jogar esta mágica pagando seu custo de evocar. Se fizer isso, ela será sacrificada quando entrar em jogo.)", "type": "Criatura — Elemental"}, {"language": "Russian", "multiverseId": 164456, "name": "Полоз Мудрости", "text": "Когда Полоз Мудрости покидает игру, выберите оппонента. Если в руке того игрока больше карт, чем в вашей, возьмите недостающее количество карт.\nВызывание {3}{U} (Вы можете разыграть это заклинание за его стоимость Вызывания. Если вы это делаете, то оно приносится в жертву, когда входит в игру.)", "type": "Существо — Элементаль"}, {"language": "Chinese Simplified", "multiverseId": 164156, "name": "蛇身思灵", "text": "当蛇身思灵离场时，选择一位对手。 若该牌手的手牌数量比你多，则抓等同于该差距数量的牌。\n呼魂{3}{U} （你可以支付此咒语的呼魂费用来使用它。 若你如此作，当它进场时便牺牲之。）", "type": "生物～元素"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "124430", "cardKingdomId": "124280", "cardsphereId": "32645", "mcmId": "18879", "mcmMetaId": "9467", "mtgjsonV4Id": "88a1188d-225d-5938-a8db-b32bec946b45", "mtgoFoilId": "29237", "mtgoId": "29236", "multiverseId": "157428", "scryfallId": "2ec9df4e-2ee7-4c77-91b0-ad6e624340cd", "scryfallIllustrationId": "1a06b05f-af4f-403a-934e-5c2cbfd1f4d8", "scryfallOracleId": "4b6512aa-535e-4edf-8797-43df2b8463de", "tcgplayerProductId": "18063"}, "keywords": ["Evoke"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{U}", "manaValue": 4.0, "name": "Slithermuse", "number": "50", "originalText": "When Slithermuse leaves play, choose an opponent. If that player has more cards in hand than you, draw cards equal to the difference.\nEvoke {3}{U} (You may play this spell for its evoke cost. If you do, it's sacrificed when it comes into play.)", "originalType": "Creature - Elemental", "power": "3", "printings": ["MOR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6fb534aeba09a43d", "cardKingdomFoil": "https://mtgjson.com/links/8772d4a74c29cf01", "cardmarket": "https://mtgjson.com/links/b0aeafcd7d3e1a37", "tcgplayer": "https://mtgjson.com/links/2861601ebf578a83"}, "rarity": "rare", "rulings": [{"date": "2008-04-01", "text": "Evoke doesn’t change the timing of when you can cast the creature that has it. If you could cast that creature spell only when you could cast a sorcery, the same is true for cast it with evoke."}, {"date": "2008-04-01", "text": "If a creature spell cast with evoke changes controllers before it enters the battlefield, it will still be sacrificed when it enters the battlefield. Similarly, if a creature cast with evoke changes controllers after it enters the battlefield but before its sacrifice ability resolves, it will still be sacrificed. In both cases, the controller of the creature at the time it left the battlefield will control its leaves-the-battlefield ability."}, {"date": "2008-04-01", "text": "When you cast a spell by paying its evoke cost, its mana cost doesn’t change. You just pay the evoke cost instead."}, {"date": "2008-04-01", "text": "Effects that cause you to pay more or less to cast a spell will cause you to pay that much more or less while casting it for its evoke cost, too. That’s because they affect the total cost of the spell, not its mana cost."}, {"date": "2008-04-01", "text": "Whether evoke’s sacrifice ability triggers when the creature enters the battlefield depends on whether the spell’s controller chose to pay the evoke cost, not whether they actually paid it (if it was reduced or otherwise altered by another ability, for example)."}, {"date": "2008-04-01", "text": "If you’re casting a spell “without paying its mana cost,” you can’t use its evoke ability."}, {"date": "2008-04-01", "text": "You choose an opponent when the ability resolves. Once you determine how many more cards than you that player has, that number is locked in as the amount you’ll draw."}], "setCode": "MOR", "subtypes": ["Elemental"], "supertypes": [], "text": "When Slithermuse leaves the battlefield, choose an opponent. If that player has more cards in hand than you, draw cards equal to the difference.\nEvoke {3}{U} (You may cast this spell for its evoke cost. If you do, it's sacrificed when it enters the battlefield.)", "toughness": "3", "type": "Creature — Elemental", "types": ["Creature"], "uuid": "e5110866-2adb-5587-a37b-329f8d21612e"}