{"artist": "Justine Cruz", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 7012, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "c95a78c5-b70f-5f81-8d06-64e116e2e837", "mtgoId": "90028", "scryfallId": "f43367d3-ceb2-4b91-a624-639d226de554", "scryfallIllustrationId": "5cf0308f-3c12-4107-a4cf-d6c5860f1817", "scryfallOracleId": "8c2dd8dc-8623-4518-b3fd-dcb9f647fa98"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Goad"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Sly Instigator", "number": "90028", "originalReleaseDate": "2021-05-01", "power": "2", "printings": ["C21", "CLB", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-04-16", "text": "Once a creature an opponent controls has been legally blocked, activating Sly Instigator's ability won't change or undo that block."}, {"date": "2021-04-16", "text": "If a goaded creature can't attack for any reason (such as being tapped or having come under that player's control that turn), then it doesn't attack. If there's a cost associated with having it attack, its controller isn't forced to pay that cost, so it doesn't have to attack in that case either."}, {"date": "2021-04-16", "text": "If a goaded creature doesn't meet any of the above exceptions and can attack, it must attack a player other than a player who goaded it if able. It the creature can't attack any of those players but could otherwise attack, it must attack an opposing planeswalker (controlled by any opponent) or a player who goaded it."}, {"date": "2021-04-16", "text": "Attacking with a goaded creature doesn't cause it to stop being goaded."}, {"date": "2021-04-16", "text": "Being goaded more than once by the same player is redundant."}, {"date": "2021-04-16", "text": "If you goad a creature you control, it must attack, and it must attack a player rather than a planeswalker."}, {"date": "2021-04-16", "text": "If a creature you control has been goaded by multiple opponents, it must attack one of your opponents who hasn't goaded it. If a creature you control has been goaded by each of your opponents, you choose which opponent it attacks."}, {"date": "2021-04-16", "text": "If you leave the game, any creatures you've goaded remain goaded until your next turn would have begun. They don't immediately stop being goaded and don't remain goaded indefinitely."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Human", "Wizard"], "supertypes": [], "text": "{U}, {T}: Until your next turn, target creature an opponent controls can't be blocked. Goad that creature. (Until your next turn, that creature attacks each combat if able and attacks a player other than you if able.)", "toughness": "4", "type": "Creature — Human Wizard", "types": ["Creature"], "uuid": "eca69234-3cf8-5e10-9979-578aaeca974f"}