{"artist": "Christopher Moeller", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 3.0, "edhrecRank": 1162, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "Japanese", "multiverseId": 457032, "name": "蛇の陰影", "text": "エンチャント（クリーチャー）\nエンチャントされているクリーチャーは＋１/＋１の修整を受け、「このクリーチャーが対戦相手１人にダメージを与えるたび、あなたはカードを１枚引いてもよい。」を持つ。\n族霊鎧（エンチャントされているクリーチャーが破壊されるなら、代わりにそれが負っているダメージをすべて取り除いてこのオーラを破壊する。）", "type": "エンチャント — オーラ"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "222935", "cardKingdomId": "222681", "cardsphereId": "58092", "mcmId": "367005", "mcmMetaId": "11269", "mtgjsonV4Id": "6f217a91-b82a-5c97-b565-7ec6d4ccfe12", "mtgoId": "70437", "multiverseId": "456778", "scryfallId": "e3071a8b-05b1-490c-89f6-4bf97c02833b", "scryfallIllustrationId": "01dd1a9b-c7be-4c37-aa93-0358b39d3fa3", "scryfallOracleId": "70ed2052-f03c-461d-b32a-8835c97c559f", "tcgplayerProductId": "180980"}, "isReprint": true, "keywords": ["Enchant", "Totem armor"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}", "manaValue": 3.0, "name": "Snake Umbra", "number": "182", "originalText": "Enchant creature\nEnchanted creature gets +1/+1 and has \"Whenever this creature deals damage to an opponent, you may draw a card.\"\nTotem armor (If enchanted creature would be destroyed, instead remove all damage from it and destroy this Aura.)", "originalType": "Enchantment — Aura", "printings": ["C18", "MB1", "NEC", "PC2", "PCA", "ROE", "UMA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/277ee48dc9435e57", "cardKingdomFoil": "https://mtgjson.com/links/6eddcba3f47d952a", "cardmarket": "https://mtgjson.com/links/0d3e561f69e4d8e2", "tcgplayer": "https://mtgjson.com/links/f63708ddbdfa2dcb"}, "rarity": "uncommon", "rulings": [{"date": "2010-06-15", "text": "The ability triggers when the enchanted creature deals any damage, not just combat damage."}, {"date": "2010-06-15", "text": "Snake Umbra grants the triggered ability to the creature. It triggers whenever the enchanted creature deals damage to an opponent of its controller (who is not necessarily an opponent of the Aura's controller). In other words, if your Snake Umbra winds up enchanting your opponent's creature, that opponent will draw a card whenever that creature damages you."}, {"date": "2018-07-13", "text": "If a permanent enchanted with an Aura that has totem armor has indestructible, lethal damage and effects that try to destroy it simply have no effect. Totem armor won't do anything because it won't have to."}, {"date": "2018-07-13", "text": "If a spell or ability says that it would “destroy” a permanent enchanted with an Aura that has totem armor, that spell or ability is what causes the Aura to be destroyed instead. Totem armor doesn't destroy the Aura; rather, it changes the effects of the spell or ability. On the other hand, if a spell or ability deals lethal damage to a creature enchanted with an Aura that has totem armor, the game rules regarding lethal damage cause the Aura to be destroyed, not that spell or ability."}, {"date": "2018-07-13", "text": "Totem armor has no effect if the enchanted permanent is put into a graveyard for any other reason, such as if it's sacrificed, if the “legend rule” applies to it, or if its toughness is 0 or less."}, {"date": "2018-07-13", "text": "Totem armor's effect is mandatory. If the enchanted permanent would be destroyed, you must remove all damage from it (if it has any) and destroy the Aura that has totem armor instead."}, {"date": "2018-07-13", "text": "Totem armor's effect is applied no matter why the enchanted permanent would be destroyed: because it's been dealt lethal damage, or because it's being affected by an effect that says to “destroy” it (such as Putrefy). In either case, all damage is removed from the permanent and the Aura is destroyed instead."}, {"date": "2018-07-13", "text": "If a permanent you control is enchanted with multiple Auras that have totem armor, and the enchanted permanent would be destroyed, one of those Auras is destroyed instead — but only one of them. You choose which one because you control the enchanted permanent."}, {"date": "2018-07-13", "text": "If a permanent enchanted with an Aura that has totem armor would be destroyed by multiple state-based actions at the same time (most likely because a creature with deathtouch has dealt damage to that creature greater than or equal to its toughness) totem armor's effect will replace all of them and save the creature."}, {"date": "2018-07-13", "text": "If a spell or ability (such as Akroma's Vengeance) would destroy both an Aura with totem armor and the permanent it's enchanting at the same time, totem armor's effect will save the enchanted permanent from being destroyed. Instead, the spell or ability will destroy the Aura in two different ways at the same time, but the result is the same as destroying it once."}, {"date": "2018-07-13", "text": "Totem armor's effect is not regeneration. Specifically, if totem armor's effect is applied, the enchanted permanent does not become tapped and is not removed from combat as a result. Effects that say the enchanted permanent can't be regenerated (as Putrefy does) won't prevent totem armor's effect from being applied."}], "setCode": "UMA", "subtypes": ["Aura"], "supertypes": [], "text": "Enchant creature\nEnchanted creature gets +1/+1 and has \"Whenever this creature deals damage to an opponent, you may draw a card.\"\nTotem armor (If enchanted creature would be destroyed, instead remove all damage from it and destroy this Aura.)", "type": "Enchantment — Aura", "types": ["Enchantment"], "uuid": "41f6cc9e-8d4d-57a5-a1a3-b4081cfd2c04"}