{"artist": "Greg Opalinski", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 3537, "finishes": ["foil"], "flavorText": "The arrival of the God-Pharaoh marked a betrayal of both gods and mortals.", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "213461", "cardsphereId": "50542", "mcmId": "298972", "mtgjsonV4Id": "6556ea7a-c524-5a89-b33c-eba86257e700", "scryfallId": "f0114b1c-da4f-4ba0-b39e-4d050152e14f", "scryfallIllustrationId": "d4727c38-1c1a-4b4c-9ca5-aab6beab14e8", "scryfallOracleId": "f0b4331b-ddd3-4f11-ba16-67c651c8954c", "tcgplayerProductId": "137167"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}", "manaValue": 3.0, "name": "Solemnity", "number": "22s", "printings": ["AKR", "HOU", "PHOU"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/7cadfe4ecd95926f", "tcgplayer": "https://mtgjson.com/links/e46a0acee8ee3247"}, "rarity": "rare", "rulings": [{"date": "2017-07-14", "text": "Solemnity doesn’t remove any counters players or permanents already have."}, {"date": "2017-07-14", "text": "Solemnity stops counters from being put on an artifact, creature, enchantment, or land as it enters the battlefield, as well as stopping counters from being put on them later."}, {"date": "2017-07-14", "text": "If the cost of an ability or an additional cost of a spell requires putting counters on an artifact, creature, enchantment, or land, that cost can’t be paid. If a resolving spell or ability says that a player may put counters on one of those objects, that player can’t choose to do so."}, {"date": "2017-07-14", "text": "If a replacement effect allows a player to modify or replace an event by putting counters on an artifact, creature, enchantment, or land, that player may apply that replacement effect. Counters won’t be put on the object, but if the original event is entirely replaced (such as by applying Soul-Scar Mage’s replacement effect), the original event won’t happen."}, {"date": "2017-07-14", "text": "If an artifact, creature, enchantment, or land would enter the battlefield with counters on it at the same time that Solemnity enters the battlefield, Solemnity doesn’t stop it from getting those counters."}, {"date": "2017-07-14", "text": "Damage from a source with wither has no effect on creatures. No -1/-1 counters are put on them, and no damage is marked on them. The damage is still dealt for purposes of effects that care about damage, such as lifelink."}, {"date": "2017-07-14", "text": "Damage from a source with infect has no effect on creatures or players. No -1/-1 counters are put on creatures, and no damage is marked on them. Players don’t get poison counters and they don’t lose life. The damage is still dealt for purposes of effects that care about damage, such as lifelink."}, {"date": "2017-07-14", "text": "Counters can be put on cards that aren't on the battlefield. Notably, suspended cards will still get time counters."}, {"date": "2017-07-14", "text": "If a creature with tribute is entering the battlefield, the chosen opponent can’t pay tribute even if they want to."}, {"date": "2017-07-14", "text": "While resolving a cumulative upkeep trigger of a permanent, you’ll fail to put a counter on that permanent, then you may pay for the age counters already on it. If it has no age counters on it, you may pay {0}."}], "securityStamp": "oval", "setCode": "PHOU", "subtypes": [], "supertypes": [], "text": "Players can't get counters.\nCounters can't be put on artifacts, creatures, enchantments, or lands.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "d6603cbb-758d-59f4-957e-e9778712e870"}