{"artist": "Lie Setiawan", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 5.0, "edhrecRank": 9712, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 531587, "name": "Lied der Inspiration", "text": "Bestimme bis zu zwei bleibende Karten deiner Wahl in deinem Friedhof. Würfle einen W20 und addiere dazu den Gesamt-Manabetrag der Karten.\n1—14 | Bringe die bestimmten Karten auf deine Hand zurück.\n15+ | Bringe die bestimmten Karten auf deine Hand zurück. Du erhältst Lebenspunkte in Höhe ihres Gesamt-Manabetrags dazu.", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 531643, "name": "Canción de la inspiración", "text": "Elige hasta dos cartas de permanente objetivo en tu cementerio. Tira 1d20 y suma el valor de maná total de esas cartas.\n1—14 | Regresa esas cartas a tu mano.\n15+ | Regresa esas cartas a tu mano. Ganas una cantidad de vidas igual al valor de maná total de esas cartas.", "type": "Instantáneo"}, {"language": "French", "multiverseId": 531699, "name": "Chant d'inspiration", "text": "Choisissez jusqu'à deux cartes de permanent ciblées de votre cimetière. Lancez un d20 et ajoutez la valeur de mana totale de ces cartes au résultat.\n1-14 | Renvoyez ces cartes dans votre main.\n15+ | Renvoyez ces cartes dans votre main. Vous gagnez un nombre de points de vie égal à leur valeur de mana totale.", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 531755, "name": "Canto di Ispirazione", "text": "Scegli fino a due carte permanente bersaglio nel tuo cimitero. Tira un d20 e aggiungi il valore di mana totale di quelle carte.\n1—14 | Riprendi in mano quelle carte.\n15+ | Riprendi in mano quelle carte. Guadagni punti vita pari al loro valore di mana totale.", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 531811, "name": "鼓舞の歌", "text": "あなたの墓地にあるパーマネント・カード最大２枚を対象とする。d20を１回振り、それらのカードのマナ総量の合計を加える。\n1—14 | それらのカードをあなたの手札に戻す。\n15+ | それらのカードをあなたの手札に戻す。あなたはそれらのマナ総量の合計に等しい点数のライフを得る。", "type": "インスタント"}], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "249364", "cardsphereId": "80274", "mcmId": "572664", "mtgjsonV4Id": "ff515749-d950-57cf-98f5-fb240fb3a262", "multiverseId": "531531", "scryfallId": "e7c9302f-d5ad-4589-b997-010d3ad107cd", "scryfallIllustrationId": "9303d677-433b-4493-9d24-47026a4e9f30", "scryfallOracleId": "bdb80d7b-672c-4e2a-b93b-9b96721b93f2", "tcgplayerProductId": "244247"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{G}{G}", "manaValue": 5.0, "name": "Song of Inspiration", "number": "311", "originalText": "Choose up to two target permanent cards in your graveyard. Roll a d20 and add the total mana value of those cards.\n1–14 | Return those cards to your hand.\n15+ | Return those cards to your hand. You gain life equal to their total mana value.", "originalType": "Instant", "printings": ["AFC"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/712947a7b5438e9b", "tcgplayer": "https://mtgjson.com/links/a90a83fa26f41d1e"}, "rarity": "rare", "rulings": [{"date": "2021-07-23", "text": "The instruction to roll a die and the effect that occurs because of the result are all part of the same ability. Players do not get the chance to respond to the ability after knowing the result of the roll."}, {"date": "2021-07-23", "text": "Dice are identified by the number of faces each one has. For example, a d20 is a twenty-sided die."}, {"date": "2021-07-23", "text": "Dice used must have equally likely outcomes and the roll must be fair. Although physical dice are recommended, digital substitutes are allowed, provided they have the same number of equally likely outcomes as specified in the original roll instruction."}, {"date": "2021-07-23", "text": "An ability that tells you to roll a die will also specify what to do with the result of that roll. Most often, this is in the form of a “results table” in the card text."}, {"date": "2021-07-23", "text": "An effect that says “choose a target, then roll a d20” or similar still uses the normal process of putting an ability on the stack and resolving it. Choosing targets is part of putting the ability on the stack and rolling the d20 happens later, as the ability resolves."}, {"date": "2021-07-23", "text": "Some effects may modify the result of a die roll. This may be part of the instruction to roll a die or it may come from other cards. Anything that references the “result” of a die roll is looking for the result after these modifications. Anything that is looking for the “natural result” is looking for the number shown on the face of the die before these modifications."}, {"date": "2021-07-23", "text": "Some abilities, like that of Pixie Guide and Barbarian Class, replace rolling a die with rolling extra dice and ignoring the lowest roll. The ignored rolls are not considered for the effect that instructed you to roll a die, and do not cause abilities to trigger. For all intents and purposes, once you determine which dice count, any extra dice were never rolled."}, {"date": "2021-07-23", "text": "Some effects instruct you to roll again. This uses the same number and type of dice as the original roll, and that roll will use the same set of possible outcomes."}, {"date": "2021-07-23", "text": "While playing Planechase, rolling the planar die will cause any ability that triggers whenever a player rolls one or more dice to trigger. However, any effect that refers to a numerical result will ignore the rolling of the planar die."}, {"date": "2021-07-23", "text": "Tournament events have more specific rules regarding dice and die-rolling. For more information, please see the most recent version of the Magic Tournament Rules at https://wpn.wizards.com/en/document/magic-gathering-tournament-rules."}], "securityStamp": "oval", "setCode": "AFC", "subtypes": [], "supertypes": [], "text": "Choose up to two target permanent cards in your graveyard. Roll a d20 and add the total mana value of those cards.\n1—14 | Return those cards to your hand.\n15+ | Return those cards to your hand. You gain life equal to their total mana value.", "type": "Instant", "types": ["Instant"], "uuid": "89237267-3ad5-5d9e-b74a-b8926850fc1f", "variations": ["3d8c9f2d-05bb-51db-9d1f-9cce9241a5b2"]}