{"artist": "Alexander Mokhov", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R", "U"], "colors": ["R", "U"], "convertedManaCost": 2.0, "edhrecRank": 2857, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "248858", "cardsphereId": "80334", "mcmId": "572502", "mtgjsonV4Id": "1c2356df-bfca-5067-b80a-46f7bf5ec7a4", "scryfallId": "ef7ff54c-0094-4b62-a8a2-11a03eb49967", "scryfallIllustrationId": "a17fd399-0ba9-4bbd-a200-5929e41f7297", "scryfallOracleId": "19ba0f2d-4de3-49a0-be7d-da0aa220cd8a", "tcgplayerProductId": "244576"}, "isPromo": true, "isReprint": true, "language": "English", "layout": "class", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{U}{R}", "manaValue": 2.0, "name": "Sorcerer Class", "number": "233s", "printings": ["AFR", "PAFR"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/66bf2c056beadf3b", "tcgplayer": "https://mtgjson.com/links/3571e36d614b85bf"}, "rarity": "rare", "rulings": [{"date": "2021-07-23", "text": "The last ability counts the number of spells that were cast before it resolved, not the number of spells that were cast before it was placed on the stack. For example, if you cast a sorcery and then respond to Sorcerer Class's triggered ability by casting an instant, both triggered abilities will deal 2 damage when they resolve."}, {"date": "2021-07-23", "text": "If the spell that causes the last ability to trigger is countered or is otherwise no longer on the stack as the ability resolves, it will still deal damage. Last known information will be used to do determine the effects of that damage. For example, if the spell has lifelink, you will still gain life when it deals damage, even if the spell was countered."}, {"date": "2021-07-23", "text": "Copying a spell won't cause Sorcerer Class's level 3 ability to trigger and won't be counted toward the number of spells you've cast during the turn. However, if an effect copies a card and you cast the copy, that will count for both of those things."}, {"date": "2021-07-23", "text": "Each Class has five abilities. The three in the major sections of its text box are class abilities. Class abilities can be static, activated, or triggered abilities. The other two are level abilities, one activated ability to advance the Class to level 2 and another to advance the Class to level 3."}, {"date": "2021-07-23", "text": "Each Class starts with only the first of three class abilities. As the first level ability resolves, the Class becomes level 2 and gains the second class ability. As the second level ability resolves, the Class becomes level 3 and gains the third class ability."}, {"date": "2021-07-23", "text": "Gaining a level won't remove abilities that a Class had at a previous level."}, {"date": "2021-07-23", "text": "Gaining a level is a normal activated ability. It uses the stack and can be responded to."}, {"date": "2021-07-23", "text": "You can't activate the first level ability of a Class unless that Class is level 1. Similarly, you can't activate the second level ability of a Class unless that Class is level 2."}, {"date": "2021-07-23", "text": "You can multiclass or even control multiple Class enchantments of the same class. Each Class permanent tracks its own level separately."}, {"date": "2021-07-23", "text": "Some Class cards have an effect that increases when more are under your control. For example, if you have multiple Barbarian Class cards, you roll that many additional dice and ignore that many of the lowest rolls."}], "securityStamp": "oval", "setCode": "PAFR", "subtypes": ["Class"], "supertypes": [], "text": "(Gain the next level as a sorcery to add its ability.)\nWhen Sorcerer Class enters the battlefield, draw two cards, then discard two cards.\n{U}{R}: Level 2\nCreatures you control have \"{T}: Add {U} or {R}. Spend this mana only to cast an instant or sorcery spell or to gain a Class level.\"\n{3}{U}{R}: Level 3\nWhenever you cast an instant or sorcery spell, that spell deals damage to each opponent equal to the number of instant and sorcery spells you've cast this turn.", "type": "Enchantment — Class", "types": ["Enchantment"], "uuid": "e895f21e-93cc-5fa1-be5b-1f4dba5336e6", "variations": ["20da7d58-7e2d-546c-97ac-2d9563e48690", "0ec86cca-2125-5172-adb5-36a1af7a01a8"]}