{"artist": "Michael Komarck", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 6.0, "edhrecRank": 2231, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 206105, "name": "Sorin Markov", "text": "+2: Sorin Markov fügt einer Kreatur oder einem Spieler deiner Wahl 2 Schadenspunkte zu, und du erhältst 2 Lebenspunkte dazu.\n-3: Der Lebenspunktestand eines Gegners deiner Wahl wird zu 10.\n-7: Du kontrollierst den nächsten Zug eines Spielers deiner Wahl.", "type": "Planeswalker — Sorin"}, {"language": "Spanish", "multiverseId": 206085, "name": "Sorin Markov", "text": "+2: Sorin Markov hace 2 puntos de daño a la criatura o jugador objetivo y tú ganas 2 vidas.\n-3: El total de vidas del oponente objetivo es 10.\n-7: Tú controlas el próximo turno del jugador objetivo.", "type": "Planeswalker — Sorin"}, {"language": "French", "multiverseId": 206109, "name": "Sorin Markov", "text": "+2 : Sorin Markov inflige 2 blessures à une cible, créature ou joueur, et vous gagnez 2 points de vie.\n-3 : Le total de points de vie de l'adversaire ciblé devient 10.\n-7 : Vous contrôlez le prochain tour du joueur ciblé.", "type": "Planeswalker : Sorin"}, {"language": "Italian", "multiverseId": 206089, "name": "Sorin Markov", "text": "+2: Sorin Markov infligge 2 danni a una creatura o a un giocatore bersaglio e tu guadagni 2 punti vita.\n-3: I punti vita di un avversario bersaglio diventano 10.\n-7: Controlli il prossimo turno di un giocatore bersaglio.", "type": "Planeswalker — Sorin"}, {"language": "Japanese", "multiverseId": 206101, "name": "ソリン・マルコフ", "text": "+2:クリーチャー１体かプレイヤー１人を対象とする。ソリン・マルコフはそれに２点のダメージを与え、あなたは２点のライフを得る。\n-3:対戦相手１人を対象とする。そのプレイヤーのライフの総量は10点になる。\n-7:プレイヤー１人を対象とする。あなたはそのプレイヤーの次のターンをコントロールする。", "type": "プレインズウォーカー — ソリン"}, {"language": "Portuguese (Brazil)", "multiverseId": 206097, "name": "Sorin Markov", "text": "+2: Sorin Markov causa 2 pontos de dano à criatura ou ao jogador alvo e você ganha 2 pontos de vida.\n-3: O total de pontos de vida do oponente alvo torna-se 10.\n-7: Você controla o próximo turno do jogador alvo.", "type": "Planeswalker — Sorin"}, {"language": "Russian", "multiverseId": 206093, "name": "Сорин Марков", "text": "+2: Сорин Марков наносит 2 повреждения целевому существу или игроку, а вы получаете 2 жизни.\n-3: количество жизней целевого оппонента становится равным 10.\n-7: вы контролируете следующий ход целевого игрока.", "type": "Planeswalker — Сорин"}, {"language": "Chinese Simplified", "multiverseId": 206113, "name": "索霖马可夫", "text": "+2：索霖马可夫对目标生物或牌手造成2点伤害，且你获得2点生命。\n-3：目标对手的总生命成为10。\n-7：目标牌手的下个回合由你来操控。", "type": "鹏洛客～索霖"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "128056", "cardKingdomId": "127800", "cardsphereId": "48036", "mcmId": "21766", "mcmMetaId": "10759", "mtgjsonV4Id": "093c2f08-248a-5b78-8a7d-ec2a17f43c7e", "mtgoFoilId": "34759", "mtgoId": "34758", "multiverseId": "195403", "scryfallId": "29606aca-f23f-4dfe-b685-2065193109c8", "scryfallIllustrationId": "9448fd89-7ebb-4954-ae3f-d0e31b71d2bf", "scryfallOracleId": "c151e8b7-4b28-4f03-8a81-9bf623f893d7", "tcgplayerProductId": "33431"}, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "loyalty": "4", "manaCost": "{3}{B}{B}{B}", "manaValue": 6.0, "name": "Sorin Markov", "number": "111", "originalText": "+2: Sorin Markov deals 2 damage to target creature or player and you gain 2 life.\n-3: Target opponent's life total becomes 10.\n-7: You control target player's next turn.", "originalType": "Planeswalker — Sorin", "printings": ["M12", "MB1", "MED", "PLIST", "ZEN"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/13b2fe611863c3de", "cardKingdomFoil": "https://mtgjson.com/links/fb085333366205e6", "cardmarket": "https://mtgjson.com/links/62eaed717e2da56d", "tcgplayer": "https://mtgjson.com/links/f72eb61e374a88be"}, "rarity": "mythic", "rulings": [{"date": "2009-10-01", "text": "The player who is being controlled is still the active player."}, {"date": "2009-10-01", "text": "While controlling another player, you also continue to make your own choices and decisions."}, {"date": "2009-10-01", "text": "While controlling another player, you make all choices and decisions that player is allowed to make or is told to make during that turn. For example: -- You choose which lands the other player plays. -- You choose which spells the other player casts, and make all decisions as those spells are cast and as they resolve. For example, you choose the value of X for that player's Earthquake, the target for that player's Lightning Bolt, what mana that player spends to cast Day of Judgment, and what card that player gets with Diabolic Tutor. -- You choose which activated abilities the other player activates, and make all decisions as those abilities are activated and as they resolve. For example, you can have your opponent sacrifice their creatures to their Vampire Aristocrat or have your opponent's Caller of Gales give one of your creatures flying. -- You make all decisions for the other player's triggered abilities, including what they target and any decisions made when they resolve. -- You choose which creatures controlled by the other player attack, who or what they attack, and how they assign their combat damage. -- You make any choices and decisions that player would make for any other reason. For example, you could cast Fact or Fiction, choose that player to divide the revealed cards into piles, and thus divide those cards into piles yourself."}, {"date": "2009-10-01", "text": "You can’t make the affected player concede. That player may choose to concede at any time, even while you’re controlling their turn."}, {"date": "2009-10-01", "text": "You can’t make any illegal decisions or illegal choices — you can’t do anything that player couldn’t do. You can’t make choices or decisions for that player that aren’t called for by the game rules or by any cards, permanents, spells, abilities, and so on. If an effect causes another player to make decisions that the affected player would normally make (such as Master Warcraft does), that effect takes precedence. (In other words, if the affected player wouldn’t make a decision, you wouldn’t make that decision on their behalf.) You also can’t make any choices or decisions for the player that would be called for by the tournament rules (such as whether to take an intentional draw or whether to call a judge)."}, {"date": "2009-10-01", "text": "If the targeted permanent or player is an illegal target by the time Sorin’s first ability resolves, the entire ability doesn’t resolve. You won’t gain life."}, {"date": "2009-10-01", "text": "You only control the player. You don’t control any of the other player’s permanents, spells, or abilities."}, {"date": "2009-10-01", "text": "If the player affected by Sorin’s third ability skips their next turn, the ability will wait. You’ll control the next turn the affected player actually takes."}, {"date": "2009-10-01", "text": "Multiple player-controlling effects that affect the same player overwrite each other. The last one to be created is the one that works."}, {"date": "2009-10-01", "text": "You could gain control of yourself using Sorin’s third ability, but unless you do so to overwrite someone else’s player-controlling effect, this doesn’t do anything."}, {"date": "2009-10-01", "text": "You can use only the affected player’s resources (cards, mana, and so on) to pay costs for that player; you can’t use your own. Similarly, you can use the affected player’s resources only to pay that player’s costs; you can’t spend them on your costs."}, {"date": "2009-10-01", "text": "For a player’s life total to become 10, what actually happens is that the player gains or loses the appropriate amount of life. For example, if the targeted opponent’s life total is 4 when this ability resolves, it will cause that player to gain 6 life; alternately, if the targeted player’s life total is 17 when this ability resolves, it will cause that player to lose 7 life. Other cards that interact with life gain or life loss will interact with this effect accordingly."}, {"date": "2009-10-01", "text": "Sorin’s third ability allows you to control another player. This effect applies to the next turn that the affected player actually takes."}, {"date": "2010-06-15", "text": "In a Two-Headed Giant game, Sorin’s second ability causes the targeted opponent’s team’s life total to become 10. Only the targeted player is actually considered to have actually gained or lost life."}, {"date": "2016-07-13", "text": "While controlling another player, you can see all cards in the game that player can see. This includes cards in that player’s hand, face-down cards that player controls, and any cards in that player’s library the player may look at."}, {"date": "2016-07-13", "text": "Controlling a player doesn’t allow you to look at that player’s sideboard. If an effect instructs that player to choose a card from outside the game, you can’t have that player choose any card."}], "setCode": "ZEN", "subtypes": ["Sorin"], "supertypes": ["Legendary"], "text": "[+2]: Sorin Markov deals 2 damage to any target and you gain 2 life.\n[−3]: Target opponent's life total becomes 10.\n[−7]: You control target player during that player's next turn.", "type": "Legendary Planeswalker — Sorin", "types": ["Planeswalker"], "uuid": "37b090ca-a6b0-5411-939c-b57e9eefd5bf"}