{"artist": "Randy Asplund-Faith", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "edhrecRank": 17869, "finishes": ["foil"], "foreignData": [], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": false, "identifiers": {"mtgjsonV4Id": "a21b55e4-179b-530d-abcd-9c3fbefc4778", "mtgoId": "36889", "scryfallId": "61f78b87-c861-4cd4-9b0a-a09396d51e6c", "scryfallIllustrationId": "f161f0ec-fdbb-4e3e-ac60-bba566821b00", "scryfallOracleId": "5419eae0-3c12-4748-9cf8-d927752e527e"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "isReserved": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaValue": 0.0, "name": "Sorrow's Path", "number": "36889", "originalReleaseDate": "2012-11-15", "printings": ["DRK", "ME3", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2009-02-01", "text": "This has two abilities. The second ability triggers any time it becomes tapped, whether to pay for its ability or not."}, {"date": "2009-10-01", "text": "When Sorrow’s Path’s first ability is activated, its second ability triggers and goes on the stack on top of the first ability. The second ability resolves first, and may cause some of the attacking creatures to be dealt lethal damage."}, {"date": "2009-10-01", "text": "The first ability can target any two blocking creatures a single opponent controls. Whether those creatures could block all creatures the other is blocking isn’t determined until the ability resolves."}, {"date": "2009-10-01", "text": "A “blocking creature” is one that has been declared as a blocker this combat, or one that was put onto the battlefield blocking this combat. Unless that creature leaves combat, it continues to be a blocking creature through the end of combat step, even if the creature or creatures that it was blocking are no longer on the battlefield or have otherwise left combat by then."}, {"date": "2009-10-01", "text": "Abilities that trigger whenever one of the targeted creatures blocks will trigger when the first ability resolves, because those creatures will change from not blocking (since they’re removed from combat) to blocking. It doesn’t matter if those abilities triggered when those creatures blocked the first time. Abilities that trigger whenever one of the attacking creatures becomes blocked will not trigger again, because they never stopped being blocked creatures. Abilities that trigger whenever a creature blocks one of the attacking creatures will trigger again, though; those kinds of abilities trigger once for each creature that blocks."}, {"date": "2009-10-01", "text": "When determining whether a creature could block all creatures the other is blocking, take into account evasion abilities (like flying), protection abilities, and other blocking restrictions, as well as abilities that allow a creature to block multiple creatures or block as though a certain condition were true. Take into account whether those creatures are tapped, but not whether they have costs to block (since those apply only as blockers are declared)."}, {"date": "2009-10-01", "text": "When the first ability resolves, if all the creatures that one of the targeted creatures was blocking have left combat, then the other targeted creature is considered to be able to block all creatures the first creature is blocking. If the ability has its full effect, the second creature will be removed from combat but not returned to combat; it doesn’t block anything."}], "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "{T}: Choose two target blocking creatures an opponent controls. If each of those creatures could block all creatures that the other is blocking, remove both of them from combat. Each one then blocks all creatures the other was blocking.\nWhenever Sorrow's Path becomes tapped, it deals 2 damage to you and each creature you control.", "type": "Land", "types": ["Land"], "uuid": "0b1afe39-3490-5045-9120-062071e6e1e4"}