{"artist": "Andrey Kuzinskiy", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 9.0, "edhrecRank": 4128, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "e45bb09c-54ae-564f-8d25-ecd13af17da0", "mtgoId": "86028", "scryfallId": "7cbd52cd-77d4-415c-b16d-4585dc6345c9", "scryfallIllustrationId": "39580624-f57f-4972-bcfc-32ae16b44b38", "scryfallOracleId": "089dd3b7-c3ed-4734-8789-a3c1ed9a4e40"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{6}{R}{R}{R}", "manaValue": 9.0, "name": "Soulfire Eruption", "number": "86028", "originalReleaseDate": "2020-12-15", "printings": ["CMR", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2020-11-10", "text": "As Soulfire Eruption resolves, if you have chosen multiple targets (and we really hope you have), those targets will be handled one at a time in turn order. Start with targets that are either the player whose turn it is (probably you) or permanents that player controls. You choose the relative order of targets within that group. For whichever target you select first, exile the top card of your library, then Soulfire Eruption deals damage to that target. Repeat this process for each subsequent target in the group. After that group is done, move on to targets that are either the next player in turn order or permanents they control. Again, you choose the relative order of targets in that group. Repeat the whole process for each other player."}, {"date": "2020-11-10", "text": "Nothing can happen in between the damage being dealt to each target, and no player can choose to take actions. Any abilities that trigger while Soulfire Eruption is resolving go on the stack after Soulfire Eruption finishes resolving."}, {"date": "2020-11-10", "text": "If you’re playing with the top card of your library revealed (perhaps because of Courser of Kruphix), you’ll see the new top card of your library after each time a card is exiled while Soulfire Eruption’s ability is resolving. Notably, you’ll see which card is on top of your library before selecting from among the targets in each group. For example: in a three-player game, you’re playing with the top card of your library revealed and you cast Soulfire Eruption targeting your two opponents and a creature controlled by the last opponent in turn order. You exile the top card of your library and Soulfire Eruption deals damage to the first opponent. You’ll see the new top card of your library before selecting whether the next target will be the last opponent or the creature they control."}, {"date": "2020-11-10", "text": "Soulfire Eruption doesn’t change when you can play the exiled cards. For example, if you exile a sorcery card, you can cast it only during your main phase. If you exile a land card, you can play it only during your main phase and only if you have an available land play remaining."}, {"date": "2020-11-10", "text": "Playing an exiled card causes it to leave exile. Soulfire Eruption won’t let you play it multiple times, even if the card later returns to exile somehow."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Choose any number of target creatures, planeswalkers, and/or players. For each of them, exile the top card of your library, then Soulfire Eruption deals damage equal to that card's mana value to that permanent or player. You may play the exiled cards until the end of your next turn.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "e05fc801-f701-57ac-a98a-b56e070a5604"}