{"artist": "Arnie Swekel", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 4.0, "edhrecRank": 6044, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 73481, "name": "Seelengießerei", "text": "Einprägen Wenn die Seelengießerei ins Spiel kommt, kannst du eine Kreaturenkarte auf deiner Hand ganz aus dem Spiel entfernen. (Die entfernte Karte wird in dieses Artefakt eingeprägt.)\n{X}, {T}:Bringe eine Spielsteinkreatur ins Spiel, die eine Kopie der eingeprägten Karte ist. X sind die umgewandelten Manakosten dieser Karte.", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 162126, "name": "Fundición de almas", "text": "Estampa Cuando la Fundición de almas entre en juego, puedes remover del juego una carta de criatura de tu mano. (La carta removida es estampada en este artefacto.)\n{X}, {T}: Pon en juego una ficha de criatura que sea una copia de la carta de criatura estampada. X es el coste de maná convertido de esa carta.", "type": "Artefacto"}, {"language": "French", "multiverseId": 161748, "name": "Fonderie d'âmes", "text": "Empreinte Quand la Fonderie d'âmes arrive en jeu, vous pouvez retirer de la partie une carte de créature de votre main. (Cet artefact a l'empreinte de la carte retirée.)\n{X}, {T}: Mettez en jeu un jeton de créature qui est une copie de la carte de créature dont la Fonderie d'âmes a l'empreinte. X est le coût converti de mana de cette carte.", "type": "Artefact"}, {"language": "Italian", "multiverseId": 160217, "name": "Forgia dell'Anima", "text": "Imprimere Quando la Forgia dell'Anima entra in gioco, puoi rimuovere dal gioco una carta creatura presente nella tua mano (La carta rimossa viene impressa su questo artefatto.)\n{X}, {T}: Metti in gioco una pedina creatura che è una copia della carta creatura impressa. X è il costo di mana convertito di quella carta.", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 73834, "name": "魂の鋳造所", "text": "刻印 ― 魂の鋳造所が場に出たとき、あなたは手札にあるクリーチャー・カードを１枚ゲームから取り除いてもよい。 （取り除かれたカードは、このアーティファクトに刻印される。）\n{X}, {T}：刻印されているクリーチャー・カードのコピーのクリーチャー・トークンを１個場に出す。 Ｘはそのカードの点数でみたマナ・コストに等しい。", "type": "アーティファクト"}, {"language": "Portuguese (Brazil)", "multiverseId": 162442, "name": "Fundição de Almas", "text": "Estampar Quando Fundição de Almas entra em jogo, você pode remover de jogo um card de criatura de sua mão. (O card removido fica estampado neste artefato.)\n{X}, {T}: Coloque em jogo uma ficha de criatura que é uma cópia do card de criatura estampado. X é o custo de mana convertido daquele card.", "type": "Artefato"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "73245", "cardKingdomId": "72245", "cardsphereId": "30933", "mcmId": "246", "mcmMetaId": "5412", "mtgjsonV4Id": "fc6c6fe2-69a8-5552-b068-e3bb5f82f91f", "mtgoFoilId": "20064", "mtgoId": "20063", "multiverseId": "46723", "scryfallId": "11b4983a-2a95-4322-a315-27b4bd430d39", "scryfallIllustrationId": "53d86100-5f18-4d59-911e-f2b3bd93d38e", "scryfallOracleId": "47068c31-d07d-473c-aa89-6de8625f74df", "tcgplayerProductId": "11303"}, "keywords": ["Imprint"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}", "manaValue": 4.0, "name": "Soul Foundry", "number": "246", "originalText": "Imprint When Soul Foundry comes into play, you may remove a creature card in your hand from the game. (The removed card is imprinted on this artifact.)\n{X}, {T}: Put a creature token into play that's a copy of the imprinted creature card. X is the converted mana cost of that card.", "originalType": "Artifact", "printings": ["C19", "MRD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/88853a863699afce", "cardKingdomFoil": "https://mtgjson.com/links/04eeb2cdb73e0a92", "cardmarket": "https://mtgjson.com/links/e58811ba7c988a0d", "tcgplayer": "https://mtgjson.com/links/825991b7e61cc77d"}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "You do not get a chance to pay any optional costs, such as Kicker, on the imprinted card."}, {"date": "2004-12-01", "text": "Soul Foundry puts a token copy of the imprinted card onto the battlefield. The token is put onto the battlefield, not cast."}, {"date": "2004-12-01", "text": "The token is an exact copy in every way, except that it’s a token, not a card."}, {"date": "2004-12-01", "text": "Most creature tokens have no mana cost and a converted mana cost of 0, but a creature token put onto the battlefield by Soul Foundry has the same mana cost and converted mana cost as the card it copies."}], "setCode": "MRD", "subtypes": [], "supertypes": [], "text": "Imprint — When Soul Foundry enters the battlefield, you may exile a creature card from your hand.\n{X}, {T}: Create a token that's a copy of the exiled card. X is the mana value of that card.", "type": "Artifact", "types": ["Artifact"], "uuid": "e2429895-beca-5a8f-bc99-2df107558ada"}