{"artist": "Eric Deschamps", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 261, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 461259, "name": "Funken-Doppelgänger", "text": "Du kannst den Funken-Doppelgänger als Kopie einer Kreatur oder eines Planeswalkers, die bzw. den du kontrollierst, ins Spiel kommen lassen, außer dass er mit einer zusätzlichen +1/+1-Marke ins Spiel kommt, falls er eine Kreatur ist, mit einer zusätzlichen Loyalitätsmarke ins Spiel kommt, falls er ein Planeswalker ist, und nicht legendär ist, falls die kopierte bleibende Karte legendär ist.", "type": "Kreatur — Illusion"}, {"language": "Spanish", "multiverseId": 461523, "name": "Doble de chispa", "text": "Puedes hacer que el Doble de chispa entre al campo de batalla como una copia de una criatura o planeswalker que controlas, excepto que entra con un contador +1/+1 adicional sobre él si es una criatura, con un contador de lealtad adicional sobre él si es un planeswalker y que no es legendario si ese permanente es legendario.", "type": "Criatura — Ilusión"}, {"language": "French", "multiverseId": 461787, "name": "Doublure d'étincelles", "text": "Vous pouvez faire que la Doublure d'étincelles arrive sur le champ de bataille comme une copie d'une créature ou d'un planeswalker que vous contrôlez, excepté qu'elle arrive avec, sur elle, un marqueur +1/+1 supplémentaire si c'est une créature, un marqueur « loyauté » supplémentaire si c'est un planeswalker, et qu'elle n'est pas légendaire si ce permanent est légendaire.", "type": "Créature : illusion"}, {"language": "Italian", "multiverseId": 462051, "name": "Clone della Scintilla", "text": "Puoi far entrare il Clone della Scintilla nel campo di battaglia come copia di una creatura o di un planeswalker che controlli, tranne che entra con un segnalino +1/+1 addizionale se è una creatura, con un segnalino fedeltà addizionale se è un planeswalker, e non è leggendario se quel permanente è leggendario.", "type": "Creatura — Illusione"}, {"language": "Japanese", "multiverseId": 462315, "name": "灯の分身", "text": "あなたは灯の分身を、これがクリーチャーであるなら＋１/＋１カウンターが追加で１個置かれた状態で戦場に出ることと、これがプレインズウォーカーであるなら忠誠カウンターが追加で１個置かれた状態で戦場に出ることと、そのパーマネントが伝説であったとしてもこれは伝説ではないことを除き、あなたがコントロールしているクリーチャー１体かプレインズウォーカー１体のコピーとして戦場に出してもよい。", "type": "クリーチャー — イリュージョン"}, {"language": "Korean", "multiverseId": 462579, "name": "불꽃 분신", "text": "당신은 불꽃 분신이 당신이 조종하는 생물 또는 플레인즈워커의 복사본으로 전장에 들어오게 할 수 있다. 단, 불꽃 분신이 생물을 복사했다면 +1/+1 카운터 한 개를, 플레인즈워커를 복사했다면 충성 카운터 한 개를 추가로 가지고 들어오며, 그 지속물이 전설적이라면 복사본은 전설적이 아니다.", "type": "생물 — 환영"}, {"language": "Portuguese (Brazil)", "multiverseId": 462843, "name": "Duplicata de Centelha", "text": "Você pode fazer com que Duplicata de Centelha entre no campo de batalha como cópia de uma criatura ou planeswalker que você controla, com a exceção de entrar com um marcador +1/+1 adicional se for uma criatura e um marcador de lealdade adicional se for um planeswalker, e de não ser lendária se aquela permanente for lendária.", "type": "Criatura — Ilusão"}, {"language": "Russian", "multiverseId": 463107, "name": "Двойник Искры", "text": "Вы можете заставить Двойника Искры выйти на поле битвы в качестве копии существа или planeswalker-а под вашим контролем, но при этом он выходит с одним дополнительным жетоном +1/+1 на нем, если он существо, выходит с одним дополнительным жетоном верности на нем, если он planeswalker, и не является легендарным, если тот перманент легендарный.", "type": "Существо — Иллюзия"}, {"language": "Chinese Simplified", "multiverseId": 463371, "name": "火花替身", "text": "你可以使火花替身当成任一由你操控之生物或鹏洛客的复制品来进入战场，但如果该永久物是传奇，则火花替身不是传奇，且如果火花替身是生物，则它进战场时上面额外有一个+1/+1指示物，且如果火花替身是鹏洛客，则它进战场时上面额外有一个忠诚指示物。", "type": "生物 ～虚影"}, {"language": "Chinese Traditional", "multiverseId": 463635, "name": "火花替身", "text": "你可以使火花替身當成任一由你操控之生物或鵬洛客的複製品來進入戰場，但如果該永久物是傳奇，則火花替身不是傳奇，且如果火花替身是生物，則它進戰場時上面額外有一個+1/+1指示物，且如果火花替身是鵬洛客，則它進戰場時上面額外有一個忠誠指示物。", "type": "生物 ～虛影"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "224520", "cardKingdomId": "224221", "cardsphereId": "59483", "mcmId": "372182", "mcmMetaId": "269524", "mtgArenaId": "69519", "mtgjsonV4Id": "731f562b-1efa-55cb-accf-33e4b2711bb3", "mtgoId": "71742", "multiverseId": "460995", "scryfallId": "bb8a103c-b776-4501-9441-a45b90391045", "scryfallIllustrationId": "fb4655d4-2c17-41a5-85db-de240ad91c1e", "scryfallOracleId": "8dcb35e5-ae44-455f-86e3-4a77d496ff34", "tcgplayerProductId": "188468"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Spark Double", "number": "68", "originalText": "You may have Spark Double enter the battlefield as a copy of a creature or planeswalker you control, except it enters with an additional +1/+1 counter on it if it's a creature, it enters with an additional loyalty counter on it if it's a planeswalker, and it isn't legendary if that permanent is legendary.", "originalType": "Creature — Illusion", "power": "0", "printings": ["PHED", "PWAR", "WAR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/92d843beed8bec83", "cardKingdomFoil": "https://mtgjson.com/links/7c874ec5fdff2d18", "cardmarket": "https://mtgjson.com/links/8757e88b257ff761", "tcgplayer": "https://mtgjson.com/links/bc8bc8a89244410c"}, "rarity": "rare", "rulings": [{"date": "2019-05-03", "text": "Spark Double copies exactly what was printed on the original permanent (unless that permanent is copying something else or is a token; see below). It doesn’t copy whether that permanent is tapped or untapped, whether it has any counters on it or any Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, or so on."}, {"date": "2019-05-03", "text": "Spark Double isn’t legendary if it copies a legendary permanent, and this exception is copiable. If something else copies Spark Double later, that copy also won’t be legendary. If you control two or more permanents with the same name but only one is legendary, the “legend rule” doesn’t apply."}, {"date": "2019-05-03", "text": "If the copied permanent has {X} in its mana cost, X is considered to be 0."}, {"date": "2019-05-03", "text": "If the chosen permanent is copying something else (for example, if the chosen permanent is another Spark Double), then Spark Double enters the battlefield as whatever the chosen permanent copied."}, {"date": "2019-05-03", "text": "If the chosen permanent is a token, Spark Double copies the original characteristics of that token as stated by the effect that created the token. Spark Double doesn’t become a token in this case."}, {"date": "2019-05-03", "text": "Any enters-the-battlefield abilities of the copied permanent will trigger when Spark Double enters the battlefield. Any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities of the chosen permanent will also work."}, {"date": "2019-05-03", "text": "If it copies a planeswalker, Spark Double enters with the appropriate number of loyalty counters as printed on the card plus one. If it copies a creature, Spark Double enters with a +1/+1 counter on it, plus any counters that will be put on it from abilities it copied and other abilities of other objects."}, {"date": "2019-05-03", "text": "If the copied permanent is affected by a type-changing effect, Spark Double may enter the battlefield with different permanent types than the copied permanent currently has. Use the characteristics of Spark Double as it enters the battlefield, not of the copied permanent, to determine whether it enters with an additional counter on it. Notably, if Spark Double copies a Gideon planeswalker that’s a creature because its loyalty ability caused it to become a planeswalker creature, Spark Double enters as a noncreature planeswalker and doesn’t get a +1/+1 counter. On the other hand, if Spark Double copies Gideon Blackblade during your turn, Spark Double enters as a planeswalker creature and gets both kinds of counters."}, {"date": "2019-05-03", "text": "If Spark Double somehow enters the battlefield at the same time as another permanent, it can’t become a copy of that permanent. You may choose only a creature or planeswalker that’s already on the battlefield."}], "securityStamp": "oval", "setCode": "WAR", "subtypes": ["Illusion"], "supertypes": [], "text": "You may have Spark Double enter the battlefield as a copy of a creature or planeswalker you control, except it enters with an additional +1/+1 counter on it if it's a creature, it enters with an additional loyalty counter on it if it's a planeswalker, and it isn't legendary.", "toughness": "0", "type": "Creature — Illusion", "types": ["Creature"], "uuid": "2411ffb6-b1ef-52c5-865e-c87e30460d3c"}