{"artist": "Uriah Voth", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 7087, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "f9a09b76-c838-5f2a-a4f9-ac470283b87e", "mtgoId": "93916", "scryfallId": "813fbfc5-1cff-466b-87c8-5748b923d871", "scryfallIllustrationId": "4d45e237-6843-4e08-87e6-2021ace93edf", "scryfallOracleId": "0de4171e-5908-408e-9852-25f148d0fb47"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Flash", "Flying"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Spectral Adversary", "number": "93916", "originalReleaseDate": "2022-01-28", "power": "2", "printings": ["DBL", "MID", "PMID", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-09-24", "text": "After you pay the {1}{U} cost one or more times, a second ability triggers and you choose the targets for it. Players may respond to the new ability at that point. As that ability resolves, Spectral Adversary gets its +1/+1 counters and the target permanents phase out."}, {"date": "2021-09-24", "text": "Permanents that are phased out are treated as though they don't exist. They can't be the target of spells or abilities, their static abilities have no effect on the game, their triggered abilities can't trigger, they can't attack or block, and so on."}, {"date": "2021-09-24", "text": "As a permanent phases out, Auras and Equipment attached to it also phase out at the same time. Those Auras and Equipment will phase in at the same time that permanent does, and they'll phase in still attached to that permanent."}, {"date": "2021-09-24", "text": "Permanents phase back in during their controller's untap step, immediately before that player untaps their permanents. Creatures that phase in this way are able to attack and pay a cost of {T} during that turn. If a permanent had counters on it when it phased out, it will have those counters when it phases back in."}, {"date": "2021-09-24", "text": "An attacking or blocking creature that phases out is removed from combat."}, {"date": "2021-09-24", "text": "Phasing out doesn't cause any “leaves the battlefield” abilities to trigger. Similarly, phasing in won't cause any “enters the battlefield” abilities to trigger."}, {"date": "2021-09-24", "text": "Any continuous effects with a “for as long as” duration ignore phased-out objects. If ignoring those objects causes the effect's conditions to no longer be met, the duration will expire. For example, phasing out Mind Flayer will cause the duration of its continuous effect (“for as long as you control Mind Flayer”) to expire."}, {"date": "2021-09-24", "text": "Choices made for permanents as they entered the battlefield are remembered when they phase in."}, {"date": "2021-09-24", "text": "If an opponent gains control of one of your permanents, that permanent phases out, and the duration of the control-change effect expires before it phases back in, that permanent phases in under your control as that opponent's next untap step begins. If they leave the game before their next untap step, it phases in as the next untap step begins after their turn would have begun."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Spirit"], "supertypes": [], "text": "Flash\nFlying\nWhen Spectral Adversary enters the battlefield, you may pay {1}{U} any number of times. When you pay this cost one or more times, put that many +1/+1 counters on Spectral Adversary, then up to that many other target artifacts, creatures, and/or enchantments phase out.", "toughness": "1", "type": "Creature — Spirit", "types": ["Creature"], "uuid": "0e33eb2e-67e2-590b-9a4c-8516e932e9fa"}