{"artist": "Luca Zontini", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 10545, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 73483, "name": "Spruchweber-Spirale", "text": "Einprägen Wenn die Spruchweber-Spirale ins Spiel kommt, kannst du zwei Hexereikarten deiner Wahl aus einem einzigen Friedhof ganz aus dem Spiel entfernen. (Die entfernten Karten werden in dieses Artefakt eingeprägt.)\nImmer wenn eine Karte gespielt wird, die denselben Namen wie eine der eingeprägten Hexereikarten hat, kannst du die andere Karte kopieren und die Kopie spielen, ohne ihre Manakosten zu bezahlen.", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 162127, "name": "Hélice tejehechizos", "text": "Estampa Cuando la Hélice tejehechizos entre en juego, puedes remover del juego dos cartas de conjuro objetivo de un único cementerio. (La carta removida es estampada en este artefacto.)\nSiempre que se juegue una carta, si tiene el mismo nombre que una de las cartas de conjuro estampadas, puedes copiar la otra y jugar la copia sin pagar su coste de maná.", "type": "Artefacto"}, {"language": "French", "multiverseId": 161749, "name": "Hélice tisse-sort", "text": "Empreinte Quand l'Hélice tisse-sort arrive en jeu, vous pouvez retirer de la partie deux cartes de rituel ciblées dans un même cimetière. (Cet artefact a l'empreinte des cartes retirées.)\nÀ chaque fois qu'une carte est jouée, si elle a le même nom qu'une des cartes dont l'Hélice tisse-sort a l'empreinte, vous pouvez copier l'autre et en jouer la copie sans payer son coût de mana.", "type": "Artefact"}, {"language": "Italian", "multiverseId": 160218, "name": "Spirale Tessimagie", "text": "Imprimere Quando la Spirale Tessimagie entra in gioco, puoi rimuovere dal gioco due carte stregoneria bersaglio presenti in un singolo cimitero (Le carte rimosse vengono impresse su questo artefatto.)\nOgniqualvolta viene giocata una carta, se ha lo stesso nome di una delle due stregonerie impresse, puoi copiare l'altra e giocare la copia senza pagare il suo costo di mana.", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 73836, "name": "呪文織りのらせん", "text": "刻印 ― 呪文織りの螺旋が場に出たとき、あなたはいずれか１つの墓地にあるソーサリー・カード２枚を対象とする。あなたはそれらをゲームから取り除いてもよい。 （取り除かれたカードは、このアーティファクトに刻印される。）\nいずれかのカードがプレイされるたび、それが刻印されているいずれかのソーサリー・カードと同じ名前を持つ場合、あなたはもう一方をコピーし、マナ・コストを支払わずにプレイしてもよい。", "type": "アーティファクト"}, {"language": "Portuguese (Brazil)", "multiverseId": 162443, "name": "Hélice Tece-Mágicas", "text": "Estampar Quando Hélice Tece-Mágicas entra em jogo, você pode remover de jogo dois cards alvo de feitiço de um único cemitério. (Os cards removidos ficam estampados neste artefato.)\nToda vez que um card for jogado, se ele tiver o mesmo nome que um dos cards de feitiço estampados, você pode copiar o outro e jogar a cópia sem pagar seu custo de mana.", "type": "Artefato"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "73246", "cardKingdomId": "72246", "cardsphereId": "30937", "mcmId": "247", "mcmMetaId": "5460", "mtgjsonV4Id": "196970a8-344e-55d6-926e-e4e8cc9950d7", "mtgoFoilId": "20084", "mtgoId": "20083", "multiverseId": "48047", "scryfallId": "a48d44b4-1c3b-4109-aaad-8351bf8a7624", "scryfallIllustrationId": "4b28a3fc-9e0c-4801-87d9-f8e461fa524b", "scryfallOracleId": "9aa8eef1-fc67-4d54-9783-4d0175a76741", "tcgplayerProductId": "11555"}, "keywords": ["Imprint"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Spellweaver Helix", "number": "247", "originalText": "Imprint When Spellweaver Helix comes into play, you may remove two target sorcery cards in a single graveyard from the game. (The removed cards are imprinted on this artifact.)\nWhenever a card is played, if it has the same name as one of the imprinted sorcery cards, you may copy the other and play the copy without paying its mana cost.", "originalType": "Artifact", "printings": ["MRD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/8d6ad619a7ea07df", "cardKingdomFoil": "https://mtgjson.com/links/6f27e0e9bf3c1f69", "cardmarket": "https://mtgjson.com/links/a1a1cec883412952", "tcgplayer": "https://mtgjson.com/links/27e68065a87608be"}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "If this card leaves the battlefield while the ability to make a copy is on the stack, the ability will still make a copy using the last-known-information rule."}, {"date": "2004-10-04", "text": "If the imprinted card leaves the exile zone while the ability to make a copy is on the stack, then no copy will be made."}, {"date": "2004-12-01", "text": "Spellweaver Helix’s second ability creates a copy of the imprinted card in the Exile zone (that’s where the imprinted sorcery card is), then allows you to cast it without paying its mana cost."}, {"date": "2004-12-01", "text": "You cast the copy while this ability is resolving, and still on the stack. Normally, you’re not allowed to cast spells or activate abilities at this time. Spellweaver Helix’s ability breaks this rule. (The card that triggered this ability is also still on the stack.)"}, {"date": "2004-12-01", "text": "If there’s only one imprinted sorcery card, nothing happens."}, {"date": "2004-12-01", "text": "You can’t cast the copy if an effect prevents you from casting sorceries or from casting that particular sorcery."}, {"date": "2004-12-01", "text": "You can’t cast the copy unless all of its targets can be chosen."}, {"date": "2004-12-01", "text": "If you don’t want to cast the copy, you can choose not to; the copy ceases to exist the next time state-based actions are checked."}, {"date": "2004-12-01", "text": "You don’t pay the spell’s mana cost. If a spell has X in its mana cost, X is 0. You do pay any additional costs for that spell. You can’t use any alternative costs."}, {"date": "2004-12-01", "text": "If the two imprinted sorcery cards have the same name and a card with that name is cast, only one copy is created, not two."}, {"date": "2005-03-01", "text": "The creation of the copy and then the casting of the copy are both optional."}, {"date": "2017-04-18", "text": "A split card has the same name as a spell if either of its names is that spell’s name."}], "setCode": "MRD", "subtypes": [], "supertypes": [], "text": "Imprint — When Spellweaver Helix enters the battlefield, you may exile two target sorcery cards from a single graveyard.\nWhenever a player casts a card, if it has the same name as one of the cards exiled with Spellweaver Helix, you may copy the other. If you do, you may cast the copy without paying its mana cost.", "type": "Artifact", "types": ["Artifact"], "uuid": "0cfde1f1-7795-515f-b52f-92e37e1def29"}