{"artist": "Ron Spencer", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 10922, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 76429, "name": "Spruchbinder", "text": "Einprägen Wenn der Spruchbinder ins Spiel kommt, kannst du eine Spontanzauberkarte, die kein Land ist, aus deiner Hand ganz aus dem Spiel entfernen.\nImmer wenn die ausgerüstete Kreatur einem Spieler Kampfschaden zufügt, kannst du die eingeprägte Spontanzauberkarte kopieren und die Kopie spielen, ohne ihre Manakosten zu bezahlen.\nAusrüsten {4}", "type": "Artefakt — Ausrüstung"}, {"language": "Spanish", "multiverseId": 75604, "name": "Enlazahechizo", "text": "Estampa Cuando el Enlazahechizo entre en juego, puedes remover del juego una carta de instantáneo de tu mano.\nSiempre que la criatura equipada haga daño de combate a un jugador, puedes copiar la carta de instantáneo estampada y jugar la copia sin pagar su coste de maná.\nEquipar {4}.", "type": "Artefacto — Equipo"}, {"language": "French", "multiverseId": 76099, "name": "Entrave-sort", "text": "Empreinte — Quand l'Entrave-sort arrive en jeu, vous pouvez retirer de la partie une carte d'éphémère de votre main.\nÀ chaque fois que la créature équipée inflige des blessures de combat à un joueur, vous pouvez copier la carte d'éphémère dont cette carte a l'empreinte et jouer la copie sans payer son coût de mana.\nÉquipement {4}", "type": "Artefact : équipement"}, {"language": "Italian", "multiverseId": 75769, "name": "Incantatore", "text": "Imprimere Quando l'Incantatore entra in gioco, puoi rimuovere dal gioco una carta istantaneo presente nella tua mano.\nOgniqualvolta la creatura equipaggiata infligge danno da combattimento a un giocatore, puoi copiare la carta istantaneo impressa e giocare la copia senza pagare il suo costo di mana.\nEquipaggiare {4}", "type": "Artefatto — Equipaggiamento"}, {"language": "Japanese", "multiverseId": 76264, "name": "呪文冊子", "text": "刻印 ― 呪文冊子が場に出たとき、あなたはあなたの手札にあるインスタント･カードを１枚、ゲームから取り除いてもよい。\n装備しているクリーチャーがいずれかのプレイヤーに戦闘ダメージを与えるたび、あなたは刻印されているインスタント･カードをコピーし、そのコピーをマナ・コストを支払わずにプレイしてもよい。\n装備 {4}", "type": "アーティファクト — 装備品"}, {"language": "Portuguese (Brazil)", "multiverseId": 75934, "name": "Ligamágicas", "text": "Estampar Quando Ligamágicas entra em jogo, você pode remover de jogo um card de mágica instantânea de sua mão.\nToda vez que a criatura equipada causar dano de combate a um jogador, você pode copiar o card de mágica instantânea estampado e jogar a cópia sem pagar seu custo de mana.\nEquipar {4}", "type": "Artefato — Equipamento"}, {"language": "Chinese Simplified", "multiverseId": 76594, "name": "凝咒杖", "text": "压印～当凝咒杖进场时，你可以从你手上将一张瞬间牌移出对战。\n每当佩带此武具的生物对任一牌手造成战斗伤害时，你可以复制压印的瞬间牌并使用此复制，且不须支付其法术力费用。\n佩带{4}", "type": "神器～武具"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "110554", "cardKingdomId": "110384", "cardsphereId": "12748", "mcmId": "359", "mcmMetaId": "5455", "mtgjsonV4Id": "8bdb1dbf-e411-57e1-bcc5-3150659fed28", "mtgoFoilId": "20590", "mtgoId": "20589", "multiverseId": "50540", "scryfallId": "4d193d4f-1beb-4938-b3fb-b2e96d0c9ec4", "scryfallIllustrationId": "8cbc90ca-aa51-4da2-93d4-5f66b68da368", "scryfallOracleId": "da50989e-4fd4-4353-afd5-9c1354330ec2", "tcgplayerProductId": "11650"}, "keywords": ["Equip", "Imprint"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Spellbinder", "number": "143", "originalText": "Imprint When Spellbinder comes into play, you may remove an instant card in your hand from the game.\nWhenever equipped creature deals combat damage to a player, you may copy the imprinted instant card and play the copy without paying its mana cost.\nEquip {4}", "originalType": "Artifact - Equipment", "printings": ["DST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ea35b3a9fd69b90f", "cardKingdomFoil": "https://mtgjson.com/links/05a160bdaa2456c3", "cardmarket": "https://mtgjson.com/links/da1dd2fba5591cb1", "tcgplayer": "https://mtgjson.com/links/ac001930055a5555"}, "rarity": "rare", "rulings": [{"date": "2004-12-01", "text": "Spellbinder’s second ability allows you to create a copy of the imprinted instant card in the Exile zone (that’s where the imprinted instant card is) and then cast it without paying its mana cost."}, {"date": "2004-12-01", "text": "You don’t pay the spell’s mana cost. If the spell has X in its mana cost, X is 0. You do pay any additional costs for that spell. You can’t use any alternative costs."}, {"date": "2004-12-01", "text": "If the copied card is a split card, you choose which one side of it to cast, but you can’t cast both sides. You can choose the other side later in the game, though."}, {"date": "2004-12-01", "text": "Spellbinder imprints a card only once, when it enters the battlefield. Attaching Spellbinder to a creature doesn’t trigger its enters-the-battlefield ability."}, {"date": "2005-03-01", "text": "The creation of the copy and then the casting of the copy are both optional."}], "setCode": "DST", "subtypes": ["Equipment"], "supertypes": [], "text": "Imprint — When Spellbinder enters the battlefield, you may exile an instant card from your hand.\nWhenever equipped creature deals combat damage to a player, you may copy the exiled card. If you do, you may cast the copy without paying its mana cost.\nEquip {4}", "type": "Artifact — Equipment", "types": ["Artifact"], "uuid": "8b1d3657-e1a0-5adb-a832-ca16f315a970"}