{"artist": "Pete Venters", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 6.0, "edhrecRank": 9763, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 169114, "name": "Zauberentführung", "text": "Neutralisiere einen Zauberspruch deiner Wahl. Falls dieser auf diese Weise neutralisiert wird, entferne ihn ganz aus dem Spiel, anstatt ihn auf den Friedhof seines Besitzers zu legen. Solange er ganz aus dem Spiel entfernt ist, kannst du diesen Zauberspruch spielen, als ob er auf deiner Hand wäre, ohne seine Manakosten bezahlen zu müssen.Falls ein X in seinen Manakosten ist, ist X dann 0.", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 170662, "name": "Hurtahechizos", "text": "Contrarresta el hechizo objetivo. Si el hechizo se contrarresta de esta manera, remuévelo del juego en vez de ponerlo en el cementerio de su propietario. Mientras permanezca fuera del juego, puedes jugarla como si estuviera en tu mano sin pagar su coste de maná. Si tiene X en su coste de maná, X es 0.", "type": "Instantáneo"}, {"language": "French", "multiverseId": 169257, "name": "Détournement de sort", "text": "Contrecarrez le sort ciblé. S'il est contrecarré de cette manière, retirez-le de la partie au lieu de le mettre dans le cimetière de son propriétaire. Tant qu'elle reste retirée de la partie, vous pouvez la jouer comme si elle était dans votre main sans payer son coût de mana. S'il y a X dans son coût de mana, X vaut 0.", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 169400, "name": "Furto di Magia", "text": "Neutralizza una magia bersaglio. Se viene neutralizzata in questo modo, rimuovila dal gioco invece di metterla nel cimitero del suo proprietario. Fintano che resta rimossa dal gioco, puoi giocarla come se fosse nella tua mano senza pagare il suo costo di mana. Se c'è X nel suo costo di mana, X è 0.", "type": "Istantaneo"}, {"language": "Japanese", "name": "呪文乗っ取り"}, {"language": "Portuguese (Brazil)", "multiverseId": 169543, "name": "Desvio de Mágica", "text": "Anula a mágica alvo. Se ela for anulada desta maneira, remova-a de jogo ao invés de colocá-la no cemitério de seu dono. Enquanto ele permanecer removido do jogo, você pode usá-lo como se ele estivese em sua mão sem pagar seu custo de mana. Se ela tiver X em seu custo de mana, X é igual a 0.", "type": "Mágica Instantânea"}], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "59050", "cardKingdomId": "58050", "cardsphereId": "22648", "mcmId": "2177", "mcmMetaId": "5458", "mtgjsonV4Id": "7d3542be-73fe-51c4-8ed2-c22f7797b319", "mtgoFoilId": "17477", "mtgoId": "17476", "multiverseId": "35169", "scryfallId": "3eda8c7b-ce35-482a-bece-52a30cc78a9a", "scryfallIllustrationId": "82fffc9c-876a-4327-aa66-debc56d20f34", "scryfallOracleId": "7687b2a7-816d-4416-979b-675e35e235fc", "tcgplayerProductId": "10211"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}{U}{U}", "manaValue": 6.0, "name": "Spelljack", "number": "51", "originalText": "Counter target spell. If it's countered this way, remove it from the game instead of putting it into its owner's graveyard. As long as it remains removed from the game, you may play it as though it were in your hand without paying its mana cost. If it has X in its mana cost, X is 0.", "originalType": "Instant", "printings": ["JUD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/3e51eec432517418", "cardKingdomFoil": "https://mtgjson.com/links/92f558679e094f00", "cardmarket": "https://mtgjson.com/links/2c85e6dc5671377e", "tcgplayer": "https://mtgjson.com/links/184243ef9f8ea221"}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "If you cast an instant or sorcery, it goes to its owner’s graveyard when it resolves."}, {"date": "2004-10-04", "text": "This spell can be used on a spell cast using Flashback."}, {"date": "2008-08-01", "text": "If you use this on an opponent’s spell which has Buyback, you may pay the Buyback cost as you cast it. If you do so, the card will go to its owner’s hand upon resolution. It will not go to your hand, nor to any player’s graveyard."}], "setCode": "JUD", "subtypes": [], "supertypes": [], "text": "Counter target spell. If that spell is countered this way, exile it instead of putting it into its owner's graveyard. You may play it without paying its mana cost for as long as it remains exiled. (If it has X in its mana cost, X is 0.)", "type": "Instant", "types": ["Instant"], "uuid": "9a4409eb-2cad-5a0a-875e-8052622a2ae9"}