{"artist": "Svetlin Velinov", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 5.0, "edhrecRank": 9395, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 484954, "name": "Zauberbrand-Phoenix", "text": "Fliegend\nWenn der Zauberbrand-Phoenix ins Spiel kommt, kannst du eine Spontanzauber- oder Hexerei-Karte deiner Wahl mit einer Umwandlung-Fähigkeit aus deinem Friedhof auf deine Hand zurückbringen.\nZu Beginn jedes Endsegments und falls du in diesem Zug zwei oder mehr Karten umgewandelt hast, bringe den Zauberbrand-Phoenix aus deinem Friedhof auf deine Hand zurück.", "type": "Kreatur — Phoenix"}, {"language": "Spanish", "multiverseId": 485005, "name": "Fénix pirohechizo", "text": "Vuela.\nCuando el Fénix pirohechizo entre al campo de batalla, puedes regresar la carta de instantáneo o de conjuro objetivo con una habilidad de ciclo de tu cementerio a tu mano.\nAl comienzo de cada paso final, si activaste la habilidad de ciclo de dos o más cartas este turno, regresa el Fénix pirohechizo de tu cementerio a tu mano.", "type": "Criatura — Fénix"}, {"language": "French", "multiverseId": 485056, "name": "Phénix sortfeu", "text": "Vol\nQuand le Phénix sortfeu arrive sur le champ de bataille, vous pouvez renvoyer une carte d'éphémère ou de rituel avec une capacité de recyclage ciblée depuis votre cimetière dans votre main.\nAu début de chaque étape de fin, si vous avez recyclé au moins deux cartes ce tour-ci, renvoyez le Phénix sortfeu depuis votre cimetière dans votre main.", "type": "Créature : phénix"}, {"language": "Italian", "multiverseId": 485107, "name": "Fenice della Pira Magica", "text": "Volare\nQuando la Fenice della Pira Magica entra nel campo di battaglia, puoi riprendere in mano una carta istantaneo o stregoneria bersaglio con un'abilità ciclo dal tuo cimitero.\nAll'inizio di ogni sottofase finale, se hai ciclato due o più carte in questo turno, riprendi in mano la Fenice della Pira Magica dal tuo cimitero.", "type": "Creatura — Fenice"}, {"language": "Japanese", "multiverseId": 485158, "name": "呪文焚きのフェニックス", "text": "飛行\n呪文焚きのフェニックスが戦場に出たとき、あなたの墓地からサイクリング能力を持ちインスタントかソーサリーであるカード１枚を対象とする。あなたはそれをあなたの手札に戻してもよい。\n各終了ステップの開始時に、このターンにあなたがカードを２枚以上サイクリングしていた場合、あなたの墓地から呪文焚きのフェニックスをあなたの手札に戻す。", "type": "クリーチャー — フェニックス"}, {"language": "Portuguese (Brazil)", "multiverseId": 485209, "name": "Fênix da Pira Mágica", "text": "Voar\nQuando Fênix da Pira Mágica entra no campo de batalha, você pode devolver o card de mágica instantânea ou feitiço alvo com uma habilidade de reciclar de seu cemitério para sua mão.\nNo início de cada etapa final, se você reciclou dois ou mais cards neste turno, devolva Fênix da Pira Mágica de seu cemitério para sua mão.", "type": "Criatura — Fênix"}, {"language": "Russian", "multiverseId": 485260, "name": "Феникс Колдовского Огня", "text": "Полет\nКогда Феникс Колдовского Огня выходит на поле битвы, вы можете вернуть целевую карту мгновенного заклинания или волшебства со способностью Цикла из вашего кладбища в вашу руку.\nВ начале каждого заключительного шага, если вы совершили Цикл двух или более карт в этом ходу, верните Феникса Колдовского Огня из вашего кладбища в вашу руку.", "type": "Существо — Феникс"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "232364", "cardsphereId": "66403", "mcmId": "453138", "mtgjsonV4Id": "6b28959f-ef85-5bb9-be85-9acf2338cbb9", "mtgoId": "80693", "multiverseId": "484903", "scryfallId": "f492c4f5-27b7-4f09-a3af-2fb1aeac50d5", "scryfallIllustrationId": "1d2cf0bd-b885-4142-ac54-7be0bd82f9e4", "scryfallOracleId": "a86710da-e498-4ca1-832c-8ba4abd6fa46", "tcgplayerProductId": "212226"}, "isStarter": true, "keywords": ["Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}{R}", "manaValue": 5.0, "name": "Spellpyre Phoenix", "number": "56", "originalText": "Flying\nWhen Spellpyre Phoenix enters the battlefield, you may return target instant or sorcery card with a cycling ability from your graveyard to your hand.\nAt the beginning of each end step, if you cycled two or more cards this turn, return Spellpyre Phoenix from your graveyard to your hand.", "originalType": "Creature — Phoenix", "power": "4", "printings": ["C20"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/590b03c69b8aa8f5", "tcgplayer": "https://mtgjson.com/links/c762315c639b1214"}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "Spellpyre Phoenix’s last ability checks the entire turn. Cards you cycled before Spellpyre Phoenix was put into your graveyard count."}, {"date": "2020-04-17", "text": "If you somehow cycle a card, return it to your hand, and cycle it a second time in one turn, Spellpyre Phoenix’s last ability counts each time you cycled it and returns to your hand."}, {"date": "2020-04-17", "text": "Some cards with cycling have an ability that triggers when you cycle them, and some cards have an ability that triggers whenever you cycle any card. These triggered abilities resolve before you draw from the cycling ability."}, {"date": "2020-04-17", "text": "Triggered abilities from cycling a card and the cycling ability itself aren’t spells. Effects that interact with spells (such as that of Cancel) won’t affect them."}, {"date": "2020-04-17", "text": "You can cycle a card even if it has a triggered ability from cycling that won’t have a legal target. This is because the cycling ability and the triggered ability are separate. This also means that if either ability is countered (with Disallow, for example), the other ability will still resolve."}], "securityStamp": "oval", "setCode": "C20", "subtypes": ["Phoenix"], "supertypes": [], "text": "Flying\nWhen Spellpyre Phoenix enters the battlefield, you may return target instant or sorcery card with a cycling ability from your graveyard to your hand.\nAt the beginning of each end step, if you cycled two or more cards this turn, return Spellpyre Phoenix from your graveyard to your hand.", "toughness": "2", "type": "Creature — Phoenix", "types": ["Creature"], "uuid": "365beef7-8248-53e8-a3e8-9e319783dccc"}