{"artist": "Bud Cook", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 11649, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 144969, "name": "Spruchweber-Schnörkel", "text": "Spontanzauberkarte-in-einem-Friedhof-Verzauberung\n Immer wenn du eine Hexerei spielst, kopiere die verzauberte Spontanzauberkarte. Du kannst diese Kopie spielen, ohne ihre Manakosten zu bezahlen. Falls du dies tust, entferne die verzauberte Karte ganz aus dem Spiel und lege den Spruchweber-Schnörkel an eine andere Spontanzauberkarte in einem Friedhof an.", "type": "Verzauberung — Aura"}, {"language": "Spanish", "multiverseId": 145293, "name": "Voluta tejehechizos", "text": "Encantar carta de instantáneo en un cementerio.\u2028Siempre que juegues un hechizo de conjuro, copia la carta de instantáneo encantada. Puedes jugar la copia sin pagar su coste de maná. Si lo haces, remueve del juego la carta encantada y anexa la Voluta tejehechizos a otra carta de instantáneo en un cementerio.", "type": "Encantamiento — Aura"}, {"language": "French", "multiverseId": 145374, "name": "Volute tisse-sort", "text": "Enchantez une carte d'éphémère dans un cimetière.\nÀ chaque fois que vous jouez un sort de rituel, copiez la carte d'éphémère enchantée. Vous pouvez jouer la copie sans payer son coût de mana. Si vous faites ainsi, retirez la carte enchantée de la partie et attachez la Volute tisse-sort à une autre carte d'éphémère dans un cimetière.", "type": "Enchantement : aura"}, {"language": "Italian", "multiverseId": 144888, "name": "Voluta Tessimagie", "text": "Incanta carta istantaneo in un cimitero\nOgniqualvolta giochi una magia stregoneria, copia la carta istantaneo incantata. Puoi giocare la copia senza pagare il suo costo di mana. Se lo fai, rimuovi dal gioco la carta incantata e assegna la Voluta Tessimagie a un'altra carta istantaneo in un cimitero.", "type": "Incantesimo — Aura"}, {"language": "Japanese", "multiverseId": 145455, "name": "呪文織りの渦巻", "text": "エンチャント（いずれかの墓地にあるインスタント・カード）\n あなたがソーサリー呪文をプレイするたび、エンチャントされているインスタント・カードをコピーする。 あなたはそのコピーを、マナ・コストを支払わずにプレイしてもよい。 そうした場合、エンチャントされているカードをゲームから取り除き、呪文織りの渦巻きをいずれかの墓地にある他のインスタント・カードにつける。", "type": "エンチャント — オーラ"}, {"language": "Portuguese (Brazil)", "multiverseId": 145131, "name": "Tece-Mágicas Espiriforme", "text": "Encantar card de mágica instantânea em um cemitério\nToda vez que você joga um feitiço, copie o card de mágica instantânea encantado. Você poderá jogar a cópia sem pagar seu custo de mana. Se você o fizer, remova o card encantado do jogo e anexe Tece-Mágicas Espiriforme a outro card de mágica instantânea em um cemitério.", "type": "Encantamento — Aura"}, {"language": "Russian", "multiverseId": 145050, "name": "Спираль Сплетенных Заклинаний", "text": "Зачаруйте находящуюся на кладбище карту мгновенного заклинания\nКаждый раз, когда вы разыгрываете заклинание волшебства, копируйте зачарованную карту мгновенного заклинания. Вы можете разыграть эту копию без уплаты её мана-стоимости. Если вы это делаете, удалите зачарованную карту из игры и прикрепите Спираль Сплетенных Заклинаний к другой карте мгновенного заклинания, находящейся на кладбище.", "type": "Чары — Аура"}, {"language": "Chinese Simplified", "multiverseId": 145212, "name": "织咒涡旋", "text": "瞬间牌结界（仅限在坟墓场的瞬间牌）\n每当你使用任一法术咒语时，复制受此结界的瞬间牌。 你可以使用此复制，并且不需支付其法术力费用。 若你如此作，则将受此结界的牌移出对战，且将织咒涡旋结附在另一张在坟墓场的瞬间牌。", "type": "结界～灵气"}], "frameVersion": "future", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "122576", "cardKingdomId": "122396", "cardsphereId": "18840", "mcmId": "15051", "mcmMetaId": "8980", "mtgjsonV4Id": "1a86c456-ec8d-5763-8f95-e507a9c29b0d", "mtgoFoilId": "26805", "mtgoId": "26804", "multiverseId": "136032", "scryfallId": "79cc73ea-3f07-4d11-9961-dc31ac598b73", "scryfallIllustrationId": "ae0bf859-30e7-4231-9124-a7e0d71c5198", "scryfallOracleId": "3d92e5ce-9d30-4203-9f84-6c36117440cf", "tcgplayerProductId": "14991"}, "isTimeshifted": true, "keywords": ["Enchant"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}{U}", "manaValue": 5.0, "name": "Spellweaver Volute", "number": "59", "originalText": "Enchant instant card in a graveyard\nWhenever you play a sorcery spell, copy the enchanted instant card. You may play the copy without paying its mana cost. If you do, remove the enchanted card from the game and attach Spellweaver Volute to another instant card in a graveyard.", "originalType": "Enchantment - Aura", "printings": ["FMB1", "FUT"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/fcc2634398ca1338", "cardKingdomFoil": "https://mtgjson.com/links/aa9c3f91e0f40b39", "cardmarket": "https://mtgjson.com/links/8220a51125a00f82", "tcgplayer": "https://mtgjson.com/links/adc38507eb0a8ef5"}, "rarity": "rare", "rulings": [{"date": "2007-05-01", "text": "This Aura targets, and enchants, an instant card in a graveyard. This is the first Aura that enchants something that’s neither a permanent nor a player."}, {"date": "2007-05-01", "text": "The Aura will be on the battlefield attached to a card in a different zone. The Aura won’t be in the graveyard. The enchanted card won’t be on the battlefield."}, {"date": "2007-05-01", "text": "If the enchanted card changes zones (due to being cast with flashback, or being exiled with Cremate, for example), Spellweaver Volute “falls off” and is put into its owner’s graveyard as a state-based action."}, {"date": "2007-05-01", "text": "When you cast a sorcery spell, Spellweaver Volute’s ability triggers. It will make a copy of the enchanted card. The copy will exist in the graveyard. You’ll have the option to cast the copy. If you don’t, the copy remains in the graveyard and ceases to exist the next time state-based actions are checked. If you do cast the copy, the copy is cast from the graveyard. After you finish casting it, the enchanted card is exiled and you must choose a new instant card in a graveyard to attach Spellweaver Volute to. If you can’t, Spellweaver Volute remains on the battlefield attached to nothing and is then put into the graveyard the next time state-based actions are checked."}, {"date": "2007-05-01", "text": "Say Spellweaver Volute’s ability triggers, then the enchanted instant card is exiled in response. Spellweaver Volute, which is now enchanting nothing, is put into its owner’s graveyard as a state-based action. When the Volute’s ability resolves, it will check its last existence on the battlefield and identify the “enchanted card” as “nothing,” so no copy is created."}, {"date": "2007-05-01", "text": "Say Spellweaver Volute’s ability triggers, then Spellweaver Volute leaves the battlefield in response. Then the instant card that was enchanted is removed from the graveyard in response. When the Volute’s ability resolves, it will check its last existence on the battlefield and identify the “enchanted card” as that instant card, so the card is copied and controller of the triggered ability may cast it."}], "setCode": "FUT", "subtypes": ["Aura"], "supertypes": [], "text": "Enchant instant card in a graveyard\nWhenever you cast a sorcery spell, copy the enchanted instant card. You may cast the copy without paying its mana cost. If you do, exile the enchanted card and attach Spellweaver Volute to another instant card in a graveyard.", "type": "Enchantment — Aura", "types": ["Enchantment"], "uuid": "f718865e-bc7f-5bde-b3a5-b773d2075fe2"}