{"artist": "Seth Conley", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 1.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "250126", "cardsphereId": "83019", "mcmId": "415214", "mtgjsonV4Id": "4fb06c19-0da4-50f8-bf44-668b75fdf149", "scryfallId": "8a5e3882-af37-4a8b-b41b-c1c064f4dbf9", "scryfallIllustrationId": "f580c1a8-e981-4ac9-a292-b6c462133079", "scryfallOracleId": "d8f5c632-48d2-416a-9bdd-59f9b8bcd212", "tcgplayerProductId": "246962"}, "isFunny": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {}, "manaCost": "{B}", "manaValue": 1.0, "name": "Spellmorph Raise Dead", "number": "46", "printings": ["CMB1", "CMB2"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/82c7a0f8845862e8", "tcgplayer": "https://mtgjson.com/links/f78a1abd2d9bf780"}, "rarity": "rare", "rulings": [{"date": "2019-11-12", "text": "Spellmorph is a variant of morph. A spellmorph ability is a morph ability, and a spellmorph cost is a morph cost. All rules and rulings for morph apply to spellmorph, except for how to turn it face up."}, {"date": "2019-11-12", "text": "To cast a spell with a morph ability, you turn it face down before determining whether it’s legal to cast. The face-down spell (and the permanent it becomes) is a 2/2 creature with no name, mana cost, creature types, or abilities. It’s colorless and has a converted mana cost of 0, and the cost to cast the spell is {3}. Other effects that apply to the spell or permanent can still grant or change any of these characteristics."}, {"date": "2019-11-12", "text": "The controller of the face-down creature with spellmorph can cast it, regardless of who cast the face-down creature spell."}, {"date": "2019-11-12", "text": "To cast a spell with spellmorph from the battlefield, first reveal that it has a spellmorph cost. If it does, ignore all effects that are affecting it to determine whether it’s legal to cast; it’s no longer a creature. If it’s legal to cast, move it to the stack. If you realize that you can’t legally cast the spell, the game rewinds and it remains face down on the battlefield."}, {"date": "2019-11-12", "text": "If a face-down creature with spellmorph loses all abilities, it can’t be cast from the battlefield."}, {"date": "2019-11-12", "text": "If a card with spellmorph is manifested, you can cast it from the battlefield."}, {"date": "2019-11-12", "text": "The face-down characteristics of a permanent are copiable values. If another object becomes a copy of a face-down creature or if a token is created that’s a copy of a face-down creature, that new object is a 2/2 colorless face-up creature with no abilities."}, {"date": "2019-11-12", "text": "Because face-down creatures don’t have a name, they can’t have the same name as any other creature or share any creature types with any other creature, even another face-down creature."}, {"date": "2019-11-12", "text": "If a face-down permanent you control leaves the battlefield, you must reveal it. If a face-down spell you control leaves the stack other than by resolving, you must reveal it. You must also reveal all face-down spells and permanents you control if you leave the game or if the game ends. The game doesn’t count them as being turned face up when you reveal them this way."}, {"date": "2019-11-12", "text": "You must ensure that your face-down spells and permanents can easily be differentiated from each other. You're not allowed to mix them up on the battlefield to confuse other players. The order they entered the battlefield should remain clear. Common methods for indicating this include using markers or dice, or simply placing them in order on the battlefield."}, {"date": "2019-11-12", "text": "There are no cards in this set that would turn a face-down instant or sorcery card face up, but some older cards can try to do this. If something tries to turn a face-down instant or sorcery card on the battlefield face up, reveal that card to show all players it’s an instant or sorcery card. The permanent remains on the battlefield face down. Abilities that trigger when a permanent turns face up won’t trigger, because even though you revealed the card, it never turned face up."}, {"date": "2019-11-12", "text": "Are you still reading? That’s awesome. Face-down cards are tricky. One more ruling to go."}, {"date": "2019-11-12", "text": "If an effect tries to return a face-down creature to the battlefield after it leaves (such Momentary Blink or Adarkar Valkyrie’s delayed triggered ability), that effect returns the card face up. If it tries to put an instant or sorcery card onto the battlefield this way, that card remains in its current zone instead."}], "setCode": "CMB2", "subtypes": [], "supertypes": [], "text": "Return target creature card from your graveyard to your hand.\nSpellmorph {B} (You may cast this card face down as a 2/2 creature for {3}. Cast it any time for its spellmorph cost.)", "type": "Instant", "types": ["Instant"], "uuid": "c782000c-c5ef-59cc-8194-9ed59b8628a2"}