{"artist": "Antonio José Manzanedo", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 8.0, "edhrecRank": 1781, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "d1c3ee2e-faec-5542-bca7-7725d2ac4f1e", "mtgoId": "85992", "scryfallId": "9c10cb0d-6570-4105-842d-a87184770cb1", "scryfallIllustrationId": "55ea1bee-9c30-4687-9bde-6fdc72b358f1", "scryfallOracleId": "516101be-be39-4d84-8fee-d8a79930dd0a"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Flying"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{6}{U}{U}", "manaValue": 8.0, "name": "Sphinx of the Second Sun", "number": "85992", "originalReleaseDate": "2020-12-15", "power": "6", "printings": ["CMR", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2020-11-10", "text": "The additional beginning phase will be a lot like your normal beginning phase. During the untap step, permanents will phase in or out as appropriate and you’ll untap your tapped permanents. Anything that triggers “at the beginning of your upkeep” or similar will trigger during the upkeep step, and you’ll eventually draw a card for your draw step."}, {"date": "2020-11-10", "text": "The additional beginning phase all happens during the current turn. Any effects that last “until your next turn” or similar won’t expire just because you’ll go through an additional beginning phase."}, {"date": "2020-11-10", "text": "After the additional beginning phase, the game proceeds to the ending phase (unless something has added even more phases; see below.)"}, {"date": "2020-11-10", "text": "If multiple phases are added to the same point in your turn, the most recently created phase happens first. For example, say you control Sphinx of the Second Sun and its ability triggers during your postcombat main phase. Later during that same main phase, another effect gives you an additional combat phase after this main phase. The additional combat will happen first, followed by the additional beginning phase."}, {"date": "2020-11-10", "text": "Even if you don’t attack with any creatures during combat, you’ll still get a postcombat main phase and Sphinx of the Second Sun’s ability will still trigger."}, {"date": "2020-11-10", "text": "If you somehow have more than two main phases in a turn, each main phase other than the first one is a postcombat main phase, and Sphinx of the Second Sun’s ability triggers at the beginning of each of them."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Sphinx"], "supertypes": [], "text": "Flying\nAt the beginning of your postcombat main phase, there is an additional beginning phase after this phase. (The beginning phase includes the untap, upkeep, and draw steps.)", "toughness": "6", "type": "Creature — Sphinx", "types": ["Creature"], "uuid": "eaa19c50-473f-5611-8c12-658812f13c4d"}