{"artist": "Franz Vohwinkel", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 7.0, "edhrecRank": 7927, "finishes": ["nonfoil", "foil"], "flavorText": "Its host's final curse lies captured within.", "foreignData": [{"flavorText": "Der letzte Fluch seines Stifters steckt in ihm.", "language": "German", "multiverseId": 217419, "name": "Sphinxknochen-Zauberstab", "text": "Immer wenn du einen Spontanzauber oder eine Hexerei wirkst, kannst du eine Ladungsmarke auf den Sphinxknochen-Zauberstab legen. Falls du dies tust, fügt der Sphinxknochen-Zauberstab einer Kreatur oder einem Spieler deiner Wahl so viele Schadenspunkte zu, wie Ladungsmarken auf ihm liegen.", "type": "Artefakt"}, {"flavorText": "La última maldición de su huésped está capturada dentro.", "language": "Spanish", "multiverseId": 217171, "name": "Varita de hueso de esfinge", "text": "Siempre que lances un hechizo instantáneo o conjuro, puedes poner un contador de carga sobre la Varita de hueso de esfinge. Si lo haces, la Varita de hueso de esfinge hace daño igual a la cantidad de contadores de carga sobre ella a la criatura o jugador objetivo.", "type": "Artefacto"}, {"flavorText": "L'ultime malédiction de son hôte y est emprisonnée.", "language": "French", "multiverseId": 215683, "name": "Baguette d'os de sphinx", "text": "À chaque fois que vous lancez un sort d'éphémère ou de rituel, vous pouvez mettre un marqueur « charge » sur la Baguette d'os de sphinx. Si vous faites ainsi, la Baguette d'os de sphinx inflige un nombre de blessures égal au nombre de marqueurs « charge » qu'elle a sur elle à une cible, créature ou joueur.", "type": "Artefact"}, {"flavorText": "La maledizione finale del suo padrone è rinchiusa al suo interno.", "language": "Italian", "multiverseId": 216427, "name": "Bacchetta di Osso della Sfinge", "text": "Ogniqualvolta lanci una magia istantaneo o stregoneria, puoi mettere un segnalino carica sulla Bacchetta di Osso della Sfinge. Se lo fai, la Bacchetta di Osso della Sfinge infligge danno pari al numero di segnalini carica su di essa a una creatura o a un giocatore bersaglio.", "type": "Artefatto"}, {"flavorText": "その主の最後の呪いが中に閉じ込められている。", "language": "Japanese", "multiverseId": 216675, "name": "スフィンクスの骨の杖", "text": "あなたがインスタント呪文かソーサリー呪文を１つ唱えるたび、クリーチャー１体かプレイヤー１人を対象とする。あなたはスフィンクスの骨の杖の上に蓄積カウンターを１個置いてもよい。 そうした場合、スフィンクスの骨の杖はそれに、スフィンクスの骨の杖の上に置かれている蓄積カウンターの数に等しい点数のダメージを与える。", "type": "アーティファクト"}, {"flavorText": "A maldição final de seu hospedeiro encontra-se aprisionada em seu interior.", "language": "Portuguese (Brazil)", "multiverseId": 216923, "name": "Cetro de Osso de Esfinge", "text": "Toda vez que conjura uma mágica instantânea ou feitiço, você pode colocar um marcador de carga em Cetro de Osso de Esfinge. Se fizer isso, Cetro de Osso de Esfinge causa uma quantidade de dano igual ao número de marcadores de carga nele à criatura ou ao jogador alvo.", "type": "Artefato"}, {"flavorText": "Внутри хранится последнее проклятие его хозяина.", "language": "Russian", "multiverseId": 215931, "name": "Жезл из Кости Сфинкса", "text": "Каждый раз когда вы разыгрываете мгновенное заклинание или заклинание волшебства, вы можете положить жетон заряда на Жезл из Кости Сфинкса. Если вы это делаете, Жезл из Кости Сфинкса наносит повреждения, равные количеству жетонов заряда на нем, целевому существу или игроку.", "type": "Артефакт"}, {"flavorText": "里面埋藏着其主子的临终诅咒。", "language": "Chinese Simplified", "multiverseId": 216179, "name": "史芬斯骨杖", "text": "每当你施放瞬间或法术咒语时，你可以在史芬斯骨杖上放置一个充电指示物。 若你如此作，则史芬斯骨杖对目标生物或牌手造成伤害，其数量等同于史芬斯骨杖上充电指示物的数量。", "type": "神器"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "131126", "cardKingdomId": "130887", "cardsphereId": "39775", "mcmId": "22601", "mcmMetaId": "11281", "mtgjsonV4Id": "b9c6dcf0-ccc3-5242-8463-6dc70cb9f6b6", "mtgoFoilId": "36585", "mtgoId": "36584", "multiverseId": "193596", "scryfallId": "b7da189e-f692-4b91-a452-3c628c3c2b1c", "scryfallIllustrationId": "c445574c-ecc5-4beb-97c2-2c8dafd4a8f7", "scryfallOracleId": "4b9e529c-4fbd-4944-828d-7fbc8f26c991", "tcgplayerProductId": "34919"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{7}", "manaValue": 7.0, "name": "Sphinx-Bone Wand", "number": "225", "originalText": "Whenever you cast an instant or sorcery spell, you may put a charge counter on Sphinx-Bone Wand. If you do, Sphinx-Bone Wand deals damage equal to the number of charge counters on it to target creature or player.", "originalType": "Artifact", "printings": ["DDJ", "ROE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/4a24524aa009f941", "cardKingdomFoil": "https://mtgjson.com/links/51e49b3a55750971", "cardmarket": "https://mtgjson.com/links/2749cb5fb78629fb", "tcgplayer": "https://mtgjson.com/links/902e94e27f469239"}, "rarity": "rare", "rulings": [{"date": "2010-06-15", "text": "If you cast an instant or sorcery spell, Sphinx-Bone Wand’s ability triggers and goes on the stack on top of it. The ability will resolve before the spell does."}, {"date": "2010-06-15", "text": "If the targeted permanent or player is an illegal target by the time the ability resolves, the ability doesn’t resolve. You won’t put a charge counter on Sphinx-Bone Wand and it won’t deal damage."}, {"date": "2010-06-15", "text": "If Sphinx-Bone Wand leaves the battlefield before its ability resolves, you won’t be able to put a charge counter on it. As a result, it won’t deal damage."}], "setCode": "ROE", "subtypes": [], "supertypes": [], "text": "Whenever you cast an instant or sorcery spell, you may put a charge counter on Sphinx-Bone Wand. If you do, Sphinx-Bone Wand deals damage equal to the number of charge counters on it to any target.", "type": "Artifact", "types": ["Artifact"], "uuid": "27f52867-06e3-50d0-8043-3a4a5deef695"}