{"artist": "Jim Nelson", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G", "U"], "colors": ["G", "U"], "convertedManaCost": 6.0, "edhrecRank": 3561, "finishes": ["nonfoil", "foil"], "flavorText": "Spitting is the customary greeting between a creature and its magical impostor.", "foreignData": [{"flavorText": "Bespucken ist die normale Begrüßung zwischen einer Kreatur und ihrem magischen Ebenbild.", "language": "German", "multiverseId": 181690, "name": "Aus dem Gesicht geschnitten", "text": "Bringe einen Spielstein ins Spiel, der eine Kopie einer Kreatur deiner Wahl ist.\nZurückverfolgen (Du kannst diese Karte aus deinem Friedhof spielen, indem du zusätzlich zu ihren anderen Kosten eine Länderkarte aus deiner Hand abwirfst.)", "type": "Hexerei"}, {"flavorText": "Escupir es el saludo acostumbrado entre una criatura y su impostor mágico.", "language": "Spanish", "multiverseId": 180790, "name": "Imagen escupidora", "text": "Pon en juego una ficha que es una copia de la criatura objetivo.\nDesandar. (Puedes jugar esta carta desde tu cementerio descartando una carta de tierra además de pagar sus otros costes.)", "type": "Conjuro"}, {"flavorText": "Une créature et son imposteur magique s'accueillent toujours l'un l'autre par un crachat.", "language": "French", "multiverseId": 181870, "name": "Portrait craché", "text": "Mettez en jeu un jeton qui est une copie de la créature ciblée.\nPistage (Vous pouvez jouer cette carte depuis votre cimetière en vous défaussant d'une carte de terrain en plus de payer ses autres coûts.)", "type": "Rituel"}, {"flavorText": "Sputare è il saluto abituale tra una creatura e il suo impostore magico.", "language": "Italian", "multiverseId": 181510, "name": "Immagine Sputata", "text": "Metti in gioco una pedina che è una copia di una creatura bersaglio.\nRievocare (Puoi giocare questa carta dal tuo cimitero scartando una carta terra oltre a pagare gli altri suoi costi.)", "type": "Stregoneria"}, {"flavorText": "瓜を投げあうのが、生き物と魔法の偽物とのよくある挨拶だ。", "language": "Japanese", "multiverseId": 181150, "name": "瓜二つ", "text": "クリーチャー１体を対象とし、それのコピーであるトークンを１体場に出す。\n回顧 （あなたはこのカードを、それの他のコストの支払いに追加して土地カードを１枚捨てることで、あなたの墓地からプレイしてもよい。）", "type": "ソーサリー"}, {"flavorText": "Cuspir é a saudação habitual entre uma criatura e seu impostor mágico.", "language": "Portuguese (Brazil)", "multiverseId": 182050, "name": "Cuspido e Escarrado", "text": "Coloque uma ficha em jogo que seja uma cópia da criatura alvo.\nRetraçar (Você pode jogar este card de seu cemitério descartando um card de terreno, além de pagar seus outros custos.)", "type": "Feitiço"}, {"flavorText": "Обмен плевками обычное приветствие между существом и его магическим двойником-самозванцем.", "language": "Russian", "multiverseId": 181330, "name": "Разительное Сходство", "text": "Положите в игру фишку, являющуюся копией целевого существа.\nВозвращение (Вы можете разыграть эту карту из вашего кладбища, сбросив карту земли в дополнение к оплате других ее стоимостей.)", "type": "Волшебство"}, {"flavorText": "生物碰上自己的法术假冒品时，通常会行互射口水之礼。", "language": "Chinese Simplified", "multiverseId": 180970, "name": "射影", "text": "将一个衍生物放置进场，此衍生物为目标生物之复制。\n追溯 （你可以从你的坟墓场使用此牌，但必须支付其所需费用，并额外弃掉一张地牌。）", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "125368", "cardKingdomId": "125148", "cardsphereId": "17104", "mcmId": "19624", "mcmMetaId": "10012", "mtgjsonV4Id": "ce73284b-0053-569b-b66c-fb4be3ba3935", "mtgoFoilId": "30147", "mtgoId": "30146", "multiverseId": "154261", "scryfallId": "a3d60c0c-1bc8-4962-9205-4645db7fb26e", "scryfallIllustrationId": "033fe12c-b648-4e96-b4d1-04d7dd3e992f", "scryfallOracleId": "a30dee74-86e3-4888-980e-b22437fbbb66", "tcgplayerProductId": "27210"}, "keywords": ["Retrace"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{G/U}{G/U}", "manaValue": 6.0, "name": "Spitting Image", "number": "162", "originalText": "Put a token into play that's a copy of target creature.\nRetrace (You may play this card from your graveyard by discarding a land card in addition to paying its other costs.)", "originalType": "Sorcery", "printings": ["C16", "C21", "CM2", "CMR", "EVE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/bfe1c88e888a7507", "cardKingdomFoil": "https://mtgjson.com/links/5a0586a14f7864ec", "cardmarket": "https://mtgjson.com/links/bb5dc928e0e3d759", "tcgplayer": "https://mtgjson.com/links/85e9064e47878ab1"}, "rarity": "rare", "rulings": [{"date": "2008-08-01", "text": "Casting a card by using its retrace ability works just like casting any other spell, with two exceptions: You’re casting it from your graveyard rather than your hand, and you must discard a land card in addition to any other costs."}, {"date": "2008-08-01", "text": "A retrace card cast from your graveyard follows the normal timing rules for its card type."}, {"date": "2008-08-01", "text": "When a retrace card you cast from your graveyard resolves, fails to resolve, or is countered, it’s put back into your graveyard. You may use the retrace ability to cast it again."}, {"date": "2008-08-01", "text": "If the active player casts a spell that has retrace, that player may cast that card again after it resolves, before another player can remove the card from the graveyard. The active player has priority after the spell resolves, so they can immediately cast a new spell. Since casting a card with retrace from the graveyard moves that card onto the stack, no one else would have the chance to affect it while it’s still in the graveyard."}, {"date": "2008-08-01", "text": "As the token is created, it checks the printed values of the creature it’s copying — or, if that creature is itself a token, the original characteristics of that token as stated by the effect that put it onto the battlefield — as well as any copy effects that have been applied to it. It won’t copy counters on the creature, nor will it copy other effects that have changed the creature’s power, toughness, types, color, or so on."}], "setCode": "EVE", "subtypes": [], "supertypes": [], "text": "Create a token that's a copy of target creature.\nRetrace (You may cast this card from your graveyard by discarding a land card in addition to paying its other costs.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "67411f74-afd0-5cb7-a679-7eaf4f1283de"}