{"artist": "Goran Josic", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 3705, "finishes": ["nonfoil", "foil"], "flavorText": "\"I know just the person for that job.\"", "foreignData": [{"flavorText": "„Ich kenne genau die richtige Person für diese Aufgabe.\"", "language": "German", "multiverseId": 217339, "name": "Zwillingsspreißel", "text": "Kreaturenverzauberung\nDie verzauberte Kreatur hat: „{T}: Bringe einen Spielstein ins Spiel, der eine Kopie dieser Kreatur ist. Dieser Spielstein hat Eile. Schicke ihn zu Beginn des nächsten Endsegments ins Exil.\"", "type": "Verzauberung — Aura"}, {"flavorText": "\"Conozco a la persona indicada para ese trabajo.\"", "language": "Spanish", "multiverseId": 217091, "name": "Gemelo astillado", "text": "Encantar criatura.\nLa criatura encantada tiene \"{T}: Pon en el campo de batalla una ficha que es una copia de esta criatura. Esa ficha tiene la habilidad de prisa. Exíliala al comienzo del próximo paso final\".", "type": "Encantamiento — Aura"}, {"flavorText": "« J'ai le candidat rêvé pour ce travail. »", "language": "French", "multiverseId": 215603, "name": "Jumeau par scission", "text": "Enchanter : créature\nLa créature enchantée a « {T} : Mettez sur le champ de bataille un jeton qui est une copie de cette créature. Ce jeton a la célérité. Exilez-le au début de la prochaine étape de fin. »", "type": "Enchantement : aura"}, {"flavorText": "\"Ho io la persona giusta!\"", "language": "Italian", "multiverseId": 216347, "name": "Gemellare", "text": "Incanta creatura\nLa creatura incantata ha \"{T}: Metti sul campo di battaglia una pedina che è una copia di questa creatura. Quella pedina ha rapidità. Esiliala all'inizio della prossima sottofase finale\".", "type": "Incantesimo — Aura"}, {"flavorText": "「その仕事専用の担当さ。」", "language": "Japanese", "multiverseId": 216595, "name": "欠片の双子", "text": "エンチャント（クリーチャー）\nエンチャントされているクリーチャーは「{T}：このクリーチャーのコピーであるトークンを１体戦場に出す。 そのトークンは速攻を持つ。 次の終了ステップの開始時に、それを追放する。」を持つ。", "type": "エンチャント — オーラ"}, {"flavorText": "\"Eu conheço a pessoa certa para aquele trabalho.\"", "language": "Portuguese (Brazil)", "multiverseId": 216843, "name": "Gêmea Estilhaçadora", "text": "Encantar criatura\nA criatura encantada tem \"{T}: Coloque no campo de batalha uma ficha que seja uma cópia desta criatura. Aquela ficha tem ímpeto. Exile-a no início da próxima etapa final.", "type": "Encantamento — Aura"}, {"flavorText": "«Я знаю подходящего человека для этого дела».", "language": "Russian", "multiverseId": 215851, "name": "Отщепление Двойника", "text": "Зачаровать существо\nЗачарованное существо имеет способность «{T}: положите на поле битвы фишку, являющуюся копией этого существа. Та фишка имеет Ускорение. Изгоните ее в начале следующего заключительного шага».", "type": "Чары — Аура"}, {"flavorText": "「我知道这事情最适合的人选。」", "language": "Chinese Simplified", "multiverseId": 216099, "name": "分裂双身", "text": "结附于生物\n所结附的生物具有「{T}：将一个衍生物放进战场，该衍生物为此生物之复制。 该衍生物具有敏捷异能。 在下一个结束步骤开始时，将它放逐。」", "type": "结界～灵气"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "130928", "cardKingdomId": "130676", "cardsphereId": "39779", "mcmId": "22374", "mcmMetaId": "11128", "mtgjsonV4Id": "c63fc062-992c-58d8-a3d1-ddcc3c6ed7c7", "mtgoFoilId": "36427", "mtgoId": "36426", "multiverseId": "193474", "scryfallId": "2f8f22fb-7291-4517-9b15-e98501f2856b", "scryfallIllustrationId": "c4ca3aa4-d8e8-454a-a82c-19c768a5f711", "scryfallOracleId": "2df3187b-4b91-4de9-9b26-d48a30700cec", "tcgplayerProductId": "34859"}, "keywords": ["Enchant"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Banned", "vintage": "Legal"}, "manaCost": "{2}{R}{R}", "manaValue": 4.0, "name": "Splinter Twin", "number": "165", "originalText": "Enchant creature\nEnchanted creature has \"{T}: Put a token that's a copy of this creature onto the battlefield. That token has haste. Exile it at the beginning of the next end step.\"", "originalType": "Enchantment — Aura", "printings": ["MM2", "PLIST", "ROE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/eab9b4df5f301496", "cardKingdomFoil": "https://mtgjson.com/links/a09f0eca173112f4", "cardmarket": "https://mtgjson.com/links/d5068e8b12743154", "tcgplayer": "https://mtgjson.com/links/877aa32c196aaa98"}, "rarity": "rare", "rulings": [{"date": "2010-06-15", "text": "The token that’s put onto the battlefield copies exactly what’s printed on the enchanted creature (unless that creature is copying something else or it’s a token; see below), plus it has haste. It doesn’t copy whether the enchanted creature is tapped or untapped, whether it has any counters on it or Auras attached to it, or whether it’s been affected by any noncopy effects that changed its power, toughness, types, color, or so on. In particular, it doesn’t copy the ability granted to the enchanted creature by Splinter Twin."}, {"date": "2010-06-15", "text": "If the enchanted creature is copying something else when the ability resolves (for example, if it’s a Renegade Doppelganger), then the token enters the battlefield as a copy of whatever the enchanted creature is copying, plus it has haste."}, {"date": "2010-06-15", "text": "If the enchanted creature is a token, the new token copies the characteristics of the original token as stated by the effect that put it onto the battlefield, plus it has haste."}, {"date": "2010-06-15", "text": "If the enchanted creature has {X} in its mana cost (such as Protean Hydra), X is considered to be zero."}, {"date": "2010-06-15", "text": "Any enters-the-battlefield abilities of the enchanted creature will trigger when the token is put onto the battlefield. Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities of the enchanted creature will also work."}, {"date": "2010-06-15", "text": "Splinter Twin grants an activated ability to the enchanted creature. That creature’s controller (who is not necessarily the Aura’s controller) can activate it. The creature’s controller is the player who gets the token."}, {"date": "2010-06-15", "text": "If you activate the ability and the enchanted creature leaves the battlefield before the ability resolves, you still get a token. The enchanted creature’s last existence on the battlefield is checked to see what it was (specifically, if it was itself or if it was copying something else)."}, {"date": "2010-06-15", "text": "The token is exiled at the beginning of the next end step regardless of who controls it at that time, or whether Splinter Twin or the enchanted creature is still on the battlefield at that time."}, {"date": "2010-06-15", "text": "If the ability is activated during a turn’s end step, the token will be exiled at the beginning of the following turn’s end step."}, {"date": "2010-06-15", "text": "If the token isn’t exiled when the delayed triggered ability resolves (due to Stifle, perhaps), it remains on the battlefield indefinitely. It continues to have haste."}, {"date": "2010-06-15", "text": "The token will not be kicked, even if the creature it’s copying was."}, {"date": "2013-07-01", "text": "If the enchanted creature is legendary, you will have to put either the original creature or the token into the graveyard as a state-based action."}], "setCode": "ROE", "subtypes": ["Aura"], "supertypes": [], "text": "Enchant creature\nEnchanted creature has \"{T}: Create a token that's a copy of this creature, except it has haste. Exile that token at the beginning of the next end step.\"", "type": "Enchantment — Aura", "types": ["Enchantment"], "uuid": "82526226-c84f-5167-8fd2-0c559b214e6c"}