{"artist": "Robbie Trevino", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 5444, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "267756", "cardsphereId": "94805", "mtgjsonV4Id": "075bed48-9af8-52e3-a944-58e97037e468", "multiverseId": "582649", "scryfallId": "14cc0679-50eb-43e7-8816-62dcbae222da", "scryfallIllustrationId": "72c25d67-620c-43c5-b656-a10839e325de", "scryfallOracleId": "5f725d51-e133-488c-9ca9-1c7b0523b5bd", "tcgplayerProductId": "448609"}, "isReprint": true, "isStarter": true, "keywords": ["Will of the council"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Split Decision", "number": "39", "originalText": "Will of the council — Choose target instant or sorcery spell. Starting with you, each player votes for denial or duplication. If denial gets more votes, counter the spell. If duplication gets more votes or the vote is tied, copy the spell. You may choose new targets for the copy.", "originalType": "Instant", "printings": ["CNS", "GN3"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/83c7c8db14e49ac3", "tcgplayer": "https://mtgjson.com/links/71b16daea51b3540"}, "rarity": "uncommon", "rulings": [{"date": "2014-05-29", "text": "If duplication gets more votes, Split Decision creates a copy of the spell. You control the copy. That copy is created on the stack, so it’s not “cast.” Abilities that trigger when a player casts a spell won’t trigger. The copy will resolve like a normal spell, after players get a chance to cast spells and activate abilities."}, {"date": "2014-05-29", "text": "The copy will have the same targets as the spell it’s copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can’t choose a new legal target, then it remains unchanged (even if the current target is illegal)."}, {"date": "2014-05-29", "text": "If the spell being copied is modal (that is, it says “Choose one —” or the like), the copy will have the same mode. You can’t choose a different one."}, {"date": "2014-05-29", "text": "If the spell being copied has an X whose value was determined as it was cast (like Skeletal Scrying has), the copy will have the same value of X."}, {"date": "2014-05-29", "text": "Effects based on any additional costs that were paid for the original spell will be copied as though those same costs were paid for the copy. For example, if a player exiles three cards from their graveyard to cast Skeletal Scrying, and you copy it, the copy will also cause you to draw three cards and lose 3 life (but you won’t exile any cards from your graveyard)."}, {"date": "2014-05-29", "text": "Because the votes are cast in turn order, each player will know the votes of players who voted beforehand."}, {"date": "2014-05-29", "text": "You must vote for one of the available options. You can’t abstain."}, {"date": "2014-05-29", "text": "No player votes until the spell or ability resolves. Any responses to that spell or ability must be made without knowing the outcome of the vote."}, {"date": "2014-05-29", "text": "Players can’t do anything after they finishing voting but before the spell or ability that included the vote finishes resolving."}, {"date": "2014-05-29", "text": "The phrase “the vote is tied” refers only to when there is more than one choice that received the most votes. For example, if a 5-player vote from among three different choices ends 3 votes to 1 vote to 1 vote, the vote isn’t tied."}], "setCode": "GN3", "subtypes": [], "supertypes": [], "text": "Will of the council — Choose target instant or sorcery spell. Starting with you, each player votes for denial or duplication. If denial gets more votes, counter the spell. If duplication gets more votes or the vote is tied, copy the spell. You may choose new targets for the copy.", "type": "Instant", "types": ["Instant"], "uuid": "642745fd-89be-560e-bb70-f63e4edf5c18"}