{"artist": "Michael Sutfin", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 2.0, "edhrecRank": 13434, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 154688, "name": "Frühjahrsputz", "text": "Zerstöre eine Verzauberung deiner Wahl. Befehde dich mit einem Gegner. Falls du die Fehde gewinnst, zerstöre alle Verzauberungen, die deine Gegner kontrollieren. (Jeder Spieler in einer Fehde deckt die oberste Karte seiner Bibliothek auf und legt diese Karte dann auf oder unter seine Bibliothek. Ein Spieler gewinnt die Fehde, wenn seine Karte die höheren umgewandelten Manakosten hat.)", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 156805, "name": "Limpieza de primavera", "text": "Destruye el encantamiento objetivo. Enfréntate con un oponente. Si ganas, destruye todos los encantamientos que controlan tus oponentes. (Cada jugador enfrentado muestra la primera carta de su biblioteca, luego pone esa carta en la parte superior o inferior. Gana el jugador cuya carta tenga el mayor coste de maná convertido.)", "type": "Instantáneo"}, {"language": "French", "multiverseId": 155601, "name": "Nettoyage de printemps", "text": "Détruisez l'enchantement ciblé. Confrontez un adversaire. Si vous gagnez, détruisez tous les enchantements que vos adversaires contrôlent. (Chaque joueur impliqué dans la confrontation révèle la carte du dessus de sa bibliothèque et met ensuite cette carte au-dessus ou au-dessous de celle-ci. Un joueur gagne si sa carte a un coût converti de mana plus élevé.)", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 155902, "name": "Pulizie di Primavera", "text": "Distruggi un incantesimo bersaglio. Scontrati con un avversario. Se vinci, distruggi tutti gli incantesimi controllati dai tuoi avversari. (Ogni giocatore che si scontra rivela la prima carta del suo grimorio, poi la mette in cima o in fondo. Un giocatore vince se la sua carta aveva un costo di mana convertito maggiore.)", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 156203, "name": "春の大掃除", "text": "エンチャント１つを対象とし、それを破壊する。 いずれかの対戦相手と激突を行う。 あなたが勝った場合、あなたの対戦相手がコントロールするすべてのエンチャントを破壊する。 （激突を行う各プレイヤーは、自分のライブラリーの一番上のカードを公開し、そのカードを一番上か一番下に置く。 自分のカードの点数で見たマナ・コストの方が大きいプレイヤーが勝つ。）", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 157106, "name": "Limpeza Primaveril", "text": "Destrua o encantamento alvo. Confronte um oponente. Se você vencer, destrua todos os encantamentos que seus oponentes controlam. (Cada jogador confrontante revela o card do topo de seu próprio grimório, e então coloca aquele card no topo ou no fundo deste. Vence o jogador que tiver o card com o maior custo de mana convertido.)", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 156504, "name": "Весенняя Уборка", "text": "Уничтожьте целевые чары. Столкнитесь с оппонентом. Если вы выиграли, уничтожьте все чары под контролем вашего оппонента. (Каждый сталкивающийся игрок показывает верхнюю карту своей библиотеки, затем кладет ту карту на верх или в низ своей библиотеки. Выигрывает тот игрок, чья карта имела большую конвертированную мана-стоимость.)", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 154989, "name": "春季扫除", "text": "消灭目标结界。 与一位对手比点。 若你赢，则消灭由所有对手操控的所有结界。 （参与比点的牌手各展示其牌库顶牌，然后将该牌置于牌库顶部或底部。 所展示的牌之总法术力费用比较高的牌手赢得比点。）", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "123851", "cardKingdomId": "123735", "cardsphereId": "25610", "mcmId": "17977", "mcmMetaId": "9347", "mtgjsonV4Id": "bbbe9cda-c662-54b8-9d80-9759debf8c64", "mtgoFoilId": "28718", "mtgoId": "28717", "multiverseId": "139489", "scryfallId": "dc20ef13-e97f-454c-8295-7bb8a7c4e4be", "scryfallIllustrationId": "af7ae804-c24d-4878-88b7-6f662b689ea7", "scryfallOracleId": "9b3b81cf-f020-4e1e-95c7-db44ca153dc1", "tcgplayerProductId": "15636"}, "keywords": ["Clash"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}", "manaValue": 2.0, "name": "Spring Cleaning", "number": "236", "originalText": "Destroy target enchantment. Clash with an opponent. If you win, destroy all enchantments your opponents control. (Each clashing player reveals the top card of his or her library, then puts that card on the top or bottom. A player wins if his or her card had a higher converted mana cost.)", "originalType": "Instant", "printings": ["LRW"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ea00d19bfd9075ad", "cardKingdomFoil": "https://mtgjson.com/links/6479126bc6eb704e", "cardmarket": "https://mtgjson.com/links/f987dd2a862f52a4", "tcgplayer": "https://mtgjson.com/links/4ae35e3f055c36b2"}, "rarity": "common", "rulings": [{"date": "2007-10-01", "text": "If you win the clash, you destroy all enchantments all of your opponents control, not just enchantments controlled by the opponent you clashed with."}, {"date": "2013-09-20", "text": "If you win the clash and the targeted enchantment is controlled by an opponent, it will be destroyed a second time if it’s still on the battlefield (for instance, if it somehow regenerated)."}], "setCode": "LRW", "subtypes": [], "supertypes": [], "text": "Destroy target enchantment. Clash with an opponent. If you win, destroy all enchantments your opponents control. (Each clashing player reveals the top card of their library, then puts that card on the top or bottom. A player wins if their card had a higher mana value.)", "type": "Instant", "types": ["Instant"], "uuid": "7abf6ff8-6e23-5b90-aa8c-c3cfe38952de"}