{"artist": "Brian Snõddy", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 21402, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 127348, "name": "Pirschender Yeti", "text": "Wenn der Pirschende Yeti ins Spiel kommt und falls er sich im Spiel befindet, fügt er einer Kreatur deiner Wahl, die ein Gegner kontrolliert, Schadenspunkte in Höhe seiner Stärke zu, und diese Kreatur fügt dem Pirschenden Yeti Schadenspunkte in Höhe ihrer Stärke zu.\n{2}{S}: Bringe den Pirschenden Yeti auf die Hand seines Besitzers zurück. Spiele diese Fähigkeit nur zu einem Zeitpunkt, zu dem du auch eine Hexerei spielen könntest. ({S} kann mit einem Mana von einer verschneiten Karte bezahlt werden.)", "type": "Verschneite Kreatur — Yeti"}, {"language": "Spanish", "multiverseId": 128123, "name": "Yeti acechante", "text": "Cuando el Yeti acechante entre en juego, si está en juego, hace daño igual a su fuerza a la criatura objetivo que controla un oponente y esa criatura hace daño igual a su fuerza al Yeti acechante.\n{2}{S}: Regresa el Yeti acechante a la mano de su propietario. Juega esta habilidad sólo cuando puedas jugar un conjuro. ({S} puede pagarse con un maná de un permanente nevado.)", "type": "Criatura nevada — Yeti"}, {"language": "French", "multiverseId": 127193, "name": "Yeti en chasse", "text": "Quand le Yeti en chasse arrive en jeu, s'il est en jeu, il inflige à la créature ciblée qu'un adversaire contrôle un nombre de blessures égal à sa force et cette créature inflige au Yeti en chasse un nombre de blessures égal à sa force.\n{2}{S} : Renvoyez le Yeti en chasse dans la main de son propriétaire. Ne jouez cette capacité que lorsque vous pourriez jouer un rituel. ({S} peut être payé avec un mana d'un permanent neigeux.)", "type": "Créature neigeuse : yeti"}, {"language": "Italian", "multiverseId": 127503, "name": "Yeti in Agguato", "text": "Quando lo Yeti in Agguato entra in gioco, se è in gioco, infligge un ammontare di danni pari alla propria forza a una creatura bersaglio controllata da un avversario e quella creatura infligge un ammontare di danni pari alla propria forza allo Yeti in Agguato.\n{2}{S}: Il proprietario riprende in mano lo Yeti in Agguato. Gioca questa abilità solo quando potresti giocare una stregoneria. ({S} può essere pagato con un mana da un permanente neve.)", "type": "Creatura Neve — Yeti"}, {"language": "Japanese", "multiverseId": 127658, "name": "忍び寄るイエティ", "text": "忍び寄るイエティが場に出たとき、いずれかの対戦相手がコントロールするクリーチャー１体を対象とする。忍び寄るイエティが場にある場合、それは自身のパワーに等しい点数のダメージをそのクリーチャーに与え、そのクリーチャーは自身のパワーに等しい点数のダメージを忍び寄るイエティに与える。\n{2}{S}：忍び寄るイエティをオーナーの手札に戻す。 この能力は、あなたがソーサリーをプレイできるときにのみプレイできる。 （{S}は氷雪パーマネントからのマナ１点で支払える。）", "type": "氷雪クリーチャー — イエティ"}, {"language": "Portuguese (Brazil)", "multiverseId": 127813, "name": "Yeti Caçador", "text": "Quando Yeti Caçador entra em jogo, se estiver em jogo, ele causa dano igual ao seu poder à criatura alvo que um oponente controla, e aquela criatura causa dano igual ao seu poder a Yeti Caçador.\n{2}{S}: Devolva Yeti Caçador para a mão de seu dono. Use esta habilidade somente quando puder jogar um feitiço. ({S} pode ser pago com um mana de uma permanente da neve.)", "type": "Criatura da Neve — Yeti"}, {"language": "Chinese Simplified", "multiverseId": 127038, "name": "潜行雪怪", "text": "当潜行雪怪进场时，若它在场，则潜行雪怪对目标由对手操控的生物造成等同于潜行雪怪力量的伤害。该生物对潜行雪怪造成等同于该生物力量的伤害。\n{2}{S}：将潜行雪怪移回其拥有者手上。 你只可以于你能使用法术的时机下使用此异能。 （{S}能以产自雪境永久物的一点法术力来支付。）", "type": "雪境生物～雪怪"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "120993", "cardKingdomId": "120838", "cardsphereId": "8776", "mcmId": "13729", "mcmMetaId": "8276", "mtgjsonV4Id": "7d584f1c-0319-5429-a3dc-17af801b8108", "mtgoFoilId": "24778", "mtgoId": "24777", "multiverseId": "122046", "scryfallId": "4af53d0b-ac60-4519-a6f4-c67899bcfdd6", "scryfallIllustrationId": "7ecbe637-8457-45ae-b61f-d77ea8263386", "scryfallOracleId": "e79e67db-3f2e-4002-9e6c-8f06ca9d8af4", "tcgplayerProductId": "14122"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}{R}", "manaValue": 4.0, "name": "Stalking Yeti", "number": "98", "originalText": "When Stalking Yeti comes into play, if it's in play, it deals damage equal to its power to target creature an opponent controls and that creature deals damage equal to its power to Stalking Yeti.\n{2}{S}: Return Stalking Yeti to its owner's hand. Play this ability only any time you could play a sorcery. ({S} can be paid with one mana from a snow permanent.)", "originalType": "Snow Creature - Yeti", "power": "3", "printings": ["CSP"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/3b218bcb920d3e37", "cardKingdomFoil": "https://mtgjson.com/links/8cee8bfe5f6a8601", "cardmarket": "https://mtgjson.com/links/c626966ed5a0dff2", "tcgplayer": "https://mtgjson.com/links/2d9d9c9478ca647f"}, "rarity": "uncommon", "rulings": [{"date": "2006-07-15", "text": "If either Stalking Yeti or the targeted creature is no longer on the battlefield when the enters-the-battlefield triggered ability resolves, the ability does nothing."}], "setCode": "CSP", "subtypes": ["Yeti"], "supertypes": ["Snow"], "text": "When Stalking Yeti enters the battlefield, if it's on the battlefield, it deals damage equal to its power to target creature an opponent controls and that creature deals damage equal to its power to Stalking Yeti.\n{2}{S}: Return Stalking Yeti to its owner's hand. Activate only as a sorcery. ({S} can be paid with one mana from a snow source.)", "toughness": "3", "type": "Snow Creature — Yeti", "types": ["Creature"], "uuid": "aa6dd436-ffc4-594b-8975-16689213c1c0"}