{"artist": "Carl Frank", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 5.0, "edhrecRank": 14820, "finishes": ["nonfoil", "foil"], "flavorText": "The Atarka use them not just for food, but also to clear away snow, trees, and enemy forces.", "foreignData": [{"flavorText": "Sie dienen den Atarka nicht nur als Nahrung, sondern räumen auch Schnee, Bäume und Feinde aus dem Weg.", "language": "German", "multiverseId": 395502, "name": "Panische Elchherde", "text": "Gewaltig — Immer wenn die Panische Elchherde angreift und falls die Kreaturen, die du kontrollierst, eine Gesamtstärke von 8 oder mehr haben, verursachen Kreaturen, die du kontrollierst, Trampelschaden bis zum Ende des Zuges.", "type": "Kreatur — Hirsch"}, {"flavorText": "Los Atarka no solo los utilizan como comida, sino también para despejar el camino de nieve, árboles y ejércitos enemigos.", "language": "Spanish", "multiverseId": 397350, "name": "Estampida de alces", "text": "Formidable — Siempre que la Estampida de alces ataque, si las criaturas que controlas tienen una fuerza total de 8 o más, las criaturas que controlas ganan la habilidad de arrollar hasta el final del turno.", "type": "Criatura — Alce"}, {"flavorText": "Les Atarka ne s'en servent pas que pour se nourrir, mais aussi pour déblayer la neige, les arbres et les forces ennemies.", "language": "French", "multiverseId": 395766, "name": "Ruée de troupeau d'élans", "text": "Redoutable — À chaque fois que la Ruée de troupeau d'élans attaque, si les créatures que vous contrôlez ont une force totale supérieure ou égale à 8, les créatures que vous contrôlez acquièrent le piétinement jusqu'à la fin du tour.", "type": "Créature : élan"}, {"flavorText": "Gli Atarka li sfruttano non solo come cibo, ma anche per spazzare via neve, alberi e nemici.", "language": "Italian", "multiverseId": 396030, "name": "Mandria di Alci Scalpitanti", "text": "Formidabile — Ogniqualvolta la Mandria di Alci Scalpitanti attacca, se le creature che controlli hanno una forza totale pari o superiore a 8, le creature che controlli hanno travolgere fino alla fine del turno.", "type": "Creatura — Alce"}, {"flavorText": "アタルカの者たちは彼らを食料として活用するだけでなく、雪や木、そして敵の軍勢を一掃するのにも利用している。", "language": "Japanese", "multiverseId": 396294, "name": "突進する大鹿の群れ", "text": "圧倒 ― 突進する大鹿の群れが攻撃するたび、あなたがコントロールするクリーチャーのパワーの合計が８以上である場合、ターン終了時まであなたがコントロールするクリーチャーはトランプルを得る。", "type": "クリーチャー — 大鹿"}, {"flavorText": "아타르카 사람들은 엘크를 잡아먹기만 한느 것이 아니라 엘크로 눈을 치우고 나무를 베고 적을 몰아낸다.", "language": "Korean", "multiverseId": 396558, "name": "달려드는 엘크 무리", "text": "강대 — 달려드는 엘크 무리가 공격할 때마다, 당신이 조종하는 생물들의 공격력 총합이 8 이상이라면, 당신이 조종하는 생물들은 턴종료까지 돌진을 얻는다.", "type": "생물 — 엘크"}, {"flavorText": "Os Atarka os usam não só para comer, mas também para varrer neve, árvores e tropas inimigas do caminho.", "language": "Portuguese (Brazil)", "multiverseId": 396822, "name": "Rebanho de Alces Galopantes", "text": "Formidável — Toda vez que Rebanho de Alces Galopantes ataca, se o total de poder das criaturas que você controla for igual ou superior a 8, as criaturas que você controla ganham iniciativa até o final do turno.", "type": "Criatura — Alce"}, {"flavorText": "Атаркцы используют их не только в качестве пищи. Они посылают оленей вперед, чтобы расчистить снег, деревья или войско врага.", "language": "Russian", "multiverseId": 397086, "name": "Несущийся Табун Оленей", "text": "Внушительность — Каждый раз, когда Несущийся Табун Оленей атакует, если сумма значений силы существ под вашим контролем равна 8 или больше, существа под вашим контролем получают Пробивной удар до конца хода.", "type": "Существо — Вапити"}, {"flavorText": "安塔卡族不仅把它们当食物，而且用它们清除积雪、树木和敌人的军队。", "language": "Chinese Simplified", "multiverseId": 394974, "name": "狂奔麋鹿群", "text": "强横～每当狂奔麋鹿群攻击时，若由你操控之生物的力量总和等于或大于8，由你操控的生物获得践踏异能直到回合结束。", "type": "生物～麋鹿"}, {"flavorText": "安塔卡族不僅把牠們當食物，而且用牠們清除積雪、樹木和敵人的軍隊。", "language": "Chinese Traditional", "multiverseId": 395238, "name": "狂奔麋鹿群", "text": "強橫～每當狂奔麋鹿群攻擊時，若由你操控之生物的力量總和等於或大于于8，由你操控的生物獲得踐踏異能直到回合結束。", "type": "生物～麋鹿"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "199719", "cardKingdomId": "199287", "cardsphereId": "14009", "mcmId": "273086", "mcmMetaId": "211137", "mtgjsonV4Id": "e4feb226-1c61-5ceb-bfbd-94117980ade6", "mtgoFoilId": "56137", "mtgoId": "56136", "multiverseId": "394710", "scryfallId": "7e55e213-6eab-4086-96cd-024de6150fbe", "scryfallIllustrationId": "2c7a7ca8-c28c-42ee-bb46-12d1c28929c0", "scryfallOracleId": "fc1020b7-086e-41d6-a9ae-1c6c72cf820c", "tcgplayerProductId": "96367"}, "keywords": ["Formidable"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{G}{G}", "manaValue": 5.0, "name": "Stampeding Elk Herd", "number": "208", "originalText": "Formidable — Whenever Stampeding Elk Herd attacks, if creatures you control have total power 8 or greater, creatures you control gain trample until end of turn.", "originalType": "Creature — Elk", "power": "5", "printings": ["DTK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/fb5d394b4b42ab27", "cardKingdomFoil": "https://mtgjson.com/links/991c87e5d4a92818", "cardmarket": "https://mtgjson.com/links/a14ed6f7ddfcc334", "tcgplayer": "https://mtgjson.com/links/8187759137485a04"}, "rarity": "common", "rulings": [{"date": "2015-02-25", "text": "If you control a creature with power less than 0, use its actual power when calculating the total power of creatures you control. For example, if you control three creatures with powers 4, 5, and -2, the total power of creatures you control is 7."}, {"date": "2015-02-25", "text": "Some formidable abilities are activated abilities that require creatures you control to have total power 8 or greater. Once you activate these abilities, it doesn’t matter what happens to the total power of creatures you control."}, {"date": "2015-02-25", "text": "Other formidable abilities are triggered abilities with an “intervening ‘if’” clause. Such abilities check the total power of creatures you control twice: once at the appropriate time to see if the ability will trigger, and again as the ability tries to resolve. If, at that time, the total power of creatures you control is no longer 8 or greater, the ability will have no effect."}], "setCode": "DTK", "subtypes": ["Elk"], "supertypes": [], "text": "Formidable — Whenever Stampeding Elk Herd attacks, if creatures you control have total power 8 or greater, creatures you control gain trample until end of turn.", "toughness": "5", "type": "Creature — Elk", "types": ["Creature"], "uuid": "8afec94e-8803-5fc9-9aec-6c8e21cb3946", "watermark": "atarka"}