{"artist": "Josh Hass", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 17771, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 583873, "name": "Statisches Netz", "text": "Wenn das Statische Netz ins Spiel kommt, schicke eine bleibende Karte deiner Wahl, die kein Land ist und die ein Gegner kontrolliert, ins Exil, bis das Statische Netz das Spiel verlässt.\nWenn das Statische Netz ins Spiel kommt, erhältst du 2 Lebenspunkte dazu und erzeugst einen getappten Kraftstein-Spielstein. (Er ist ein Artefakt mit „{T}: Erzeuge {C}. Dieses Mana kann nicht ausgegeben werden, um einen Nichtartefakt-Zauberspruch zu wirken.\")", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 584134, "name": "Red estática", "text": "Cuando la Red estática entre al campo de batalla, exilia el permanente objetivo que no sea tierra que controla un oponente hasta que la Red estática deje el campo de batalla.\nCuando la Red estática entre al campo de batalla, ganas 2 vidas y creas una ficha de Piedra de poder girada. (Es un artefacto con \"{T}: Agrega {C}. Este maná no se puede usar para lanzar hechizos que no sean de artefacto\".)", "type": "Encantamiento"}, {"language": "French", "multiverseId": 584395, "name": "Filet statique", "text": "Quand le Filet statique arrive sur le champ de bataille, exilez un permanent non-terrain ciblé qu'un adversaire contrôle jusqu'à ce que le Filet statique quitte le champ de bataille.\nQuand le Filet statique arrive sur le champ de bataille, vous gagnez 2 points de vie et vous créez un jeton Lithoforce engagé. (C'est un artefact avec « {T} : Ajoutez {C}. Ce mana ne peut pas être dépensé pour lancer un sort non-artefact. »)", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 584656, "name": "Rete Statica", "text": "Quando la Rete Statica entra nel campo di battaglia, esilia un permanente non terra bersaglio controllato da un avversario finché la Rete Statica non lascia il campo di battaglia.\nQuando la Rete Statica entra nel campo di battaglia, guadagni 2 punti vita e crei una pedina Pietra del Potere TAPpata. (È un artefatto con \"{T}: Aggiungi {C}. Questo mana non può essere speso per lanciare una magia non artefatto\".)", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 584917, "name": "静止網", "text": "静止網が戦場に出たとき、対戦相手がコントロールしていて土地でないパーマネント１つを対象とする。それを、静止網が戦場を離れるまで追放する。\n静止網が戦場に出たとき、あなたは２点のライフを得、パワーストーン・トークン１つをタップ状態で生成する。（それは、「{T}：{C}を加える。このマナはアーティファクトでない呪文を唱えるためには支払えない。」を持つアーティファクトである。）", "type": "エンチャント"}, {"language": "Portuguese (Brazil)", "multiverseId": 585178, "name": "Rede Estática", "text": "Quando Rede Estática entrar no campo de batalha, exile a permanente alvo não de terreno que um oponente controla até que Rede Estática deixe o campo de batalha.\nQuando Rede Estática entra no campo de batalha, você ganha 2 pontos de vida e cria uma ficha de Pedra de Energia virada. (Ela é um artefato com \"{T}: Adicione {C}. Este mana não pode ser gasto para conjurar uma mágica não de artefato\".)", "type": "Encantamento"}, {"language": "Chinese Simplified", "multiverseId": 585439, "name": "静态网", "text": "当静态网进战场时，放逐目标由对手操控的非地永久物，直到静态网离开战场为止。\n当静态网进战场时，你获得2点生命并派出一个已横置的魔力石衍生物。（它是具有「{T}：加{C}。此法术力不能用来施放非神器咒语」的神器。）", "type": "结界"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "269122", "cardKingdomId": "268812", "cardsphereId": "95291", "mcmId": "683306", "mcmMetaId": "414047", "mtgArenaId": "82511", "mtgjsonV4Id": "6df8ce59-a6aa-5a2d-8a01-7e7446104e4f", "mtgoId": "104672", "multiverseId": "583612", "scryfallId": "5ab5cb30-3ced-4450-a3c4-b519f3762620", "scryfallIllustrationId": "b95e0404-85e2-4e94-b622-fd3453216869", "scryfallOracleId": "3f285781-ee03-4a58-a85e-a33f5efffc9d", "tcgplayerProductId": "452637"}, "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}", "manaValue": 4.0, "name": "Static Net", "number": "27", "originalText": "When Static Net enters the battlefield, exile target nonland permanent an opponent controls until Static Net leaves the battlefield.\nWhen Static Net enters the battlefield, you gain 2 life and create a tapped Powerstone token. (It's an artifact with \"{T}: Add {C}. This mana can't be spent to cast a nonartifact spell.\")", "originalType": "Enchantment", "printings": ["BRO"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1f57f9db35ea9730", "cardKingdomFoil": "https://mtgjson.com/links/99ab994faff1636d", "cardmarket": "https://mtgjson.com/links/bf3138066c240f6b", "tcgplayer": "https://mtgjson.com/links/116cdd9bd3d13638"}, "rarity": "uncommon", "rulings": [{"date": "2022-10-14", "text": "Static Net’s first ability creates two one-shot effects: one that exiles the permanent when the ability resolves, and another that returns the exiled card to the battlefield immediately after Static Net leaves the battlefield."}, {"date": "2022-10-14", "text": "If Static Net leaves the battlefield before its first ability resolves, the target permanent won’t be exiled."}, {"date": "2022-10-14", "text": "Auras attached to the exiled permanent will be put into their owners’ graveyards. Equipment attached to an exiled creature will become unattached and remain on the battlefield. Any counters on the exiled permanent will cease to exist."}, {"date": "2022-10-14", "text": "If a token is exiled, it ceases to exist. It won’t be returned to the battlefield."}, {"date": "2022-10-14", "text": "In a multiplayer game, if Static Net’s owner leaves the game, the exiled card will return to the battlefield. Because the one-shot effect that returns the card isn’t an ability that goes on the stack, it won’t cease to exist along with the leaving player’s spells and abilities on the stack."}, {"date": "2022-10-14", "text": "Powerstone tokens are a kind of predefined token. Each one has the artifact subtype “Powerstone” and the ability “{T}: Add {C}. This mana can’t be spent to cast a nonartifact spell.”"}, {"date": "2022-10-14", "text": "You can use the {C} added by a Powerstone token on anything that isn’t a nonartifact spell. This includes paying costs to activate abilities of both artifact and nonartifact permanents, paying ward costs, and so on."}, {"date": "2022-10-14", "text": "Although all the cards in The Brothers’ War that create Powerstone tokens create a tapped Powerstone token, entering the battlefield tapped isn’t part of the token’s definition. Notably, if you create a token that is a copy of a Powerstone token, the token copy won’t enter the battlefield tapped."}], "setCode": "BRO", "subtypes": [], "supertypes": [], "text": "When Static Net enters the battlefield, exile target nonland permanent an opponent controls until Static Net leaves the battlefield.\nWhen Static Net enters the battlefield, you gain 2 life and create a tapped Powerstone token. (It's an artifact with \"{T}: Add {C}. This mana can't be spent to cast a nonartifact spell.\")", "type": "Enchantment", "types": ["Enchantment"], "uuid": "09371945-5baf-5ec4-8f9c-7836bfe41789"}