{"artist": "Willian Murai", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 3263, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 545882, "name": "Maskenspiel in Stenzen", "text": "Angreifende Kreaturen, die du kontrollierst, haben Erstschlag.\nImmer wenn ein Vampir, den du kontrollierst, einem Spieler Kampfschaden zufügt, lege eine +1/+1-Marke auf ihn.\nWahnsinn {2}{R} (Falls du diese Karte abwirfst, wirf sie ins Exil ab. Wenn du dies tust, wirke sie für ihre Wahnsinn-Kosten oder lege sie auf deinen Friedhof.)", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 545994, "name": "Mascarada de Stensia", "text": "Las criaturas atacantes que controlas tienen la habilidad de dañar primero.\nSiempre que un Vampiro que controlas haga daño de combate a un jugador, pon un contador +1/+1 sobre él.\nDemencia {2}{R}. (Si descartas esta carta, exíliala. Cuando lo hagas, lánzala por su coste de demencia o ponla en tu cementerio.)", "type": "Encantamiento"}, {"language": "French", "multiverseId": 546106, "name": "Mascarade stensienne", "text": "Les créatures attaquantes que vous contrôlez ont l'initiative.\nÀ chaque fois qu'un vampire que vous contrôlez inflige des blessures de combat à un joueur, mettez un marqueur +1/+1 sur lui.\nFolie {2}{R} (Si vous vous défaussez de cette carte, défaussez-vous en vers l'exil. Quand vous faites ainsi, lancez-la pour son coût de folie ou mettez-la dans votre cimetière.)", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 546218, "name": "Ballo in Maschera di Stensia", "text": "Le creature attaccanti che controlli hanno attacco improvviso.\nOgniqualvolta un Vampiro che controlli infligge danno da combattimento a un giocatore, metti un segnalino +1/+1 su quel Vampiro.\nFollia {2}{R} (Se scarti questa carta, scartala in esilio. Quando lo fai, lanciala pagando il suo costo di follia o mettila nel tuo cimitero.)", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 546330, "name": "ステンシア仮面舞踏会", "text": "あなたがコントロールしているすべての攻撃クリーチャーは先制攻撃を持つ。\nあなたがコントロールしている吸血鬼１体がプレイヤー１人に戦闘ダメージを与えるたび、それの上に＋１/＋１カウンター１個を置く。\nマッドネス{2}{R}（あなたがこのカードを捨てるなら、これを追放領域に捨てる。そうしたとき、マッドネス・コストでこれを唱えるか、これをあなたの墓地に置く。）", "type": "エンチャント"}, {"language": "Portuguese (Brazil)", "multiverseId": 546442, "name": "Baile de Máscaras de Stensia", "text": "As criaturas atacantes que você controla têm iniciativa.\nToda vez que um Vampiro que você controla causar dano de combate a um jogador, coloque um marcador +1/+1 nele.\nLoucura {2}{R} (Se você descartar este card, descarte-o para o exílio. Quando fizer isso, conjure-o por seu custo de loucura ou coloque-o em seu cemitério.)", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 546554, "name": "Маскарад в Стенсии", "text": "Атакующие существа под вашим контролем имеют Первый удар.\nКаждый раз, когда Вампир под вашим контролем наносит боевые повреждения игроку, положите на него один жетон +1/+1.\nБешенство {2}{R} (Если вы сбрасываете эту карту, сбросьте ее в изгнание. Когда вы это делаете, разыграйте ее за ее стоимость Бешенства или положите на ваше кладбище.)", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 546666, "name": "史顿襄舞会", "text": "由你操控且进行攻击的生物具有先攻异能。\n每当一个由你操控的吸血鬼对任一牌手造成战斗伤害时，在其上放置一个+1/+1指示物。\n疯魔{2}{R}（如果你弃掉此牌，将之弃到放逐区。当你如此作时，支付其疯魔费用施放之，否则便将其置入你的坟墓场。）", "type": "结界"}, {"language": "Chinese Traditional", "multiverseId": 546778, "name": "史頓襄舞會", "text": "由你操控且進行攻擊的生物具有先攻異能。\n每當一個由你操控的吸血鬼對任一玩家造成戰鬥傷害時，在其上放置一個+1/+1指示物。\n瘋魔{2}{R}（如果你棄掉此牌，將之棄到放逐區。當你如此作時，支付其瘋魔費用施放之，否則便將其置入你的墳墓場。）", "type": "結界"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "253497", "cardsphereId": "82482", "mcmId": "584130", "mtgjsonV4Id": "ebdc4322-d5e5-5e57-a30a-836af4988981", "multiverseId": "545770", "scryfallId": "12ea7e21-b500-47cb-807a-a0849038fd56", "scryfallIllustrationId": "2d67bd2b-d86d-47e1-b6ea-c1bee49986cd", "scryfallOracleId": "88f5d146-420b-417c-bcf1-fe0e78312a74", "tcgplayerProductId": "254430"}, "isReprint": true, "isStarter": true, "keywords": ["Madness"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}", "manaValue": 3.0, "name": "Stensia Masquerade", "number": "150", "originalText": "Attacking creatures you control have first strike.\nWhenever a Vampire you control deals combat damage to a player, put a +1/+1 counter on it.\nMadness {2}{R} (If you discard this card, discard it into exile. When you do, cast it for its madness cost or put it into your graveyard.)", "originalType": "Enchantment", "printings": ["SOI", "VOC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/4ab4ae9f7dc66a00", "tcgplayer": "https://mtgjson.com/links/772e83abc1dee7c6"}, "rarity": "uncommon", "rulings": [{"date": "2016-04-08", "text": "Losing or gaining first strike after first-strike damage has been dealt won't cause a creature to deal combat damage twice or to not deal combat damage."}, {"date": "2016-04-08", "text": "Cards are discarded in a Magic game only from a player's hand. Effects that put cards from a player's library into that player's graveyard do not cause those cards to be discarded."}, {"date": "2016-04-08", "text": "A spell cast for its madness cost is put onto the stack like any other spell. It can be countered, copied, and so on. As it resolves, it's put onto the battlefield if it's a permanent card or into its owner's graveyard if it's an instant or sorcery card."}, {"date": "2016-04-08", "text": "Casting a spell for its madness cost doesn't change its mana cost or its mana value. You just pay the madness cost instead."}, {"date": "2016-04-08", "text": "Effects that cause you to pay more or less for a spell will cause you to pay that much more or less for its madness cost, too."}, {"date": "2016-04-08", "text": "Madness works independently of why you're discarding the card. You could discard it to pay a cost, because a spell or ability tells you to, or even because you have too many cards in your hand at the end of your turn. You can't discard a card with madness just because you want to, though."}, {"date": "2016-04-08", "text": "When you cast a card with madness, it was still discarded. If it was discarded to pay a cost, that cost is still paid. Abilities that trigger when a card is discarded will still trigger."}, {"date": "2016-04-08", "text": "If you choose not to cast a card with madness when the madness triggered ability resolves, it's put into your graveyard. You don't get another chance to cast it later."}, {"date": "2016-04-08", "text": "If you discard a card with madness to pay the cost of a spell or activated ability, that card's madness trigger (and the spell that card becomes, if you choose to cast it) will resolve before the spell or ability the discard paid for."}, {"date": "2016-04-08", "text": "If you discard a card with madness while resolving a spell or ability, it moves immediately to exile. Continue resolving that spell or ability—the card is not in your graveyard at this time. Its madness trigger will be placed onto the stack once that spell or ability has completely resolved."}], "setCode": "VOC", "subtypes": [], "supertypes": [], "text": "Attacking creatures you control have first strike.\nWhenever a Vampire you control deals combat damage to a player, put a +1/+1 counter on it.\nMadness {2}{R} (If you discard this card, discard it into exile. When you do, cast it for its madness cost or put it into your graveyard.)", "type": "Enchantment", "types": ["Enchantment"], "uuid": "140ce017-7e25-5323-b0c5-dc154289159f"}