{"artist": "Raluca Marinescu", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 9633, "finishes": ["nonfoil", "foil"], "flavorText": "At the first sign of danger, she breaks out the power chords.", "foreignData": [{"flavorText": "Beim ersten Anzeichen von Gefahr spielt sie die Akkorde der Macht.", "language": "German", "multiverseId": 563438, "name": "Mitreißende Bardin", "text": "Verteidiger\nWenn die Mitreißende Bardin ins Spiel kommt, übernimmst du die Initiative.\nMantel der Inspiration — {T}: Eine Kreatur deiner Wahl erhält Bedrohlichkeit und Eile bis zum Ende des Zuges.", "type": "Kreatur — Drache, Barde"}, {"flavorText": "Desata el poder de las cuerdas ante el mínimo indicio de peligro.", "language": "Spanish", "multiverseId": 563798, "name": "Bardo alentadora", "text": "Defensor.\nCuando la Bardo alentadora entre al campo de batalla, tomas la iniciativa.\nManto de inspiración — {T}: La criatura objetivo gana las habilidades de amenaza y prisa hasta el final del turno.", "type": "Criatura — Bardo dragón"}, {"flavorText": "Au premier signe de danger, elle se lance dans une fugue en accord majeur.", "language": "French", "multiverseId": 564158, "name": "Barde poignante", "text": "Défenseur\nQuand la Barde poignante arrive sur le champ de bataille, vous prenez l'initiative.\nManteau d'inspiration — {T} : Une créature ciblée acquiert la menace et la célérité jusqu'à la fin du tour.", "type": "Créature : dragon et barde"}, {"flavorText": "Al primo segnale di pericolo, intona gli accordi potenti.", "language": "Italian", "multiverseId": 564518, "name": "Bardo Ridestante", "text": "Difensore\nQuando il Bardo Ridestante entra nel campo di battaglia, prendi l'iniziativa.\nManto di Ispirazione — {T}: Una creatura bersaglio ha minacciare e rapidità fino alla fine del turno.", "type": "Creatura — Bardo Drago"}, {"flavorText": "危険を察するやいなや、彼女は激しく力の音色をかき鳴らす。", "language": "Japanese", "multiverseId": 564878, "name": "奮起させるバード", "text": "防衛\n奮起させるバードが戦場に出たとき、あなたはイニシアチブを得る。\n声援の装い ― {T}：クリーチャー１体を対象とする。ターン終了時まで、それは威迫と速攻を得る。", "type": "クリーチャー — ドラゴン・バード"}, {"flavorText": "위험을 알리는 첫 신호를 마주했을 때, 그녀는 힘의 선율을 퉁겨냈다.", "language": "Korean", "multiverseId": 565238, "name": "마음을 휘젓는 바드", "text": "수비태세\n마음을 휘젓는 바드가 전장에 들어올 때, 당신이 이니셔티브를 차지한다.\n고양감의 망토 — {T}: 생물을 목표로 정한다. 그 생물은 턴종료까지 호전적 및 신속을 얻는다.", "type": "생물 — 용 음유시인"}, {"flavorText": "Ao primeiro sinal de perigo, ela toca os acordes potentes.", "language": "Portuguese (Brazil)", "multiverseId": 565598, "name": "Barda Despertadora", "text": "Defensor\nQuando Barda Despertadora entra no campo de batalha, você assume a dianteira.\nManto da inspiração — {T}: A criatura alvo ganha ameaçar e ímpeto até o final do turno.", "type": "Criatura — Dragão Bardo"}, {"flavorText": "При первых признаках опасности она берет мощные аккорды.", "language": "Russian", "multiverseId": 565958, "name": "Пробуждающий Бард", "text": "Защитник\nКогда Пробуждающий Бард выходит на поле битвы, вы получаете инициативу.\nПокров вдохновения — {T}: целевое существо получает Угрозу и Ускорение до конца хода.", "type": "Существо — Дракон Бард"}, {"flavorText": "一察觉危险，她就会奏出强力和弦。", "language": "Chinese Simplified", "multiverseId": 566318, "name": "振奋吟游诗人", "text": "守军\n当振奋吟游诗人进战场时，你掌握先制。\n激励光环～{T}：目标生物获得威慑与敏捷异能直到回合结束。", "type": "生物 ～龙／诗人"}, {"flavorText": "一察覺危險，她就會奏出強力和弦。", "language": "Chinese Traditional", "multiverseId": 566678, "name": "振奮吟遊詩人", "text": "守軍\n當振奮吟遊詩人進戰場時，你掌握先制。\n激勵光環～{T}：目標生物獲得威懾與敏捷異能直到回合結束。", "type": "生物 ～龍／詩人"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "261696", "cardKingdomId": "261303", "cardsphereId": "89203", "mcmId": "660897", "mcmMetaId": "408711", "mtgjsonV4Id": "016f591d-cdd4-5748-897f-6afdb749de69", "mtgoId": "100414", "multiverseId": "563078", "scryfallId": "d06d9d83-d1e6-4499-a1ac-6f865159f6b6", "scryfallIllustrationId": "128898a0-ef8e-4bb4-ba57-79e7ea2284e4", "scryfallOracleId": "2583836d-7fd3-47b3-9b69-6814efe54a90", "tcgplayerProductId": "273341"}, "keywords": ["Defender", "Mantle of Inspiration"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "pauper": "Banned", "paupercommander": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}", "manaValue": 4.0, "name": "Stirring Bard", "number": "195", "originalText": "Defender\nWhen Stirring Bard enters the battlefield, you take the initiative.\nMantle of Inspiration — {T}: Target creature gains menace and haste until end of turn.", "originalType": "Creature — Dragon Bard", "power": "0", "printings": ["CLB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/48ffddfeb8028750", "cardKingdomFoil": "https://mtgjson.com/links/7ff0247c85ef22b2", "cardmarket": "https://mtgjson.com/links/ef092a0c6a013f1b", "tcgplayer": "https://mtgjson.com/links/c75ccab46186a878"}, "rarity": "common", "rulings": [{"date": "2022-06-10", "text": "The initiative is a designation a player can have. A player with the initiative designation is said to “have the initiative.” The initiative carries two inherent rules. First, whenever a player takes the initiative, and at the beginning of the upkeep of the player with the initiative, that player ventures into Undercity. Second, whenever one or more creatures a player controls deal combat damage to the player who has the initiative, the first player takes the initiative. Also, some abilities will refer to having the initiative and provide other benefits."}, {"date": "2022-06-10", "text": "There is no initiative in a game until an effect instructs a player to take the initiative. Once a player is instructed to do this, they have the initiative until another player takes the initiative."}, {"date": "2022-06-10", "text": "Only one player can have the initiative at a time. As one player takes the initiative, any other player that had the initiative ceases to have it."}, {"date": "2022-06-10", "text": "A player who currently has the initiative may take the initiative again. This causes that player to venture into Undercity again, but does not cause them to have multiple initiative designations."}, {"date": "2022-06-10", "text": "If the player with the initiative leaves the game, the active player takes the initiative at the same time that player leaves the game. If the active player is leaving the game or if there is no active player, the next player in turn order takes the initiative."}, {"date": "2022-06-10", "text": "In a Two-Headed Giant game, if both players on a team deal combat damage to the player that has the initiative at the same time, the player with the initiative will choose the order of the triggered abilities. Then, as those abilities resolve, one team member takes the initiative (and ventures into Undercity) and then the other team member does the same. The last player to take the initiative keeps it until the initiative changes again."}, {"date": "2022-06-10", "text": "You cannot venture into Undercity unless instructed to do so, either because you have the initiative at the beginning of your upkeep or because you take the initiative. Notably, if you aren’t in a dungeon and an effect instructs you to venture into the dungeon (not venture into Undercity), you can’t start Undercity."}, {"date": "2022-06-10", "text": "Similarly, when instructed to venture into Undercity, you can’t start a dungeon that isn’t Undercity."}, {"date": "2022-06-10", "text": "If you aren’t in a dungeon when instructed to venture into Undercity, you will put Undercity into the command zone and move your venture marker to Secret Entrance (the first room)."}, {"date": "2022-06-10", "text": "If you’re already in a dungeon when instructed to venture into Undercity, you move to the next room of that dungeon. If you are already in the last room, you will complete that dungeon and start Undercity. This is true whether you’re already in Undercity or any other dungeon."}], "setCode": "CLB", "subtypes": ["Dragon", "Bard"], "supertypes": [], "text": "Defender\nWhen Stirring Bard enters the battlefield, you take the initiative.\nMantle of Inspiration — {T}: Target creature gains menace and haste until end of turn.", "toughness": "4", "type": "Creature — Dragon Bard", "types": ["Creature"], "uuid": "295f998b-6ef9-579b-9d9a-320b80bab605"}