{"artist": "Svetlin Velinov", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 4237, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 508167, "name": "Stoischer Bauer", "text": "Wenn der Stoische Bauer ins Spiel kommt, durchsuche deine Bibliothek nach einer Ebene-Standardlandkarte und zeige sie offen vor. Falls ein Gegner mehr Länder kontrolliert als du, bringe sie getappt ins Spiel. Nimm sie sonst auf deine Hand. Mische danach deine Bibliothek.\nVorherbestimmung {1}{W} (Während deines Zuges kannst du {2} bezahlen und diese Karte aus deiner Hand verdeckt ins Exil schicken. Wirke sie in einem späteren Zug für ihre Vorherbestimmungskosten.)", "type": "Kreatur — Zwerg Gesinde"}, {"language": "Spanish", "multiverseId": 508183, "name": "Granjero estoico", "text": "Cuando el Granjero estoico entre al campo de batalla, busca en tu biblioteca una carta de Llanura básica y muéstrala. Si un oponente controla más tierras que tú, ponla en el campo de batalla girada. De lo contrario, ponla en tu mano. Luego baraja tu biblioteca.\nProfetizar {1}{W}. (Durante tu turno, puedes pagar {2} y exiliar esta carta de tu mano boca abajo. Puedes lanzarla en un turno posterior pagando su coste de profetizar.)", "type": "Criatura — Plebeyo enano"}, {"language": "French", "multiverseId": 508199, "name": "Fermier stoïque", "text": "Quand le Fermier stoïque arrive sur le champ de bataille, cherchez dans votre bibliothèque une carte de plaine de base et révélez-la. Si un adversaire contrôle plus de terrains que vous, mettez-la sur le champ de bataille engagée. Sinon, mettez-la dans votre main. Mélangez ensuite votre bibliothèque.\nPrédiction {1}{W} (Pendant votre tour, vous pouvez payer {2} et exiler cette carte de votre main face cachée. Lancez-la pendant un autre tour pour son coût de prédiction.)", "type": "Créature : nain et paysan"}, {"language": "Italian", "multiverseId": 508215, "name": "Contadino Tenace", "text": "Quando il Contadino Tenace entra nel campo di battaglia, passa in rassegna il tuo grimorio per una carta Pianura base e rivelala. Se un avversario controlla più terre di te, mettila sul campo di battaglia TAPpata. Altrimenti, aggiungila alla tua mano. Poi rimescola il tuo grimorio.\nPredire {1}{W} (Durante il tuo turno, puoi pagare {2} ed esiliare questa carta dalla tua mano a faccia in giù. Lanciala in un turno successivo per il suo costo di predire.)", "type": "Creatura — Popolano Nano"}, {"language": "Japanese", "multiverseId": 508231, "name": "冷静な農夫", "text": "冷静な農夫が戦場に出たとき、あなたはあなたのライブラリーから基本平地・カード１枚を探し、公開する。対戦相手１人があなたよりも多くの土地をコントロールしているなら、それをタップ状態で戦場に出す。そうでないなら、それをあなたの手札に加える。その後、あなたのライブラリーを切り直す。\n予顕{1}{W}（あなたのターンの間、あなたは{2}を支払って、あなたの手札からこのカードを裏向きに追放してもよい。後のターンに、これの予顕コストでこれを唱えてもよい。）", "type": "クリーチャー — ドワーフ・農民"}, {"language": "Portuguese (Brazil)", "multiverseId": 508247, "name": "Fazendeiro Estoico", "text": "Quando Fazendeiro Estoico entrar no campo de batalha, procure um card de Planície básico em seu\ngrimório e revele-o. Se um oponente controlar mais terrenos que você, coloque-o no campo de batalha virado. Caso contrário, coloque-o em sua mão. Depois, embaralhe seu grimório.\nProfetizar {1}{W} (Durante o seu turno, você pode pagar {2} e exilar este card de sua mão voltado para baixo. Conjure-o em um turno posterior pagando seu custo de profetizar.)", "type": "Criatura — Anão Plebeu"}, {"language": "Russian", "multiverseId": 508263, "name": "Упорный Земледелец", "text": "Когда Упорный Земледелец выходит на поле битвы, найдите в вашей библиотеке карту базовой Равнины и покажите ее. Если под контролем оппонента больше земель, чем у вас, положите ее на поле битвы повернутой. В противном случае положите ее в вашу руку. Затем перетасуйте вашу библиотеку.\nПророчество {1}{W} (Во время вашего хода вы можете заплатить {2} и изгнать эту карту из вашей руки рубашкой вверх. Разыграйте ее во время одного из последующих ходов за ее стоимость Пророчества.)", "type": "Существо — Гном Простолюдин"}, {"language": "Chinese Simplified", "multiverseId": 508279, "name": "寡欲农夫", "text": "当寡欲农夫进战场时，从你的牌库中搜寻一张基本的平原牌并展示该牌。若某对手操控的地比你多，则将该牌横置放进战场。若否，则将它置于你手上。然后将你的牌库洗牌。\n预示{1}{W}（在你的回合中，你可以支付{2}并从你手上牌面朝下地放逐此牌。过了该回合后，便可利用其预示费用来施放之。）", "type": "生物 ～矮人／平民"}, {"language": "Chinese Traditional", "multiverseId": 508295, "name": "寡欲農夫", "text": "當寡欲農夫進戰場時，從你的牌庫中搜尋一張基本的平原牌並展示該牌。若某對手操控的地比你多， 則將該牌橫置放進戰場。若否，則將它置於你手上。然後將你的牌庫洗牌。\n預示{1}{W}（在你的回合中，你可以支付{2}並從你手上牌面朝下地放逐此牌。過了該回合後，便可利用其預示費用來施放之。）", "type": "生物 ～矮人／平民"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "240738", "cardsphereId": "73999", "mcmId": "533117", "mtgjsonV4Id": "0a1b0746-7116-5622-9cf2-7921547a7bc7", "mtgoId": "88153", "multiverseId": "508151", "scryfallId": "f53f39e9-f07e-444f-8420-4545e56253e5", "scryfallIllustrationId": "c88a4b2a-8673-46b9-b6af-6dab2151fbc9", "scryfallOracleId": "42820e09-f817-4485-a96a-ac2b0b798269", "tcgplayerProductId": "230964"}, "isStarter": true, "keywords": ["Foretell"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}", "manaValue": 4.0, "name": "Stoic Farmer", "number": "5", "originalText": "When Stoic Farmer enters the battlefield, search your library for a basic Plains card and reveal it. If an opponent controls more lands than you, put it onto the battlefield tapped. Otherwise put it into your hand. Then shuffle your library.\nForetell {1}{W} (During your turn, you may pay {2} and exile this card from your hand face down. Cast it on a later turn for its foretell cost.)", "originalType": "Creature — Dwarf Peasant", "power": "3", "printings": ["KHC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/9c45580867d74075", "tcgplayer": "https://mtgjson.com/links/b7119925778908a0"}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "Because exiling a card with foretell from your hand is a special action, you can do so any time you have priority during your turn, including in response to spells and abilities. Once you announce you’re taking the action, no other player can respond by trying to remove the card from your hand."}, {"date": "2021-02-05", "text": "Casting a foretold card from exile follows the timing rules for that card. If you foretell an instant card, you can cast it as soon as the next player’s turn. In most cases, if you foretell a card that isn’t an instant (or doesn’t have flash), you’ll have to wait until your next turn to cast it."}, {"date": "2021-02-05", "text": "If you’re casting a foretold card from exile for its foretell cost, you can’t choose to cast it for any other alternative costs. You can, however, pay additional costs, such as kicker costs. If the card has any mandatory additional costs, those must be paid to cast the spell."}], "securityStamp": "oval", "setCode": "KHC", "subtypes": ["Dwarf", "Peasant"], "supertypes": [], "text": "When Stoic Farmer enters the battlefield, search your library for a basic Plains card and reveal it. If an opponent controls more lands than you, put it onto the battlefield tapped. Otherwise put it into your hand. Then shuffle.\nForetell {1}{W} (During your turn, you may pay {2} and exile this card from your hand face down. Cast it on a later turn for its foretell cost.)", "toughness": "3", "type": "Creature — Dwarf Peasant", "types": ["Creature"], "uuid": "5f7840b0-a917-532d-99fe-e838adf96393", "watermark": "foretell"}