{"artist": "Pete Venters", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 4.0, "edhrecRank": 11242, "finishes": ["nonfoil", "foil"], "flavorText": "\"Might of ancient wood and stone, Into spirit, flesh, and bone.\"", "foreignData": [{"flavorText": "„Die Kraft von altem Holz und Stein fahre in Geist, Fleisch und Gebein.\"", "language": "German", "multiverseId": 133089, "name": "Hartholz-Beschwörung", "text": "Sekundenbruchteil (Solange dieser Zauberspruch sich auf dem Stapel befindet, können Spieler keine Zaubersprüche oder aktivierte Fähigkeiten spielen, die keine Manafähigkeiten sind.)\nEine Kreatur deiner Wahl erhält +5/+5 bis zum Ende des Zuges und kann in diesem Zug nicht das Ziel von Zaubersprüchen und Fähigkeiten sein.", "type": "Spontanzauber"}, {"flavorText": "\"Poder de la antigua madera y piedra, convertido en espíritu, carne y hueso.\"", "language": "Spanish", "multiverseId": 134594, "name": "Invocación de maderapiedra", "text": "Fracción de segundo (Mientras este hechizo esté en la pila, los jugadores no pueden jugar hechizos o habilidades activadas que no sean habilidades de maná.)\nLa criatura objetivo obtiene +5/+5 hasta el final del turno y no puede ser objetivo de hechizos o habilidades este turno.", "type": "Instantáneo"}, {"flavorText": "« Puissance vénérable du bois et de la pierre, Pénètre esprit, os et chair. »", "language": "French", "multiverseId": 132788, "name": "Invocation de pierrebois", "text": "Fraction de seconde (Tant que ce sort est sur la pile, les joueurs ne peuvent pas jouer de sorts ou de capacités activées qui ne sont pas des capacités de mana.)\nLa créature ciblée gagne +5/+5 jusqu'à la fin du tour et ne peut pas être la cible de sorts ou de capacités ce tour-ci.", "type": "Éphémère"}, {"flavorText": "\"Di pietra e legno antico la potenza, Infusa nella carne, nelle ossa e nell'essenza.\"", "language": "Italian", "multiverseId": 133390, "name": "Evocazione di Boscopietra", "text": "Battibaleno (Fintanto che questa magia è in pila, i giocatori non possono giocare magie o abilità attivate che non siano abilità di mana.)\nUna creatura bersaglio prende +5/+5 fino alla fine del turno e non può essere bersaglio di magie o abilità in questo turno.", "type": "Istantaneo"}, {"flavorText": "古樹と古石との力よ来たれ、 心と肉と骨とに宿れ。", "language": "Japanese", "multiverseId": 133691, "name": "岩石樹の祈り", "text": "刹那 （この呪文がスタックにあるかぎり、プレイヤーは呪文やマナ能力でない起動型能力をプレイできない。）\nクリーチャー１体を対象とする。それはターン終了時まで＋５/＋５の修整を受けるとともに、このターン呪文や能力の対象にならない。", "type": "インスタント"}, {"flavorText": "\"O poder da madeira e da pedra primordiais, No espírito, na carne e nos ossos.\"", "language": "Portuguese (Brazil)", "multiverseId": 133992, "name": "Invocação da Selva de Pedras", "text": "Fração de segundo (Enquanto esta mágica estiver na pilha, os jogadores não poderão jogar mágicas ou habilidades ativadas que não sejam habilidades de mana.)\nA criatura alvo recebe +5/+5 até o final do turno e não pode ser alvo de mágicas nem de habilidades neste turno.", "type": "Mágica Instantânea"}, {"flavorText": "«Мощь древнего древа и камня, Войди в дух, плоть и кость».", "language": "Russian", "multiverseId": 134293, "name": "Стоунвудская Мольба", "text": "Мгновение ока (До тех пор пока это заклинание находится в стеке, игроки не могут играть заклинания или активируемые способности, которые не являются мана-способностями.)\nЦелевое существо получает +5/+5 до конца хода и не может быть целью заклинаний и способностей на этом ходу.", "type": "Мгновенное заклинание"}, {"flavorText": "「古木巨岩瀚力， 尽入心身骨底。」", "language": "Chinese Simplified", "multiverseId": 132487, "name": "坚木祝愿", "text": "转瞬（只要此咒语在堆叠上，牌手便不能使用咒语或不是法术力异能的起动式异能。）\n本回合中，目标生物得+5/+5且不能成为咒语或异能的目标。", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "121681", "cardKingdomId": "121391", "cardsphereId": "44722", "mcmId": "13993", "mcmMetaId": "8524", "mtgjsonV4Id": "2be668ad-b861-5eb0-8db0-75be1cd9508b", "mtgoFoilId": "25808", "mtgoId": "25807", "multiverseId": "118890", "scryfallId": "1b300e67-04d2-4c69-b516-c5cc0a6ff2e7", "scryfallIllustrationId": "871d84e8-1d6f-4689-b502-8a2988c59f97", "scryfallOracleId": "35f09a11-1d9b-4dfd-9695-b809c871f10d", "tcgplayerProductId": "14374"}, "keywords": ["Split second"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{G}", "manaValue": 4.0, "name": "Stonewood Invocation", "number": "223", "originalText": "Split second (As long as this spell is on the stack, players can't play spells or activated abilities that aren't mana abilities.)\nTarget creature gets +5/+5 until end of turn and can't be the target of spells or abilities this turn.", "originalType": "Instant", "printings": ["TSP"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d9730f536a367e33", "cardKingdomFoil": "https://mtgjson.com/links/ccf7db9c9aa57042", "cardmarket": "https://mtgjson.com/links/0d6e16c79a84de8f", "tcgplayer": "https://mtgjson.com/links/6837d27590fb9447"}, "rarity": "rare", "rulings": [{"date": "2021-03-19", "text": "Players may turn face-down creatures face up while a spell with split second is on the stack."}, {"date": "2021-03-19", "text": "Split second doesn’t stop triggered abilities from triggering, such as that of Chalice of the Void. If one does, its controller puts it on the stack and chooses targets for it, if any. Those abilities will resolve as normal."}, {"date": "2021-03-19", "text": "Casting a spell with split second won’t affect spells and abilities that are already on the stack."}, {"date": "2021-03-19", "text": "Players still get priority while a card with split second is on the stack; their options are just limited to mana abilities and certain special actions."}, {"date": "2021-03-19", "text": "If the resolution of a triggered ability involves casting a spell, that spell can’t be cast if a spell with split second is on the stack."}, {"date": "2021-03-19", "text": "After a spell with split second resolves (or otherwise leaves the stack), players may again cast spells and activate abilities before the next object on the stack resolves."}], "setCode": "TSP", "subtypes": [], "supertypes": [], "text": "Split second (As long as this spell is on the stack, players can't cast spells or activate abilities that aren't mana abilities.)\nTarget creature gets +5/+5 and gains shroud until end of turn. (It can't be the target of spells or abilities.)", "type": "Instant", "types": ["Instant"], "uuid": "c39cd306-325e-5cfc-98d6-af14ed12017d"}