{"artist": "Sam White", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 2.0, "edhrecRank": 344, "finishes": ["nonfoil", "foil"], "flavorText": "Its tines cannot be rung by mere physical force. Only magic of great power can start its eldritch resonance.", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "b58f5520-5f1f-5292-b0a7-bb8899e82457", "mtgoId": "95467", "scryfallId": "de0426ba-9a62-4230-8474-407e74578627", "scryfallIllustrationId": "aca105f4-5bcf-45eb-984c-48a95589bb52", "scryfallOracleId": "cf751552-156f-4f81-ac94-9814dce099f9"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}", "manaValue": 2.0, "name": "Strionic Resonator", "number": "95467", "originalReleaseDate": "2022-11-19", "printings": ["A25", "BRC", "C19", "M14", "NCC", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2018-03-16", "text": "Triggered abilities use the word “when,” “whenever,” or “at.” They're often written as “[Trigger condition], [effect].”"}, {"date": "2018-03-16", "text": "Strionic Resonator targets a triggered ability that has triggered and is on the stack and creates another instance of that ability on the stack. It doesn't cause any object to gain an ability."}, {"date": "2018-03-16", "text": "The source of the copy is the same as the source of the original ability."}, {"date": "2018-03-16", "text": "If the triggered ability is modal (that is, if it says, “Choose one —” or similar), the mode is copied and can't be changed."}, {"date": "2018-03-16", "text": "If the triggered ability divides damage or distributes counters among a number of targets (for example, the ability of Bogardan Hellkite), the division and number of targets can't be changed. If you choose new targets, you must choose the same number of targets."}, {"date": "2018-03-16", "text": "Any choices made when the triggered ability resolves won't have been made yet when it's copied. Any such choices will be made separately when the copy resolves. If the triggered ability asks you to pay a cost (such as that of Frenzied Goblin), you pay that cost for the copy."}, {"date": "2018-03-16", "text": "If a triggered ability is linked to a second ability, copies of that triggered ability are also linked to that second ability. If the second ability refers to “the exiled card,” it refers to all cards exiled by the triggered ability and the copy. For example, if Fiend Hunter's enters-the-battlefield ability is copied and two creatures are exiled, they both return when Fiend Hunter leaves the battlefield."}, {"date": "2018-03-16", "text": "In some cases involving linked abilities, an ability requires information about “the exiled card.” When this happens, the ability gets multiple answers. If these answers are being used to determine the value of a variable, the sum is used. For example, if Elite Arcanist's enters-the-battlefield ability is copied, two cards are exiled. The value of X in the activation cost of Elite Arcanist's other ability is the sum of the two cards' mana values. As the ability resolves, you create copies of both cards and can cast none, one, or both of the copies in any order."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "{2}, {T}: Copy target triggered ability you control. You may choose new targets for the copy. (A triggered ability uses the words \"when,\" \"whenever,\" or \"at.\")", "type": "Artifact", "types": ["Artifact"], "uuid": "622355c5-8efe-51a4-ab48-67cd5c43acf7"}