{"artist": "Jim Pavelec", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210279", "mcmId": "294470", "mtgjsonV4Id": "853b2c28-70de-5e28-9fdc-1a599748b1f8", "multiverseId": "423656", "scryfallId": "d5b7baf7-3d9a-4acf-8985-126cbee14248", "scryfallIllustrationId": "c21e3a8d-deb4-4866-b2db-58e35d5e4b90", "scryfallOracleId": "ff76b576-8ad3-44f9-8043-80003a078e84", "tcgplayerProductId": "125632"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Stronghold Furnace", "number": "75", "originalText": "If a source would deal damage to a creature or player, it deals double that damage to that creature or player instead.\nWhenever you roll {Chaos}, Stronghold Furnace deals 1 damage to target creature or player.", "originalType": "Plane — Rath", "printings": ["OHOP", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6405c9560af2827e", "tcgplayer": "https://mtgjson.com/links/97add99f2fb4f09c"}, "rarity": "common", "rulings": [{"date": "2009-10-01", "text": "A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"}, {"date": "2009-10-01", "text": "A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."}, {"date": "2009-10-01", "text": "The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."}, {"date": "2009-10-01", "text": "If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}, {"date": "2009-10-01", "text": "Stronghold Furnace’s first ability interacts with all damage, not just combat damage. Notably, it doubles the damage from its own chaos ability."}, {"date": "2009-10-01", "text": "If multiple effects modify how damage will be dealt, the player who would be dealt damage or the controller of the creature that would be dealt damage chooses the order to apply the effects. For example, Mending Hands says, “Prevent the next 4 damage that would be dealt to any target this turn.” Suppose a spell would deal 5 damage to a player who has cast Mending Hands targeting themselves. The player who would be dealt damage can either (a) prevent 4 damage first and then let Stronghold Furnace’s effect double the remaining 1 damage, taking 2 damage, or (b) double the damage to 10 and then prevent 4 damage, taking 6 damage."}, {"date": "2009-10-01", "text": "If a spell or ability divides damage among multiple recipients (such as Pyrotechnics does), the damage is divided before Stronghold Furnace’s effect doubles it. The same is true for combat damage."}], "setCode": "OPCA", "subtypes": ["Rath"], "supertypes": [], "text": "If a source would deal damage to a permanent or player, it deals double that damage to that permanent or player instead.\nWhenever you roll {CHAOS}, Stronghold Furnace deals 1 damage to any target.", "type": "Plane — Rath", "types": ["Plane"], "uuid": "256ab904-9bb5-5750-9eb2-32f6f6ac3642"}