{"artist": "Lindsey Look", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 6.0, "edhrecRank": 897, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "759e07fb-a0bd-5646-b9e2-2125dedb0f0f", "mtgoId": "81946", "scryfallId": "ba77faae-b943-499a-838d-268cf72a9309", "scryfallIllustrationId": "a1b72b6a-21a1-4e17-a9b9-0f8451775d98", "scryfallOracleId": "56148ae7-a9df-4771-8d53-d9ffb815c884"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U}{U}", "manaValue": 6.0, "name": "Sublime Epiphany", "number": "81946", "originalReleaseDate": "2020-07-31", "printings": ["M21", "PM21", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-06-23", "text": "You can't choose any one mode more than once."}, {"date": "2020-06-23", "text": "If any of the targets become illegal, the remaining targets are affected as appropriate."}, {"date": "2020-06-23", "text": "If you choose more than one mode, you perform the modes in the order specified. For example, if you choose to counter target spell, return target nonland permanent to its owner's hand, and have target player draw a card, that permanent will be on the battlefield while that spell is countered (and may modify, affect, or trigger on that event) but will not be on the battlefield while that player draws a card."}, {"date": "2020-06-23", "text": "Sublime Epiphany's second mode counters only activated and triggered abilities already on the stack. It doesn't prevent abilities from being activated or from triggering later in the turn, and it has no effect on static abilities."}, {"date": "2020-06-23", "text": "Activated abilities are written in the form “[Cost]: [Effect].” Some keyword abilities (such as equip) are activated abilities and will have colons in their reminder texts."}, {"date": "2020-06-23", "text": "Triggered abilities use the word “when,” “whenever,” or “at.” They're often written as “[Trigger condition], [effect].” Some keyword abilities (such as prowess) are triggered abilities and will have “when,” “whenever,” or “at” in their reminder text."}, {"date": "2020-06-23", "text": "Abilities that create replacement effects, such as a permanent entering the battlefield tapped or with counters on it, can't be countered. Abilities that apply “as [this creature] enters the battlefield” are also replacement effects and can't be countered."}, {"date": "2020-06-23", "text": "Sublime Epiphany's second mode can't counter an activated or triggered mana ability. An activated mana ability is one that adds mana to a player's mana pool as it resolves, doesn't have a target, and isn't a loyalty ability. A triggered mana ability is one that adds mana to a player's mana pool and triggers on an activated mana ability."}, {"date": "2020-06-23", "text": "If you counter a delayed triggered ability that triggered at the beginning of the “next” occurrence of a specified step or phase, that ability won't trigger again the following time that phase or step occurs."}, {"date": "2020-06-23", "text": "If you choose the third and fourth modes and target the same creature you control both times, you'll return it and then create a token that's a copy of it, using its copiable values as it last appeared on the battlefield. This is because the legality of targets is checked only as the spell begins to resolve, before any actions are performed."}, {"date": "2020-06-23", "text": "The token copies exactly what is printed on the creature and nothing else (unless that creature is a token or is copying something else; see below). It doesn't copy whether that creature is tapped or untapped, whether it has any counters on it or Auras and/or Equipment attached to it, or any non-copy effects that changed its power, toughness, types, color, and so on."}, {"date": "2020-06-23", "text": "If the copied creature is itself a token, the token created by Sublime Epiphany copies the original characteristics of that token as stated by the effect that created it."}, {"date": "2020-06-23", "text": "If the copied creature is copying something else, the token enters the battlefield as whatever that creature is copying."}, {"date": "2020-06-23", "text": "If the copied creature has {X} in its mana cost, X is 0."}, {"date": "2020-06-23", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when the token enters the battlefield. Any “As [this creature] enters the battlefield” or “[This creature] enters the battlefield with” abilities of the copied creature will also work."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Choose one or more —\n• Counter target spell.\n• Counter target activated or triggered ability.\n• Return target nonland permanent to its owner's hand.\n• Create a token that's a copy of target creature you control.\n• Target player draws a card.", "type": "Instant", "types": ["Instant"], "uuid": "0d978e71-eaa4-5580-9b0d-2950f854fadd"}