{"artist": "Adam Paquette", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 18696, "finishes": ["nonfoil", "foil"], "flavorText": "No matter how big and strong you are, the sea is bigger and stronger.", "foreignData": [{"flavorText": "Es ist einerlei, wie groß und stark du bist. Die See ist größer und stärker.", "language": "German", "multiverseId": 378920, "name": "Plötzlicher Sturm", "text": "Tappe bis zu zwei Kreaturen deiner Wahl. Diese Kreaturen enttappen nicht während des nächsten Enttappsegments ihrer Besitzer. Hellsicht 1. (Schaue dir die oberste Karte deiner Bibliothek an. Du kannst diese Karte unter deine Bibliothek legen.)", "type": "Spontanzauber"}, {"flavorText": "No importa si eres grande y fuerte; el mar siempre lo será más.", "language": "Spanish", "multiverseId": 380075, "name": "Tormenta repentina", "text": "Gira hasta dos criaturas objetivo. Esas criaturas no se enderezan durante el próximo paso de enderezar de sus controladores. Adivina 1. (Mira la primera carta de tu biblioteca. Puedes poner esa carta en el fondo de tu biblioteca.)", "type": "Instantáneo"}, {"flavorText": "Qu'importe votre taille et votre force, la mer est toujours plus grande et plus forte.", "language": "French", "multiverseId": 379085, "name": "Tempête soudaine", "text": "Engagez jusqu'à deux créatures ciblées. Ces créatures ne se dégagent pas pendant les prochaines étapes de dégagement de leurs contrôleurs. Regard 1. (Regardez la carte du dessus de votre bibliothèque. Vous pouvez mettre cette carte au-dessous de votre bibliothèque.)", "type": "Éphémère"}, {"flavorText": "Per quanto tu possa essere grande e forte, il mare è più vasto e più potente.", "language": "Italian", "multiverseId": 379250, "name": "Tempesta Improvvisa", "text": "TAPpa fino a due creature bersaglio. Quelle creature non STAPpano durante il prossimo STAP dei rispettivi controllori. Profetizza 1. (Guarda la prima carta del tuo grimorio. Puoi mettere quella carta in fondo al tuo grimorio.)", "type": "Istantaneo"}, {"flavorText": "お前がいかに大きくて強力であっても、海はさらに大きく、そして強大である。", "language": "Japanese", "multiverseId": 379415, "name": "突然の嵐", "text": "クリーチャーを最大２体まで対象とし、それらをタップする。それらのクリーチャーは、それらのコントローラーの次のアンタップ・ステップにアンタップしない。占術１を行う。（あなたのライブラリーの一番上のカードを見る。あなたはそのカードをあなたのライブラリーの一番下に置いてもよい。）", "type": "インスタント"}, {"flavorText": "네놈이 아무리 힘을 자랑해도 바다가 더 크고 강하다.", "language": "Korean", "multiverseId": 379580, "name": "느닷없는 폭풍", "text": "최대 둘까지의 생물을 목표로 정한다. 그 생물들을 탭한다. 그 생물들은 조종자의 다음 언탭단에 언탭되지 않는다. 점술 1. (당신의 서고 맨 위의 카드 한 장을 본다. 당신은 그 카드를 당신의 서고 맨 밑에 놓을 수 있다.)", "type": "순간마법"}, {"flavorText": "Não importa o quanto você seja grande e forte, o mar é ainda maior e mais forte.", "language": "Portuguese (Brazil)", "multiverseId": 379745, "name": "Tempestade Súbita", "text": "Vire até duas criaturas alvo. Aquelas criaturas não serão desviradas durante a próxima etapa de desvirar de seus controladores. Vidência 1. (Olhe o card do topo de seu grimório. Você pode colocar aquele card no fundo de seu grimório.)", "type": "Mágica Instantânea"}, {"flavorText": "Как бы ты ни был огромен и силен, море больше и сильнее.", "language": "Russian", "multiverseId": 379910, "name": "Внезапная Буря", "text": "Поверните не более двух целевых существ. Те существа не разворачиваются во время следующего шага разворота контролирующих их игроков. Предскажите 1. (Посмотрите верхнюю карту вашей библиотеки. Вы можете положить ту карту в низ вашей библиотеки.)", "type": "Мгновенное заклинание"}, {"flavorText": "不管你有多大多壮，都敌不过更大更壮的海洋。", "language": "Chinese Simplified", "multiverseId": 378590, "name": "突降暴雨", "text": "横置至多两个目标生物。这些生物于其操控者的下一个重置步骤中不能重置。占卜1。（检视你牌库顶的牌。你可以将该牌置于你的牌库底。）", "type": "瞬间"}, {"flavorText": "不管你有多大多壯，都敵不過更大更壯的海洋。", "language": "Chinese Traditional", "multiverseId": 378755, "name": "突降暴雨", "text": "橫置至多兩個目標生物。這些生物於其操控者的下一個重置步驟中不能重置。占卜1。（檢視你牌庫頂的牌。你可以將該牌置於你的牌庫底。）", "type": "瞬間"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "193677", "cardKingdomId": "193456", "cardsphereId": "7684", "mcmId": "265873", "mcmMetaId": "209335", "mtgjsonV4Id": "e1ed5b6c-6ffd-522d-8a7e-ec9974fd6d4c", "mtgoFoilId": "51782", "mtgoId": "51781", "multiverseId": "378425", "scryfallId": "6beffc33-58fd-4364-b87b-d4573ecaf4bd", "scryfallIllustrationId": "53d56978-0e10-4dc0-904e-e5503ba84c40", "scryfallOracleId": "32e915fb-3836-4bed-93b1-61c9c3951ad1", "tcgplayerProductId": "79121"}, "keywords": ["Scry"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Sudden Storm", "number": "53", "originalText": "Tap up to two target creatures. Those creatures don't untap during their controllers' next untap steps. Scry 1. (Look at the top card of your library. You may put that card on the bottom of your library.)", "originalType": "Instant", "printings": ["BNG"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ec3ec508b26ecc9f", "cardKingdomFoil": "https://mtgjson.com/links/0d72a9df95e43959", "cardmarket": "https://mtgjson.com/links/109608a7f82a7e05", "tcgplayer": "https://mtgjson.com/links/8b418ec6e37bc527"}, "rarity": "common", "rulings": [{"date": "2013-09-15", "text": "When you scry, you may put all the cards you look at back on top of your library, you may put all of those cards on the bottom of your library, or you may put some of those cards on top and the rest of them on the bottom."}, {"date": "2013-09-15", "text": "You choose how to order cards returned to your library after scrying no matter where you put them."}, {"date": "2013-09-15", "text": "You perform the actions stated on a card in sequence. For some spells and abilities, that means you’ll scry last. For others, that means you’ll scry and then perform other actions."}, {"date": "2013-09-15", "text": "Scry appears on some spells and abilities with one or more targets. If all of the spell or ability’s targets are illegal when it tries to resolve, it won’t resolve and none of its effects will happen. You won’t scry."}, {"date": "2014-02-01", "text": "If you choose zero targets, you’ll just scry 1 when the ability resolves. However, if you choose at least one target and all of Sudden Storm’s targets are illegal as it tries to resolve, the spell won’t resolve and none of its effects will happen. You won’t scry in that case."}, {"date": "2014-02-01", "text": "If a creature affected by Sudden Storm changes controllers before its old controller’s next untap step, Sudden Storm will prevent it from becoming untapped during its new controller’s next untap step."}, {"date": "2014-02-01", "text": "This spell can target tapped creatures. If a targeted creature is already tapped when the spell resolves, that creature remains tapped and doesn’t untap during its controller’s next untap step."}, {"date": "2014-02-01", "text": "If you chose two targets and one is an illegal target when Sudden Storm resolves, that creature won’t become tapped and it won’t be stopped from untapping during its controller’s next untap step. It won’t be affected by Sudden Storm in any way."}], "setCode": "BNG", "subtypes": [], "supertypes": [], "text": "Tap up to two target creatures. Those creatures don't untap during their controllers' next untap steps. Scry 1. (Look at the top card of your library. You may put that card on the bottom of your library.)", "type": "Instant", "types": ["Instant"], "uuid": "6cf10253-e02f-5ede-a9d0-a73dbb79ed0c"}