{"artist": "Jesper Ejsing", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "Japanese", "multiverseId": 417210, "name": "召喚者の絆", "text": "両策（この策略を統率領域に裏向きに置いた状態でゲームを始め、秘密裏に異なるカード名２つを指定する。あなたはいつでもこの策略を表向きにして、指定したカードの名前を公表してもよい。）\nあなたが、指定した名前の一方を持つクリーチャー・呪文を１つ唱えるたび、あなたはあなたのライブラリーから指定した名前の他方を持つクリーチャー・カード１枚を探してもよい。そうしたなら、それを公開してあなたの手札に加え、その後あなたのライブラリーを切り直す。", "type": "策略"}, {"language": "Chinese Simplified", "multiverseId": 416989, "name": "召唤师羁绊", "text": "双重秘案（开始游戏时将此诡局牌面朝下地置于统帅区，并私下决定两个不同的牌名。你随时可以将此诡局翻回正面并公布这些名称。）\n每当你施放具这两者之间任一名称的生物咒语时，你可以从你的牌库中搜寻一张具这两者之间另一名称的生物牌，展示该牌，将它置于你手上，然后将你的牌库洗牌。", "type": "诡局"}], "frameEffects": ["draft"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "208402", "cardKingdomId": "208125", "cardsphereId": "12118", "mcmId": "291740", "mcmMetaId": "223524", "mtgjsonV4Id": "2bb70b5b-c58d-5c5f-b69f-1e9fdacdfebd", "multiverseId": "416768", "scryfallId": "c4f16145-1ace-48a9-bd98-b0aea3e4bf62", "scryfallIllustrationId": "ef4711d0-dfca-48a2-ae07-0dd950e7911b", "scryfallOracleId": "07b6326a-b73d-422b-bcb5-c508aa3fc558", "tcgplayerProductId": "121436"}, "keywords": ["Double agenda"], "language": "English", "layout": "normal", "legalities": {"commander": "Banned", "legacy": "Banned", "vintage": "Banned"}, "manaValue": 0.0, "name": "Summoner's Bond", "number": "11", "originalText": "Double agenda (Start the game with this conspiracy face down in the command zone and secretly name two different cards. You may turn this conspiracy face up any time and reveal the chosen names.)\nWhenever you cast a creature spell with one of the chosen names, you may search your library for a creature card with the other chosen name, reveal it, put it into your hand, then shuffle your library.", "originalType": "Conspiracy", "printings": ["CN2"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/b86c5b789698d60d", "cardKingdomFoil": "https://mtgjson.com/links/2ab69827f4627ded", "cardmarket": "https://mtgjson.com/links/9636994fbc9b9b13", "tcgplayer": "https://mtgjson.com/links/222c0e3422533423"}, "rarity": "uncommon", "rulings": [{"date": "2016-08-23", "text": "Double agenda is a variant of hidden agenda. The only difference is you secretly name two different cards instead of one."}, {"date": "2016-08-23", "text": "The last ability of Summoner’s Bond will resolve before the creature spell that caused it to trigger."}, {"date": "2016-08-23", "text": "Conspiracies are never put into your deck. Instead, you put any number of conspiracies from your card pool into the command zone as the game begins. These conspiracies are face up unless they have hidden agenda, in which case they begin the game face down."}, {"date": "2016-08-23", "text": "A conspiracy doesn’t count as a card in your deck for purposes of meeting minimum deck size requirements. (In most drafts, the minimum deck size is 40 cards.)"}, {"date": "2016-08-23", "text": "You don’t have to play with any conspiracy you draft. However, you have only one opportunity to put conspiracies into the command zone, as the game begins. You can’t put conspiracies into the command zone after this point."}, {"date": "2016-08-23", "text": "You can look at any player’s face-up conspiracies at any time. You’ll also know how many face-down conspiracies a player has in the command zone, although you won’t know what they are."}, {"date": "2016-08-23", "text": "A conspiracy’s static and triggered abilities function as long as that conspiracy is face-up in the command zone."}, {"date": "2016-08-23", "text": "Conspiracies are colorless, have no mana cost, and can’t be cast as spells."}, {"date": "2016-08-23", "text": "Conspiracies aren’t legal for any sanctioned Constructed format, but may be included in other Limited formats, such as Cube Draft."}, {"date": "2016-08-23", "text": "You name the card as the game begins, as you put the conspiracy into the command zone, not as you turn the face-down conspiracy face up."}, {"date": "2016-08-23", "text": "There are several ways to secretly name a card, including writing the name on a piece of paper that’s kept with the face-down conspiracy. If you have multiple face-down conspiracies, you may name a different card for each one. It’s important that each named card is clearly associated with only one of the conspiracies."}, {"date": "2016-08-23", "text": "You must name a Magic card. Notably, you can’t name a token (except in the unusual case that a token’s name matches the name of a card, such as Illusion)."}, {"date": "2016-08-23", "text": "If you play multiple games after the draft, you can name a different card in each new game."}, {"date": "2016-08-23", "text": "As a special action, you may turn a face-down conspiracy face up. You may do so any time you have priority. This action doesn’t use the stack and can’t be responded to. Once face up, the named card is revealed and the conspiracy’s abilities will affect the game."}, {"date": "2016-08-23", "text": "At the end of the game, you must reveal any face-down conspiracies you own in the command zone to all players."}, {"date": "2016-08-23", "text": "A conspiracy with hidden agenda that has a triggered ability must be face up before that ability’s trigger condition is met in order for it to trigger. Turning it face up afterward won’t have any effect."}, {"date": "2016-08-23", "text": "At the end of the game, you must reveal any face-down conspiracies you own in the command zone to all players. Notably, you can’t bluff conspiracies with hidden agenda by putting other cards into the command zone face down as the game starts."}], "setCode": "CN2", "subtypes": [], "supertypes": [], "text": "Double agenda (Start the game with this conspiracy face down in the command zone and secretly choose two different card names. You may turn this conspiracy face up any time and reveal those names.)\nWhenever you cast a creature spell with one of the chosen names, you may search your library for a creature card with the other chosen name, reveal it, put it into your hand, then shuffle.", "type": "Conspiracy", "types": ["Conspiracy"], "uuid": "6872e47c-e95a-50a1-b806-cac1e354aee9", "watermark": "conspiracy"}