{"artist": "Jim Nelson", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 4.0, "edhrecRank": 9613, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 81019, "name": "Ei des Beschwörers", "text": "Einprägen Wenn das Ei des Beschwörers ins Spiel kommt, kannst du eine Karte aus deiner Hand verdeckt ganz aus dem Spiel entfernen.\nWenn das Ei des Beschwörers aus dem Spiel auf den Friedhof gelegt wird, decke die eingeprägte verdeckte Karte auf. Ist diese Karte eine Kreaturenkarte, bringe sie unter deiner Kontrolle ins Spiel.", "type": "Artefaktkreatur"}, {"language": "Spanish", "multiverseId": 81184, "name": "Huevo del invocador", "text": "Estampa Cuando el Huevo del invocador entre en juego, puedes remover del juego boca abajo una carta de tu mano.\nCuando el Huevo del invocador vaya a un cementerio desde el juego, voltea la carta estampada boca arriba. Si es una carta de criatura, ponla en juego bajo tu control.", "type": "Criatura artefacto"}, {"language": "French", "multiverseId": 80854, "name": "Œuf de l'invocateur", "text": "Empreinte Quand l'Œuf de l'invocateur arrive en jeu, vous pouvez retirer de la partie, face cachée, une carte de votre main.\nQuand l'Œuf de l'invocateur est mis dans un cimetière depuis le jeu, retournez face visible la carte dont il a l'empreinte. Si cette carte est une carte de créature, mettez-la en jeu sous votre contrôle.", "type": "Créature-artefact"}, {"language": "Italian", "multiverseId": 81349, "name": "Uovo dell'Evocatore", "text": "Imprimere Quando l'Uovo dell'Evocatore entra in gioco, puoi rimuovere dal gioco a faccia in giù una carta presente nella tua mano.\nQuando l'Uovo dell'Evocatore viene messo in un cimitero dal gioco, gira a faccia in su la carta impressa a faccia in giù. Se quella carta è una carta creatura, mettila in gioco sotto il tuo controllo.", "type": "Creatura Artefatto"}, {"language": "Japanese", "multiverseId": 80689, "name": "召喚者の卵", "text": "刻印 ― 召喚者の卵が場に出たとき、あなたは自分の手札にあるカードを１枚、裏向きにゲームから取り除いてもよい。\n召喚者の卵が場から墓地に置かれたとき、刻印されている裏向きのカードを表向きにする。それがクリーチャー･カードである場合、それをあなたのコントロール下で場に出す。", "type": "アーティファクト・クリーチャー"}, {"language": "Portuguese (Brazil)", "multiverseId": 81514, "name": "Ovo do Invocador", "text": "Estampar Quando Ovo do Invocador entra em jogo, você pode remover de jogo, com a face para baixo, um card de sua mão. (O card removido fica estampado neste artefato.)\nQuando Ovo do Invocador for colocado num cemitério vindo de jogo, volte com a face para cima o card estampado com a face para baixo. Se o card for um card de criatura, coloque-o em jogo sob o seu controle.", "type": "Criatura Artefato"}, {"language": "Chinese Simplified", "multiverseId": 81679, "name": "召唤师封卵", "text": "压印～当召唤师封卵进场时，你可以将一张牌从你手上面朝下地移出对战。（被移出对战的牌压印在此神器上）\n当召唤师封卵从场上进入坟墓场时，将所压印的牌面朝下之牌翻回正面。若该牌是生物牌，则将该牌在你的操控下放置进场。", "type": "神器生物"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "111730", "cardKingdomId": "111559", "cardsphereId": "18357", "mcmId": "528", "mcmMetaId": "5696", "mtgjsonV4Id": "e0ccd5d0-0574-5b81-a0ec-d4e853cf53cc", "mtgoFoilId": "20783", "mtgoId": "20782", "multiverseId": "51075", "scryfallId": "3581ac02-5dab-423a-9cf3-275d9203f26d", "scryfallIllustrationId": "9feff99e-5abe-47fa-83d8-40ee393071ea", "scryfallOracleId": "2209ebd4-1131-4b8e-b0f5-aa9506dc0057", "tcgplayerProductId": "11829"}, "keywords": ["Imprint"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}", "manaValue": 4.0, "name": "Summoner's Egg", "number": "157", "originalText": "Imprint When Summoner's Egg comes into play, you may remove a card in your hand from the game face down.\nWhen Summoner's Egg is put into a graveyard from play, turn the imprinted face-down card face up. If that card is a creature card, put it into play under your control.", "originalType": "Artifact Creature", "power": "0", "printings": ["5DN"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/375efa8ab718b099", "cardKingdomFoil": "https://mtgjson.com/links/eb0920705bfaba47", "cardmarket": "https://mtgjson.com/links/a16c7846a1eff931", "tcgplayer": "https://mtgjson.com/links/2834164440d89bbd"}, "rarity": "rare", "rulings": [{"date": "2004-12-01", "text": "The card is imprinted face down. This means that other players don’t know what the card is and you can’t look at the card once it’s imprinted (until it’s turned face up, of course). Note that effects that exile cards, including all previous imprint cards, exile those cards face up unless the effect says otherwise."}, {"date": "2004-12-01", "text": "If the card is not a creature card when it’s turned face up, it remains exiled face up."}, {"date": "2004-12-01", "text": "Any “When this creature is turned face up” abilities that the exiled card may have don’t trigger because the card isn’t being turned face up while it’s on the battlefield."}], "setCode": "5DN", "subtypes": ["Egg"], "supertypes": [], "text": "Imprint — When Summoner's Egg enters the battlefield, you may exile a card from your hand face down.\nWhen Summoner's Egg dies, turn the exiled card face up. If it's a creature card, put it onto the battlefield under your control.", "toughness": "4", "type": "Artifact Creature — Egg", "types": ["Artifact", "Creature"], "uuid": "08045c26-aa4f-5764-887b-5d8ec73b9528"}