{"artist": "Kieran Yanner", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 6.0, "edhrecRank": 11613, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 204264, "name": "Beschwörungsfalle", "text": "Falls ein Kreaturenzauber, den du in diesem Zug gewirkt hast, von einem Zauberspruch oder einer Fähigkeit, den bzw. die ein Gegner kontrolliert hat, neutralisiert wurde, kannst du {0} bezahlen, anstatt die Manakosten der Beschwörungsfalle zu bezahlen.\nSchau dir die obersten sieben Karten deiner Bibliothek an. Du kannst davon eine Kreaturenkarte ins Spiel bringen. Lege den Rest in beliebiger Reihenfolge unter deine Bibliothek.", "type": "Spontanzauber — Falle"}, {"language": "Spanish", "multiverseId": 202919, "name": "Trampa invocadora", "text": "Si un hechizo de criatura que lanzaste este turno fue contrarrestado por un hechizo o habilidad que controlaba un oponente, puedes pagar {0} en lugar de pagar el coste de maná de la Trampa invocadora.\nMira las primeras siete cartas de la parte superior de tu biblioteca. Puedes poner en el campo de batalla una carta de criatura que se encuentre entre ellas. Pon el resto en la parte inferior de tu biblioteca en cualquier orden.", "type": "Instantáneo — Trampa"}, {"language": "French", "multiverseId": 204533, "name": "Piège à invocation", "text": "Si un sort de créature que vous avez lancé ce tour-ci a été contrecarré par un sort ou une capacité qu'un adversaire contrôlait, vous pouvez payer {0} à la place du coût de mana du Piège à invocation.\nRegardez les sept cartes du dessus de votre bibliothèque. Vous pouvez mettre sur le champ de bataille une carte de créature parmi celles-ci. Mettez les autres au-dessous de votre bibliothèque, dans n'importe quel ordre.", "type": "Éphémère : piège"}, {"language": "Italian", "multiverseId": 203188, "name": "Trappola Evocatrice", "text": "Se una magia creatura che hai lanciato in questo turno è stata neutralizzata da una magia o abilità controllata da un avversario, puoi pagare {0} invece di pagare il costo di mana della Trappola Evocatrice.\nGuarda le prime sette carte del tuo grimorio. Puoi mettere sul campo di battaglia una carta creatura scelta tra queste sette. Metti le altre in fondo al tuo grimorio in qualsiasi ordine.", "type": "Istantaneo — Trappola"}, {"language": "Japanese", "multiverseId": 203995, "name": "召喚の罠", "text": "このターン、あなたが唱えたクリーチャー呪文が、いずれかの対戦相手がコントロールするいずれかの呪文や能力に打ち消されていた場合、あなたは召喚の罠のマナ・コストを支払うのではなく、{0}を支払ってもよい。\nあなたのライブラリーの一番上から７枚のカードを見る。 あなたは、それらの中にあるクリーチャー・カードを１枚戦場に出してもよい。 残りをあなたのライブラリーの一番下に望む順番で置く。", "type": "インスタント — 罠"}, {"language": "Portuguese (Brazil)", "multiverseId": 203726, "name": "Armadilha de Convocação", "text": "Se uma mágica de criatura que você conjurou neste turno foi anulada por uma mágica ou habilidade que um oponente controlava, você pode pagar {0} em vez de pagar o custo de mana de Armadilha de Convocação.\nOlhe os sete cards do topo de seu grimório. Você pode colocar um card de criatura dentre eles no campo de batalha. Coloque o resto no fundo de seu grimório em qualquer ordem.", "type": "Mágica Instantânea — Armadilha"}, {"language": "Russian", "multiverseId": 203457, "name": "Западня Вызова", "text": "Если разыгранное вами в этом ходу заклинание существа было отменено заклинанием или способностью, находившимися под контролем оппонента, вы можете заплатить {0} вместо уплаты мана-стоимости Западни Вызова.\nПосмотрите семь верхних карт вашей библиотеки. Вы можете положить на поле битвы находящуюся среди них карту существа. Положите остальные карты в низ вашей библиотеки в любом порядке.", "type": "Мгновенное заклинание — Ловушка"}, {"language": "Chinese Simplified", "multiverseId": 204802, "name": "召兽陷阱", "text": "如果本回合中，你施放的生物咒语被由对手操控的咒语或异能所反击，你可以支付{0}，而不支付召兽陷阱的法术力费用。\n检视你牌库顶的七张牌。 你可以将其中一张生物牌放进战场。 将其余的牌以任意顺序置于你牌库底。", "type": "瞬间～陷阱"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "128141", "cardKingdomId": "127889", "cardsphereId": "48058", "mcmId": "21838", "mcmMetaId": "10820", "mtgjsonV4Id": "d3ad6d06-2f84-5a87-a0ac-4d90e7f1a080", "mtgoFoilId": "34795", "mtgoId": "34794", "multiverseId": "197527", "scryfallId": "72ce4a96-9cb2-4032-9291-7fa0849aeab9", "scryfallIllustrationId": "4e7f0cac-111e-4dba-9e1d-83fadb83e839", "scryfallOracleId": "2faa8dc1-0370-458c-9aef-44f81a9b5cd5", "tcgplayerProductId": "33442"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{G}{G}", "manaValue": 6.0, "name": "Summoning Trap", "number": "184", "originalText": "If a creature spell you cast this turn was countered by a spell or ability an opponent controlled, you may pay {0} rather than pay Summoning Trap's mana cost.\nLook at the top seven cards of your library. You may put a creature card from among them onto the battlefield. Put the rest on the bottom of your library in any order.", "originalType": "Instant — Trap", "printings": ["MM3", "ZEN"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/0a1adfa575ea5f98", "cardKingdomFoil": "https://mtgjson.com/links/b0c29b2b64c6c3bb", "cardmarket": "https://mtgjson.com/links/58fa12103bff3b27", "tcgplayer": "https://mtgjson.com/links/5b174f7e56cb6416"}, "rarity": "rare", "rulings": [{"date": "2009-10-01", "text": "You may ignore a Trap’s alternative cost condition and simply cast it for its normal mana cost. This is true even if its alternative cost condition has been met."}, {"date": "2009-10-01", "text": "Casting a Trap by paying its alternative cost doesn’t change its mana cost or converted mana cost. The only difference is the cost you actually pay."}, {"date": "2009-10-01", "text": "Effects that increase or reduce the cost to cast a Trap will apply to whichever cost you chose to pay."}, {"date": "2009-10-01", "text": "If there are seven or fewer cards in your library, you’ll look at all of them."}], "setCode": "ZEN", "subtypes": ["Trap"], "supertypes": [], "text": "If a creature spell you cast this turn was countered by a spell or ability an opponent controlled, you may pay {0} rather than pay this spell's mana cost.\nLook at the top seven cards of your library. You may put a creature card from among them onto the battlefield. Put the rest on the bottom of your library in any order.", "type": "Instant — Trap", "types": ["Instant"], "uuid": "85c406f8-807c-5aa4-8a2b-f78f5abb180b"}