{"artist": "Vincent Proce", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 2.0, "edhrecRank": 1715, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 263842, "name": "Sonnenuhr der Unendlichkeit", "text": "{1}, {T}: Beende den Zug. Aktiviere diese Fähigkeit nur während deines Zuges. (Schicke alle Zaubersprüche und Fähigkeiten auf dem Stapel ins Exil. Wirf Karten aus der Hand ab, bis du deine maximale Handkartenzahl erreicht hast. Schaden heilt, und „in diesem Zug\"- sowie „bis zum Ende des Zuges\"-Effekte enden.)", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 265087, "name": "Reloj de sol del infinito", "text": "{1}, {T}: Finaliza el turno. Activa esta habilidad sólo durante tu turno. (Exilia todos los hechizos y habilidades en la pila. Descarta hasta tu tamaño máximo de mano. El daño desaparece y terminan los efectos \"hasta el final del turno\" y \"este turno\".)", "type": "Artefacto"}, {"language": "French", "multiverseId": 263593, "name": "Cadran solaire de l'Infini", "text": "{1}, {T} : Terminez le tour. N'activez cette capacité que pendant votre tour. (Exilez tous les sorts et les capacités sur la pile. Défaussez-vous de cartes pour revenir à votre taille de main maximale. Les blessures disparaissent et les effets « ce tour » et « jusqu'à la fin du tour » se terminent.)", "type": "Artefact"}, {"language": "Italian", "multiverseId": 264091, "name": "Meridiana dell'Infinito", "text": "{1}, {T}: Termina il turno. Attiva questa abilità solo durante il tuo turno. (Esilia tutte le magie e le abilità in pila. Scarta fino a raggiungere il limite massimo di carte nella tua mano. Il danno viene rimosso e terminano gli effetti \"in questo turno\" e \"fino alla fine del turno\".)", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 264340, "name": "無限の日時計", "text": "{1}, {T}：ターンを終了する。 この能力は、あなたのターンの間にのみ起動できる。 （スタックの呪文や能力をすべて追放する。 あなたの手札の最大枚数になるまで手札を捨てる。 ダメージは消え、「このターン」と「ターン終了時まで」の効果は終わる。）", "type": "アーティファクト"}, {"language": "Korean", "name": "무한의 해시계", "text": ", : 턴을 종료한다. 당신의 턴 중에만 이 능력을 활성화한다. (스택에 있는 모든 주문과 능력을 추방한다. 당신의 치대손크기에 맞추도록 카드를 버린다. 지속물에 있던 모든 피해가 없어지고, \"이 턴에\"와 \"턴종료까지\"로 명시된 효과가 종료된다.)", "type": "마법물체"}, {"language": "Portuguese (Brazil)", "multiverseId": 264589, "name": "Meridiana do Infinito", "text": "{1}, {T}: Termine o turno. Ative esta habilidade apenas durante o seu próprio turno. (Exile todas as mágicas e habilidades na pilha. Descarte cards até atingir o seu número máximo permitido de cards na mão. O dano desaparece e efeitos que ocorrem \"neste turno\" e \"até o final do turno\" cessam.)", "type": "Artefato"}, {"language": "Russian", "multiverseId": 264838, "name": "Солнечные Часы Бесконечности", "text": "{1}, {T}: завершите ход. Активируйте эту способность только во время вашего хода. (Изгоните все находящиеся в стеке заклинания и способности. Сбросьте лишние карты до максимального размера вашей руки. Повреждения исчезают, и действие всех эффектов, существующих «в этом ходу» и «до конца хода», прекращается.)", "type": "Артефакт"}, {"language": "Chinese Simplified", "multiverseId": 263095, "name": "无尽日晷", "text": "{1}，{T}：结束本回合。 你只可以于自己的回合中起动此异能。 （放逐堆叠中的所有咒语与异能。 你将手牌弃掉、直到满足手牌上限为止。 生物上的伤害消失，并且注记着「本回合」与「直到回合结束」的效应均结束。）", "type": "神器"}, {"language": "Chinese Traditional", "multiverseId": 263344, "name": "無盡日晷", "text": "{1}，{T}：結束本回合。 你只可以於自己的回合中起動此異能。 （放逐堆疊中的所有咒語與異能。 你將手牌棄掉、直到滿足手牌上限為止。 生物上的傷害消失，並且註記著「本回合」與「直到回合結束」的效應均結束。）", "type": "神器"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "185421", "cardKingdomId": "185161", "cardsphereId": "27178", "mcmId": "247979", "mcmMetaId": "203501", "mtgjsonV4Id": "ce13971e-1817-5ee6-8021-e058506fde2e", "mtgoFoilId": "41484", "mtgoId": "41483", "multiverseId": "228118", "scryfallId": "36d3da9c-cb7a-4cea-b6e6-6722bd16c73c", "scryfallIllustrationId": "1cd29db7-799e-47d0-9e28-6f18d8ba0841", "scryfallOracleId": "79d46e09-2548-440f-9c02-3c3dc39a0cd1", "tcgplayerProductId": "47648"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}", "manaValue": 2.0, "name": "Sundial of the Infinite", "number": "218", "originalText": "{1}, {T}: End the turn. Activate this ability only during your turn. (Exile all spells and abilities on the stack. Discard down to your maximum hand size. Damage wears off, and \"this turn\" and \"until end of turn\" effects end.)", "originalType": "Artifact", "printings": ["FMB1", "M12"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/c79f914068406b64", "cardKingdomFoil": "https://mtgjson.com/links/1b79468f24bec2f0", "cardmarket": "https://mtgjson.com/links/9efda12e7dffe458", "tcgplayer": "https://mtgjson.com/links/79965bdf6cefae9e"}, "rarity": "rare", "rulings": [{"date": "2011-09-22", "text": "Ending the turn this way means the following things happen in order: 1) All spells and abilities on the stack are exiled. This includes spells and abilities that can't be countered. 2) All attacking and blocking creatures are removed from combat. 3) State-based actions are checked. No player gets priority, and no triggered abilities are put onto the stack. 4) The current phase and/or step ends. The game skips straight to the cleanup step. The cleanup step happens in its entirety."}, {"date": "2011-09-22", "text": "If any triggered abilities do trigger during this process, they’re put onto the stack during the cleanup step. If this happens, players will have a chance to cast spells and activate abilities, then there will be another cleanup step before the turn finally ends."}, {"date": "2011-09-22", "text": "Though spells and abilities that are exiled won’t get a chance to resolve, they don’t count as being “countered.”"}, {"date": "2011-09-22", "text": "If Sundial of the Infinite’s ability is activated before the end step, any “at the beginning of the end step”-triggered abilities won’t get the chance to trigger that turn because the end step is skipped. Those abilities will trigger at the beginning of the end step of the next turn. The same is true of abilities that trigger at the beginning of other phases or steps (except upkeep)."}, {"date": "2011-09-22", "text": "The earliest that you can activate Sundial of the Infinite’s ability is during your upkeep step, after abilities that trigger “at the beginning of your upkeep” have been put onto the stack but before they resolve."}], "setCode": "M12", "subtypes": [], "supertypes": [], "text": "{1}, {T}: End the turn. Activate only during your turn. (Exile all spells and abilities from the stack. Discard down to your maximum hand size. Damage wears off, and \"this turn\" and \"until end of turn\" effects end.)", "type": "Artifact", "types": ["Artifact"], "uuid": "82525319-0976-5875-88a8-94e6f59a2589"}