{"artist": "Shishizaru", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 3.0, "edhrecRank": 12026, "finishes": ["nonfoil", "foil"], "flavorText": "Centuries of wind, rain, and roots compressed into an instant of destruction: such is the power of Selesnya.", "foreignData": [{"flavorText": "Wenn man Jahrhunderte aus Wind, Regen und Wurzeln zu einem einzigen zerstörerischen Moment zusammenpackt, dann hat man die Macht von Selesnija.", "language": "German", "multiverseId": 111843, "name": "Absondern des Lebens", "text": "Einberufen (Jede Kreatur, die du tappst, während du diesen Zauberspruch spielst, reduziert dessen Kosten um {1} oder um ein Mana der Farbe jener Kreatur.)\nZerstöre ein Artefakt oder eine Verzauberung deiner Wahl.", "type": "Spontanzauber"}, {"flavorText": "Siglos de viento, lluvia y raíces en un solo instante de destrucción: ese es el poder de Selesnya.", "language": "Spanish", "multiverseId": 113373, "name": "Vitalidad quebradora", "text": "Convocar (Cada criatura que gires al jugar este hechizo reduce su coste en {1} o en un maná del color de esa criatura.)\nDestruye el artefacto o encantamiento objetivo.", "type": "Instantáneo"}, {"flavorText": "Des siècles de vent, de pluie et de racines compressés en un instant de destruction : telle est la puissance de Selesnya.", "language": "French", "multiverseId": 112149, "name": "Vigueur morceleuse", "text": "Convocation (Chaque créature que vous engagez en jouant ce sort réduit son coût de {1} ou d'un mana de la couleur de cette créature.)\nDétruisez l'artefact ciblé ou l'enchantement ciblé.", "type": "Éphémère"}, {"flavorText": "Secoli di vento, pioggia e radici compressi in un solo istante di distruzione: questo è il potere di Selesnya.", "language": "Italian", "multiverseId": 112455, "name": "Energia di Scissione", "text": "Convocazione (Ciascuna creatura che TAPpi mentre giochi questa magia riduce il suo costo di {1} o di un mana del colore di quella creatura.)\nDistruggi un artefatto o un incantesimo bersaglio.", "type": "Istantaneo"}, {"flavorText": "何世紀もの風や雨や根が重なり合って破壊をもたらす。それこそがセレズニアの力だ。", "language": "Japanese", "multiverseId": 112761, "name": "隔離する活力", "text": "召集 （あなたがこの呪文をプレイする段階であなたがタップした各クリーチャーにつき、この呪文のコストはそのクリーチャーの色のマナ１点か{1}少なくなる。）\nアーティファクト１つかエンチャント１つを対象とし、それを破壊する。", "type": "インスタント"}, {"flavorText": "Séculos de vento, chuva e raízes compactados em um instante de destruição: este é o poder dos Selesnya.", "language": "Portuguese (Brazil)", "multiverseId": 113067, "name": "Vida Esfaceladora", "text": "Convocar (Cada criatura que você vira ao jogar esta mágica reduz seu custo em {1} ou em um mana da cor daquela criatura.)\nDestrói o artefato alvo ou o encantamento alvo.", "type": "Mágica Instantânea"}, {"flavorText": "В едином порыве разрушения соединились многовековые воздействия ветра, дождя и корней. Такова сила Селезнии.", "language": "Russian", "multiverseId": 114475, "name": "Разъединенная жизнь", "text": "Созыв (Когда вы разыгрываете это заклинание, каждое повернутое существо уменьшает стоимость заклинания на {1} или на один пункт маны цвета этого существа).\nУничтожьте целевой артефакт или чары.", "type": "Мгновенное заклинание"}, {"flavorText": "几个世纪的狂风、暴雨和缠根，凝聚成瞬间的破坏；这便是瑟雷尼亚的力量。", "language": "Chinese Simplified", "multiverseId": 111537, "name": "粉碎活力", "text": "召集（使用此咒语时，你每为它横置一个生物，便可以少支付{1}，或一点所横置生物颜色的法术力。）\n消灭目标神器或结界。", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "118888", "cardKingdomId": "118597", "cardsphereId": "38361", "mcmId": "13547", "mcmMetaId": "8104", "mtgjsonV4Id": "9386af65-af7b-584b-9a81-549aef513805", "mtgoFoilId": "23189", "mtgoId": "23188", "multiverseId": "87927", "scryfallId": "1ab15b40-c5c8-4d77-a4c0-982b6bf94267", "scryfallIllustrationId": "39d21734-0723-4bf9-8338-c09b42739440", "scryfallOracleId": "132c8a62-00bc-4b89-b775-099d8909f200", "tcgplayerProductId": "13432"}, "keywords": ["Convoke"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}", "manaValue": 3.0, "name": "Sundering Vitae", "number": "185", "originalText": "Convoke (Each creature you tap while playing this spell reduces its cost by {1} or by one mana of that creature's color.)\nDestroy target artifact or enchantment.", "originalType": "Instant", "printings": ["MM2", "RAV"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/5d52bee63da22667", "cardKingdomFoil": "https://mtgjson.com/links/221699dca6434069", "cardmarket": "https://mtgjson.com/links/3dabbd7d7314e345", "tcgplayer": "https://mtgjson.com/links/d63b73040a0bca08"}, "rarity": "common", "rulings": [{"date": "2014-07-18", "text": "The rules for convoke have changed slightly since it last appeared in an expansion. Previously, convoke reduced the cost to cast a spell. Under current rules, you tap creatures at the same time you pay the spell’s costs. Tapping a creature this way is simply another way to pay."}, {"date": "2014-07-18", "text": "Convoke doesn’t change a spell’s mana cost or converted mana cost."}, {"date": "2014-07-18", "text": "When calculating a spell’s total cost, include any alternative costs, additional costs, or anything else that increases or reduces the cost to cast the spell. Convoke applies after the total cost is calculated."}, {"date": "2014-07-18", "text": "Because convoke isn’t an alternative cost, it can be used in conjunction with alternative costs."}, {"date": "2014-07-18", "text": "Tapping a multicolored creature using convoke will pay for {1} or one mana of your choice of any of that creature’s colors."}, {"date": "2014-07-18", "text": "When using convoke to cast a spell with {X} in its mana cost, first choose the value for X. That choice, plus any cost increases or decreases, will determine the spell’s total cost. Then you can tap creatures you control to help pay that cost. For example, if you cast Chord of Calling (a spell with convoke and mana cost {X}{G}{G}{G}) and choose X to be 3, the total cost is {3}{G}{G}{G}. If you tap two green creatures and two red creatures, you’ll have to pay {1}{G}."}, {"date": "2014-07-18", "text": "If a creature you control has a mana ability with {T} in the cost, activating that ability while casting a spell with convoke will result in the creature being tapped when you pay the spell’s costs. You won’t be able to tap it again for convoke. Similarly, if you sacrifice a creature to activate a mana ability while casting a spell with convoke, that creature won’t be on the battlefield when you pay the spell’s costs, so you won’t be able to tap it for convoke."}], "setCode": "RAV", "subtypes": [], "supertypes": [], "text": "Convoke (Your creatures can help cast this spell. Each creature you tap while casting this spell pays for {1} or one mana of that creature's color.)\nDestroy target artifact or enchantment.", "type": "Instant", "types": ["Instant"], "uuid": "febb466a-a484-5a03-b1d2-8bb518b79cf4", "watermark": "selesnya"}