{"artist": "Monte Michael Moore", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 22748, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 167646, "name": "Sonnenfeuer-Salbe", "text": "Verhindere die nächsten 4 Schadenspunkte, die in diesem Zug einer Kreatur oder einem Spieler deiner Wahl zugefügt werden.\nUmwandlung {1}{W} ({1}{W}, wirf diese Karte aus deiner Hand ab: Ziehe eine Karte.)\nWenn du die Sonnenfeuer-Salbe umwandelst, kannst du den nächsten 1 Schadenspunkt, der einer Kreatur oder einem Spieler deiner Wahl in diesem Zug zugefügt würde, verhindern.", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 170307, "name": "Bálsamo fuegosol", "text": "Prevén los siguientes 4 puntos de daño que se le fuera a hacer a la criatura o jugador objetivo este turno.\nCiclo {1}{W}. ({1}{W}, descartar esta carta de tu mano: Roba una carta.)\nCuando uses la habilidad de ciclo del Bálsamo fuegosol, puedes prevenir el siguiente punto de daño que se le fuera a hacer a la criatura o jugador objetivo este turno.", "type": "Instantáneo"}, {"language": "French", "multiverseId": 168003, "name": "Baume solaire", "text": "Prévenez, ce tour-ci, les prochaines 4 blessures qui devraient être infligées à une cible, créature ou joueur.\nRecyclage {1}{W} ({1}{W}, défaussez-vous de cette carte de votre main : Piochez une carte.)Quand vous recyclez le Baume solaire, vous pouvez prévenir, ce tour-ci, la prochaine 1 blessure qui devrait être infligée à une cible, créature ou joueur\n.", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 168368, "name": "Balsamo di Fuocosole", "text": "Previeni i prossimi 4 danni che verrebbero inflitti a una creatura o a un giocatore bersaglio in questo turno.\nCiclo {1}{W} ({1}{W}, Scarta questa carta dalla tua mano: Pesca una carta).\nQuando usi l'abilità ciclo del Balsamo di Fuocosole, puoi prevenire il prossimo punto danno che verrebbe inflitto a una creatura o a un giocatore bersaglio in questo turno.", "type": "Istantaneo"}, {"language": "Japanese", "name": "陽光の香油"}, {"language": "Portuguese (Brazil)", "multiverseId": 168718, "name": "Bálsamo de Fogo Solar", "text": "Previne os próximos 4 pontos de dano que seriam causados à criatura ou ao jogador alvo neste turno.\nReciclar {1}{W} ({1}{W}, Descarte este card de sua mão: Compre um card.)\nQuando reciclar Bálsamo de Fogo Solar, você poderá prevenir o próximo 1 ponto de dano que seria causado à criatura alvo ou ao jogador alvo neste turno.", "type": "Mágica Instantânea"}], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "61055", "cardKingdomId": "60055", "cardsphereId": "35031", "mcmId": "1687", "mcmMetaId": "5707", "mtgjsonV4Id": "6e73c9a0-e2f0-50ef-97a4-d2021f5d3e47", "mtgoFoilId": "17736", "mtgoId": "17735", "multiverseId": "41144", "scryfallId": "0d563ebb-ecd1-406c-9d69-c101acdeced7", "scryfallIllustrationId": "fe53b655-e24d-498d-81fb-20c00a0e373d", "scryfallOracleId": "61d2f269-8674-4429-a07c-59972afd9ede", "tcgplayerProductId": "10457"}, "keywords": ["Cycling"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "penny": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}", "manaValue": 3.0, "name": "Sunfire Balm", "number": "56", "originalText": "Prevent the next 4 damage that would be dealt to target creature or player this turn.\nCycling o1o\nW (o1o\nW, Discard this card from your hand: Draw a card.)\nWhen you cycle Sunfire Balm, you may prevent the next 1 damage that would be dealt to target creature or player this turn.", "originalType": "Instant", "printings": ["ONS"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/a87e933ed818253a", "cardKingdomFoil": "https://mtgjson.com/links/1b9f06b0bfe840b2", "cardmarket": "https://mtgjson.com/links/5741bdbf24f07ede", "tcgplayer": "https://mtgjson.com/links/4fb58680b2be7466"}, "rarity": "uncommon", "rulings": [{"date": "2008-10-01", "text": "Cycling is an activated ability. Effects that interact with activated abilities (such as Stifle or Rings of Brighthearth) will interact with cycling. Effects that interact with spells (such as Remove Soul or Faerie Tauntings) will not."}, {"date": "2008-10-01", "text": "When you cycle this card, first the cycling ability goes on the stack, then the triggered ability goes on the stack on top of it. The triggered ability will resolve before you draw a card from the cycling ability."}, {"date": "2008-10-01", "text": "The cycling ability and the triggered ability are separate. If the triggered ability doesn't resolve (due to being countered with Stifle, for example, or if all its targets have become illegal), the cycling ability will still resolve and you'll draw a card."}, {"date": "2008-10-01", "text": "You can cycle this card even if there are no targets for the triggered ability. That's because the cycling ability itself has no targets."}], "setCode": "ONS", "subtypes": [], "supertypes": [], "text": "Prevent the next 4 damage that would be dealt to any target this turn.\nCycling {1}{W} ({1}{W}, Discard this card: Draw a card.)\nWhen you cycle Sunfire Balm, you may prevent the next 1 damage that would be dealt to any target this turn.", "type": "Instant", "types": ["Instant"], "uuid": "93bc409f-e57b-5b5a-8953-27a237a2642e"}