{"artist": "Izzy", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 2786, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 484955, "name": "Mürrischer Dachssaurier", "text": "Immer wenn du eine Kreaturenkarte abwirfst, lege eine +1/+1-Marke auf den Mürrischen Dachssaurier.\nImmer wenn du eine Länderkarte abwirfst, erzeuge einen Schatz-Spielstein. (Er ist ein Artefakt mit „{T}, opfere dieses Artefakt: Erzeuge ein Mana einer beliebigen Farbe.\")\nImmer wenn du eine Karte, die weder eine Kreatur noch ein Land ist, abwirfst, kämpft der Mürrische Dachssaurier gegen bis zu eine Kreatur deiner Wahl, die du nicht kontrollierst.", "type": "Kreatur — Dachs, Dinosaurier"}, {"language": "Spanish", "multiverseId": 485006, "name": "Tejosaurio malhumorado", "text": "Siempre que descartes una carta de criatura, pon un contador +1/+1 sobre el Tejosaurio malhumorado.\nSiempre que descartes una carta de tierra, crea una ficha de Tesoro. (Es un artefacto con \"{T}, sacrificar este artefacto: Agrega un maná de cualquier color\".)\nSiempre que descartes una carta que no sea de criatura o de tierra, el Tejosaurio malhumorado lucha contra hasta una criatura objetivo que no controlas.", "type": "Criatura — Dinosaurio tejón"}, {"language": "French", "multiverseId": 485057, "name": "Blairosaure revêche", "text": "À chaque fois que vous vous défaussez d'une carte de créature, mettez un marqueur +1/+1 sur le Blairosaure revêche.\nÀ chaque fois que vous vous défaussez d'une carte de terrain, créez un jeton Trésor. (C'est un artefact avec « {T}, sacrifiez cet artefact : Ajoutez un mana de la couleur de votre choix. »)\nÀ chaque fois que vous vous défaussez d'une carte non-créature, non-terrain, le Blairosaure revêche se bat contre jusqu'à une créature ciblée que vous ne contrôlez pas.", "type": "Créature : blaireau et dinosaure"}, {"language": "Italian", "multiverseId": 485108, "name": "Tassosauro Scontroso", "text": "Ogniqualvolta scarti una carta creatura, metti un segnalino +1/+1 sul Tassosauro Scontroso.\nOgniqualvolta scarti una carta terra, crea una pedina Tesoro. (È un artefatto con: \"{T}, Sacrifica questo artefatto: Aggiungi un mana di un qualsiasi colore\".)\nOgniqualvolta scarti una carta non creatura, non terra, il Tassosauro Scontroso lotta con fino a una creatura bersaglio che non controlli.", "type": "Creatura — Dinosauro Tasso"}, {"language": "Japanese", "multiverseId": 485159, "name": "無愛想なアナグマザウルス", "text": "あなたがクリーチャー・カードを１枚捨てるたび、無愛想なアナグマザウルスの上に＋１/＋１カウンターを１個置く。\nあなたが土地・カードを１枚捨てるたび、宝物・トークンを１つ生成する。（それは、「{T}, このアーティファクトを生け贄に捧げる：好きな色１色のマナ１点を加える。」を持つアーティファクトである。）\nあなたがクリーチャーでも土地でもないカードを１枚捨てるたび、あなたがコントロールしていないクリーチャー最大１体を対象とする。無愛想なアナグマザウルスはそれと格闘を行う。", "type": "クリーチャー — アナグマ・恐竜"}, {"language": "Portuguese (Brazil)", "multiverseId": 485210, "name": "Texugossauro Ranzinza", "text": "Toda vez que você descartar um card de criatura, coloque um marcador +1/+1 em Texugossauro Ranzinza.\nToda vez que você descartar um card de terreno, crie uma ficha de Tesouro. (Ela é um artefato com \"{T}, sacrifique este artefato: Adicione um mana de qualquer cor.\")\nToda vez que você descarta um card que não seja de criatura nem de terreno, Texugossauro Ranzinza luta com até uma criatura alvo que você não controla.", "type": "Criatura — Texugo Dinossauro"}, {"language": "Russian", "multiverseId": 485261, "name": "Угрюмый Барсукозавр", "text": "Каждый раз, когда вы сбрасываете карту существа, положите один жетон +1/+1 на Угрюмого Барсукозавра.\nКаждый раз, когда вы сбрасываете карту земли, создайте одну фишку Клада. (Это артефакт со способностью «{T}, пожертвуйте этот артефакт: добавьте одну ману любого цвета».)\nКаждый раз, когда вы сбрасываете карту, не являющуюся ни существом, ни землей, Угрюмый Барсукозавр дерется не более чем с одним целевым существом не под вашим контролем.", "type": "Существо — Барсук Динозавр"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "232365", "cardsphereId": "66394", "mcmId": "452528", "mtgjsonV4Id": "2e01090b-b13e-54f0-9325-d6ca524b0327", "mtgoId": "80695", "multiverseId": "484904", "scryfallId": "7ba507e2-fe5e-4947-aada-20184aa09700", "scryfallIllustrationId": "fd7d1cd9-2974-4cd1-93d4-b6782c792a47", "scryfallOracleId": "0209dc74-ac49-4deb-907a-e9fa49d27a0f", "tcgplayerProductId": "212233"}, "isStarter": true, "keywords": ["Fight"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}", "manaValue": 4.0, "name": "Surly Badgersaur", "number": "57", "originalText": "Whenever you discard a creature card, put a +1/+1 counter on Surly Badgersaur.\nWhenever you discard a land card, create a Treasure token. (It's an artifact with \"{T}, Sacrifice this artifact: Add one mana of any color.\")\nWhenever you discard a noncreature, nonland card, Surly Badgersaur fights up to one target creature you don't control.", "originalType": "Creature — Badger Dinosaur", "power": "3", "printings": ["C20"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/388d25df6cf51d4f", "tcgplayer": "https://mtgjson.com/links/c6cd7b9753b84c83"}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "Surly Badgersaur’s abilities are triggered abilities, not activated abilities. They don’t allow you to discard a card whenever you want; rather, you need some other way of discarding a card, such as a cycling ability."}, {"date": "2020-04-17", "text": "If you discard a card as a cost to cast a spell or activate an ability, Surly Badgersaur’s triggered ability resolves before that spell or ability but after you’ve chosen targets for it. If you discard a card while a spell or ability is resolving, that spell or ability finishes resolving before Surly Badgersaur’s triggered ability does."}, {"date": "2020-04-17", "text": "If the target creature is an illegal target when Surly Badgersaur’s last ability tries to resolve, the ability doesn’t resolve. If it’s a legal target but Surly Badgersaur is no longer on the battlefield when the ability resolves, the target creature won’t deal or be dealt damage."}], "securityStamp": "oval", "setCode": "C20", "subtypes": ["Badger", "Dinosaur"], "supertypes": [], "text": "Whenever you discard a creature card, put a +1/+1 counter on Surly Badgersaur.\nWhenever you discard a land card, create a Treasure token. (It's an artifact with \"{T}, Sacrifice this artifact: Add one mana of any color.\")\nWhenever you discard a noncreature, nonland card, Surly Badgersaur fights up to one target creature you don't control.", "toughness": "3", "type": "Creature — Badger Dinosaur", "types": ["Creature"], "uuid": "d6bb93ba-0993-5d2f-a54b-afd8f4ca1817"}