{"artist": "Scott Chou", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 9961, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 217379, "name": "Notfalllager", "text": "Du erhältst 2 Lebenspunkte dazu. Dann ziehst du, falls du mehr Lebenspunkte als ein Gegner hast, eine Karte.\nAbprall (Falls du diesen Zauberspruch aus deiner Hand wirkst, schicke ihn ins Exil, sowie er verrechnet wird. Du kannst zu Beginn deines nächsten Versorgungssegments diese Karte aus dem Exil wirken, ohne ihre Manakosten zu bezahlen.)", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 217131, "name": "Reserva de supervivencia", "text": "Gana 2 vidas. Luego, si tienes más vidas que un oponente, roba una carta.\nRebote. (Si lanzas este hechizo de tu mano, exílialo en cuanto se resuelve. Al comienzo de tu próximo mantenimiento, puedes lanzar esta carta desde el exilio sin pagar su coste de maná.)", "type": "Conjuro"}, {"language": "French", "multiverseId": 215643, "name": "Cache de survie", "text": "Vous gagnez 2 points de vie. Ensuite, si vous avez plus de points de vie qu'un adversaire, piochez une carte.\nRebond (Si vous lancez ce sort depuis votre main, exilez-le au moment où il se résout. Au début de votre prochain entretien, vous pouvez lancer cette carte depuis l'exil sans payer son coût de mana.)", "type": "Rituel"}, {"language": "Italian", "multiverseId": 216387, "name": "Nascondiglio di Sopravvivenza", "text": "Guadagni 2 punti vita. Poi se hai più punti vita di un avversario, pesca una carta.\nRipresa (Se lanci questa magia dalla tua mano, esiliala quando si risolve. All'inizio del tuo prossimo mantenimento, puoi lanciare questa carta dall'esilio senza pagare il suo costo di mana.)", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 216635, "name": "生き残りの隠し場所", "text": "あなたは２点のライフを得る。 その後、あなたのライフがいずれかの対戦相手よりも多い場合、カードを１枚引く。\n反復 （あなたがこの呪文をあなたの手札から唱えた場合、それの解決に際し、それを追放する。 あなたの次のアップキープの開始時に、あなたはこのカードを追放領域からマナ・コストを支払うことなく唱えてもよい。）", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 216883, "name": "Esconderijo de Sobrevivência", "text": "Você ganha 2 pontos de vida. Em seguida, se tiver mais pontos de vida do que um oponente, compre um card.\nRebote (Se conjurar esta mágica da sua mão, exile-a quando ela for resolvida. No início de sua próxima manutenção, você poderá conjurar este card do exílio sem pagar seu custo de mana.)", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 215891, "name": "Запас для Выживания", "text": "Вы получаете 2 жизни. Затем, если у вас больше жизней, чем у оппонента, возьмите карту.\nОтскок (Если вы разыгрываете это заклинание из вашей руки, изгоните его в момент его разрешения. В начале вашего следующего шага поддержки вы можете разыграть эту карту из изгнания без уплаты ее мана-стоимости.)", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 216139, "name": "避难密储", "text": "你获得2点生命。 然后如果你的生命比某位对手多，则抓一张牌。\n弹回 （如果你从你手上施放此牌，于它结算时将之放逐。 在你的下一个维持开始时，你可以从放逐区施放此牌，且不须支付其法术力费用。）", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "131013", "cardKingdomId": "130772", "cardsphereId": "39797", "mcmId": "22627", "mcmMetaId": "11304", "mtgjsonV4Id": "fde2b489-12e0-508f-ae30-6cb9fbeb23a6", "mtgoFoilId": "36507", "mtgoId": "36506", "multiverseId": "193531", "scryfallId": "4333f864-6b1c-4720-b2d6-490d5c7b31a1", "scryfallIllustrationId": "a890013d-7231-402b-858d-4db9a6a9f062", "scryfallOracleId": "5fb8be5a-3666-4680-84e2-341cb269df07", "tcgplayerProductId": "34742"}, "keywords": ["Rebound"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}", "manaValue": 3.0, "name": "Survival Cache", "number": "48", "originalText": "You gain 2 life. Then if you have more life than an opponent, draw a card.\nRebound (If you cast this spell from your hand, exile it as it resolves. At the beginning of your next upkeep, you may cast this card from exile without paying its mana cost.)", "originalType": "Sorcery", "printings": ["C13", "IMA", "ROE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/3c021ae956f0dc46", "cardKingdomFoil": "https://mtgjson.com/links/5eb15da590547b97", "cardmarket": "https://mtgjson.com/links/8125c06ef8f43579", "tcgplayer": "https://mtgjson.com/links/73689269924352cb"}, "rarity": "uncommon", "rulings": [{"date": "2010-06-15", "text": "If a spell with rebound that you cast from your hand doesn’t resolve for any reason (due being countered by a spell like Cancel, or because all of its targets are illegal), rebound has no effect. The spell is simply put into your graveyard. You won’t get to cast it again next turn."}, {"date": "2010-06-15", "text": "If you cast a spell with rebound from anywhere other than your hand (such as from your graveyard due to Sins of the Past, from your library due to cascade, or from your opponent’s hand due to Sen Triplets), rebound won’t have any effect. If you do cast it from your hand, rebound will work regardless of whether you paid its mana cost (for example, if you cast it from your hand due to Maelstrom Archangel)."}, {"date": "2010-06-15", "text": "If a replacement effect would cause a spell with rebound that you cast from your hand to be put somewhere else instead of your graveyard (such as Leyline of the Void might), you choose whether to apply the rebound effect or the other effect as the spell resolves."}, {"date": "2010-06-15", "text": "Rebound will have no effect on copies of spells because you don’t cast them from your hand."}, {"date": "2010-06-15", "text": "If you cast a spell with rebound from your hand and it resolves, it isn’t put into your graveyard. Rather, it’s exiled directly from the stack. Effects that care about cards being put into your graveyard won’t do anything."}, {"date": "2010-06-15", "text": "At the beginning of your upkeep, all delayed triggered abilities created by rebound effects trigger. You may handle them in any order. If you want to cast a card this way, you do so as part of the resolution of its delayed triggered ability. Timing restrictions based on the card’s type (if it’s a sorcery) are ignored. Other restrictions are not (such as the one from Rule of Law)."}, {"date": "2010-06-15", "text": "If you are unable to cast a card from exile this way, or you choose not to, nothing happens when the delayed triggered ability resolves. The card remains exiled for the rest of the game, and you won’t get another chance to cast the card. The same is true if the ability is countered (due to Stifle, perhaps)."}, {"date": "2010-06-15", "text": "If you cast a card from exile this way, it will go to your graveyard when it resolves, fails to resolve, or is countered. It won’t go back to exile."}, {"date": "2010-06-15", "text": "In a Two-Headed Giant game, anything that cares about your life total checks the life total of your team. For example, say that your team has 10 life and your opponent’s team has 11 life when you cast Survival Cache. You’ll gain 2 life, so your team’s life total becomes 12. Since your life total (12) is greater than an opponent’s life total (11), you’ll draw a card."}], "setCode": "ROE", "subtypes": [], "supertypes": [], "text": "You gain 2 life. Then if you have more life than an opponent, draw a card.\nRebound (If you cast this spell from your hand, exile it as it resolves. At the beginning of your next upkeep, you may cast this card from exile without paying its mana cost.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "d5475175-b171-5cef-8d2b-11b57352e28b"}