{"artist": "DZO", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G", "R"], "colors": ["G", "R"], "convertedManaCost": 3.0, "edhrecRank": 5312, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "23ef2ea7-ec8d-5e50-babc-cd76944f5f7c", "mtgoId": "88380", "scryfallId": "95b1dd27-3c81-4088-9898-b126eac1a5c6", "scryfallIllustrationId": "5a305969-57b3-45f4-94bc-96c89ede9f72", "scryfallOracleId": "7fd8a508-335c-4d5a-9916-23bf26dfff38"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}{G}", "manaValue": 3.0, "name": "Svella, Ice Shaper", "number": "88380", "originalReleaseDate": "2021-02-28", "power": "2", "printings": ["KHM", "PRM"], "purchaseUrls": {}, "rarity": "uncommon", "rulings": [{"date": "2021-02-05", "text": "The spell you cast with Svella’s last ability is cast from your library."}, {"date": "2021-02-05", "text": "If you cast a spell using Svella’s ability, you do so as part of the resolution of that ability. You can’t wait to cast it later in the turn. Timing permissions based on the card’s type are ignored."}, {"date": "2021-02-05", "text": "If you cast a spell “without paying its mana cost,” you can’t choose to cast it for any alternative costs. You can, however, pay additional costs, such as kicker costs. If the card has any mandatory additional costs, those must be paid to cast the spell."}, {"date": "2021-02-05", "text": "If the spell has {X} in its mana cost, you must choose 0 as the value of X."}, {"date": "2021-02-05", "text": "In some unusual cases, the order of your library will matter as you cast the spell from among the revealed cards. Remember that looking at the top cards of your library doesn’t change their order or allow you to change their order. You don’t put the cards on the bottom of your library until after you are done casting the spell."}, {"date": "2021-02-05", "text": "You’ll put the cards you didn’t cast on the bottom of your library before the spell you cast resolves."}, {"date": "2021-02-05", "text": "Snow is a supertype, not a card type. It has no rules meaning or function by itself, but spells and abilities may refer to it."}, {"date": "2021-02-05", "text": "The {S} symbol is a generic mana symbol. It represents a cost that can be paid by one mana that was produced by a snow source. That mana can be any color or colorless."}, {"date": "2021-02-05", "text": "Snow isn’t a type of mana. If an effect says you may spend mana as though it were any type, you can’t pay for {S} using mana that wasn’t produced by a snow source."}, {"date": "2021-02-05", "text": "Some cards have additional effects for each {S} spent to cast them. You can cast these spells even if you don’t spend any snow mana to cast them; their additional effects simply won’t do anything."}, {"date": "2021-02-05", "text": "The Kaldheim set doesn’t have any cards with mana costs that include {S}, but some previous sets do. If an effect says such a spell costs {1} less to cast, that reduction doesn’t apply to any {S} costs. This is also true for activated abilities that include {S} in their activation costs and effects that reduce those costs."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Troll", "Warrior"], "supertypes": ["Legendary", "Snow"], "text": "{3}, {T}: Create a colorless snow artifact token named Icy Manalith with \"{T}: Add one mana of any color.\"\n{6}{R}{G}, {T}: Look at the top four cards of your library. You may cast a spell from among them without paying its mana cost. Put the rest on the bottom of your library in a random order.", "toughness": "4", "type": "Legendary Snow Creature — Troll Warrior", "types": ["Creature"], "uuid": "da5b4f6b-fd27-5c9c-9a06-318a5ae94a21"}