{"artist": "Brian Valeza", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 2.0, "edhrecRank": 3357, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 532016, "name": "Schwert der Stunden", "text": "Immer wenn die ausgerüstete Kreatur angreift, lege eine +1/+1-Marke auf sie.\nImmer wenn die ausgerüstete Kreatur Kampfschaden zufügt, würfle einen W12. Falls das Ergebnis größer als der zugefügte Schaden oder gleich 12 ist, verdopple die Anzahl der +1/+1-Marken auf der Kreatur.\nAusrüsten {2} ({2}: Lege diese Karte an eine Kreatur deiner Wahl an, die du kontrollierst. Spiele Ausrüsten wie eine Hexerei.)", "type": "Artefakt — Ausrüstung"}, {"language": "Spanish", "multiverseId": 532070, "name": "Espada de las horas", "text": "Siempre que la criatura equipada ataque, pon un contador +1/+1 sobre ella.\nSiempre que la criatura equipada haga daño de combate, tira 1d12. Si el resultado es mayor al daño hecho o el resultado es 12, duplica la cantidad de contadores +1/+1 sobre esa criatura.\nEquipar {2}. ({2}: Anexa este Equipo a la criatura objetivo que controlas. Activa la habilidad de equipar como un conjuro.)", "type": "Artefacto — Equipo"}, {"language": "French", "multiverseId": 532124, "name": "Épée des heures", "text": "À chaque fois que la créature équipée attaque, mettez un marqueur +1/+1 sur elle.\nÀ chaque fois que la créature équipée inflige des blessures de combat, lancez un d12. Si le résultat est supérieur au nombre de blessures infligées ou que le résultat est 12, doublez le nombre de marqueurs +1/+1 sur cette créature.\nÉquipement {2} ({2} : Attachez à une créature ciblée que vous contrôlez. N'attachez l'équipement que lorsque vous pourriez lancer un rituel.)", "type": "Artefact : équipement"}, {"language": "Italian", "multiverseId": 532178, "name": "Spada delle Ore", "text": "Ogniqualvolta la creatura equipaggiata attacca, metti un segnalino +1/+1 su di essa.\nOgniqualvolta la creatura equipaggiata infligge danno da combattimento, tira un d12. Se il risultato è superiore al danno inflitto o il risultato è 12, raddoppia il numero di segnalini +1/+1 su quella creatura.\nEquipaggiare {2} ({2}: Assegna a una creatura bersaglio che controlli. Equipaggia solo come una stregoneria.)", "type": "Artefatto — Equipaggiamento"}, {"language": "Japanese", "multiverseId": 532232, "name": "時の剣", "text": "装備しているクリーチャーが攻撃するたび、それの上に＋１/＋１カウンターを１個置く。\n装備しているクリーチャーが戦闘ダメージを与えるたび、１個のd12を振る。その出目がその与えたダメージより大きいかその出目が12であるなら、そのクリーチャーの上に置かれている＋１/＋１カウンターの個数を２倍にする。\n装備{2}（{2}：あなたがコントロールしているクリーチャー１体を対象とする。これをそれにつける。装備はソーサリーとしてのみ行う。）", "type": "アーティファクト — 装備品"}, {"language": "Portuguese (Brazil)", "multiverseId": 532286, "name": "Espada das Horas", "text": "Toda vez que a criatura equipada atacar, coloque um marcador +1/+1 nela.\nToda vez que a criatura equipada causar dano de combate, role um d12. Se o resultado for maior que o dano causado ou for 12, dobre o número de marcadores +1/+1 naquela criatura.\nEquipar {2} ({2}: Anexe este equipamento à criatura alvo que você controla. Equipe somente como um feitiço.)", "type": "Artefato — Equipamento"}, {"language": "Russian", "multiverseId": 532340, "name": "Меч Часов", "text": "Каждый раз, когда снаряженное существо атакует, положите на него один жетон +1/+1.\nКаждый раз, когда снаряженное существо наносит боевые повреждения, бросьте d12. Если результат больше, чем нанесенные повреждения, или результат равен 12, то удвойте количество жетонов +1/+1 на том существе.\nСнарядить {2} ({2}: прикрепите к целевому существу под вашим контролем. Снаряжайте только как волшебство.)", "type": "Артефакт — Снаряжение"}, {"language": "Chinese Simplified", "multiverseId": 532394, "name": "日晷魔剑", "text": "每当佩带此武具的生物攻击时，在其上放置一个+1/+1指示物。\n每当佩带此武具的生物造成战斗伤害时，掷一颗d12。如果掷骰结果大于所造成的伤害或掷骰结果为12，则将该生物上的+1/+1指示物数量加倍。\n佩带{2}（{2}：贴附在目标由你操控的生物上。只能于法术时机佩带。）", "type": "神器 ～武具"}, {"language": "Chinese Traditional", "multiverseId": 532448, "name": "日晷魔劍", "text": "每當佩帶此武具的生物攻擊時，在其上放置一個+1/+1指示物。\n每當佩帶此武具的生物造成戰鬥傷害時，擲一顆d12。如果擲骰結果大於所造成的傷害或擲骰結果為12，則將該生物上的+1/+1指示物數量加倍。\n佩帶{2}（{2}：貼附在目標由你操控的生物上。只能於巫術時機佩帶。）", "type": "神器 ～武具"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "249139", "cardsphereId": "79949", "mcmId": "572224", "mtgjsonV4Id": "d785956b-3007-5aba-a5f2-e6282cfdf0c8", "multiverseId": "531962", "scryfallId": "eaedf482-9f2c-497a-bf1c-bebb4168c52f", "scryfallIllustrationId": "373144b6-c724-4cb8-b132-6ffe730c85ac", "scryfallOracleId": "abaddcce-9039-4b4e-baf8-fdab304b5c52", "tcgplayerProductId": "243756"}, "isStarter": true, "keywords": ["Equip"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}", "manaValue": 2.0, "name": "Sword of Hours", "number": "61", "originalText": "Whenever equipped creature attacks, put a +1/+1 counter on it.\nWhenever equipped creature deals combat damage, roll a d12. If the result is greater than the damage dealt or the result is 12, double the number of +1/+1 counters on that creature.\nEquip {2} ({2}: Attach to target creature you control. Equip only as a sorcery.)", "originalType": "Artifact — Equipment", "printings": ["AFC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/27d6425b324b8af4", "tcgplayer": "https://mtgjson.com/links/f515b2546167e505"}, "rarity": "uncommon", "rulings": [{"date": "2021-07-23", "text": "To double the number of +1/+1 counters on a permanent, count the number of +1/+1 counters that are currently on that permanent and put that many more on it. Any replacement effects that change this number will apply accordingly."}, {"date": "2021-07-23", "text": "If the equipped creature takes lethal damage at the same time that it deals combat damage, it will die before the counters on it can be doubled. However, you will still roll a d12, which may cause abilities of other permanents to trigger."}, {"date": "2021-07-23", "text": "Dice are identified by the number of faces each one has. For example, a d20 is a twenty-sided die."}, {"date": "2021-07-23", "text": "Dice used must have equally likely outcomes and the roll must be fair. Although physical dice are recommended, digital substitutes are allowed, provided they have the same number of equally likely outcomes as specified in the original roll instruction."}, {"date": "2021-07-23", "text": "An ability that tells you to roll a die will also specify what to do with the result of that roll. Most often, this is in the form of a “results table” in the card text."}, {"date": "2021-07-23", "text": "The instruction to roll a die and the effect that occurs because of the result are all part of the same ability. Players do not get the chance to respond to the ability after knowing the result of the roll."}, {"date": "2021-07-23", "text": "An effect that says “choose a target, then roll a d20” or similar still uses the normal process of putting an ability on the stack and resolving it. Choosing targets is part of putting the ability on the stack and rolling the d20 happens later, as the ability resolves."}, {"date": "2021-07-23", "text": "Some effects may modify the result of a die roll. This may be part of the instruction to roll a die or it may come from other cards. Anything that references the “result” of a die roll is looking for the result after these modifications. Anything that is looking for the “natural result” is looking for the number shown on the face of the die before these modifications."}, {"date": "2021-07-23", "text": "Some abilities, like that of Pixie Guide and Barbarian Class, replace rolling a die with rolling extra dice and ignoring the lowest roll. The ignored rolls are not considered for the effect that instructed you to roll a die, and do not cause abilities to trigger. For all intents and purposes, once you determine which dice count, any extra dice were never rolled."}, {"date": "2021-07-23", "text": "Some effects instruct you to roll again. This uses the same number and type of dice as the original roll, and that roll will use the same set of possible outcomes."}, {"date": "2021-07-23", "text": "While playing Planechase, rolling the planar die will cause any ability that triggers whenever a player rolls one or more dice to trigger. However, any effect that refers to a numerical result will ignore the rolling of the planar die."}, {"date": "2021-07-23", "text": "Tournament events have more specific rules regarding dice and die-rolling. For more information, please see the most recent version of the Magic Tournament Rules at https://wpn.wizards.com/en/document/magic-gathering-tournament-rules."}], "setCode": "AFC", "subtypes": ["Equipment"], "supertypes": [], "text": "Whenever equipped creature attacks, put a +1/+1 counter on it.\nWhenever equipped creature deals combat damage, roll a d12. If the result is greater than the damage dealt or the result is 12, double the number of +1/+1 counters on that creature.\nEquip {2} ({2}: Attach to target creature you control. Equip only as a sorcery.)", "type": "Artifact — Equipment", "types": ["Artifact"], "uuid": "1a58c3eb-2cbd-5a1b-8e0f-26ee655739c2"}