{"artist": "Filipe Pagliuso", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 5.0, "edhrecRank": 12416, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 563289, "name": "Tabaxi-Tukaniere", "text": "Fliegend\nMyriade (Immer wenn diese Kreatur angreift, kannst du für jeden Gegner außer dem verteidigenden Spieler einen Spielstein erzeugen, der eine Kopie dieser Kreatur ist. Er kommt getappt und jenen Gegner oder einen Planeswalker, den er kontrolliert, angreifend ins Spiel. Schicke die Spielsteine am Ende des Kampfes ins Exil.)", "type": "Kreatur — Katze, Waldläufer"}, {"language": "Spanish", "multiverseId": 563649, "name": "Tucaneros tabaxis", "text": "Vuela.\nMiríada. (Siempre que esta criatura ataque, por cada oponente que no sea el jugador defensor, puedes crear una ficha que es una copia de esta criatura que está girada y atacando a ese jugador o a un planeswalker que controla. Exilia las fichas al final del combate.)", "type": "Criatura — Guardabosque felino"}, {"language": "French", "multiverseId": 564009, "name": "Toucaniers tabaxi", "text": "Vol\nMyriade (À chaque fois que cette créature attaque, pour chaque adversaire autre que le joueur défenseur, vous pouvez créer un jeton qui est une copie de cette créature, engagé et attaquant ce joueur ou un planeswalker qu'il contrôle. Exilez ces jetons à la fin du combat.)", "type": "Créature : chat et ranger"}, {"language": "Italian", "multiverseId": 564369, "name": "Tabaxi Tucanieri", "text": "Volare\nMiriade (Ogniqualvolta questa creatura attacca, per ogni avversario diverso dal giocatore in difesa, puoi creare una pedina che è una copia di questa creatura TAPpata e che attacca quel giocatore o un planeswalker controllato da quel giocatore. Esilia le pedine alla fine del combattimento.)", "type": "Creatura — Ranger Felino"}, {"language": "Japanese", "multiverseId": 564729, "name": "タバクシーの大嘴賊", "text": "飛行\n無尽（このクリーチャーが攻撃するたび、防御プレイヤー以外の対戦相手１人につきそれぞれ、このクリーチャーのコピーであるトークン１体をタップ状態かつそのプレイヤーかそのプレイヤーがコントロールしているプレインズウォーカー１体を攻撃している状態で生成してもよい。戦闘終了時に、それらのトークンを追放する。）", "type": "クリーチャー — 猫・レインジャー"}, {"language": "Korean", "multiverseId": 565089, "name": "타박시 큰부리새기수", "text": "비행\n무수 (이 생물이 공격할 때마다, 수비플레이어를 제외한 각 상대에 대해, 당신은 이 생물의 복사본이며 탭되어 그 플레이어 또는 그 플레이어가 조종하는 플레인즈워커를 공격 중인 토큰 한 개를 만들 수 있다. 전투종료에 그 토큰들을 추방한다.)", "type": "생물 — 고양이 레인저"}, {"language": "Portuguese (Brazil)", "multiverseId": 565449, "name": "Tucaneiros Tabaxi", "text": "Voar\nMiríade (Toda vez que esta criatura ataca, para cada oponente além do jogador defensor, você pode criar uma ficha que seja uma cópia desta criatura que está virada e atacando aquele jogador ou um planeswalker que ele controla. Exile as fichas no final do combate.)", "type": "Criatura — Felino Guardião"}, {"language": "Russian", "multiverseId": 565809, "name": "Табакси-Туканьеры", "text": "Полет\nБесчисленность (Каждый раз, когда это существо атакует, за каждого оппонента, кроме защищающегося игрока, вы можете создать одну фишку, которая является копией этого существа, повернутой и атакующей того игрока или planeswalker'а под его контролем. Изгоните те фишки в конце боя.)", "type": "Существо — Кошка Следопыт"}, {"language": "Chinese Simplified", "multiverseId": 566169, "name": "斑猫人驭鸟盗", "text": "飞行\n繁影（每当此生物攻击时，对防御牌手之外的每位对手而言，你可以派出一个为此生物复制品的衍生物，其为横置且正向该牌手或某个由他操控的鹏洛客进行攻击。在战斗结束时，放逐这些衍生物。）", "type": "生物 ～猫／游侠"}, {"language": "Chinese Traditional", "multiverseId": 566529, "name": "斑貓人馭鳥盜", "text": "飛行\n繁影（每當此生物攻擊時，對防禦玩家之外的每位對手而言，你可以派出一個為此生物複製品的衍生物，其為橫置且正向該玩家或某個由他操控的鵬洛客進行攻擊。在戰鬥結束時，放逐這些衍生物。）", "type": "生物 ～貓／遊俠"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "261575", "cardKingdomId": "261140", "cardsphereId": "89004", "mcmId": "660260", "mcmMetaId": "408556", "mtgjsonV4Id": "0177e055-430a-5322-b709-12fe440aacc1", "mtgoId": "100090", "multiverseId": "562929", "scryfallId": "43e38761-70e0-4f6e-a4c2-7c9a17557d25", "scryfallIllustrationId": "14d0f5af-f98b-419e-9339-8dc4d7fc09fe", "scryfallOracleId": "36dd999e-53da-45c7-ae98-90f7aad78680", "tcgplayerProductId": "273116"}, "keywords": ["Flying", "Myriad"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "pauper": "Legal", "paupercommander": "Legal", "vintage": "Legal"}, "manaCost": "{4}{W}", "manaValue": 5.0, "name": "Tabaxi Toucaneers", "number": "46", "originalText": "Flying\nMyriad (Whenever this creature attacks, for each opponent other than defending player, you may create a token that's a copy of this creature that's tapped and attacking that player or a planeswalker they control. Exile the tokens at end of combat.)", "originalType": "Creature — Cat Ranger", "power": "3", "printings": ["CLB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/f5fb0a54d31983f6", "cardKingdomFoil": "https://mtgjson.com/links/475e58d7430c9d6b", "cardmarket": "https://mtgjson.com/links/becb18106dcc0bb0", "tcgplayer": "https://mtgjson.com/links/4a71a6488ecfea35"}, "rarity": "common", "rulings": [{"date": "2022-06-10", "text": "The term “defending player” in the myriad rules (or any other ability of an attacking creature) refers to the player the creature with myriad was attacking or the controller of the planeswalker it was attacking at the time the ability resolves. If that creature is no longer attacking, it refers to the player it was last attacking or the controller of the planeswalker it was last attacking."}, {"date": "2022-06-10", "text": "If the defending player is your only opponent, no tokens are put onto the battlefield."}, {"date": "2022-06-10", "text": "You choose whether each token is attacking the player or a planeswalker they control as the token is created. If it’s attacking a planeswalker, you choose which one."}, {"date": "2022-06-10", "text": "Although the tokens enter the battlefield attacking, they were never declared as attackers. Abilities that trigger whenever a creature attacks won’t trigger, including the myriad ability of the tokens. If there are any costs to have a creature attack, those costs won’t apply to the tokens."}, {"date": "2022-06-10", "text": "The tokens all enter the battlefield at the same time."}, {"date": "2022-06-10", "text": "Each token copies exactly what was printed on the original creature and nothing else. It doesn’t copy whether that creature is tapped or untapped, whether it has any counters on it or Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, and so on."}, {"date": "2022-06-10", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when the tokens enter the battlefield. Any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities of the copied creature will also work."}, {"date": "2022-06-10", "text": "If myriad creates more than one token for any given player (due to an effect such as the one Doubling Season creates), you may choose separately for each token whether it’s attacking the player or a planeswalker they control."}, {"date": "2022-06-10", "text": "If a token created with the myriad ability phases out before the next end step, the delayed triggered ability will still trigger at the beginning of the next end step after it phases in again. However, if it phases out with that triggered ability on the stack, it won't be exiled, and the delayed triggered ability won't trigger again during future end steps."}], "setCode": "CLB", "subtypes": ["Cat", "Ranger"], "supertypes": [], "text": "Flying\nMyriad (Whenever this creature attacks, for each opponent other than defending player, you may create a token that's a copy of this creature that's tapped and attacking that player or a planeswalker they control. Exile the tokens at end of combat.)", "toughness": "2", "type": "Creature — Cat Ranger", "types": ["Creature"], "uuid": "d4d23986-7a54-58b8-8075-03223bfe5021"}