{"artist": "宋其金/Song Qijin", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["G", "R"], "colors": ["G", "R"], "convertedManaCost": 4.0, "edhrecRank": 7235, "finishes": ["foil"], "foreignData": [{"language": "Japanese", "name": "航海士、ターンガース", "text": "航海士、ターンガースは、２体以上のクリーチャーによってはブロックされない。\n対戦相手１人がクリーチャー１体以上で攻撃するたび、航海士、ターンガースがタップ状態である場合、あなたは「戦闘終了時まで、その対戦相手は航海士、ターンガースのコントロールを得る。」を選んでもよい。そうしたなら、その対戦相手が攻撃しているプレイヤーやプレインズウォーカーのうち１つを選ぶ。航海士、ターンガースはそのプレイヤーかプレインズウォーカーを攻撃している状態になる。", "type": "伝説のクリーチャー — ミノタウルス・戦士"}], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "260353", "cardsphereId": "86869", "mcmId": "584330", "mtgjsonV4Id": "ff4d656a-9dd8-5e8e-ad0a-b2105e2fa050", "scryfallId": "b85f59ce-a382-418c-aab7-90c22e17255f", "scryfallIllustrationId": "aebf5074-3eee-4628-9fb8-118a8f76fd43", "scryfallOracleId": "1a8a41a1-6fc5-4dc8-bd28-9bf404c777d7", "tcgplayerProductId": "253846"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}{G}", "manaValue": 4.0, "name": "Tahngarth, First Mate", "number": "4", "originalReleaseDate": "2021-12-06", "power": "5", "printings": ["C19", "PL21"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/fec4976b44cccab5", "tcgplayer": "https://mtgjson.com/links/bb2c76de83ef4cc5"}, "rarity": "rare", "rulings": [{"date": "2019-08-23", "text": "Players can’t take any actions between the time you choose to give control of Tahngarth to the attacking player and the time it becomes an attacking creature."}, {"date": "2019-08-23", "text": "If Tahngarth gains menace, it can’t be blocked at all."}, {"date": "2019-08-23", "text": "Giving control of Tahngarth to an opponent doesn’t cause it to become untapped. This means that Tahngarth may end up attacking several times between your turns."}, {"date": "2019-08-23", "text": "If an opponent is attacking a planeswalker but not that planeswalker’s controller, Tahngarth can’t attack that player."}, {"date": "2019-08-23", "text": "If an opponent attacks a player or planeswalker but each creature attacking that player or planeswalker is no longer attacking that player or planeswalker by the time Tahngarth’s ability resolves (most likely because they’ve left the battlefield), that player or planeswalker can’t be chosen for Tahngarth to attack. If there’s no player or planeswalker to choose this way but you still choose to give the opponent control of Tahngarth, Tahngarth isn’t attacking."}, {"date": "2019-08-23", "text": "Although Tahngarth is an attacking creature if it uses its triggered ability, it was never declared as an attacking creature. This means that abilities that trigger whenever a creature attacks won’t trigger when it changes control and becomes attacking."}, {"date": "2019-08-23", "text": "Any effects that say that Tahngarth can’t attack or can’t attack a certain player (such as that of Propaganda, or if Tahngarth gains defender) affect only the declaration of attackers. They won’t stop Tahngarth from becoming an attacking creature through its triggered ability."}, {"date": "2019-08-23", "text": "Tahngarth may end up attacking its owner this way."}, {"date": "2019-08-23", "text": "Commander damage is tracked for each commander. It doesn’t matter who controls the commander as it deals damage. If Tahngarth deals 10 damage to one player while under your control and another 11 damage to that same player while under a third player’s control, the player loses the game."}], "securityStamp": "oval", "setCode": "PL21", "subtypes": ["Minotaur", "Warrior"], "supertypes": ["Legendary"], "text": "Tahngarth, First Mate can't be blocked by more than one creature.\nWhenever an opponent attacks with one or more creatures, if Tahngarth is tapped, you may have that opponent gain control of Tahngarth until end of combat. If you do, choose a player or planeswalker that opponent is attacking. Tahngarth is attacking that player or planeswalker.", "toughness": "5", "type": "Legendary Creature — Minotaur Warrior", "types": ["Creature"], "uuid": "70529994-95a9-5fda-8701-c9093f5f2728"}