{"artist": "Simon Dominic", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U", "W"], "colors": ["U", "W"], "convertedManaCost": 4.0, "edhrecRank": 5271, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "d6635dc0-b7f5-551f-af62-f6d5f1ed6679", "mtgoId": "65739", "scryfallId": "6c6490a2-006e-4c1a-8896-6b5733a3feaa", "scryfallIllustrationId": "63e6c38f-0cac-4b89-a49d-9036f062b2ec", "scryfallOracleId": "e4cf3710-8600-4f95-abb2-faefdc25693d"}, "isOnlineOnly": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}{U}", "manaValue": 4.0, "name": "Taigam, Ojutai Master", "number": "65739", "power": "3", "printings": ["C17", "PZ2"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2017-08-25", "text": "If a spell moves itself into another zone as part of its resolution (as Teferi’s Protection, All Suns’ Dawn, and Beacon of Unrest do), rebound won’t get a chance to apply."}, {"date": "2017-08-25", "text": "If Taigam leaves the battlefield after it attacks, its last ability won’t trigger whenever you cast an instant or sorcery spell from your hand this turn. If it leaves the battlefield after the spell has gained rebound, that spell will still have rebound. Once the card is exiled, rebound’s delayed triggered ability will trigger at the beginning of your next upkeep even if you no longer control Taigam."}, {"date": "2017-08-25", "text": "If Taigam is killed in response to you casting a spell, the ability will still trigger and your spell will gain rebound if Taigam attacked."}, {"date": "2017-08-25", "text": "Casting the card again due to rebound’s delayed triggered ability is optional. If you choose not to cast the card, or if you can’t (perhaps because there are no legal targets available), the card will stay exiled. You won’t get another chance to cast it on a future turn."}, {"date": "2017-08-25", "text": "If a spell with rebound that you cast from your hand doesn’t resolve for any reason (either because another spell or ability counters it or because all its targets are illegal as it tries to resolve), none of its effects will happen, including rebound. The spell will be put into its owner’s graveyard and you won’t get to cast it again on your next turn."}, {"date": "2017-08-25", "text": "If a replacement effect (such as the one created by Rest in Peace) would cause a spell with rebound that you cast from your hand to be put somewhere other than into your graveyard as it resolves, you can choose whether to apply the rebound effect or the other effect as the spell resolves."}, {"date": "2017-08-25", "text": "At the beginning of your upkeep, all delayed triggered abilities created by rebound effects trigger. You may handle them in any order. A spell you cast this way resolves before you can cast the next one, so one rebounded spell can’t target another. Timing permissions based on the card’s type (if it’s a sorcery) are ignored. Other restrictions, such as “Cast [this spell] only during combat,” must be followed."}, {"date": "2017-08-25", "text": "If you cast a card from exile, it will go to its owner’s graveyard when it resolves, fails to resolve, or is countered. It won’t go back to exile."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": ["Human", "Monk"], "supertypes": ["Legendary"], "text": "Instant, sorcery, and Dragon spells you control can't be countered.\nWhenever you cast an instant or sorcery spell from your hand, if Taigam, Ojutai Master attacked this turn, that spell gains rebound. (Exile the spell as it resolves. At the beginning of your next upkeep, you may cast that card from exile without paying its mana cost.)", "toughness": "4", "type": "Legendary Creature — Human Monk", "types": ["Creature"], "uuid": "406148bd-4fca-53d6-911d-9a35701c00dc"}