{"artist": "David Gaillet", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 15320, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 395518, "name": "Taigams Hieb", "text": "Eine Kreatur deiner Wahl erhält +2/+0 bis zum Ende des Zuges und kann in diesem Zug nicht geblockt werden.\nAbprall (Falls du diesen Zauberspruch aus deiner Hand wirkst, schicke ihn ins Exil, sowie er verrechnet wird. Zu Beginn deines nächsten Versorgungssegments kannst du diese Karte aus dem Exil wirken, ohne ihre Manakosten zu bezahlen.)", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 397366, "name": "Golpe de Taigam", "text": "La criatura objetivo obtiene +2/+0 hasta el final del turno y no puede ser bloqueada este turno.\nRebote. (Si lanzas este hechizo de tu mano, exílialo en cuanto se resuelve. Al comienzo de tu próximo mantenimiento, puedes lanzar esta carta desde el exilio sin pagar su coste de maná.)", "type": "Conjuro"}, {"language": "French", "multiverseId": 395782, "name": "Frappe de Taigam", "text": "La créature ciblée gagne +2/+0 jusqu'à la fin du tour et ne peut pas être bloquée ce tour-ci.\nRebond (Si vous lancez ce sort depuis votre main, exilez-le au moment où il se résout. Au début de votre prochain entretien, vous pouvez lancer cette carte depuis l'exil sans payer son coût de mana.)", "type": "Rituel"}, {"language": "Italian", "multiverseId": 396046, "name": "Colpo di Taigam", "text": "Una creatura bersaglio prende +2/+0 fino alla fine del turno e non può essere bloccata in questo turno.\nRipresa (Se lanci questa magia dalla tua mano, esiliala mentre si risolve. All'inizio del tuo prossimo mantenimento, puoi lanciare questa carta dall'esilio senza pagare il suo costo di mana.)", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 396310, "name": "テイガムの一撃", "text": "クリーチャー１体を対象とする。ターン終了時まで、それは＋２/＋０の修整を受けるとともに、このターン、それはブロックされない。\n反復（この呪文があなたの手札から唱えられたなら、これの解決に際し、これを追放する。あなたの次のアップキープの開始時に、あなたはこのカードを追放領域からこれのマナ・コストを支払うことなく唱えてもよい。）", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 396574, "name": "타이감의 일격", "text": "생물을 목표로 정한다. 그 생물은 턴종료까지 +2/+0을 받으며 이번 턴에 방어될 수 없다.\n반동 (당신이 손에서 이 주문을 발동했다면, 주문을 해결하면서 추방한다. 당신의 다음 유지단 시작에, 당신은 마나 비용을 지불하지 않고 이 카드를 추방 영역에서 발동할 수 있다.)", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 396838, "name": "Golpe de Taigam", "text": "A criatura alvo recebe +2/+0 até o final do turno e não pode ser bloqueada neste turno.\nRebote (Se você conjurar esta mágica da sua mão, exile-a conforme ela for resolvida. No início de sua próxima manutenção, você poderá conjurar este card a partir do exílio sem pagar seu custo de mana.)", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 397102, "name": "Удар Тайгама", "text": "Целевое существо получает +2/+0 до конца хода и не может быть заблокировано в этом ходу.\nОтскок (Изгоните это заклинание в момент его разрешения, если вы разыгрываете его из вашей руки. В начале вашего следующего шага поддержки вы можете разыграть эту карту из изгнания без уплаты ее мана-стоимости.)", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 394990, "name": "泰伽姆的挥击", "text": "目标生物得+2/+0直到回合结束，且本回合不能被阻挡。\n弹回（如果你从你手上施放此牌，于它结算时将之放逐。在你的下一个维持开始时，你可以从放逐区施放此牌，且不需支付其法术力费用。）", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 395254, "name": "泰伽姆的揮擊", "text": "目標生物得+2/+0直到回合結束，且本回合不能被阻擋。\n彈回（如果你從手上施放此咒語，於它結算時將之放逐。在你的下一個維持開始時，你可以從放逐區施放此牌，且不需支付其魔法力費用。）", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "199898", "cardKingdomId": "199525", "cardsphereId": "14041", "mcmId": "273326", "mcmMetaId": "211294", "mtgjsonV4Id": "6034c910-a65e-5be1-b505-7d50f77ecf93", "mtgoFoilId": "56181", "mtgoId": "56180", "multiverseId": "394726", "scryfallId": "2ef5e279-14c4-4f91-b24d-c7098140efcd", "scryfallIllustrationId": "97fb8cc7-648e-4d06-bedc-6f486225aad4", "scryfallOracleId": "f256c828-01d2-4077-823d-8dccd15120bd", "tcgplayerProductId": "96658"}, "keywords": ["Rebound"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Taigam's Strike", "number": "81", "originalText": "Target creature gets +2/+0 until end of turn and can't be blocked this turn.\nRebound (If you cast this spell from your hand, exile it as it resolves. At the beginning of your next upkeep, you may cast this card from exile without paying its mana cost.)", "originalType": "Sorcery", "printings": ["DTK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/46df0928cfe85a0c", "cardKingdomFoil": "https://mtgjson.com/links/c2d104cbe4016c42", "cardmarket": "https://mtgjson.com/links/cba17aefacd42b8a", "tcgplayer": "https://mtgjson.com/links/f4d5ade755edbf89"}, "rarity": "common", "rulings": [{"date": "2015-02-25", "text": "Casting the card again due to the delayed triggered ability is optional. If you choose not to cast the card, or if you can’t (perhaps because there are no legal targets available), the card will stay exiled. You won’t get another chance to cast it on a future turn."}, {"date": "2015-02-25", "text": "If a spell with rebound that you cast from your hand doesn’t resolve for any reason (either because another spell or ability counters it or because all its targets are illegal as it tries to resolve), none of its effects will happen, including rebound. The spell will be put into its owner’s graveyard and you won’t get to cast it again on your next turn."}, {"date": "2015-02-25", "text": "At the beginning of your upkeep, all delayed triggered abilities created by rebound effects trigger. You may handle them in any order. If you want to cast a card this way, you do so as part of the resolution of its delayed triggered ability. Timing restrictions based on the card’s type (if it’s a sorcery) are ignored. Other restrictions, such as “Cast [this spell] only during combat,” must be followed."}, {"date": "2015-02-25", "text": "As long as you cast a spell with rebound from your hand, rebound will work regardless of whether you paid its mana cost or an alternative cost you were permitted to pay."}, {"date": "2015-02-25", "text": "If you cast a spell with rebound from any zone other than your hand (including your opponent’s hand), rebound will have no effect."}, {"date": "2015-02-25", "text": "If a replacement effect (such as the one created by Rest in Peace) would cause a spell with rebound that you cast from your hand to be put somewhere other than into your graveyard as it resolves, you can choose whether to apply the rebound effect or the other effect as the spell resolves."}, {"date": "2015-02-25", "text": "Rebound will have no effect on copies of spells because you don’t cast them from your hand."}, {"date": "2015-02-25", "text": "If you cast a card from exile this way, it will go to its owner’s graveyard when it resolves, fails to resolve, or is countered. It won’t go back to exile."}], "setCode": "DTK", "subtypes": [], "supertypes": [], "text": "Target creature gets +2/+0 until end of turn and can't be blocked this turn.\nRebound (If you cast this spell from your hand, exile it as it resolves. At the beginning of your next upkeep, you may cast this card from exile without paying its mana cost.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "f68feeb8-69fd-5c0c-ba19-2b0465ebd9aa", "watermark": "ojutai"}