{"artist": "rk post", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 2.0, "edhrecRank": 7099, "finishes": ["nonfoil", "foil"], "flavorText": "\"No more blood shall be spilled to satisfy another's deluded lust for power.\"", "foreignData": [{"flavorText": "„Kein Blut soll mehr vergossen werden, um die verblendete Lust eines Anderen nach Macht zu befriedigen.\"", "language": "German", "multiverseId": 217323, "name": "Tajuru-Erhalter", "text": "Zaubersprüche und Fähigkeiten, die deine Gegner kontrollieren, können dich nicht dazu bringen, bleibende Karten zu opfern.", "type": "Kreatur — Elf, Schamane"}, {"flavorText": "\"No se derramará más sangre para satisfacer el ansia de poder de otro.\"", "language": "Spanish", "multiverseId": 217075, "name": "Preservador de Tajuru", "text": "Los hechizos y habilidades que controlan tus oponentes no te pueden hacer sacrificar permanentes.", "type": "Criatura — Chamán elfo"}, {"flavorText": "« Le sang ne sera plus versé pour satisfaire la soif de puissance d'autrui. »", "language": "French", "multiverseId": 215587, "name": "Préservateur de Tajuru", "text": "Les sorts et les capacités que vos adversaires contrôlent ne peuvent pas vous faire sacrifier de permanents.", "type": "Créature : elfe et shamane"}, {"flavorText": "\"Non si dovrà più versare sangue per soddisfare l'altrui illusoria brama di potere.\"", "language": "Italian", "multiverseId": 216331, "name": "Protettore dei Tajuru", "text": "Le magie e le abilità controllate dai tuoi avversari non possono farti sacrificare permanenti.", "type": "Creatura — Sciamano Elfo"}, {"flavorText": "「力への渇望に惑わされた者を満たすために、これ以上の血は流させるものか。」", "language": "Japanese", "multiverseId": 216579, "name": "タジュールの保護者", "text": "あなたの対戦相手がコントロールする呪文や能力は、あなたにパーマネントを生け贄に捧げさせることができない。", "type": "クリーチャー — エルフ・シャーマン"}, {"flavorText": "\"Nem mais uma gota de sangue será derramada para satisfazer o desejo de poder de outro iludido.\"", "language": "Portuguese (Brazil)", "multiverseId": 216827, "name": "Preservador Tajuru", "text": "As mágicas e habilidades que seus oponentes controlam não podem fazer com que você sacrifique permanentes.", "type": "Criatura — Elfo Xamã"}, {"flavorText": "«Довольно кровопролития ради удовлетворения чужой ненасытной жажды власти».", "language": "Russian", "multiverseId": 215835, "name": "Таджурский Спаситель", "text": "Заклинания и способности под контролем ваших оппонентов не могут заставить вас приносить в жертву перманенты.", "type": "Существо — Эльф Шаман"}, {"flavorText": "「不该再有鲜血为了他人的力量妄想而平白流下。」", "language": "Chinese Simplified", "multiverseId": 216083, "name": "特裘如存护师", "text": "由对手所操控的咒语或异能无法让你牺牲永久物。", "type": "生物～妖精／祭师"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "131118", "cardKingdomId": "130879", "cardsphereId": "39807", "mcmId": "22593", "mcmMetaId": "11273", "mtgjsonV4Id": "3c93afda-7ac4-5128-b5d7-49163f11889f", "mtgoFoilId": "36395", "mtgoId": "36394", "multiverseId": "193451", "scryfallId": "c8d03346-0802-4058-b89e-1b6076963c8e", "scryfallIllustrationId": "dba1b37f-9658-42c7-921d-a1e572141a31", "scryfallOracleId": "d12d4b54-a13a-46ba-b176-3aaa453ce3e2", "tcgplayerProductId": "34905"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}", "manaValue": 2.0, "name": "Tajuru Preserver", "number": "211", "originalText": "Spells and abilities your opponents control can't cause you to sacrifice permanents.", "originalType": "Creature — Elf Shaman", "power": "2", "printings": ["ROE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/699d000e30cc905c", "cardKingdomFoil": "https://mtgjson.com/links/a6f2c564cb8e70f9", "cardmarket": "https://mtgjson.com/links/946d60ba145790a9", "tcgplayer": "https://mtgjson.com/links/e8d51b6e5d9aacea"}, "rarity": "rare", "rulings": [{"date": "2010-06-15", "text": "As a spell or ability an opponent controls resolves, if it would force you to sacrifice a permanent (as the annihilator ability does), you just don’t. That part of the effect does nothing. If that spell or ability gives you the option to sacrifice a permanent (as Prowling Pangolin’s ability does), you can’t take that option."}, {"date": "2010-06-15", "text": "If a spell or ability an opponent controls instructs you to perform an action unless you sacrifice a permanent (as Ogre Marauder does), you can’t choose to sacrifice a permanent. You must perform the action. On the other hand, if a spell or ability an opponent controls instructs you to sacrifice a permanent unless you perform an action (as Rishadan Brigand does), you can choose whether or not to perform the action. If you don’t perform the action, nothing happens, since you can’t sacrifice any permanents."}, {"date": "2010-06-15", "text": "You may still sacrifice permanents to pay the costs of spells you cast and abilities you activate, or because a resolving spell or ability you control instructs or allows you to do so. Notably, you may still sacrifice Eldrazi Spawn creature tokens for mana."}, {"date": "2010-06-15", "text": "You may sacrifice a permanent to pay the activation cost of an ability, even if that ability comes from a permanent an opponent controls (such as Excavation)."}, {"date": "2010-06-15", "text": "You may sacrifice a permanent as a special action, even if the effect that allows you to do so comes from an opponent’s permanent (such as Damping Engine or Volrath’s Curse). No one controls special actions."}, {"date": "2010-06-15", "text": "This ability affects only sacrifices. It won’t stop a creature from being put into the graveyard due to lethal damage or having 0 toughness, and it won’t stop a permanent from being put into the graveyard due to the “legend rule.” None of these are sacrifices; they’re the result of game rules."}], "setCode": "ROE", "subtypes": ["Elf", "Shaman"], "supertypes": [], "text": "Spells and abilities your opponents control can't cause you to sacrifice permanents.", "toughness": "1", "type": "Creature — Elf Shaman", "types": ["Creature"], "uuid": "7d6ff481-216c-5e99-a54d-4a5747ea0924"}