{"artist": "Daniel Gelon", "availability": ["mtgo"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 18452, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "aa6e6f61-31fa-5b58-a9de-1c34376629b9", "mtgoFoilId": "33605", "mtgoId": "33604", "multiverseId": "201230", "scryfallId": "a1171f5b-5b92-4a65-a59d-97ac6ce1283d", "scryfallIllustrationId": "1739132a-8c4d-4496-a0b5-cca863db2079", "scryfallOracleId": "31d01633-86f8-4a3f-9c28-f6968e056ba3"}, "isOnlineOnly": true, "isReprint": true, "keywords": ["Enchant"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}{B}", "manaValue": 4.0, "name": "Takklemaggot", "number": "76", "originalText": "Enchant creature\nAt the beginning of the upkeep of enchanted creature's controller, put a -0/-1 counter on that creature.\nWhen enchanted creature is put into a graveyard, that creature's controller chooses a creature that Takklemaggot could enchant. If he or she does, return Takklemaggot to the battlefield under your control attached to that creature. If he or she doesn't, return Takklemaggot to the battlefield under your control as a non-Aura enchantment. It loses \"enchant creature\" and gains \"At the beginning of that player's upkeep, Takklemaggot deals 1 damage to him or her.\"", "originalType": "Enchantment — Aura", "printings": ["CHR", "LEG", "ME3"], "purchaseUrls": {}, "rarity": "uncommon", "rulings": [{"date": "2004-10-04", "text": "If the creature leaves the battlefield without going to the graveyard, Takklemaggot is simply put into its owner’s graveyard."}, {"date": "2008-05-01", "text": "Takklemaggot’s controller no longer changes as it returns to the battlefield. The player who controlled it when it left the battlefield is the same player that controls it when it returns to the battlefield, even though a different player may be choosing what it will be attached to after returning onto the battlefield."}, {"date": "2009-10-01", "text": "When the enchanted creature is put into a graveyard, Takklemaggot’s second ability triggers, then Takklemaggot is put into its owner’s graveyard as a state-based action. When the ability resolves, if Takklemaggot is still in that graveyard, it’s returned to the battlefield."}, {"date": "2009-10-01", "text": "The player who controlled the creature that went to the graveyard (and caused Takklemaggot’s second ability to trigger) chooses what creature Takklemaggot will return to the battlefield attached to. The creature isn’t chosen until the ability resolves, so no player can respond between the time the creature is chosen and the time Takklemaggot returns to the battlefield attached to it. The ability doesn’t target a creature, so a creature with shroud, for example, can be chosen. However, only a creature that can be legally enchanted by Takklemaggot can be chosen, so a creature with protection from black, for example, can’t be chosen. If the player can choose a creature, they must do so, no matter who controls it. If the player can’t choose a creature, Takklemaggot returns to the battlefield as a non-Aura enchantment, and that player is the player that Takklemaggot will deal damage to."}], "setCode": "ME3", "subtypes": ["Aura"], "supertypes": [], "text": "Enchant creature\nAt the beginning of the upkeep of enchanted creature's controller, put a -0/-1 counter on that creature.\nWhen enchanted creature dies, that creature's controller chooses a creature that Takklemaggot could enchant. If the player does, return Takklemaggot to the battlefield under your control attached to that creature. If they don't, return Takklemaggot to the battlefield under your control as a non-Aura enchantment. It loses \"enchant creature\" and gains \"At the beginning of that player's upkeep, Takklemaggot deals 1 damage to that player.\"", "type": "Enchantment — Aura", "types": ["Enchantment"], "uuid": "bd21149e-5afd-5477-b46a-3bc35e4a455d"}