{"artist": "Chris Rallis", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 833, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "e9305642-deda-5e68-a152-35cc26dbb71c", "mtgoId": "85940", "scryfallId": "920067af-fdd5-4e48-bd6e-7d477c53a7ac", "scryfallIllustrationId": "f9ca7837-d5f5-4465-8d77-c823a437df30", "scryfallOracleId": "e802fb53-7cf5-46bc-8a0b-f99cf5c20f74"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": false, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "loyalty": "3", "manaCost": "{2}{U}{U}", "manaValue": 4.0, "name": "Teferi, Master of Time", "number": "85940", "originalReleaseDate": "2020-12-15", "printings": ["M21", "PM21", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2020-06-23", "text": "Teferi's first ability doesn't change how many of his abilities you can activate during each turn."}, {"date": "2020-06-23", "text": "You draw a card and discard a card all while Teferi's first loyalty ability is resolving. Nothing can happen between the two, and no player may choose to take actions."}, {"date": "2020-06-23", "text": "While a permanent is phased out, it's treated as though it doesn't exist. It can't be the target of spells or abilities, its static abilities have no effect on the game, its triggered abilities can't trigger, it can't attack or block, and so on."}, {"date": "2020-06-23", "text": "An attacking creature that phases out is removed from combat."}, {"date": "2020-06-23", "text": "Phasing out doesn't cause any “leaves the battlefield” abilities to trigger. Similarly, phasing in won't cause any “enters the battlefield” abilities to trigger."}, {"date": "2020-06-23", "text": "Any one-shot effects that are waiting “until [this] leaves the battlefield,” such as that of Kitesail Freebooter, won't happen when a permanent phases out."}, {"date": "2020-06-23", "text": "Any continuous effects with a “for as long as” duration such as that of Awakener Druid ignore phased-out objects. Any such effects will expire if their conditions are no longer met after ignoring the phased-out objects."}, {"date": "2020-06-23", "text": "Each Aura and Equipment attached to a permanent that's phasing out also phases out. They will phase in with that permanent and still be attached to it. Similarly, permanents that phase out with counters phase in with those counters."}, {"date": "2020-06-23", "text": "Choices made for permanents as they entered the battlefield are remembered when they phase in."}, {"date": "2020-06-23", "text": "Any creatures that phase in during their controller's untap step will be able to attack and pay a cost of {T} during that turn."}, {"date": "2020-06-23", "text": "If an opponent gains control of your creature and it phases out and the duration of the control-change effect expires before it phases in, that permanent phases in under your control as that opponent's next untap step begins. If they leave the game before their next untap step, it phases in as the next untap step begins after their turn would have begun."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Teferi"], "supertypes": ["Legendary"], "text": "You may activate loyalty abilities of Teferi, Master of Time on any player's turn any time you could cast an instant.\n[+1]: Draw a card, then discard a card.\n[−3]: Target creature you don't control phases out. (Treat it and anything attached to it as though they don't exist until its controller's next turn.)\n[−10]: Take two extra turns after this one.", "type": "Legendary Planeswalker — Teferi", "types": ["Planeswalker"], "uuid": "42e4cda2-9dc9-5aca-9797-7d47f461521e"}