{"artist": "Mike Bierek", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 5725, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 376901, "name": "Verlockung der Spiegelung", "text": "Verlockendes Angebot — Bestimme eine Kreatur deiner Wahl, die du kontrollierst. Bringe einen Spielstein ins Spiel, der eine Kopie dieser Kreatur ist. Jeder Gegner kann einen Spielstein ins Spiel bringen, der eine Kopie dieser Kreatur ist. Bringe für jeden Gegner, der dies tut, einen Spielstein ins Spiel, der eine Kopie dieser Kreatur ist.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 378325, "name": "Tentación de los reflejos", "text": "Oferta tentadora — Elige una criatura objetivo que controlas. Pon en el campo de batalla una ficha que es una copia de esa criatura. Cada oponente puede poner en el campo de batalla una ficha que es una copia de esa criatura. Por cada oponente que lo haga, pon en el campo de batalla una ficha que es una copia de esa criatura.", "type": "Conjuro"}, {"language": "French", "multiverseId": 377257, "name": "Tentation des reflets", "text": "Offre tentante — Choisissez une créature ciblée que vous contrôlez. Mettez sur le champ de bataille un jeton qui est une copie de cette créature. Chaque adversaire peut mettre sur le champ de bataille un jeton qui est une copie de cette créature. Pour chaque adversaire qui fait ainsi, mettez sur le champ de bataille un jeton qui est une copie de cette créature.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 377613, "name": "Tentazione del Riflesso", "text": "Tentazione allettante — Scegli una creatura bersaglio che controlli. Metti sul campo di battaglia una pedina che è una copia di quella creatura. Ogni avversario può mettere sul campo di battaglia una pedina che è una copia di quella creatura. Per ogni avversario che lo fa, metti sul campo di battaglia una pedina che è una copia di quella creatura.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 377969, "name": "反射の誘惑", "text": "誘引 — あなたがコントロールするクリーチャー１体を対象とする。そのクリーチャーのコピーであるトークンを１体戦場に出す。各対戦相手はそれぞれそのクリーチャーのコピーであるトークンを１体戦場に出してもよい。そうしたなら、それを行った対戦相手１人につき、あなたはそのクリーチャーのコピーであるトークンを１体戦場に出す。", "type": "ソーサリー"}], "frameVersion": "2003", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "191856", "cardsphereId": "9821", "mcmId": "264733", "mcmMetaId": "208883", "mtgjsonV4Id": "6db7f3a5-8c30-507b-a00f-75f0c5cc1435", "mtgoFoilId": "51331", "mtgoId": "51330", "multiverseId": "376545", "scryfallId": "ebb0070f-8686-4127-91c3-4f1488e2d995", "scryfallIllustrationId": "68c35e1f-aaf6-46bd-b64b-c7b65e606a45", "scryfallOracleId": "76c142ef-0f07-4215-8d11-d25f7114c70d", "tcgplayerProductId": "71872"}, "isStarter": true, "keywords": ["Tempting offer"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Tempt with Reflections", "number": "60", "originalText": "Tempting offer — Choose target creature you control. Put a token onto the battlefield that's a copy of that creature. Each opponent may put a token onto the battlefield that's a copy of that creature. For each opponent who does, put a token onto the battlefield that's a copy of that creature.", "originalType": "Sorcery", "printings": ["C13"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/a424622f46c308b4", "cardmarket": "https://mtgjson.com/links/93bc0d3eaab2ff87", "tcgplayer": "https://mtgjson.com/links/a0824c96014e90b5"}, "rarity": "rare", "rulings": [{"date": "2013-10-17", "text": "Your opponents decide in turn order whether or not they accept the offer, starting with the opponent on your left. Each opponent will know the decisions of previous opponents in turn order when making their decision."}, {"date": "2013-10-17", "text": "After each opponent has decided, the effect happens simultaneously for each one who accepted the offer. Then, the effect happens again for you a number of times equal to the number of opponents who accepted."}, {"date": "2013-10-17", "text": "If the creature you control is an illegal target when Tempt with Reflections tries to resolve, it won’t resolve and none of its effects will happen. No copies will be created."}, {"date": "2013-10-17", "text": "If the target creature has an enters-the-battlefield triggered ability, the abilities of all the copies will trigger as Tempt with Reflections resolves. All of those abilities will be put on the stack after Tempt with Reflections finishes resolving. Abilities controlled by the active player will be put on the stack first (in an order of their choice), followed by abilities controlled by each other player in turn order. The last ability to be put on the stack will resolve first, and so on."}, {"date": "2013-10-17", "text": "The tokens copy exactly what was printed on the original creature and nothing else (unless that creature is copying something else or is a token; see below). They don’t copy whether that creature is tapped or untapped, whether it has any counters on it or Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, or so on."}, {"date": "2013-10-17", "text": "If the copied creature has {X} in its mana cost, X is considered to be zero."}, {"date": "2013-10-17", "text": "If the copied creature is copying something else (for example, if the copied creature is a Clone), then the tokens enter the battlefield as whatever that creature copied."}, {"date": "2013-10-17", "text": "If the copied creature is a token, the tokens created by Tempt with Reflections copy the original characteristics of that token as stated by the effect that put the token onto the battlefield."}, {"date": "2013-10-17", "text": "Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities of the copied creature will also work."}], "setCode": "C13", "subtypes": [], "supertypes": [], "text": "Tempting offer — Choose target creature you control. Create a token that's a copy of that creature. Each opponent may create a token that's a copy of that creature. For each opponent who does, create a token that's a copy of that creature.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "6d7232af-fd56-5a53-bf2b-357bd61811c5"}