{"artist": "Philip Straub", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 5.0, "edhrecRank": 7890, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 376900, "name": "Verlockung der Unsterblichkeit", "text": "Verlockendes Angebot — Bringe eine Kreaturenkarte deiner Wahl aus deinem Friedhof ins Spiel zurück. Jeder Gegner kann eine Kreaturenkarte aus seinem Friedhof ins Spiel zurückbringen. Bringe für jeden Gegner, der dies tut, eine Kreaturenkarte aus deinem Friedhof ins Spiel zurück.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 378324, "name": "Tentación de la inmortalidad", "text": "Oferta tentadora — Regresa una carta de criatura de tu cementerio al campo de batalla. Cada oponente puede regresar una carta de criatura de su cementerio al campo de batalla. Por cada jugador que lo haga, regresa una carta de criatura de tu cementerio al campo de batalla.", "type": "Conjuro"}, {"language": "French", "multiverseId": 377256, "name": "Tentation de l'immortalité", "text": "Offre tentante — Renvoyez sur le champ de bataille une carte de créature de votre cimetière. Chaque joueur peut renvoyer sur le champ de bataille une carte de créature de son cimetière. Pour chaque joueur qui fait ainsi, renvoyez sur le champ de bataille une carte de créature de votre cimetière.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 377612, "name": "Tentazione dell'Immortalità", "text": "Tentazione allettante — Rimetti sul campo di battaglia una carta creatura dal tuo cimitero. Ogni avversario può rimettere sul campo di battaglia una carta creatura dal proprio cimitero. Per ogni giocatore che lo fa, rimetti sul campo di battaglia una carta creatura dal tuo cimitero.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 377968, "name": "不死の誘惑", "text": "誘引 — あなたの墓地にあるクリーチャー・カード１枚を戦場に戻す。各対戦相手は自分の墓地にあるクリーチャー・カード１枚を戦場に戻してもよい。そうしたなら、それを行ったプレイヤー１人につき、 あなたの墓地にあるクリーチャー・カード１枚を戦場に戻す。", "type": "ソーサリー"}], "frameVersion": "2003", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "191775", "cardsphereId": "9820", "mcmId": "264742", "mcmMetaId": "208892", "mtgjsonV4Id": "fddb33ae-621b-5d5b-bfd4-d1422bd583cd", "mtgoFoilId": "51349", "mtgoId": "51348", "multiverseId": "376544", "scryfallId": "c87ff489-2d9c-4f04-a169-9eafb046dd7e", "scryfallIllustrationId": "b9fb37b9-3606-4e8e-b036-6403125b35f9", "scryfallOracleId": "06e1c0fa-767c-4204-972f-d98f770d85f3", "tcgplayerProductId": "71853"}, "isStarter": true, "keywords": ["Tempting offer"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{B}", "manaValue": 5.0, "name": "Tempt with Immortality", "number": "95", "originalText": "Tempting offer — Return a creature card from your graveyard to the battlefield. Each opponent may return a creature card from his or her graveyard to the battlefield. For each player who does, return a creature card from your graveyard to the battlefield.", "originalType": "Sorcery", "printings": ["C13"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/f480b47b6adc8b19", "cardmarket": "https://mtgjson.com/links/be93cee0c57c67f1", "tcgplayer": "https://mtgjson.com/links/3228c0ebf24bb1e4"}, "rarity": "rare", "rulings": [{"date": "2013-10-17", "text": "Your opponents decide in turn order whether or not they accept the offer, starting with the opponent on your left. Each opponent will know the decisions of previous opponents in turn order when making their decision."}, {"date": "2013-10-17", "text": "After each opponent has decided, the effect happens simultaneously for each one who accepted the offer. Then, the effect happens again for you a number of times equal to the number of opponents who accepted."}, {"date": "2013-10-17", "text": "None of the creature cards in graveyards are targeted. The cards are chosen as Tempt with Immortality resolves."}], "setCode": "C13", "subtypes": [], "supertypes": [], "text": "Tempting offer — Return a creature card from your graveyard to the battlefield. Each opponent may return a creature card from their graveyard to the battlefield. For each opponent who does, return a creature card from your graveyard to the battlefield.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "b9bae13c-1ee3-54ab-b67d-e2dcd1b2a146"}