{"artist": "Mark Zug", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 2.0, "edhrecRank": 12287, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 387501, "name": "Temur-Streitross", "text": "Morph—Zeige eine grüne Karte auf deiner Hand offen vor. (Du kannst diese Karte verdeckt für {3} als eine 2/2 Kreatur wirken. Decke sie zu einem beliebigen Zeitpunkt für ihre Morph-Kosten auf.)\nWenn das Temur-Streitross aufgedeckt wird, verursacht eine Kreatur deiner Wahl Trampelschaden bis zum Ende des Zuges.", "type": "Kreatur — Pferd"}, {"language": "Spanish", "multiverseId": 389384, "name": "Acometedor temur", "text": "Metamorfosis—Muestra una carta verde de tu mano. (Puedes lanzar esta carta boca abajo como una criatura 2/2 pagando {3}. Ponla boca arriba en cualquier momento pagando su coste de metamorfosis.)\nCuando el Acometedor temur se ponga boca arriba, la criatura objetivo gana la habilidad de arrollar hasta el final del turno.", "type": "Criatura — Caballo"}, {"language": "French", "multiverseId": 387770, "name": "Batailleur temurien", "text": "Mue — Révélez une carte verte de votre main. (Vous pouvez lancer cette carte face cachée comme une créature 2/2 pour {3}. Retournez-la à tout moment pour son coût de mue.)\nQuand le Batailleur temurien est retourné face visible, la créature ciblée acquiert le piétinement jusqu'à la fin du tour.", "type": "Créature : cheval"}, {"language": "Italian", "multiverseId": 388039, "name": "Destriero Temur", "text": "Metamorfosi—Rivela una carta verde dalla tua mano. (Puoi lanciare questa carta a faccia in giù come una creatura 2/2 pagando {3}. Girala a faccia in su in qualsiasi momento pagando il suo costo di metamorfosi.)\nQuando il Destriero Temur viene girato a faccia in su, una creatura bersaglio ha travolgere fino alla fine del turno.", "type": "Creatura — Cavallo"}, {"language": "Japanese", "multiverseId": 388308, "name": "ティムールの軍馬", "text": "変異 ― あなたの手札にある緑のカードを１枚公開する。（あなたはこのカードを、{3}で２/２クリーチャーとして裏向きに唱えてもよい。これの変異コストで、これをいつでも表向きにしてよい。）\nティムールの軍馬が表向きになったとき、クリーチャー１体を対象とする。ターン終了時まで、それはトランプルを得る。", "type": "クリーチャー — 馬"}, {"language": "Korean", "multiverseId": 388577, "name": "테무르 군마", "text": "변이—당신의 손에서 녹색 카드 한 장을 공개한다. (당신은 {3}을 지불해서 이 카드를 뒷면 상태의 2/2 생물로 발동할 수 있다. 언제든지 변이 비용을 지불하고 앞면이 보이도록 뒤집을 수 있다.)\n테무르 군마가 앞면으로 뒤집히면, 생물을 목표로 정한다. 그 생물은 턴종료까지 돌진을 얻는다.", "type": "생물 — 말"}, {"language": "Portuguese (Brazil)", "multiverseId": 388846, "name": "Corcel Temur", "text": "Metamorfose — Revele um card verde na sua mão. (Você pode conjurar este card com a face voltada para baixo como uma criatura 2/2 por {3}. Volte sua face para cima a qualquer momento pagando seu custo de metamorfose.)\nQuando Corcel Temur é voltado para cima, a criatura alvo ganha atropelar até o final do turno.", "type": "Criatura — Cavalo"}, {"language": "Russian", "multiverseId": 389115, "name": "Темурский Скакун", "text": "Оборотень — Покажите зеленую карту, находящуюся в вашей руке. (Вы можете разыграть эту карту рубашкой вверх как существо 2/2 за {3}. Переверните ее рубашкой вниз в любой момент за ее стоимость Оборотня.)\nКогда Темурский Скакун переворачивается рубашкой вниз, целевое существо получает Пробивной удар до конца хода.", "type": "Существо — Лошадь"}, {"language": "Chinese Simplified", "multiverseId": 386963, "name": "铁木尔战马", "text": "变身～从你手上展示一张绿色牌。（你可牌面朝下地施放此牌并支付{3}，将其当成2/2生物。可随时支付其变身费用使其翻回正面。）\n当铁木尔战马翻回正面时，目标生物获得践踏异能直到回合结束。", "type": "生物～马"}, {"language": "Chinese Traditional", "multiverseId": 387232, "name": "鐵木爾戰馬", "text": "變身～從你手上展示一張綠色牌。（你可牌面朝下地施放此牌並支付{3}，將其當成2/2生物。可隨時支付其變身費用使其翻回正面。）\n當鐵木爾戰馬翻回正面時，目標生物獲得踐踏異能直到回合結束。", "type": "生物～馬"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "196238", "cardKingdomId": "195740", "cardsphereId": "23786", "mcmId": "269199", "mcmMetaId": "210220", "mtgjsonV4Id": "adcd0fa6-d0b9-5354-9c98-b13f062533b5", "mtgoFoilId": "54121", "mtgoId": "54120", "multiverseId": "386694", "scryfallId": "f77258fc-8683-4656-84a3-4df4ea2a8435", "scryfallIllustrationId": "f7914a48-272f-4258-ae00-409263fb7871", "scryfallOracleId": "a0665c10-e652-4608-920b-66206c0e5905", "tcgplayerProductId": "92894"}, "keywords": ["Morph"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}", "manaValue": 2.0, "name": "Temur Charger", "number": "153", "originalText": "Morph—\nReveal a green card in your hand. (You may cast this card face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.)\nWhen Temur Charger is turned face up, target creature gains trample until end of turn.", "originalType": "Creature — Horse", "power": "3", "printings": ["KTK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/f96f9719f030fb5d", "cardKingdomFoil": "https://mtgjson.com/links/1a985766135d9f7b", "cardmarket": "https://mtgjson.com/links/6ac78b8b9935b315", "tcgplayer": "https://mtgjson.com/links/193cef5d86d6e80e"}, "rarity": "uncommon", "rulings": [{"date": "2014-09-20", "text": "Morph lets you cast a card face down by paying {3}, and lets you turn the face-down permanent face up any time you have priority by paying its morph cost."}, {"date": "2014-09-20", "text": "The face-down spell has no mana cost and has a converted mana cost of 0. When you cast a face-down spell, put it on the stack face down so no other player knows what it is, and pay {3}. This is an alternative cost."}, {"date": "2014-09-20", "text": "When the spell resolves, it enters the battlefield as a 2/2 creature with no name, mana cost, creature types, or abilities. It’s colorless and has a converted mana cost of 0. Other effects that apply to the creature can still grant it any of these characteristics."}, {"date": "2014-09-20", "text": "Any time you have priority, you may turn the face-down creature face up by revealing what its morph cost is and paying that cost. This is a special action. It doesn’t use the stack and can’t be responded to. Only a face-down permanent can be turned face up this way; a face-down spell cannot."}, {"date": "2014-09-20", "text": "Because the permanent is on the battlefield both before and after it’s turned face up, turning a permanent face up doesn’t cause any enters-the-battlefield abilities to trigger."}, {"date": "2014-09-20", "text": "A permanent that turns face up or face down changes characteristics but is otherwise the same permanent. Spells and abilities that were targeting that permanent, as well as Auras and Equipment that were attached to the permanent, aren’t affected."}, {"date": "2014-09-20", "text": "At any time, you can look at a face-down spell or permanent you control. You can’t look at face-down spells or permanents you don’t control unless an effect instructs you to do so."}, {"date": "2014-09-20", "text": "You must ensure that your face-down spells and permanents can easily be differentiated from each other. You’re not allowed to mix up the cards that represent them on the battlefield in order to confuse other players. The order they entered the battlefield should remain clear. Common methods for doing this include using markers or dice, or simply placing them in order on the battlefield."}, {"date": "2014-09-20", "text": "If a face-down permanent leaves the battlefield, you must reveal it. You must also reveal all face-down spells and permanents you control if you leave the game or if the game ends."}], "setCode": "KTK", "subtypes": ["Horse"], "supertypes": [], "text": "Morph—Reveal a green card in your hand. (You may cast this card face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.)\nWhen Temur Charger is turned face up, target creature gains trample until end of turn.", "toughness": "1", "type": "Creature — Horse", "types": ["Creature"], "uuid": "2a448bb0-e87f-5978-a6bc-4dd4bead18fc", "watermark": "temur"}