{"artist": "Richard Luong", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 928, "faceName": "Tergrid's Lantern", "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "03c51419-fc26-53cd-8ad4-13b53143b512", "mtgoId": "88290", "scryfallId": "529451ef-2c7e-4566-8627-a1f25e010829", "scryfallIllustrationId": "b1f50603-cbe2-4cc1-ae74-df158194b5a2", "scryfallOracleId": "8485cfaa-1dbf-432b-b5d0-92a6aa6a329b"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "modal_dfc", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}", "manaValue": 4.0, "name": "Tergrid, God of Fright // Tergrid's Lantern", "number": "88290", "originalReleaseDate": "2021-02-28", "otherFaceIds": ["1f87d383-c62c-5a67-96e3-02e567a614fc"], "printings": ["KHM", "PKHM", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "There is a single triangle icon in the top left corner of the front face. There is a double triangle icon in the top left corner of the back face."}, {"date": "2021-02-05", "text": "To determine whether it is legal to play a modal double-faced card, consider only the characteristics of the face you’re playing and ignore the other face’s characteristics."}, {"date": "2021-02-05", "text": "If an effect allows you to play a specific modal double-faced card, you may cast it as a spell or play it as a land, as determined by which face you choose to play. If an effect allows you to cast (rather than “play”) a specific modal double-faced card, you can’t play it as a land."}, {"date": "2021-02-05", "text": "If an effect allows you to play a land or cast a spell from among a group of cards, you may play or cast a modal double-faced card with any face that fits the criteria of that effect."}, {"date": "2021-02-05", "text": "The converted mana cost of a modal double-faced card is based on the characteristics of the face that’s being considered. On the stack and battlefield, consider whichever face is up. In all other zones, consider only the front face. This is different than how the converted mana cost of a transforming double-faced card is determined."}, {"date": "2021-02-05", "text": "A modal double-faced card can’t be transformed or be put onto the battlefield transformed. Ignore any instruction to transform a modal double-faced card or to put one onto the battlefield transformed."}, {"date": "2021-02-05", "text": "If an effect puts a double-faced card onto the battlefield, it enters with its front face up. If that front face can’t be put onto the battlefield, it doesn’t enter the battlefield."}, {"date": "2021-02-05", "text": "If an effect instructs a player to choose a card name, the name of either face may be chosen. If that effect or a linked ability refers to a spell with the chosen name being cast and/or a land with the chosen name being played, it considers only the chosen name, not the other face’s name."}, {"date": "2021-02-05", "text": "In the Commander variant, a double-faced card’s color identity is determined by the mana costs and mana symbols in the rules text of both faces combined. If either face has a color indicator or basic land type, those are also considered."}, {"date": "2021-02-05", "text": "A permanent card is an artifact, creature, enchantment, land, or planeswalker card."}, {"date": "2021-02-05", "text": "If an opponent sacrifices a nontoken permanent, it doesn’t matter which graveyard it goes to. Tergrid’s ability will trigger."}, {"date": "2021-02-05", "text": "If the card leaves the graveyard before Tergrid’s ability resolves, you can’t put it onto the battlefield, even if it returns to the graveyard before the ability resolves."}, {"date": "2021-02-05", "text": "If an opponent sacrifices a nontoken permanent or discards a permanent card as part of paying the cost of a spell or ability, Tergrid’s ability will trigger and goes on the stack on top of that spell or ability. Tergrid’s ability will resolve before that spell or ability."}, {"date": "2021-02-05", "text": "If you put an Aura onto the battlefield using Tergrid’s ability, you choose what the Aura will enchant just before it enters the battlefield. An Aura put onto the battlefield this way doesn’t target the player or permanent it will enchant, so permanents or players with hexproof may be chosen; however, the chosen recipient must be able to legally be enchanted by the Aura, so a player or permanent with protection from one of the Aura’s qualities can’t be chosen this way. If there’s nothing legal for the Aura to enchant, it stays in the graveyard."}, {"date": "2021-02-05", "text": "The player targeted by the first ability of Tergrid’s Lantern can choose to lose 3 life even if they have nonland permanents to sacrifice or cards to discard. They can’t choose to sacrifice a nonland permanent if they don’t control any, nor can they choose to discard a card if they have none in hand."}], "securityStamp": "oval", "setCode": "PRM", "side": "b", "subtypes": [], "supertypes": ["Legendary"], "text": "{T}: Target player loses 3 life unless they sacrifice a nonland permanent or discard a card.\n{3}{B}: Untap Tergrid's Lantern.", "type": "Legendary Artifact", "types": ["Artifact"], "uuid": "1d7a4599-a2d7-51df-b9cf-66a171ec952a"}