{"artist": "Chris Rallis", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 5.0, "edhrecRank": 1371, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "423a061e-48bf-525e-8f7d-8fd64f432c4a", "mtgoId": "85946", "scryfallId": "86fa8212-1a0b-42a8-8d67-eeef9625504f", "scryfallIllustrationId": "dcec6dce-d7df-4ce5-8a5c-b7248404f251", "scryfallOracleId": "79a1783f-ea7e-4cdf-95f5-53b383d38c66"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Partner"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": true}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "loyalty": "4", "manaCost": "{4}{B}", "manaValue": 5.0, "name": "Tevesh Szat, Doom of Fools", "number": "85946", "originalReleaseDate": "2020-12-15", "printings": ["CMR", "PLIST", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2020-11-10", "text": "For the second ability of Tevesh Szat, Doom of Fools, you choose whether to sacrifice anything and what to sacrifice as the ability resolves."}, {"date": "2020-11-10", "text": "As the third ability is resolving, you’ll gain control of all commanders that were already on the battlefield before the commanders from the command zone enter the battlefield under your control."}, {"date": "2020-11-10", "text": "If you leave the game, each commander you gained control of is returned to its previous controller’s control. Each commander that entered the battlefield under your control is exiled (from there, its owner may return it to the command zone)."}, {"date": "2020-11-10", "text": "If your Commander deck has two commanders, you can only include cards whose own color identities are also found in your commanders’ combined color identities. If Falthis and Kediss are your commanders, your deck may contain cards with black and/or red in their color identity, but not cards with green, white, or blue."}, {"date": "2020-11-10", "text": "Both commanders start in the command zone, and the remaining 98 cards (or 58 cards in a Commander Draft game) of your deck are shuffled to become your library."}, {"date": "2020-11-10", "text": "To have two commanders, both must have the partner ability as the game begins. Losing the ability during the game doesn’t cause either to cease to be your commander."}, {"date": "2020-11-10", "text": "Once the game begins, your two commanders are tracked separately. If you cast one, you won’t have to pay an additional {2} the first time you cast the other. A player loses the game after having been dealt 21 damage from any one of them, not from both of them combined."}, {"date": "2020-11-10", "text": "If something refers to your commander while you have two commanders, it refers to one of them of your choice. If you are instructed to perform an action on your commander (e.g. put it from the command zone into your hand due to Command Beacon), you choose one of your commanders at the time the effect happens."}, {"date": "2020-11-10", "text": "An effect that checks whether you control your commander is satisfied if you control one or both of your two commanders."}, {"date": "2020-11-10", "text": "You can choose two commanders with partner that are the same color or colors. In Commander Draft, you can even choose two of the same commander with partner if you drafted them. If you do this, make sure you keep the number of times you’ve cast each from the command zone clear for “commander tax” purposes."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Szat"], "supertypes": ["Legendary"], "text": "[+2]: Create two 0/1 black Thrull creature tokens.\n[+1]: You may sacrifice another creature or planeswalker. If you do, draw two cards, then draw another card if the sacrificed permanent was a commander.\n[−10]: Gain control of all commanders. Put all commanders from the command zone onto the battlefield under your control.\nTevesh Szat, Doom of Fools can be your commander.\nPartner", "type": "Legendary Planeswalker — Szat", "types": ["Planeswalker"], "uuid": "96d650d3-5c6f-5456-b192-5312c288f6a1"}