{"artist": "Magali Villeneuve", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "W"], "colors": ["B", "W"], "convertedManaCost": 4.0, "edhrecRank": 1202, "finishes": ["nonfoil", "foil"], "flavorText": "While Kaya is guildmaster, Teysa waits patiently at the center of the Orzhov web of power.", "foreignData": [{"flavorText": "Solange Kaya Gildenmeisterin ist, wartet Teysa geduldig im Zentrum des Machtnetzwerks der Orzhov.", "language": "German", "multiverseId": 457615, "name": "Teysa Karlov", "text": "Falls das Sterben einer Kreatur eine ausgelöste Fähigkeit einer bleibenden Karte, die du kontrollierst, auslöst, wird die Fähigkeit ein weiteres Mal ausgelöst.\nKreaturenspielsteine, die du kontrollierst, haben Wachsamkeit und Lebensverknüpfung.", "type": "Legendäre Kreatur — Mensch, Berater"}, {"flavorText": "Mientras Kaya es maestra del gremio, Teysa espera pacientemente en el centro de la red de poder orzhov.", "language": "Spanish", "multiverseId": 457874, "name": "Teysa Karlov", "text": "Si la muerte de una criatura hace que se dispare una habilidad disparada de un permanente que controlas, esa habilidad se dispara una vez más.\nLas fichas de criatura que controlas tienen las habilidades de vigilancia y vínculo vital.", "type": "Criatura legendaria — Consejero humano"}, {"flavorText": "Tant que Kaya est maître de guilde, Teysa attend patiemment au centre de la toile du pouvoir d'Orzhov.", "language": "French", "multiverseId": 458133, "name": "Teysa Karlov", "text": "Si la mort d'une créature provoque le déclenchement d'une capacité déclenchée d'un permanent que vous contrôlez, cette capacité se déclenche une fois de plus.\nLes jetons de créature que vous contrôlez ont la vigilance et le lien de vie.", "type": "Créature légendaire : humain et conseiller"}, {"flavorText": "Kaya è il capo della gilda, ma Teysa attende pazientemente al centro della rete di potere degli Orzhov.", "language": "Italian", "multiverseId": 458392, "name": "Teysa Karlov", "text": "Se una creatura che muore fa innescare l'abilità innescata di un permanente che controlli, quell'abilità si innesca una volta in più.\nLe pedine creatura che controlli hanno cautela e legame vitale.", "type": "Creatura Leggendaria — Consigliere Umano"}, {"flavorText": "ケイヤがギルドマスターを務めている間、テイサはオルゾフの権力の網の目の中心でじっと待っていた。", "language": "Japanese", "multiverseId": 458651, "name": "テイサ・カルロフ", "text": "クリーチャーの死亡によりあなたがコントロールしているパーマネントの誘発型能力が１回誘発するなら、その能力は追加でもう１回誘発する。\nあなたがコントロールしているクリーチャー・トークンは警戒と絆魂を持つ。", "type": "伝説のクリーチャー — 人間・アドバイザー"}, {"flavorText": "카야가 길드마스터일 동안, 테이사는 오르조브의 힘의 중심부에서 참을성 있게 기다린다.", "language": "Korean", "multiverseId": 458910, "name": "테이사 카를로프", "text": "생물이 죽어서 당신이 조종하는 지속물의 격발능력이 격발되려고 하면, 그 능력은 한 번 더 격발된다.\n당신이 조종하는 생물 토큰들은 경계와 생명연결을 가진다.", "type": "전설적 생물 — 인간 참모"}, {"flavorText": "Enquanto Kaya é a mestra da guilda, Teysa aguarda pacientemente no centro da teia do poder dos Orzhov.", "language": "Portuguese (Brazil)", "multiverseId": 459169, "name": "Teysa Karlov", "text": "Se a morte de uma criatura fizer com que uma habilidade desencadeada de uma permanente que você controla seja desencadeada, aquela habilidade será desencadeada uma vez adicional.\nAs fichas de criatura que você controla têm vigilância e vínculo com a vida.", "type": "Criatura Lendária — Humano Conselheiro"}, {"flavorText": "Кайя заняла место предводителя гильдии, Тейса же терпеливо ждет в центре паутины могущества Орзовов.", "language": "Russian", "multiverseId": 459428, "name": "Тейса Карлов", "text": "Если умирающее существо вызывает срабатывание срабатывающей способности перманента под вашим контролем, та способность срабатывает дополнительный раз.\nУ фишек существ под вашим контролем есть Бдительность и Цепь жизни.", "type": "Легендарное Существо — Человек Советник"}, {"flavorText": "卡娅当上公会首领后，泰莎就在欧佐夫权力网的中心静观其变。", "language": "Chinese Simplified", "multiverseId": 459687, "name": "泰莎卡洛夫", "text": "如果某个死去的生物触发由你操控之永久物的触发式异能，则该异能额外触发一次。\n由你操控的衍生生物具有警戒与系命异能。", "type": "传奇生物 ～人类／参谋"}, {"flavorText": "卡婭當上公會首領後，泰莎就在歐佐夫權力網的中心靜觀其變。", "language": "Chinese Traditional", "multiverseId": 459946, "name": "泰莎卡洛夫", "text": "如果某個死去的生物觸發由你操控之永久物的觸發式異能，則該異能額外觸發一次。\n由你操控的衍生生物具有警戒與繫命異能。", "type": "傳奇生物 ～人類／參謀"}], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "223490", "cardKingdomId": "223178", "cardsphereId": "58399", "mcmId": "368124", "mcmMetaId": "267548", "mtgArenaId": "69340", "mtgjsonV4Id": "74ff44b9-c29c-5f37-8e09-954dadd7aa69", "mtgoId": "71424", "multiverseId": "457356", "scryfallId": "bcfaa19e-995e-447d-a0a2-46e5d117d5ec", "scryfallIllustrationId": "245a2cd6-d107-4116-97f7-57021bafd835", "scryfallOracleId": "644eeefd-e684-4ca8-8aef-a892ca130c07", "tcgplayerProductId": "182955"}, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}{B}", "manaValue": 4.0, "name": "Teysa Karlov", "number": "212", "originalText": "If a creature dying causes a triggered ability of a permanent you control to trigger, that ability triggers an additional time.\nCreature tokens you control have vigilance and lifelink.", "originalType": "Legendary Creature — Human Advisor", "power": "2", "printings": ["PRNA", "RNA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/efa23d9b7f8e37f7", "cardKingdomFoil": "https://mtgjson.com/links/94e82cba6ab28cfe", "cardmarket": "https://mtgjson.com/links/1fbe605d6923c4c1", "tcgplayer": "https://mtgjson.com/links/9c1c3600131e8197"}, "rarity": "rare", "rulings": [{"date": "2019-01-25", "text": "Teysa affects a creature’s own “when this creature dies” triggered abilities as well as other triggered abilities that trigger when that creature dies. Such triggered abilities start with “when” or “whenever.”"}, {"date": "2019-01-25", "text": "Teysa’s effect doesn’t copy the triggered ability; it just causes the ability to trigger twice. Any choices made as you put the ability onto the stack, such as modes and targets, are made separately for each instance of the ability. Any choices made on resolution, such as whether to pay a cost for that triggered ability, are also made separately."}, {"date": "2019-01-25", "text": "The trigger event doesn’t have to specifically refer to “creatures.” In these cases, the trigger event may also refer to something being “put into a graveyard from the battlefield.” For example, an ability that triggers “whenever an artifact is put into a graveyard from the battlefield” would trigger twice if an artifact creature dies while Teysa Karlov is on the battlefield."}, {"date": "2019-01-25", "text": "An ability that triggers when a creature “leaves the battlefield” will trigger twice if that creature leaves the battlefield by dying."}, {"date": "2019-01-25", "text": "An ability that triggers on an event that causes a creature to die doesn’t trigger twice. For example, an ability that triggers “whenever you sacrifice a creature” triggers only once."}, {"date": "2019-01-25", "text": "Look at each creature as it exists on the battlefield, taking into account continuous effects, to determine whether any triggered abilities will trigger multiple times. For example, if a land that has become a creature dies, an ability that triggers when it dies triggers twice."}, {"date": "2019-01-25", "text": "If a creature dying at the same time that another permanent you control leaves the battlefield causes a triggered ability of that permanent to trigger, that ability triggers an additional time."}, {"date": "2019-01-25", "text": "If a creature dying at the same time as Teysa (including Teysa itself dying) causes a triggered ability of a permanent you control to trigger, that ability triggers an additional time."}, {"date": "2019-01-25", "text": "If you somehow control two Teysas, a creature dying causes abilities to trigger three times, not four. A third Teysa causes abilities to trigger four times, a fourth causes abilities to trigger five times, and so on. This also means that if you control Teysa and cast a second one, an ability that triggers when it dies due to the “legend rule” triggers three times."}, {"date": "2019-01-25", "text": "An ability of a permanent that triggers when a card is put into a graveyard “from anywhere” triggers twice only if Teysa and that permanent are both still on the battlefield immediately after the creature has died."}], "securityStamp": "oval", "setCode": "RNA", "subtypes": ["Human", "Advisor"], "supertypes": ["Legendary"], "text": "If a creature dying causes a triggered ability of a permanent you control to trigger, that ability triggers an additional time.\nCreature tokens you control have vigilance and lifelink.", "toughness": "4", "type": "Legendary Creature — Human Advisor", "types": ["Creature"], "uuid": "4e54e567-962d-58cc-aeb3-b9448fe82d11", "watermark": "orzhov"}