{"artist": "Jason A. Engle", "availability": ["arena", "mtgo", "paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 699, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameEffects": ["nyxtouched", "showcase", "legendary", "fullart"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "231330", "cardKingdomId": "230853", "cardsphereId": "65636", "mcmId": "430524", "mcmMetaId": "291084", "mtgArenaId": "73754", "mtgjsonV4Id": "e87829e0-1581-569c-84d1-c8f703bfff15", "scryfallId": "27b52628-de05-4ec1-9978-e998cf17bb26", "scryfallIllustrationId": "8a62fa06-28ae-412b-973f-ba1f9eb31555", "scryfallOracleId": "2396299a-c031-4020-b13e-1f9bf9d64511", "tcgplayerProductId": "206758"}, "isFullArt": true, "isStarter": true, "keywords": ["Indestructible"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Thassa, Deep-Dwelling", "number": "261", "power": "6", "printings": ["PRM", "PTHB", "THB"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/53b9dcfc8726b3c6", "cardKingdomFoil": "https://mtgjson.com/links/89a7a5e3dbaabc74", "cardmarket": "https://mtgjson.com/links/cf8e0937bbb629d9", "tcgplayer": "https://mtgjson.com/links/730d93b893986fd0"}, "rarity": "mythic", "rulings": [{"date": "2020-01-24", "text": "When the card returns to the battlefield, it will be a new object with no connection to the card that was exiled. Auras attached to the exiled creature will be put into their owners’ graveyards. Any Equipment will become unattached and remain on the battlefield. Any counters on the exiled creature will cease to exist."}, {"date": "2020-01-24", "text": "If a token is exiled this way, it will cease to exist and won’t return to the battlefield."}, {"date": "2020-01-24", "text": "If you gain control of a creature “until end of turn,” you’ll control it during your end step."}, {"date": "2020-01-24", "text": "Hybrid mana symbols, monocolored hybrid mana symbols, and Phyrexian mana symbols do count toward your devotion to their color(s)."}, {"date": "2020-01-24", "text": "When an effect returns the exiled card “under your control,” you control it indefinitely after that. In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. If you leave the game, any creatures you control from Thassa’s effect but don’t own are exiled."}, {"date": "2020-01-24", "text": "Colorless and generic mana symbols ({C}, {0}, {1}, {2}, {X}, and so on) in mana costs of permanents you control don’t count toward your devotion to any color."}, {"date": "2020-01-24", "text": "Mana symbols in the text boxes of permanents you control don’t count toward your devotion to any color."}, {"date": "2020-01-24", "text": "If an activated ability or triggered ability has an effect that depends on your devotion to a color, you count the number of mana symbols of that color among the mana costs of permanents you control as the ability resolves. The permanent with that ability will be counted if it’s still on the battlefield at that time."}, {"date": "2020-01-24", "text": "If you put an Aura on an opponent’s permanent, you still control the Aura, and mana symbols in its mana cost count towards your devotion."}, {"date": "2020-01-24", "text": "The type-changing ability that can make a God not be a creature functions only on the battlefield. It’s always a creature card in other zones, regardless of your devotion to its color. It’s always a creature spell while it’s on the stack."}, {"date": "2020-01-24", "text": "As a God enters the battlefield, your devotion to its color will determine whether any replacement effects that affect creatures entering the battlefield apply to that God. Because replacement effects are considered before the God is on the battlefield, the mana symbols in its mana cost won’t be counted when determining this."}, {"date": "2020-01-24", "text": "When a God enters the battlefield, your devotion to its color (including the mana symbols in the mana cost of the God itself) will determine if a creature entered the battlefield or not for abilities that trigger whenever a creature enters the battlefield."}, {"date": "2020-01-24", "text": "If a God stops being a creature, it loses the type creature and the creature type God. It continues to be a legendary enchantment."}, {"date": "2020-01-24", "text": "The abilities of Gods function as long as they’re on the battlefield, regardless of whether they’re creatures."}, {"date": "2020-01-24", "text": "If a God is attacking or blocking and it stops being a creature, it will be removed from combat. It won’t rejoin combat if it resumes being a creature later during that combat."}, {"date": "2020-01-24", "text": "Counters put on a God remain on it while it’s not a creature, even if they have no effect."}, {"date": "2020-01-24", "text": "If an effect causes a God to lose all abilities, its ability that causes it to stop being a creature still applies if appropriate."}], "securityStamp": "oval", "setCode": "THB", "subtypes": ["God"], "supertypes": ["Legendary"], "text": "Indestructible\nAs long as your devotion to blue is less than five, Thassa isn't a creature.\nAt the beginning of your end step, exile up to one other target creature you control, then return that card to the battlefield under your control.\n{3}{U}: Tap another target creature.", "toughness": "5", "type": "Legendary Enchantment Creature — God", "types": ["Enchantment", "Creature"], "uuid": "c485d8a2-6cdb-5dca-8708-b0631abcbf89", "variations": ["d10be5ed-839b-5b56-bddb-8a4be0aff8c4"]}