{"artist": "Mark Tedin", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 4420, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "270088", "mcmId": "685619", "mcmMetaId": "239390", "mtgjsonV4Id": "317df31c-b882-5f89-b92a-3f1d61b1afbe", "scryfallId": "26e50443-a2e1-42f9-95f1-60b539e446ad", "scryfallIllustrationId": "3dec7398-bf8f-4c6d-a775-77156ee0f27e", "scryfallOracleId": "ab5a9749-5c94-43e0-b9df-bd2c3601936f", "tcgplayerProductId": "454188"}, "isReprint": true, "language": "English", "layout": "saga", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "The Antiquities War", "number": "899", "originalReleaseDate": "2022-11-18", "printings": ["DOM", "PDOM", "PLIST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d8bc5785e1d335f9", "cardmarket": "https://mtgjson.com/links/e708a41fc9c1d9e6", "tcgplayer": "https://mtgjson.com/links/2c2cc5a504d46fea"}, "rarity": "rare", "rulings": [{"date": "2018-04-27", "text": "The final chapter ability of The Antiquities War affects only artifacts you control at the time it resolves. Artifacts you begin to control later in the turn won’t become 5/5 creatures."}, {"date": "2018-04-27", "text": "The final chapter ability of The Antiquities War overwrites an artifact creature’s normal base power and toughness and all previous effects that set an artifact creature’s base power and toughness to specific values. Any power- or toughness-setting effects that start to apply after the ability resolves will overwrite this effect."}, {"date": "2018-04-27", "text": "Effects that modify an artifact creature’s power and/or toughness, such as the effect of Titanic Growth, will apply to the creature no matter when they started to take effect. The same is true for any counters that change its power and/or toughness and effects that switch its power and toughness."}, {"date": "2018-04-27", "text": "If The Antiquities War somehow becomes an artifact enchantment prior to resolving its final chapter ability, it will become a 5/5 Saga artifact enchantment creature, and will then be sacrificed after that ability resolves."}, {"date": "2018-04-27", "text": "An Equipment that becomes an artifact creature becomes unattached if it’s attached to a creature. Its equip ability can be activated, but it won’t become attached to the target creature."}, {"date": "2018-04-27", "text": "As a Saga enters the battlefield, its controller puts a lore counter on it. As your precombat main phase begins (immediately after your draw step), you put another lore counter on each Saga you control. Putting a lore counter on a Saga in either of these ways doesn’t use the stack."}, {"date": "2018-04-27", "text": "Each symbol on the left of a Saga’s text box represents a chapter ability. A chapter ability is a triggered ability that triggers when a lore counter that is put on the Saga causes the number of lore counters on the Saga to become equal to or greater than the ability’s chapter number. Chapter abilities are put onto the stack and may be responded to."}, {"date": "2018-04-27", "text": "A chapter ability doesn’t trigger if a lore counter is put on a Saga that already had a number of lore counters greater than or equal to that chapter’s number. For example, the third lore counter put on a Saga causes the III chapter ability to trigger, but I and II won’t trigger again."}, {"date": "2018-04-27", "text": "Once a chapter ability has triggered, the ability on the stack won’t be affected if the Saga gains or loses counters, or if it leaves the battlefield."}, {"date": "2018-04-27", "text": "If multiple chapter abilities trigger at the same time, their controller puts them on the stack in any order. If any of them require targets, those targets are chosen as you put the abilities on the stack, before any of those abilities resolve."}, {"date": "2018-04-27", "text": "If counters are removed from a Saga, the appropriate chapter abilities will trigger again when the Saga receives lore counters. Removing lore counters won’t cause a previous chapter ability to trigger."}, {"date": "2018-04-27", "text": "Once the number of lore counters on a Saga is greater than or equal to the greatest number among its chapter abilities—in the Dominaria set, this is always three—the Saga’s controller sacrifices it as soon as its chapter ability has left the stack, most likely by resolving or being countered. This state-based action doesn’t use the stack."}], "securityStamp": "oval", "setCode": "PLIST", "subtypes": ["Saga"], "supertypes": [], "text": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI, II — Look at the top five cards of your library. You may reveal an artifact card from among them and put it into your hand. Put the rest on the bottom of your library in a random order.\nIII — Artifacts you control become artifact creatures with base power and toughness 5/5 until end of turn.", "type": "Enchantment — Saga", "types": ["Enchantment"], "uuid": "1a855a55-7907-5aee-8db6-e75a88e7c6e8"}