{"artist": "Jason A. Engle", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210280", "mcmId": "294405", "mtgjsonV4Id": "150d7a65-a380-53fa-aaf0-71bcaa26b5cd", "multiverseId": "423591", "scryfallId": "3d8c9d69-be51-4ad4-9c2a-0ec1952e4f72", "scryfallIllustrationId": "c4bf9680-daca-43d0-a9f0-0767b7eacce7", "scryfallOracleId": "8eb442a9-5e61-4e2e-983d-b49b04be2575", "tcgplayerProductId": "125636"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "The Aether Flues", "number": "10", "originalText": "When you planeswalk to The Æther Flues or at the beginning of your upkeep, you may sacrifice a creature. If you do, reveal cards from the top of your library until you reveal a creature card, put that card onto the battlefield, then shuffle all other cards revealed this way into your library.\nWhenever you roll {Chaos}, you may put a creature card from your hand onto the battlefield.", "originalType": "Plane — Iquatana", "printings": ["OHOP", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/57168af451d989b5", "tcgplayer": "https://mtgjson.com/links/1703b747e4ecdf47"}, "rarity": "common", "rulings": [{"date": "2009-10-01", "text": "A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"}, {"date": "2009-10-01", "text": "A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."}, {"date": "2009-10-01", "text": "The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."}, {"date": "2009-10-01", "text": "If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}, {"date": "2009-10-01", "text": "The first ability of The Aether Flues doesn’t target a creature. You don’t choose a creature to sacrifice until the ability resolves. Once you choose a creature to sacrifice, it’s too late for players to respond."}, {"date": "2009-10-01", "text": "If you use the first ability of The Aether Flues but there are no creatures in your library, you’ll reveal your entire library then shuffle it."}], "setCode": "OPCA", "subtypes": ["Iquatana"], "supertypes": [], "text": "When you planeswalk to The Aether Flues or at the beginning of your upkeep, you may sacrifice a creature. If you do, reveal cards from the top of your library until you reveal a creature card, put that card onto the battlefield, then shuffle all other cards revealed this way into your library.\nWhenever you roll {CHAOS}, you may put a creature card from your hand onto the battlefield.", "type": "Plane — Iquatana", "types": ["Plane"], "uuid": "dc9d2575-fe57-517e-b4b5-77f96c335c10"}