{"artist": "Steven Belledin", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 6801, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 476629, "name": "Der Akroische Krieg", "text": "(Je eine Sagenmarke beim Ins-Spiel-Kommen und nach deinem Ziehsegment. Opfern nach III.)\nI — Übernimm die Kontrolle über eine Kreatur deiner Wahl, solange der Akroische Krieg im Spiel bleibt.\nII — Bis zu deinem nächsten Zug greifen Kreaturen, die deine Gegner kontrollieren, in jedem Kampf an, falls möglich.\nIII — Jede getappte Kreatur fügt sich selbst Schadenspunkte in Höhe ihrer Stärke zu.", "type": "Verzauberung — Sage"}, {"language": "Spanish", "multiverseId": 476883, "name": "La Guerra Akroniense", "text": "(En cuanto esta Saga entre y después de tu paso de robar, agrega un contador de sabiduría. Sacrifícala después de III.)\nI — Gana el control de la criatura objetivo mientras La Guerra Akroniense permanezca en el campo de batalla.\nII — Hasta tu próximo turno, las criaturas que controlan tus oponentes atacan cada combate si pueden.\nIII — Cada criatura girada se hace una cantidad de daño igual a su fuerza a sí misma.", "type": "Encantamiento — Saga"}, {"language": "French", "multiverseId": 477137, "name": "La Guerre d'Akros", "text": "(Au moment où cette saga arrive sur le champ de bataille et après votre étape de pioche, ajoutez un marqueur « sapience ». Sacrifiez après III.)\nI — Acquérez le contrôle d'une créature ciblée tant que La Guerre d'Akros reste sur le champ de bataille.\nII — Jusqu'à votre prochain tour, les créatures que vos adversaires contrôlent attaquent à chaque combat si possible.\nIIII — Chaque créature engagée s'inflige un nombre de blessures égal à sa force.", "type": "Enchantement : saga"}, {"language": "Italian", "multiverseId": 477391, "name": "La Guerra di Akros", "text": "(Mentre questa Saga entra e dopo la tua sottofase di acquisizione, aggiungi un segnalino sapere. Sacrifica dopo III.)\nI — Prendi il controllo di una creatura bersaglio fintanto che La Guerra di Akros rimane sul campo di battaglia.\nII — Fino al tuo prossimo turno, le creature controllate dai tuoi avversari attaccano in ogni combattimento, se possono farlo.\nIII — Ogni creatura TAPpata infligge a se stessa danno pari alla propria forza.", "type": "Incantesimo — Saga"}, {"language": "Japanese", "multiverseId": 477645, "name": "アクロス戦争", "text": "（この英雄譚が出た際とあなたのドロー・ステップの後に、伝承カウンターを１個加える。IIIの後に、生け贄に捧げる。）\nI ― クリーチャー１体を対象とする。アクロス戦争が戦場に残り続けているかぎり、それのコントロールを得る。\nII ― あなたの次のターンまで、各戦闘で、対戦相手がコントロールしているクリーチャーは可能なら攻撃する。\nIII ― タップ状態の各クリーチャーはそれぞれ、自身にそれのパワーに等しい点数のダメージを与える。", "type": "エンチャント — 英雄譚"}, {"language": "Korean", "multiverseId": 477899, "name": "아크로스 전쟁", "text": "(이 서사시가 들어오면서 그리고 당신의 뽑기단 후에, 전승 카운터 한 개를 추가한다. III 이후에 희생한다.)\nI — 생물을 목표로 정한다. 아크로스 전쟁이 전장에 남아 있는 한 그 생물의 조종권을 얻는다.\nII — 당신의 다음 턴까지, 당신의 상대들이 조종하는 생물들은 가능하면 매 전투마다 공격한다.\nIII — 각 탭된 생물은 자신에게 자신의 공격력만큼 피해를 입힌다.", "type": "부여마법 — 서사시"}, {"language": "Portuguese (Brazil)", "multiverseId": 478153, "name": "A Guerra Acrosana", "text": "(Conforme esta Saga entra e após sua etapa de compra, adicione um marcador de conhecimento. Sacrifique-a após III.)\nI — Ganhe o controle da criatura alvo enquanto A Guerra Acrosana permanecer no campo de batalha.\nII — Até seu próximo turno, as criaturas que seus oponentes controlam atacam a cada combate se estiverem aptas.\nIII — Cada criatura virada causa a si mesma uma quantidade de dano igual ao próprio poder.", "type": "Encantamento — Saga"}, {"language": "Russian", "multiverseId": 478407, "name": "Акросская Война", "text": "(При выходе этой Саги и после вашего шага взятия карты добавьте один жетон знаний. Пожертвуйте после III.)\nI — Получите контроль над целевым существом до тех пор, пока Акросская Война остается на поле битвы.\nII — До вашего следующего хода существа под контролем ваших оппонентов атакуют в каждом бою, если могут.\nIII — Каждое повернутое существо наносит самому себе повреждения, равные своей силе.", "type": "Чары — Сага"}, {"language": "Chinese Simplified", "multiverseId": 478661, "name": "阿喀洛斯战记", "text": "（于此传纪进战场时及于你抓牌步骤后，加一个学问指示物。到III后牺牲之。）\nI — 于阿喀洛斯战记仍在战场上时段内，获得目标生物的操控权。\nII — 直到你的下一个回合，由对手操控的生物每次战斗若能攻击，则必须攻击。\nIII — 每个已横置的生物各对本身造成等同于其力量的伤害。", "type": "结界 ～传纪"}, {"language": "Chinese Traditional", "multiverseId": 478915, "name": "阿喀洛斯戰記", "text": "（於此傳紀進戰場時及於你抽牌步驟後，加一個學問指示物。到III後犧牲之。）\nI — 於阿喀洛斯戰記仍在戰場上的時段內，獲得目標生物的操控權。\nII — 直到你的下一個回合，由對手操控的生物每次戰鬥若能攻擊，則必須攻擊。\nIII — 每個已橫置的生物各對本身造成等同於其力量的傷害。", "type": "結界 ～傳紀"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "231049", "cardKingdomId": "230674", "cardsphereId": "65421", "mcmId": "429076", "mcmMetaId": "290246", "mtgArenaId": "70635", "mtgjsonV4Id": "537efeee-062c-50d0-805c-2a9d78ca541d", "mtgoId": "79372", "multiverseId": "476375", "scryfallId": "28ea046b-1bbc-4430-a859-321602c9e928", "scryfallIllustrationId": "434bd54b-3b31-43c4-8f18-c419bc88417f", "scryfallOracleId": "8c0b9596-c44f-44fb-89c9-056da0db33d3", "tcgplayerProductId": "206150"}, "language": "English", "layout": "saga", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}", "manaValue": 4.0, "name": "The Akroan War", "number": "124", "originalText": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI — Gain control of target creature for as long as The Akroan War remains on the battlefield.\nII — Until your next turn, creatures your opponents control attack each combat if able.\nIII — Each tapped creature deals damage to itself equal to its power.", "originalType": "Enchantment — Saga", "printings": ["CLB", "PTHB", "THB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/9dd9c1432a15ec48", "cardKingdomFoil": "https://mtgjson.com/links/0a572087d9850265", "cardmarket": "https://mtgjson.com/links/0d1c282e206e73fa", "tcgplayer": "https://mtgjson.com/links/7374804a5702999d"}, "rarity": "rare", "rulings": [{"date": "2020-01-24", "text": "If The Akroan War leaves the battlefield before its first ability resolves, you won't gain control of the creature at all."}, {"date": "2020-01-24", "text": "If a creature can't attack for any reason (such as being tapped or having come under that player's control that turn), then it doesn't attack. If there's a cost associated with having it attack, the player isn't forced to pay that cost, so it doesn't have to attack in that case either."}, {"date": "2020-01-24", "text": "Because a Saga isn't sacrificed until after its last ability has resolved, you still control the creature you took with The Akroan War's first ability while the last ability is resolving."}, {"date": "2020-01-24", "text": "If the creature you took with The Akroan War's first ability has an ability that triggers when you sacrifice The Akroan War, you control the resulting trigger. If it has an ability that triggers when The Akroan War is put into a graveyard “from anywhere,” check whether that ability should trigger only after the creature's former controller has regained control of it."}, {"date": "2020-01-24", "text": "As a Saga enters the battlefield, its controller puts a lore counter on it. As your precombat main phase begins (immediately after your draw step), you put another lore counter on each Saga you control. Putting a lore counter on a Saga in either of these ways doesn't use the stack."}, {"date": "2020-01-24", "text": "Each symbol on the left of a Saga's text box represents a chapter ability. A chapter ability is a triggered ability that triggers when a lore counter that is put on the Saga causes the number of lore counters on the Saga to become equal to or greater than the ability's chapter number. Chapter abilities are put onto the stack and may be responded to."}, {"date": "2020-01-24", "text": "A chapter ability doesn't trigger if a lore counter is put on a Saga that already had a number of lore counters greater than or equal to that chapter's number. For example, the third lore counter put on a Saga causes the III chapter ability to trigger, but I and II won't trigger again."}, {"date": "2020-01-24", "text": "Once a chapter ability has triggered, the ability on the stack won't be affected if the Saga gains or loses counters, or if it leaves the battlefield."}, {"date": "2020-01-24", "text": "If multiple chapter abilities trigger at the same time, their controller puts them on the stack in any order. If any of them require targets, those targets are chosen as you put the abilities on the stack, before any of those abilities resolve."}, {"date": "2020-01-24", "text": "Removing lore counters won't cause a previous chapter ability to trigger. If lore counters are removed from a Saga, the appropriate chapter abilities will trigger again when the Saga receives lore counters."}, {"date": "2020-01-24", "text": "Once the number of lore counters on a Saga is greater than or equal to the greatest number among its chapter abilities, the Saga's controller sacrifices it as soon as its chapter ability has left the stack, most likely by resolving or being countered. This state-based action doesn't use the stack."}], "securityStamp": "oval", "setCode": "THB", "subtypes": ["Saga"], "supertypes": [], "text": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI — Gain control of target creature for as long as The Akroan War remains on the battlefield.\nII — Until your next turn, creatures your opponents control attack each combat if able.\nIII — Each tapped creature deals damage to itself equal to its power.", "type": "Enchantment — Saga", "types": ["Enchantment"], "uuid": "b9f2a87e-3b67-5547-8cca-91b6bd06b4f1"}