{"artist": "Randy Gallegos", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["G", "U"], "colors": ["G", "U"], "convertedManaCost": 3.0, "edhrecRank": 7939, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "241531", "cardsphereId": "74292", "mcmId": "535827", "mtgjsonV4Id": "b5c70aa9-cb8d-5f56-a632-747f2bc5dc9c", "scryfallId": "0675dfab-2c60-4701-9a0f-da6c876d9616", "scryfallIllustrationId": "8af80b4b-9bde-4092-a444-69d2c7becb2c", "scryfallOracleId": "697f3fd9-1577-4f69-bdf8-db1f673d3505", "tcgplayerProductId": "231609"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "saga", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}{U}", "manaValue": 3.0, "name": "The Bears of Littjara", "number": "205s", "printings": ["KHM", "PKHM"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/ddbd5cba4fb0dd8f", "tcgplayer": "https://mtgjson.com/links/84e93612056c8386"}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "The chapter II ability overwrites any previous effects that set any of the Shapeshifters’ base power and toughness to specific values. Any effects that set a Shapeshifter’s base power and toughness that start to apply after the chapter II ability will override the effect of that ability."}, {"date": "2021-02-05", "text": "Any effects that modify the Shapeshifter’s power or toughness without setting it to a specific value will apply after its base power and toughness are set, regardless of the order in which those effects were created. The same is true of counters that modify its power and toughness."}, {"date": "2021-02-05", "text": "The effect of the chapter II ability lasts indefinitely. It doesn’t expire at end of turn."}, {"date": "2021-02-05", "text": "As a Saga enters the battlefield, its controller puts a lore counter on it. As your precombat main phase begins (immediately after your draw step), you put another lore counter on each Saga you control. Putting a lore counter on a Saga in either of these ways doesn’t use the stack."}, {"date": "2021-02-05", "text": "Each symbol on the left of a Saga’s text box represents a chapter ability. A chapter ability is a triggered ability that triggers when a lore counter that is put on the Saga causes the number of lore counters on the Saga to become equal to or greater than the ability’s chapter number. Chapter abilities are put onto the stack and may be responded to."}, {"date": "2021-02-05", "text": "A chapter ability doesn’t trigger if a lore counter is put on a Saga that already had a number of lore counters greater than or equal to that chapter’s number. For example, the third lore counter put on a Saga causes the chapter III ability to trigger, but chapters I and II won’t trigger again."}, {"date": "2021-02-05", "text": "Once a chapter ability has triggered, the ability on the stack won’t be affected if the Saga gains or loses counters, or if it leaves the battlefield."}, {"date": "2021-02-05", "text": "If multiple chapter abilities trigger at the same time, their controller puts them on the stack in any order. If any of them require targets, those targets are chosen as you put the abilities on the stack, before any of those abilities resolve."}, {"date": "2021-02-05", "text": "Removing lore counters won’t cause a previous chapter ability to trigger. If lore counters are removed from a Saga, the appropriate chapter abilities will trigger again when the Saga receives more lore counters."}, {"date": "2021-02-05", "text": "Once the number of lore counters on a Saga is greater than or equal to the greatest number among its chapter abilities, the Saga’s controller sacrifices it as soon as its chapter ability has left the stack, most likely by resolving or being countered. This state-based action doesn’t use the stack."}, {"date": "2021-02-05", "text": "Changeling is a characteristic-defining ability. It functions in all zones, not only while a card that has it is on the battlefield."}, {"date": "2021-02-05", "text": "The subtype Shapeshifter that appears on the type line is mostly there to reinforce the flavor. A creature card with changeling is just as much an Elf, a Dwarf, a Sliver, a Goat, a Coward, and a Zombie as it is a Shapeshifter."}, {"date": "2021-02-05", "text": "If an effect causes a creature with changeling to become a new creature type, it will be only that new creature type. It will still have changeling; the effect making it all creature types will simply be overwritten."}, {"date": "2021-02-05", "text": "If an effect causes a creature with changeling to lose all abilities, it will remain all creature types, even though it will no longer have changeling. This is because changeling applies before the effect that removes it."}], "securityStamp": "oval", "setCode": "PKHM", "subtypes": ["Saga"], "supertypes": [], "text": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI — Create a 2/2 blue Shapeshifter creature token with changeling.\nII — Any number of target Shapeshifter creatures you control have base power and toughness 4/4.\nIII — Choose up to one target creature or planeswalker. Each creature with power 4 or greater you control deals damage equal to its power to that permanent.", "type": "Enchantment — Saga", "types": ["Enchantment"], "uuid": "ca5fabbe-abd8-59af-8e26-99f26bf3b54c", "variations": ["fb7f1311-ee48-557e-ab09-18f21a1ffe0e"]}