{"artist": "Mike Burns", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 1.0, "edhrecRank": 12521, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "229568", "cardsphereId": "64717", "mcmId": "421576", "mcmMetaId": "262833", "mtgjsonV4Id": "33ea7b3f-ab0b-5373-8227-991a5ed1806c", "scryfallId": "5140cab6-436e-4128-8c2b-af235c5b03d1", "scryfallIllustrationId": "91ad2dc7-d118-4610-9d46-cc01287e586a", "scryfallOracleId": "21302f37-0632-4202-9823-f08c5aec016e", "tcgplayerProductId": "203209"}, "isReprint": true, "keywords": ["Assist", "Support"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{X}{G}", "manaValue": 1.0, "name": "The Crowd Goes Wild", "number": "1173", "printings": ["BBD", "MB1"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/46d0e9585990713a", "cardmarket": "https://mtgjson.com/links/b5bfd35d060a3c31", "tcgplayer": "https://mtgjson.com/links/fd982eb67cee226f"}, "rarity": "uncommon", "rulings": [{"date": "2018-06-08", "text": "You can cast The Crowd Goes Wild with 0 as the value of X. The spell won’t target any creatures, and creatures with +1/+1 counters on them will gain trample."}, {"date": "2018-06-08", "text": "The final ability of The Crowd Goes Wild affects only creatures with a +1/+1 counter on them at the time it’s applied. Creatures that get a +1/+1 counter later in the turn won’t gain trample, and creatures that lose their +1/+1 counters later in the turn won’t lose trample."}, {"date": "2018-06-08", "text": "If The Crowd Goes Wild has any targets and each of those targets is illegal as it tries to resolve, the spell doesn’t resolve. No creatures gain trample. The crowd falls silent."}, {"date": "2018-06-08", "text": "You may reveal a card with assist and discuss how to pay for it before you begin to cast the spell. Targets are chosen for that spell before you choose another player to help you pay for it and before that player has committed any mana to doing so."}, {"date": "2018-06-08", "text": "Only the generic mana portion of a spell’s cost can be paid with assist. Any colored mana costs must be paid by the spell’s controller, even if the assisting player paid mana of that color."}, {"date": "2018-06-08", "text": "If an effect allows a player to cast a spell spending mana “as though it were mana of any color” or “of any type,” that player must still pay for the colored mana in that spell’s total cost. That cost doesn’t become generic."}, {"date": "2018-06-08", "text": "Assist allows another player to pay for any amount of generic mana. If an effect changes the cost of the spell, the amount that player may pay will be more or less than the amount in the spell’s reminder text."}, {"date": "2018-06-08", "text": "You can’t put more than one +1/+1 counter on any one target using the support action."}, {"date": "2018-06-08", "text": "Support can target a creature another player controls."}, {"date": "2018-06-08", "text": "If a spell with support has other abilities that target creatures, those abilities and the support ability can target the same creature."}, {"date": "2018-06-08", "text": "If some, but not all, targets for a spell become illegal, the remaining targets are affected as appropriate. If all of a spell’s targets become illegal, that spell doesn’t resolve."}], "setCode": "MB1", "subtypes": [], "supertypes": [], "text": "Assist (Another player can pay up to {X} of this spell's cost. You choose the value of X.)\nSupport X. (Put a +1/+1 counter on each of up to X target creatures.)\nEach creature with a +1/+1 counter on it gains trample until end of turn.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "ecadb2de-e5c1-5733-8884-7d540f7fbfc8"}