{"artist": "Lake Hurwitz", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 10626, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "238124", "cardsphereId": "71771", "mcmId": "498840", "mcmMetaId": "239419", "mtgjsonV4Id": "176de3a4-6afc-516b-8830-fb25017c76c3", "scryfallId": "13a55cfb-5893-4650-8c03-1545d793e698", "scryfallIllustrationId": "daa0b7c9-bf6d-4a17-b779-547439b7373f", "scryfallOracleId": "26b41c78-c5ee-4c50-93be-e3acc35ab355", "tcgplayerProductId": "222552"}, "isReprint": true, "language": "English", "layout": "saga", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}", "manaValue": 2.0, "name": "The Flame of Keld", "number": "129", "printings": ["DOM", "PLIST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d6de1becb3f1ad4c", "cardmarket": "https://mtgjson.com/links/4d3e0c05c1fa06d4", "tcgplayer": "https://mtgjson.com/links/9cd2c2c058feec07"}, "rarity": "uncommon", "rulings": [{"date": "2018-04-27", "text": "If multiple replacement effects would modify how damage would be dealt, the player being dealt damage (or the controller of the permanent being dealt damage) chooses the order in which to apply those effects."}, {"date": "2018-04-27", "text": "If damage dealt by a source you control is being divided or assigned among multiple permanents an opponent controls or among an opponent and one or more permanents they control simultaneously, divide the original amount before adding 2. For example, if you attack with a 5/5 red creature with trample and your opponent blocks with a 2/2 creature, you can assign 2 damage to the blocker and 3 damage to the defending player. These amounts are then modified to 4 and 5, respectively."}, {"date": "2018-04-27", "text": "As a Saga enters the battlefield, its controller puts a lore counter on it. As your precombat main phase begins (immediately after your draw step), you put another lore counter on each Saga you control. Putting a lore counter on a Saga in either of these ways doesn’t use the stack."}, {"date": "2018-04-27", "text": "Each symbol on the left of a Saga’s text box represents a chapter ability. A chapter ability is a triggered ability that triggers when a lore counter that is put on the Saga causes the number of lore counters on the Saga to become equal to or greater than the ability’s chapter number. Chapter abilities are put onto the stack and may be responded to."}, {"date": "2018-04-27", "text": "A chapter ability doesn’t trigger if a lore counter is put on a Saga that already had a number of lore counters greater than or equal to that chapter’s number. For example, the third lore counter put on a Saga causes the III chapter ability to trigger, but I and II won’t trigger again."}, {"date": "2018-04-27", "text": "Once a chapter ability has triggered, the ability on the stack won’t be affected if the Saga gains or loses counters, or if it leaves the battlefield."}, {"date": "2018-04-27", "text": "If multiple chapter abilities trigger at the same time, their controller puts them on the stack in any order. If any of them require targets, those targets are chosen as you put the abilities on the stack, before any of those abilities resolve."}, {"date": "2018-04-27", "text": "If counters are removed from a Saga, the appropriate chapter abilities will trigger again when the Saga receives lore counters. Removing lore counters won’t cause a previous chapter ability to trigger."}, {"date": "2018-04-27", "text": "Once the number of lore counters on a Saga is greater than or equal to the greatest number among its chapter abilities—in the Dominaria set, this is always three—the Saga’s controller sacrifices it as soon as its chapter ability has left the stack, most likely by resolving or being countered. This state-based action doesn’t use the stack."}], "setCode": "PLIST", "subtypes": ["Saga"], "supertypes": [], "text": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI — Discard your hand.\nII — Draw two cards.\nIII — If a red source you control would deal damage to a permanent or player this turn, it deals that much damage plus 2 to that permanent or player instead.", "type": "Enchantment — Saga", "types": ["Enchantment"], "uuid": "0538bef1-1555-520f-8a92-15a1cf36c7b2"}