{"artist": "Games Workshop", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 4.0, "edhrecRank": 6919, "finishes": ["foil"], "foreignData": [], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "266453", "cardsphereId": "94350", "mtgjsonV4Id": "9e6fee52-2ea3-52ed-b249-6417602de7be", "scryfallId": "b9110c5b-bfe5-4164-ba26-7a7f01dabf4d", "scryfallIllustrationId": "f4cb96a7-9d23-4b4f-9f3c-e1c4202b73e7", "scryfallOracleId": "a68f41a2-37ee-46e1-bf3c-164c78b003ca", "tcgplayerProductId": "286474"}, "isAlternative": true, "keywords": ["A Thousand Souls Die Every Day", "Arcane Life-support"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}", "manaValue": 4.0, "name": "The Golden Throne", "number": "157★", "printings": ["40K"], "promoTypes": ["surgefoil"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/d5c3e929c7cfd54b", "tcgplayer": "https://mtgjson.com/links/6e42e3d8eaedac55"}, "rarity": "rare", "rulings": [{"date": "2022-10-07", "text": "If a spell or ability both destroys The Golden Throne and deals enough damage to you to reduce your life total to zero or less, you will still lose the game. This is because the state-based action that causes a player to lose the game due to having zero or less life won’t be performed until after the spell or ability finishes resolving. At that point, The Golden Throne is no longer on the battlefield to apply its replacement effect."}, {"date": "2022-10-07", "text": "If an effect says that you can’t lose the game, The Golden Throne’s first ability doesn’t apply."}, {"date": "2022-10-07", "text": "The Golden Throne’s effect applies any time you would lose the game while it is on the battlefield, even if you’re not losing due to your life total being 0 or less. If you would have lost the game because you tried to draw from an empty library, your life total becomes 1 and you won’t lose again until you try to draw again and still can’t do so. If you would have lost the game due to having ten or more poison counters, your life total becomes 1, but you will lose the game immediately afterward because you still have ten or more poison counters."}, {"date": "2022-10-07", "text": "The Golden Throne’s effect does nothing if you concede the game. A player who concedes leaves the game."}, {"date": "2022-10-07", "text": "For your life total to become 1, you will gain or lose the appropriate amount of life. For example, if your life total is -4 when The Golden Throne’s ability applies, it will cause you to gain 5 life. Alternatively, if your life total is 20 when it applies (perhaps because you tried to draw a card from an empty library), you will lose 19 life. Other cards that interact with life gain or life loss will interact with this effect accordingly. Notably, this means that if you can’t gain life or the life gain event is modified by another replacement effect, you might still have 0 or less life and still lose the game."}, {"date": "2022-10-07", "text": "If an effect states that an opponent wins the game, The Golden Throne’s effect doesn’t apply."}, {"date": "2022-10-07", "text": "In a Two-Headed Giant game, The Golden Throne’s ability set’s the team’s life total to 1, but only you gain or lose life."}], "securityStamp": "triangle", "setCode": "40K", "subtypes": [], "supertypes": ["Legendary"], "text": "Arcane Life-support — If you would lose the game, instead exile The Golden Throne and your life total becomes 1.\nA Thousand Souls Die Every Day — {T}, Sacrifice a creature: Add three mana in any combination of colors.", "type": "Legendary Artifact", "types": ["Artifact"], "uuid": "b53632ff-9775-557f-8a3f-5fd3d3873c27", "variations": ["4a106f2b-82ce-542c-823c-dfc912cbc04f"]}