{"artist": "James Arnold", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 4359, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "218440", "cardsphereId": "54801", "mcmId": "355692", "mtgjsonV4Id": "05a90490-7a09-5a08-a97f-b5398e4033b3", "scryfallId": "7b5037df-c089-4dcd-ae40-cc10a0c0fbaa", "scryfallIllustrationId": "be099eea-cb0f-4223-89be-f10f683adaf9", "scryfallOracleId": "56528234-46c0-4fba-972a-0c8011996f8d", "tcgplayerProductId": "165603"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "saga", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U}", "manaValue": 5.0, "name": "The Mirari Conjecture", "number": "57s", "printings": ["DOM", "MB1", "PDOM"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/5ce7f6ab21829cd9", "tcgplayer": "https://mtgjson.com/links/1dd14d2ede5a1f21"}, "rarity": "rare", "rulings": [{"date": "2018-04-27", "text": "The Mirari Conjecture’s final chapter ability copies any instant or sorcery spell you cast, not just those with targets."}, {"date": "2018-04-27", "text": "The copy is created on the stack, so it’s not “cast.” Abilities that trigger when a player casts a spell won’t trigger."}, {"date": "2018-04-27", "text": "The copy will have the same targets as the spell it’s copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can’t choose a new legal target, then it remains unchanged (even if the current target is illegal)."}, {"date": "2018-04-27", "text": "If the spell that’s copied is modal (that is, it says “Choose one —” or the like), the copy will have the same mode. A different mode can’t be chosen."}, {"date": "2018-04-27", "text": "If the spell that’s copied has an X whose value was determined as it was cast (like Jaya’s Immolating Inferno does), the copy will have the same value of X."}, {"date": "2018-04-27", "text": "If the spell has damage divided as it was cast (like Fight with Fire does when kicked), the division can’t be changed (although the targets receiving that damage still can)."}, {"date": "2018-04-27", "text": "The controller of a copy can’t choose to pay any alternative or additional costs for the copy. However, effects based on any alternative or additional costs that were paid for the original spell are copied as though those same costs were paid for the copy."}, {"date": "2018-04-27", "text": "As a Saga enters the battlefield, its controller puts a lore counter on it. As your precombat main phase begins (immediately after your draw step), you put another lore counter on each Saga you control. Putting a lore counter on a Saga in either of these ways doesn’t use the stack."}, {"date": "2018-04-27", "text": "Each symbol on the left of a Saga’s text box represents a chapter ability. A chapter ability is a triggered ability that triggers when a lore counter that is put on the Saga causes the number of lore counters on the Saga to become equal to or greater than the ability’s chapter number. Chapter abilities are put onto the stack and may be responded to."}, {"date": "2018-04-27", "text": "A chapter ability doesn’t trigger if a lore counter is put on a Saga that already had a number of lore counters greater than or equal to that chapter’s number. For example, the third lore counter put on a Saga causes the III chapter ability to trigger, but I and II won’t trigger again."}, {"date": "2018-04-27", "text": "Once a chapter ability has triggered, the ability on the stack won’t be affected if the Saga gains or loses counters, or if it leaves the battlefield."}, {"date": "2018-04-27", "text": "If multiple chapter abilities trigger at the same time, their controller puts them on the stack in any order. If any of them require targets, those targets are chosen as you put the abilities on the stack, before any of those abilities resolve."}, {"date": "2018-04-27", "text": "If counters are removed from a Saga, the appropriate chapter abilities will trigger again when the Saga receives lore counters. Removing lore counters won’t cause a previous chapter ability to trigger."}, {"date": "2018-04-27", "text": "Once the number of lore counters on a Saga is greater than or equal to the greatest number among its chapter abilities—in the Dominaria set, this is always three—the Saga’s controller sacrifices it as soon as its chapter ability has left the stack, most likely by resolving or being countered. This state-based action doesn’t use the stack."}], "securityStamp": "oval", "setCode": "PDOM", "subtypes": ["Saga"], "supertypes": [], "text": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI — Return target instant card from your graveyard to your hand.\nII — Return target sorcery card from your graveyard to your hand.\nIII — Until end of turn, whenever you cast an instant or sorcery spell, copy it. You may choose new targets for the copy.", "type": "Enchantment — Saga", "types": ["Enchantment"], "uuid": "6068026e-a782-55f5-904e-54ff9ffe8fcd"}