{"artist": "James Paick", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210286", "mcmId": "294444", "mtgjsonV4Id": "1e01dca0-757e-5749-98be-6695676a73d0", "multiverseId": "423630", "scryfallId": "6223caca-e993-4834-a673-3eee65b8afe1", "scryfallIllustrationId": "a2f52e01-c6b3-42d1-993f-bb93a29b91da", "scryfallOracleId": "e28deac5-d3c4-48e9-974c-093e3122f317", "tcgplayerProductId": "125642"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "The Maelstrom", "number": "49", "originalText": "When you planeswalk to The Maelstrom or at the beginning of your upkeep, you may reveal the top card of your library. If it's a permanent card, you may put it onto the battlefield. If you revealed a card but didn't put it onto the battlefield, put it on the bottom of your library.\nWhenever you roll {Chaos}, return target permanent card from your graveyard to the battlefield.", "originalType": "Plane — Alara", "printings": ["OHOP", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/94844a11b3bc1102", "tcgplayer": "https://mtgjson.com/links/5d34fdf1f1d54c51"}, "rarity": "common", "rulings": [{"date": "2009-10-01", "text": "A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"}, {"date": "2009-10-01", "text": "A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."}, {"date": "2009-10-01", "text": "The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."}, {"date": "2009-10-01", "text": "If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}, {"date": "2009-10-01", "text": "A permanent card is an artifact, creature, enchantment, land, or planeswalker card."}, {"date": "2009-10-01", "text": "As The Maelstrom’s first ability resolves, you choose whether or not to reveal the top card of your library. If you reveal it and it’s a permanent card, you have two choices: Put it onto the battlefield, or put it on the bottom of your library. It can’t remain on top of your library. On the other hand, if you reveal it and it’s an instant or sorcery card, it must be put on the bottom of your library. There is no way you can leave a card revealed this way on top of your library."}, {"date": "2009-10-01", "text": "If you reveal a permanent card that can’t enter the battlefield (because it’s an Aura and there’s nothing it can enchant, for example), then you must put it on the bottom of your library."}], "setCode": "OPCA", "subtypes": ["Alara"], "supertypes": [], "text": "When you planeswalk to The Maelstrom or at the beginning of your upkeep, you may reveal the top card of your library. If it's a permanent card, you may put it onto the battlefield. If you revealed a card but didn't put it onto the battlefield, put it on the bottom of your library.\nWhenever you roll {CHAOS}, return target permanent card from your graveyard to the battlefield.", "type": "Plane — Alara", "types": ["Plane"], "uuid": "b2cefb5e-05d9-55cd-9d4c-f10d5dcfbb41"}