{"artist": "Sam Burley", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 1.0, "edhrecRank": 389, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "6ae7f467-a807-57e8-8cad-54922377d85d", "mtgoId": "80853", "scryfallId": "880d6793-5a51-4f60-8679-efe121f8d89c", "scryfallIllustrationId": "4dcb147b-1b2b-4f20-b12c-c7dd93e1a3a2", "scryfallOracleId": "1946ded1-5f53-409f-b0a6-5433bb0357d2"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}", "manaValue": 1.0, "name": "The Ozolith", "number": "80853", "originalReleaseDate": "2020-04-30", "printings": ["IKO", "PIKO", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "The Ozolith’s first ability doesn’t move counters off the creature that’s left the battlefield. Instead, it causes you to put a number of counters of each kind of counter that was on that creature onto The Ozolith. Notably, if you somehow control a second The Ozolith, each one will receive the same number and kinds of counters that were on the creature that left the battlefield. Similarly, if the creature has an ability that triggers when it leaves the battlefield that refers to the number of counters it had, that ability will use the number of counters that were on the permanent, even if The Ozolith’s first ability resolves first."}, {"date": "2020-04-17", "text": "+1/+1 counters on The Ozolith have no effect unless it becomes a creature. Keyword counters on The Ozolith will grant it keywords that may have no practical effect. For example, flying on a noncreature artifact is just strange, but hexproof on a noncreature artifact is entirely useful."}, {"date": "2020-04-17", "text": "As The Ozolith’s last ability resolves, you choose whether to move the counters."}, {"date": "2020-04-17", "text": "You can’t move only some of the counters from The Ozolith onto the target creature."}, {"date": "2020-04-17", "text": "If the target creature is an illegal target by the time The Ozolith’s last ability tries to resolve, the ability won’t resolve. You won’t remove any counters from The Ozolith."}, {"date": "2020-04-17", "text": "If The Ozolith leaves the battlefield after the last ability triggers but before it resolves, you can’t move any counters from it onto the target creature."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": ["Legendary"], "text": "Whenever a creature you control leaves the battlefield, if it had counters on it, put those counters on The Ozolith.\nAt the beginning of combat on your turn, if The Ozolith has counters on it, you may move all counters from The Ozolith onto target creature.", "type": "Legendary Artifact", "types": ["Artifact"], "uuid": "a572a21b-529c-5880-8c9b-3b8a5ebfc811"}