{"artist": "Adam Paquette", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G", "U"], "colors": ["G", "U"], "convertedManaCost": 2.0, "edhrecRank": 10614, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 504148, "name": "Die Drei Jahreszeiten", "text": "(Je eine Sagenmarke beim Ins-Spiel-Kommen und nach deinem Ziehsegment. Opfern nach III.)\nI — Du millst drei Karten.\nII — Bringe bis zu zwei verschneite bleibende Karten deiner Wahl aus deinem Friedhof auf deine Hand zurück.\nIII — Bestimme in jedem Friedhof drei Karten. Ihre Besitzer mischen die Karten in ihre Bibliotheken.", "type": "Verzauberung — Sage"}, {"language": "Spanish", "multiverseId": 504449, "name": "Las tres estaciones", "text": "(En cuanto esta Saga entre y después de tu paso de robar, agrega un contador de sabiduría. Sacrifícala después de III.)\nI — Muele tres cartas.\nII — Regresa hasta dos cartas de permanente nevado objetivo de tu cementerio a tu mano.\nIII — Elige tres cartas en cada cementerio. Sus propietarios barajan esas cartas en sus bibliotecas.", "type": "Encantamiento — Saga"}, {"language": "French", "multiverseId": 504750, "name": "Les trois saisons", "text": "(Au moment où cette saga arrive sur le champ de bataille et après votre étape de pioche, ajoutez un marqueur « sapience ». Sacrifiez après III.)\nI — Meulez trois cartes.\nII — Renvoyez jusqu'à deux cartes de permanent neigeux ciblées depuis votre cimetière dans votre main.\nIII — Choisissez trois cartes dans chaque cimetière. Leurs propriétaires mélangent ces cartes dans leurs bibliothèques.", "type": "Enchantement : saga"}, {"language": "Italian", "multiverseId": 505051, "name": "Le Tre Stagioni", "text": "(Mentre questa Saga entra e dopo la tua sottofase di acquisizione, aggiungi un segnalino sapere. Sacrifica dopo III.)\nI — Macina tre carte.\nII — Riprendi in mano fino a due carte permanente neve bersaglio dal tuo cimitero.\nIII — Scegli tre carte in ogni cimitero. I loro proprietari rimescolano quelle carte nei propri grimori.", "type": "Incantesimo — Saga"}, {"language": "Japanese", "multiverseId": 505352, "name": "三つの季節", "text": "（この英雄譚が出た際とあなたのドロー・ステップの後に、伝承カウンターを１個加える。IIIの後に、生け贄に捧げる。）\nI ― カード３枚を切削する。\nII ― あなたの墓地から氷雪パーマネント・カード最大２枚を対象とする。それらをあなたの手札に戻す。\nIII ― 各墓地からそれぞれカード３枚を選ぶ。それらのオーナーはそれらのカードを自分のライブラリーに加えて切り直す。", "type": "エンチャント — 英雄譚"}, {"language": "Korean", "multiverseId": 505653, "name": "세 계절", "text": "(이 서사시가 들어오면서 그리고 당신의 뽑기단 후에, 전승 카운터 한 개를 추가한다. III 이후에 희생한다.)\nI — 카드 세 장을 민다.\nII — 당신의 무덤에 있는 눈 지속물 카드를 최대 두 개까지 목표로 정한다. 그 카드들을 당신의 손으로 되돌린다.\nIII — 각 무덤에서 카드를 세 장씩 선택한다. 그 카드들의 소유자는 그 카드들을 자신의 서고에 섞어넣는다.", "type": "부여마법 — 서사시"}, {"language": "Portuguese (Brazil)", "multiverseId": 505954, "name": "As Três Estações", "text": "(Conforme esta Saga entra e após sua etapa de compra, adicione um marcador de conhecimento. Sacrifique-a após III.)\nI — Triture três cards.\nII — Devolva até dois cards de permanente da neve alvo de seu cemitério para sua mão.\nIII — Escolha três cards em cada cemitério. Seus donos embaralham aqueles cards em seus cemitérios.", "type": "Encantamento — Saga"}, {"language": "Russian", "multiverseId": 506255, "name": "Три Времени Года", "text": "(При выходе этой Саги и после вашего шага взятия карты добавьте один жетон знаний. Пожертвуйте после III.)\nI — Скрутите три карты.\nII — Верните не более двух целевых карт снежных перманентов из вашего кладбища в вашу руку.\nIII — Выберите по три карты на каждом кладбище. Их владельцы втасовывают те карты в свои библиотеки.", "type": "Чары — Сага"}, {"language": "Chinese Simplified", "multiverseId": 506556, "name": "三季变换", "text": "（于此传纪进战场时及于你抓牌步骤后，加一个学问指示物。到III后牺牲之。）\nI — 磨三张牌。\nII — 将至多两张目标雪境永久物牌从你的坟墓场移回你手上。\nIII — 从每个坟墓场中各选择三张牌。其拥有者将这些牌洗入各自的牌库。", "type": "结界 ～传纪"}, {"language": "Chinese Traditional", "multiverseId": 506857, "name": "三季變換", "text": "（於此傳紀進戰場時及於你抽牌步驟後，加一個學問指示物。到III後犧牲之。）\nI — 磨三張牌。\nII — 將至多兩張目標雪境永久物牌從你的墳墓場移回你手上。\nIII — 從每個墳墓場中各選擇三張牌。其擁有者將這些牌洗入各自的牌庫。", "type": "結界 ～傳紀"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "241117", "cardKingdomId": "240704", "cardsphereId": "73271", "mcmId": "532972", "mcmMetaId": "330417", "mtgArenaId": "75278", "mtgjsonV4Id": "ffdae37c-d465-5ddb-b183-a5e26f342ab9", "mtgoId": "87805", "multiverseId": "503847", "scryfallId": "48ce03b3-ec7c-46df-b89a-55405f3b5245", "scryfallIllustrationId": "0852db67-590f-4349-a266-fe54cc12a57f", "scryfallOracleId": "a38ebf4a-064c-4517-a553-15f0a252c159", "tcgplayerProductId": "230885"}, "keywords": ["Mill"], "language": "English", "layout": "saga", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{G}{U}", "manaValue": 2.0, "name": "The Three Seasons", "number": "231", "originalText": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI — Mill three cards.\nII — Return up to two target snow permanent cards from your graveyard to your hand.\nIII — Choose three cards in each graveyard. Their owners shuffle those cards into their libraries.", "originalType": "Enchantment — Saga", "printings": ["KHM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/315005836a4e9c32", "cardKingdomFoil": "https://mtgjson.com/links/db6a7b1ac93b69aa", "cardmarket": "https://mtgjson.com/links/2453b35afcdd8ab9", "tcgplayer": "https://mtgjson.com/links/442493adf4710c52"}, "rarity": "uncommon", "rulings": [{"date": "2021-02-05", "text": "For the chapter III ability, if a player has no cards in their graveyard, they don’t shuffle their library."}, {"date": "2021-02-05", "text": "As a Saga enters the battlefield, its controller puts a lore counter on it. As your precombat main phase begins (immediately after your draw step), you put another lore counter on each Saga you control. Putting a lore counter on a Saga in either of these ways doesn’t use the stack."}, {"date": "2021-02-05", "text": "Each symbol on the left of a Saga’s text box represents a chapter ability. A chapter ability is a triggered ability that triggers when a lore counter that is put on the Saga causes the number of lore counters on the Saga to become equal to or greater than the ability’s chapter number. Chapter abilities are put onto the stack and may be responded to."}, {"date": "2021-02-05", "text": "A chapter ability doesn’t trigger if a lore counter is put on a Saga that already had a number of lore counters greater than or equal to that chapter’s number. For example, the third lore counter put on a Saga causes the chapter III ability to trigger, but chapters I and II won’t trigger again."}, {"date": "2021-02-05", "text": "Once a chapter ability has triggered, the ability on the stack won’t be affected if the Saga gains or loses counters, or if it leaves the battlefield."}, {"date": "2021-02-05", "text": "If multiple chapter abilities trigger at the same time, their controller puts them on the stack in any order. If any of them require targets, those targets are chosen as you put the abilities on the stack, before any of those abilities resolve."}, {"date": "2021-02-05", "text": "Removing lore counters won’t cause a previous chapter ability to trigger. If lore counters are removed from a Saga, the appropriate chapter abilities will trigger again when the Saga receives more lore counters."}, {"date": "2021-02-05", "text": "Once the number of lore counters on a Saga is greater than or equal to the greatest number among its chapter abilities, the Saga’s controller sacrifices it as soon as its chapter ability has left the stack, most likely by resolving or being countered. This state-based action doesn’t use the stack."}], "setCode": "KHM", "subtypes": ["Saga"], "supertypes": [], "text": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI — Mill three cards.\nII — Return up to two target snow permanent cards from your graveyard to your hand.\nIII — Choose three cards in each graveyard. Their owners shuffle those cards into their libraries.", "type": "Enchantment — Saga", "types": ["Enchantment"], "uuid": "9b4bfcad-0328-535b-a92b-291939ab2812"}