{"artist": "Johan Grenier", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 7.0, "edhrecRank": 4290, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 470869, "name": "Diebisches Mischwesen", "text": "Zu Beginn des Versorgungssegments jedes Gegners manifestierst du die oberste Karte seiner Bibliothek. (Bringe sie als eine 2/2 Kreatur verdeckt ins Spiel. Decke sie zu einem beliebigen Zeitpunkt für ihre Manakosten auf, falls es eine Kreaturenkarte ist.)\nImmer wenn eine Kreatur, die du kontrollierst, aber nicht besitzt, stirbt, verliert ihr Besitzer 2 Lebenspunkte und du erhältst 2 Lebenspunkte dazu.", "type": "Kreatur — Menschenaffe, Ophis"}, {"language": "Spanish", "multiverseId": 471171, "name": "Amalgama ladrona", "text": "Al comienzo del mantenimiento de cada oponente, manifiesta la primera carta de la biblioteca de ese jugador. (Ponla en el campo de batalla boca abajo como una criatura 2/2. Ponla boca arriba en cualquier momento por su coste de maná si es una carta de criatura.)\nSiempre que una criatura que controlas pero de la cual no eres propietario muera, su propietario pierde 2 vidas y tú ganas 2 vidas.", "type": "Criatura — Víbora simio"}, {"language": "French", "multiverseId": 471473, "name": "Amalgame voleur", "text": "Au début de l'entretien de chaque adversaire, vous manifestez la carte du dessus de la bibliothèque de ce joueur. (Mettez-la sur le champ de bataille face cachée comme une créature 2/2. Retournez-la face visible à tout moment pour son coût de mana si c'est une carte de créature.)\nÀ chaque fois qu'une créature que vous contrôlez mais que vous ne possédez pas meurt, son propriétaire perd 2 points de vie et vous gagnez 2 points de vie.", "type": "Créature : grand singe et serpent"}, {"language": "Italian", "multiverseId": 471775, "name": "Amalgama Ladro", "text": "All'inizio del mantenimento di ogni avversario, manifesti la prima carta del grimorio di quel giocatore. (Mettila sul campo di battaglia a faccia in giù come una creatura 2/2. Se è una carta creatura, girala a faccia in su in qualsiasi momento pagando il suo costo di mana.)\nOgniqualvolta una creatura che controlli ma non possiedi muore, il suo proprietario perde 2 punti vita e tu guadagni 2 punti vita.", "type": "Creatura — Serpente Scimpanzé"}, {"language": "Japanese", "multiverseId": 472077, "name": "盗み取る融合体", "text": "各対戦相手のアップキープの開始時に、あなたはそのプレイヤーのライブラリーの一番上のカードを予示する。（それを裏向きの状態で２/２クリーチャーとして戦場に出す。それがクリーチャー・カードであるなら、そのマナ・コストで、いつでも表向きにしてよい。）\nあなたがコントロールしていてあなたがオーナーでないクリーチャーが１体死亡するたび、それのオーナーは２点のライフを失い、あなたは２点のライフを得る。", "type": "クリーチャー — 類人猿・蛇"}, {"language": "Portuguese (Brazil)", "multiverseId": 472379, "name": "Amálgama Ladrão", "text": "No início da manutenção de cada oponente, você manifesta o card do topo do grimório daquele jogador. (Coloque-o no campo de batalha com a face voltada para baixo como uma criatura 2/2. Volte sua face para cima a qualquer momento pagando seu custo de mana se for um card de criatura.)\nToda vez que uma criatura que não é sua mas que você controla morre, seu dono perde 2 pontos de vida e você ganha 2 pontos de vida.", "type": "Criatura — Símio Cobra"}, {"language": "Russian", "multiverseId": 472681, "name": "Скрещенный Вор", "text": "В начале шага поддержки каждого оппонента вы воплощаете верхнюю карту библиотеки того игрока. (Положите ее на поле битвы рубашкой вверх как существо 2/2. Если это карта существа, вы в любой момент можете перевернуть ее рубашкой вниз, оплатив ее мана-стоимость.)\nКаждый раз, когда не принадлежащее вам существо под вашим контролем умирает, его владелец теряет 2 жизни, а вы получаете 2 жизни.", "type": "Существо — Обезьяна Змея"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "226959", "cardsphereId": "61370", "mcmId": "391357", "mcmMetaId": "278567", "mtgjsonV4Id": "946160b6-b003-5326-a94e-8a583d2b670c", "mtgoId": "77096", "multiverseId": "470567", "scryfallId": "06ed7c94-ed3c-427a-b62a-32e91e054671", "scryfallIllustrationId": "5f0c6291-aa9f-4ad0-85ec-c44185bc399d", "scryfallOracleId": "f60cd1d8-eeb6-41a3-af32-3e2a54937ca2", "tcgplayerProductId": "196459"}, "isStarter": true, "keywords": ["Manifest"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{5}{B}{B}", "manaValue": 7.0, "name": "Thieving Amalgam", "number": "21", "originalText": "At the beginning of each opponent's upkeep, you manifest the top card of that player's library. (Put it onto the battlefield face down as a 2/2 creature. Turn it face up any time for its mana cost if it's a creature card.)\nWhenever a creature you control but don't own dies, its owner loses 2 life and you gain 2 life.", "originalType": "Creature — Ape Snake", "power": "6", "printings": ["C19"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/56381c24eb306ffd", "cardmarket": "https://mtgjson.com/links/35e60f6e7db92781", "tcgplayer": "https://mtgjson.com/links/ff317efb2a99bfde"}, "rarity": "rare", "rulings": [{"date": "2019-08-23", "text": "Your opponents can’t look at the card they own that you manifested."}, {"date": "2019-08-23", "text": "If a creature you control but don’t own dies at the same time that your life total becomes 0 or less, you lose the game before Thieving Amalgam’s last ability can save you."}, {"date": "2019-08-23", "text": "If a creature you control but don’t own dies at the same time that its owner leaves the game, Thieving Amalgam’s last ability triggers. No player loses 2 life, but you gain 2 life."}, {"date": "2019-08-23", "text": "In the Commander variant, you can produce mana that isn’t of your commander’s color identity if an effect lets you produce mana of that color or mana of any color, even though those symbols can’t appear on cards in your deck. You may be able to turn a manifested creature card face up this way if it’s not the same colors as your commander."}, {"date": "2019-08-23", "text": "In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. If you leave the game, the creatures you manifested with Thieving Amalgam’s triggered ability are exiled."}], "securityStamp": "oval", "setCode": "C19", "subtypes": ["Ape", "Snake"], "supertypes": [], "text": "At the beginning of each opponent's upkeep, you manifest the top card of that player's library. (Put it onto the battlefield face down as a 2/2 creature. Turn it face up any time for its mana cost if it's a creature card.)\nWhenever a creature you control but don't own dies, its owner loses 2 life and you gain 2 life.", "toughness": "7", "type": "Creature — Ape Snake", "types": ["Creature"], "uuid": "125552cb-1195-587c-9718-47310d38b778"}