{"artist": "David Gaillet", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 5335, "finishes": ["nonfoil", "foil"], "flavorText": "If bribery and intimidation fail, Marchesa turns to her favorite form of bureaucracy.", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "af7889bf-f6fc-5e04-8645-b79c3761b125", "mtgoId": "63586", "scryfallId": "7f147b62-fb17-40f0-ab09-4deac8f5f1d8", "scryfallIllustrationId": "53a6d1a7-72f5-4fc1-9523-185dac7b67cc", "scryfallOracleId": "a7894a81-8c0a-4015-8bc1-2698cf5306d1"}, "isOnlineOnly": true, "isReprint": true, "isStarter": true, "keywords": ["Deathtouch"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "pauper": "Legal", "paupercommander": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}", "manaValue": 4.0, "name": "Thorn of the Black Rose", "number": "18", "power": "1", "printings": ["CMR", "CN2", "MB1", "PZ2"], "purchaseUrls": {}, "rarity": "common", "rulings": [{"date": "2016-08-23", "text": "The game starts with no monarch. Once an effect makes one player the monarch, the game will have exactly one monarch from that point forward."}, {"date": "2016-08-23", "text": "Being the monarch carries two inherent triggered abilities. “At the beginning of the monarch’s end step, that player draws a card” and “Whenever a creature deals combat damage to the monarch, its controller becomes the monarch.”"}, {"date": "2016-08-23", "text": "Abilities that trigger whenever you “become the monarch” trigger only if you aren’t already the monarch. For example, if you are already the monarch as Custodi Lich enters the battlefield, its last ability won’t trigger."}, {"date": "2016-08-23", "text": "If the triggered ability that causes the monarch to draw a card goes on the stack, and a different player becomes the monarch before that ability resolves, the first player will still draw the card."}, {"date": "2020-11-10", "text": "If combat damage dealt to the monarch causes that player to lose the game, the triggered ability that causes the controller of the attacking creature to become the monarch doesn’t resolve. In most cases, the controller of the attacking creature will still become the monarch as it is likely their turn."}, {"date": "2020-11-10", "text": "The game starts with no monarch. Once an effect makes one player the monarch, the game will have exactly one monarch from that point forward. As a player becomes the monarch, the current monarch (if any) ceases being the monarch."}, {"date": "2020-11-10", "text": "There are two inherent triggered abilities associated with being the monarch. These triggered abilities have no source and are controlled by the player who was the monarch at the time the abilities triggered. The full texts of these abilities are “At the beginning of the monarch’s end step, that player draws a card” and “Whenever a creature deals combat damage to the monarch, its controller becomes the monarch.”"}, {"date": "2020-11-10", "text": "If the triggered ability that causes the monarch to draw a card goes on the stack and a different player becomes the monarch before that ability resolves, the first player will still draw the card."}, {"date": "2020-11-10", "text": "If the monarch leaves the game during another player’s turn, that player becomes the monarch. If the monarch leaves the game during their turn, the next player in turn order becomes the monarch."}], "setCode": "PZ2", "subtypes": ["Human", "Assassin"], "supertypes": [], "text": "Deathtouch\nWhen Thorn of the Black Rose enters the battlefield, you become the monarch.", "toughness": "3", "type": "Creature — Human Assassin", "types": ["Creature"], "uuid": "c9b9555e-d22a-54da-80fa-fca5b7ecdcaa"}