{"artist": "Donato Giancola", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R", "U"], "colors": ["R", "U"], "convertedManaCost": 6.0, "edhrecRank": 1289, "finishes": ["nonfoil", "foil"], "flavorText": "Cloudy with a chance of chaos.", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "2bbd237a-d163-57d9-9896-408aeb00e989", "mtgoId": "102311", "scryfallId": "bb87fd04-91f1-401b-a91c-1f0bbbb203d9", "scryfallIllustrationId": "57a2726c-37d5-4506-a4f6-4165f4d74d2c", "scryfallOracleId": "dd4cf149-2fae-40e5-b50b-639f6bcec65e"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U}{R}", "manaValue": 6.0, "name": "Thousand-Year Storm", "number": "102311", "originalReleaseDate": "2022-07-08", "printings": ["2X2", "GRN", "PGRN", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2018-10-05", "text": "Spells you’ve cast that were countered were still cast, and so will add copies when Thousand-Year Storm’s ability resolves for later spells in the turn."}, {"date": "2018-10-05", "text": "If an effect instructs you to cast multiple spells, they’re cast one at a time in any order."}, {"date": "2018-10-05", "text": "Thousand-Year Storm’s ability will copy any instant or sorcery spell, not just one with targets."}, {"date": "2018-10-05", "text": "Copies are created even if the spell that caused Thousand-Year Storm’s ability to trigger has been countered by the time that ability resolves. The copies resolve before the original spell."}, {"date": "2018-10-05", "text": "The copies will have the same targets as the spell they’re copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. The new targets must be legal."}, {"date": "2018-10-05", "text": "If the spell that’s copied is modal (that is, it says “Choose one —” or the like), the copies will have the same mode or modes. You can’t choose different ones."}, {"date": "2018-10-05", "text": "If the spell that’s copied has an X whose value was determined as it was cast, the copies will have the same value of X."}, {"date": "2018-10-05", "text": "If the spell has damage divided as it was cast, the division can’t be changed (although the targets receiving that damage still can). The same is true of spells that distribute counters."}, {"date": "2018-10-05", "text": "You can’t choose to pay any additional costs for the copies. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too."}, {"date": "2018-10-05", "text": "The copies that Thousand-Year Storm’s ability creates are created on the stack, so they’re not “cast.” Abilities that trigger when a player casts a spell (such as that of Thousand-Year Storm itself) won’t trigger."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Whenever you cast an instant or sorcery spell, copy it for each other instant and sorcery spell you've cast before it this turn. You may choose new targets for the copies.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "a1dca2a5-6adc-5182-9bc1-3d4ea886888a"}