{"artist": "Ekaterina Burmak", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 1.0, "edhrecRank": 2430, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "1560565d-ed42-5ac9-b073-e4595261cb2c", "mtgoId": "97909", "scryfallId": "b43d2018-91c0-4ff5-a61e-1169fea4c5a9", "scryfallIllustrationId": "191e3801-5de1-409c-a90d-4261d9ed0625", "scryfallOracleId": "98636623-bbc6-4935-a2bb-2234691eb6d8"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Flying", "Ninjutsu"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{U}", "manaValue": 1.0, "name": "Thousand-Faced Shadow", "number": "97909", "originalReleaseDate": "2022-02-19", "power": "1", "printings": ["NEO", "PNEO", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2022-02-18", "text": "You choose which opponent or opposing planeswalker the token is attacking as you put it onto the battlefield. It doesn't have to be the same player or planeswalker Thousand-Faced Shadow is attacking. (Remember that the rules for ninjutsu specify that a creature that enters the battlefield attacking because of a ninjutsu ability attacks the same player or planeswalker the returned unblocked creature was.)"}, {"date": "2022-02-18", "text": "Although the token is attacking, it was never declared as an attacking creature (for purposes of abilities that trigger whenever a creature attacks, for example)."}, {"date": "2022-02-18", "text": "The token copies exactly what was printed on the original creature and nothing else (unless that permanent is copying something else or is a token; see below). It doesn't copy whether that creature has any counters on it or Auras and/or Equipment attached to it, or any non-copy effects that changed its power, toughness, types, color, and so on. Notably, it doesn't copy any effects that may have turned a noncreature permanent into a creature. If the token isn't a creature as it enters the battlefield, it won't be attacking."}, {"date": "2022-02-18", "text": "If the copied creature had {X} in its mana cost, X is 0."}, {"date": "2022-02-18", "text": "If the copied creature was copying something else, the token enters the battlefield as whatever that creature was copying."}, {"date": "2022-02-18", "text": "If the copied creature is a token, the token created by Thousand-Faced Shadow copies the original characteristics of that token as stated by the effect that put it onto the battlefield."}, {"date": "2022-02-18", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when the token enters the battlefield. Any “As [this creature] enters the battlefield” or “[This creature] enters the battlefield with” abilities of the copied creature will also work."}, {"date": "2022-02-18", "text": "The ninjutsu ability can be activated only after blockers have been declared. Before then, attacking creatures are neither blocked nor unblocked."}, {"date": "2022-02-18", "text": "As you activate a ninjutsu ability, you reveal the Ninja card in your hand and return the attacking creature. The Ninja card stays revealed and isn't put onto the battlefield until the ability resolves. If it leaves your hand before then, it won't enter the battlefield at all."}, {"date": "2022-02-18", "text": "The creature with ninjutsu enters the battlefield attacking the same player or planeswalker that the returned creature was attacking. This is a rule specific to ninjutsu; in other cases, when a creature is put onto the battlefield attacking, that creature's controller chooses which player or planeswalker it's attacking."}, {"date": "2022-02-18", "text": "Although the Ninja is attacking, it was never declared as an attacking creature (for purposes of abilities that trigger whenever a creature attacks, for example)."}, {"date": "2022-02-18", "text": "The ninjutsu ability can be activated during the declare blockers step, combat damage step, or end of combat step. In most cases (see below), if you wait until the combatdamage step or end of combat step, it will be after combat damage has been dealt, so the Ninja won't deal combat damage."}, {"date": "2022-02-18", "text": "If a creature in combat has first strike or double strike, you can activate the ninjutsu ability during the first-strike combat damage step. The Ninja will deal combat damage during the regular combat damage step, even if it has first strike."}, {"date": "2022-02-18", "text": "Puff of smoke not included."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Human", "Ninja"], "supertypes": [], "text": "Ninjutsu {2}{U}{U} ({2}{U}{U}, Return an unblocked attacker you control to hand: Put this card onto the battlefield from your hand tapped and attacking.)\nFlying\nWhen Thousand-Faced Shadow enters the battlefield from your hand, if it's attacking, create a token that's a copy of another target attacking creature. The token enters the battlefield tapped and attacking.", "toughness": "1", "type": "Creature — Human Ninja", "types": ["Creature"], "uuid": "cc8735f1-1d66-5392-a900-693c78b444c7"}