{"artist": "Glen Angus", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 5.0, "edhrecRank": 16645, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 73514, "name": "Gedankengefängnis", "text": "Einprägen Wenn das Gedankengefängnis ins Spiel kommt, kannst du einen Spieler deiner Wahl die Karten auf seiner Hand vorzeigen lassen. Falls du dies tust, bestimme eine Karte darunter, die kein Land ist, und entferne sie ganz aus dem Spiel. (Die entfernte Karte wird in dieses Artefakt eingeprägt.)\nImmer wenn ein Spieler einen Zauberspruch ausspielt, der eine Farbe oder die umgewandelten Manakosten mit der eingeprägten Karte gemeinsam hat, fügt das Gedankengefängnis diesem Spieler 2 Schadenspunkte zu.", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 162141, "name": "Prisión del pensamiento", "text": "Estampa Cuando la Prisión del pensamiento entre en juego, puedes hacer que el jugador objetivo muestre su mano. Si lo haces, elige una carta que no sea tierra de allí y remuévela del juego. (La carta removida es estampada en este artefacto.)\nSiempre que un jugador juegue un hechizo que comparta un color o el coste de maná convertido con la carta estampada, la Prisión del pensamiento hace 2 puntos de daño a ese jugador.", "type": "Artefacto"}, {"language": "French", "multiverseId": 161763, "name": "Prison cérébrale", "text": "Empreinte Quand la Prison cérébrale arrive en jeu, vous pouvez faire que le joueur ciblé révèle sa main. Si vous le faites, choisissez-y une carte autre qu'une carte de terrain et retirez cette carte de la partie. (Cet artefact a l'empreinte de la carte retirée.)\nÀ chaque fois qu'un joueur joue un sort qui partage une couleur ou un coût converti de mana avec la carte dont la Prison cérébrale a l'empreinte, la Prison cérébrale inflige 2 blessures à ce joueur.", "type": "Artefact"}, {"language": "Italian", "multiverseId": 160232, "name": "Prigione del Pensiero", "text": "Imprimere Quando la Prigione del Pensiero entra in gioco, puoi far rivelare la propria mano a un giocatore bersaglio. Se lo fai, scegli una carta non terra dalla sua mano e rimuovila dal gioco. (La carta rimossa viene impressa su questo artefatto.)\nOgniqualvolta un giocatore gioca una magia che ha almeno un colore o il costo di mana convertito in comune con la carta impressa, la Prigione del Pensiero infligge 2 danni a quel giocatore.", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 73867, "name": "思考の牢獄", "text": "刻印 ― 思考の牢獄が場に出たとき、プレイヤー１人を対象とする。あなたはそのプレイヤーの手札を公開させてもよい。 そうした場合、そこから土地でないカードを１枚選び、それをゲームから取り除く。 （取り除かれたカードは、このアーティファクトに刻印される。）\nいずれかのプレイヤーが、刻印されているカードと共通の色か点数でみたマナ・コストを持つ呪文をプレイするたび、思考の牢獄はそのプレイヤーに２点のダメージを与える。", "type": "アーティファクト"}, {"language": "Portuguese (Brazil)", "multiverseId": 162457, "name": "Prisão do Pensamento", "text": "Estampar Quando Prisão do Pensamento entra em jogo, você pode fazer com que o jogador alvo revele sua própria mão. Se o fizer, escolha um card dela que não seja um terreno e remova aquele card do jogo. (O card removido fica estampado neste artefato.)\nToda vez que um jogador jogar uma mágica que compartilha uma cor ou o custo de mana convertido com o card estampado, Prisão do Pensamento causa 2 pontos de dano àquele jogador.", "type": "Artefato"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "73260", "cardKingdomId": "72260", "cardsphereId": "30999", "mcmId": "261", "mcmMetaId": "5957", "mtgjsonV4Id": "f1b6b89b-e5b3-52c3-8634-3954c32ef521", "mtgoFoilId": "20172", "mtgoId": "20171", "multiverseId": "48915", "scryfallId": "409087ef-8232-489c-8b98-b601bb0a47a4", "scryfallIllustrationId": "15251967-a701-4b75-b96d-bde7c2783fb8", "scryfallOracleId": "da1ea03f-747f-46c9-8ff5-7e85996df804", "tcgplayerProductId": "11569"}, "keywords": ["Imprint"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{5}", "manaValue": 5.0, "name": "Thought Prison", "number": "261", "originalText": "Imprint When Thought Prison comes into play, you may have target player reveal his or her hand. If you do, choose a nonland card from it and remove that card from the game. (The removed card is imprinted on this artifact.)\nWhenever a player plays a spell that shares a color or converted mana cost with the imprinted card, Thought Prison deals 2 damage to that player.", "originalType": "Artifact", "printings": ["MRD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/8f6afce5b6defe4e", "cardKingdomFoil": "https://mtgjson.com/links/74ebdea2409cc81c", "cardmarket": "https://mtgjson.com/links/195d19ff0752ad80", "tcgplayer": "https://mtgjson.com/links/58b9981b0c2ac7f4"}, "rarity": "uncommon", "rulings": [{"date": "2004-12-01", "text": "The second ability triggers only once per spell. If the spell shares both a color and a converted mana cost with the imprinted card, Thought Prison deals 2 damage, not 4."}], "setCode": "MRD", "subtypes": [], "supertypes": [], "text": "Imprint — When Thought Prison enters the battlefield, you may have target player reveal their hand. If you do, choose a nonland card from it and exile that card.\nWhenever a player casts a spell that shares a color or mana value with the exiled card, Thought Prison deals 2 damage to that player.", "type": "Artifact", "types": ["Artifact"], "uuid": "09c84d88-0429-554b-aa62-c00725bae836"}