{"artist": "Randy Vargas", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 12.0, "edhrecRank": 4890, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "df420e89-b040-5756-bc32-9aee0bf585fe", "mtgoId": "91299", "scryfallId": "ad5d273e-294f-4ed5-8943-6ba0c8633756", "scryfallIllustrationId": "6f00dd2d-71cc-44f0-a714-e34bc12c8c08", "scryfallOracleId": "19d258fb-4cda-4cbb-b07a-8b4670488867"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Haste", "Trample"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{10}{G}{G}", "manaValue": 12.0, "name": "Thrasta, Tempest's Roar", "number": "91299", "originalReleaseDate": "2021-06-18", "power": "7", "printings": ["MH2", "PMH2", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-06-18", "text": "Trample over planeswalkers means that when Thrasta, Tempest's Roar deals combat damage to a planeswalker it's attacking, it can assign any amount of excess damage to that planeswalker's controller. Excess damage to a planeswalker is damage greater than the number of loyalty counters that planeswalker has. Deathtouch does not cause damage dealt to a planeswalker to be lethal."}, {"date": "2021-06-18", "text": "Trample over planeswalkers takes into account any other damage being assigned to the planeswalker at the same time. For example, if Thrasta and a 2/2 Bear Cub are attacking a planeswalker with seven loyalty counters on it (and are unblocked), Thrasta can assign 5 damage to the defending planeswalker and 2 damage to the defending player."}, {"date": "2021-06-18", "text": "Trample and trample over planeswalkers can both apply during the same combat. For example, if Thrasta is attacking a planeswalker with two loyalty counters on it and is blocked by a 3/3 creature, you could have Thrasta assign 3 combat damage to the blocking creature, 2 combat damage to the planeswalker, and 2 combat damage to the defending player."}, {"date": "2021-06-18", "text": "If a planeswalker that is being attacked by Thrasta is somehow also a creature, Thrasta still deals excess damage based on that planeswalker's loyalty, not its toughness."}, {"date": "2021-06-18", "text": "In some rare, strange cases, a planeswalker that is also a creature may block Thrasta while Thrasta is attacking that same planeswalker. (I did say strange.) Assuming no other creatures are blocking Thrasta and the blocking creature has no damage marked on it, Thrasta's controller must assign at least as much damage to that creature planeswalker equal to its toughness or the number of loyalty counters it has, whichever is greater."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Dinosaur"], "supertypes": ["Legendary"], "text": "This spell costs {3} less to cast for each other spell cast this turn.\nTrample, haste\nTrample over planeswalkers (This creature can deal excess combat damage to the controller of the planeswalker it's attacking.)\nThrasta, Tempest's Roar has hexproof as long as it entered the battlefield this turn.", "toughness": "7", "type": "Legendary Creature — Dinosaur", "types": ["Creature"], "uuid": "f8d88d55-ab38-5d30-bac0-bc5cc0a6c486"}