{"artist": "Sam Stoddard", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "250134", "cardsphereId": "83049", "mcmId": "415254", "mtgjsonV4Id": "aebe7381-62e2-50f1-9be1-d52273b7f09d", "scryfallId": "144280de-1493-41e5-a537-83339c1ae26e", "scryfallIllustrationId": "6a2772a1-b532-4014-8e20-7085ee2a7c4b", "scryfallOracleId": "ec6bb300-f43f-4b29-a596-671338afaa2c", "tcgplayerProductId": "246991"}, "isFunny": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {}, "manaCost": "{1}{R}{R}", "manaValue": 3.0, "name": "Throat Wolf", "number": "65", "power": "3", "printings": ["CMB1", "CMB2"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/9dbf82a7a65e8028", "tcgplayer": "https://mtgjson.com/links/8fa19ae86d502f31"}, "rarity": "rare", "rulings": [{"date": "2019-11-12", "text": "“Summon” isn’t a card type. Throat Wolf is a creature."}, {"date": "2019-11-12", "text": "As the declare blockers step ends, if any creatures have firstest strike, there’s an additional combat step where only those creatures deal damage. The game waits until after this step to determine whether there will be a first-strike combat damage step."}, {"date": "2019-11-12", "text": "If a creature with firstest strike enters the battlefield during the firstest-strike combat damage step or the first-strike combat damage step, it deals regular combat damage instead."}, {"date": "2019-11-12", "text": "If a creature with firstest strike gains first strike, it deals damage during the first strike and firstest strike combat damage steps. If it gains double strike, it deals damage during all three combat damage steps."}, {"date": "2019-11-12", "text": "Throat Wolf’s last ability reads like it’s pointless. Only Throat Wolf can attack, but it can’t attack, so nothing can attack. Rather than assume the text is pointless, this ability should be played as though it read “After each opponent’s first combat phase on each turn, you have a combat phase. Only Throat Wolf can attack during that combat phase.”"}, {"date": "2019-11-12", "text": "While it’s your combat phase during your opponent’s turn, you’re the active player and the attacking player. However, any rules or effects that check whose turn it is will still know that it’s your opponent’s turn."}, {"date": "2019-11-12", "text": "If two players each control Throat Wolf, player A’s first combat phase will be followed by player B’s first combat phase from B’s Throat Wolf, which will be followed by player A’s second combat from A’s Throat Wolf. On player C’s turn (where C is the active player and player A is the next player in turn order) player C’s combat phase is followed by player A’s combat phase, then player B’s combat phase following player A’s, then player A’s following player B’s, then player B’s that follows player C’s finally happens."}], "setCode": "CMB2", "subtypes": [], "supertypes": [], "text": "You may cast Throat Wolf during an opponent's combat phase.\nFirstest strike (This creature deals combat damage to creatures before creatures with first strike.)\nAfter each opponent's first combat phase of each turn, there is an additional combat phase. Only Throat Wolf can attack during that combat phase.", "toughness": "1", "type": "Summon Wolf", "types": ["Summon", "Wolf"], "uuid": "d3b1ebc5-f51b-56cb-beb6-62eb08e7e584"}