{"artist": "Dave Kendall", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 3.0, "edhrecRank": 21785, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 140569, "name": "Tidenwanderer", "text": "Der Tidenwanderer kommt mit einer Zeitmarke für jede Insel, die du kontrollierst, ins Spiel.\nVerschwinden (Entferne zu Beginn deines Versorgungssegments eine Zeitmarke von dieser bleibenden Karte. Wenn die letzte Zeitmarke entfernt wird, opfere die bleibende Karte.)\nStärke und Widerstandskraft des Tidenwanderers sind gleich der Anzahl an Zeitmarken auf ihm.", "type": "Kreatur — Elementarwesen"}, {"language": "Spanish", "multiverseId": 141289, "name": "Caminante de la marea", "text": "El Caminante de la marea entra en juego con un contador de tiempo sobre él por cada isla que controlas.\nDesmaterializarse (Al comienzo de tu mantenimiento, remueve un contador de tiempo de este permanente. Cuando sea removido el último, sacrifícalo.)\nTanto la fuerza como la resistencia del Caminante de la marea son iguales al número de contadores de tiempo sobre él.", "type": "Criatura — Elemental"}, {"language": "French", "multiverseId": 140449, "name": "Marcheur des marées", "text": "Le Marcheur des marées arrive en jeu avec, sur lui, un marqueur « temps » pour chaque île que vous contrôlez.\nDisparition (Au début de votre entretien, retirez un marqueur « temps » de ce permanent. Quand le dernier marqueur est retiré, sacrifiez le permanent.)\nLa force et l'endurance du Marcheur des marées sont chacune égale au nombre de marqueurs « temps » sur lui.", "type": "Créature : élémental"}, {"language": "Italian", "multiverseId": 140689, "name": "Viandante delle Maree", "text": "Il Viandante delle Maree entra in gioco con un segnalino tempo su di esso per ogni Isola che controlli.\nEvanescenza (All'inizio del tuo mantenimento, rimuovi un segnalino tempo da questo permanente. Quando l'ultimo viene rimosso, sacrificalo.)\nLa forza e la costituzione del Viandante delle Maree sono pari al numero di segnalini tempo su di esso.", "type": "Creatura — Elementale"}, {"language": "Japanese", "multiverseId": 140929, "name": "潮歩き", "text": "潮歩きは、あなたがコントロールする島の総数に等しい数の時間カウンターが置かれた状態で場に出る。\n消失 （あなたのアップキープの開始時に、このパーマネントの上から時間カウンターを１個取り除く。 最後の１個が取り除かれたとき、それを生け贄に捧げる。）\n潮歩きのパワーとタフネスは、それぞれそれの上に置かれている時間カウンターの数に等しい。", "type": "クリーチャー — エレメンタル"}, {"language": "Portuguese (Brazil)", "multiverseId": 141049, "name": "Marondulante", "text": "Marondulante entra em jogo com um marcador temporal sobre ele para cada Ilha que você controla.\nSumiço (No início de sua manutenção, remova um marcador temporal desta permanente. Quando o último for removido, sacrifique-a.)\nO poder e a resistência de Marondulante são ambos iguais ao número de marcadores temporais sobre ele.", "type": "Criatura — Elemental"}, {"language": "Russian", "multiverseId": 141169, "name": "Приливник", "text": "Приливник входит в игру с одним временным жетоном на нем за каждый Остров под вашим контролем\nИсчезновение (В начале вашего шага поддержки удалите временной жетон с этого перманента. Когда удаляется последний, пожертвуйте его.)\nСила и защита Приливника равны количеству жетонов времени на нем.", "type": "Существо — Элементаль"}, {"language": "Chinese Simplified", "multiverseId": 141409, "name": "涌潮妖", "text": "你每操控一个海岛，涌潮妖进场时其上便有一个计时指示物。\n消逝（在你的维持开始时，从其上移去一个计时指示物。 当移去最后一个时，将它牺牲。）\n涌潮妖的力量与防御力各等同于其上计时指示物的数量", "type": "生物～元素"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "122139", "cardKingdomId": "121965", "cardsphereId": "35435", "mcmId": "14228", "mcmMetaId": "8635", "mtgjsonV4Id": "3fd34594-c960-5fda-b2c3-ba7c647155e0", "mtgoFoilId": "26472", "mtgoId": "26471", "multiverseId": "130814", "scryfallId": "9464c2aa-8f12-4654-89c5-3323d7e7ab73", "scryfallIllustrationId": "7c341478-a6f0-49e3-a394-6c4000b9d9ae", "scryfallOracleId": "3cc857b4-3cc7-44d5-9c51-ef819d1289c6", "tcgplayerProductId": "14823"}, "keywords": ["Vanishing"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}", "manaValue": 3.0, "name": "Tidewalker", "number": "49", "originalText": "Tidewalker comes into play with a time counter on it for each Island you control.\nVanishing (At the beginning of your upkeep, remove a time counter from this permanent. When the last is removed, sacrifice it.)\nTidewalker's power and toughness are each equal to the number of time counters on it.", "originalType": "Creature - Elemental", "power": "*", "printings": ["PLC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/74a21dffa6dd0760", "cardKingdomFoil": "https://mtgjson.com/links/01e8691d1e28dd6b", "cardmarket": "https://mtgjson.com/links/677834f9a7cc36ec", "tcgplayer": "https://mtgjson.com/links/8f7ce46a831ada21"}, "rarity": "uncommon", "rulings": [{"date": "2007-02-01", "text": "Unless something is boosting Tidewalker’s toughness, when the last time counter is removed, it will be put into the graveyard as a state-based action for having 0 toughness before it can be sacrificed as the result of vanishing."}, {"date": "2007-02-01", "text": "If you don’t control any Islands when Tidewalker enters the battlefield, its vanishing ability has no effect. (It enters the battlefield with no time counters on it, so neither of the vanishing triggers can trigger. See “Vanishing” in the General Notes section above.) On the other hand, it will be 0/0 and will be put into its owner’s graveyard unless something is boosting its toughness."}], "setCode": "PLC", "subtypes": ["Elemental"], "supertypes": [], "text": "Tidewalker enters the battlefield with a time counter on it for each Island you control.\nVanishing (At the beginning of your upkeep, remove a time counter from this creature. When the last is removed, sacrifice it.)\nTidewalker's power and toughness are each equal to the number of time counters on it.", "toughness": "*", "type": "Creature — Elemental", "types": ["Creature"], "uuid": "2c1b4254-3648-522f-b1dc-e76504c6c23e"}