{"artist": "Dany Orizio", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 5.0, "edhrecRank": 9105, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 73516, "name": "Zeitsieb", "text": "Zu Beginn des Versorgungssegments jedes Spielers entfernt jeder Spieler die oberste Karte seiner Bibliothek ganz aus dem Spiel. Der Spieler, der die Karte mit den höchsten umgewandelten Manakosten entfernt hat, erhält nach diesem Zug einen zusätzlichen Zug. Haben die Karten von zwei oder mehr Spielern einen Gleichstand für die höchsten Kosten, wiederholen diese Spieler den Prozess, bis kein Gleichstand mehr herrscht.", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 162142, "name": "Tamizatiempo", "text": "Al comienzo del mantenimiento de cada jugador, cada jugador remueve del juego la carta de la parte superior de su biblioteca. El jugador que haya removido la carta con el mayor coste de maná convertido tiene un turno adicional después de este. Si las cartas de dos o más jugadores están empatadas por el mayor coste, esos jugadores repiten este proceso hasta el desempate.", "type": "Artefacto"}, {"language": "French", "multiverseId": 161764, "name": "Tamiseur de temps", "text": "Au début de l'entretien de chaque joueur, ce joueur retire de la partie la première carte de sa bibliothèque. Le joueur qui a retiré la carte ayant le coût converti de mana le plus élevé joue un tour supplémentaire après celui-ci. Si au moins deux joueurs partagent le coût le plus élevé, ces joueurs répètent la même opération jusqu'à ce qu'il y ait un gagnant.", "type": "Artefact"}, {"language": "Italian", "multiverseId": 160233, "name": "Setacciatempo", "text": "All'inizio del mantenimento di ogni giocatore, ogni giocatore rimuove dal gioco la prima carta del proprio grimorio. Il giocatore che ha rimosso la carta con il costo di mana convertito più alto gioca un turno addizionale dopo questo. Se due o più giocatori hanno rimosso la carta con il costo più alto, i giocatori in parità ripetono il processo fino a quando la parità si interrompe.", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 73869, "name": "時間ふるい", "text": "各プレイヤーのアップキープの開始時に、各プレイヤーは自分のライブラリーの一番上のカードをゲームから取り除く。 それらの内、点数でみたマナ・コストが最も高いカードを取り除いたプレイヤーは、このターンの後に追加のターンを得る。 点数でみたマナ・コストが最も高いプレイヤーが複数いる場合、それらのプレイヤーだけでこの手順を繰り返し、１人のプレイヤーを決める。", "type": "アーティファクト"}, {"language": "Portuguese (Brazil)", "multiverseId": 162458, "name": "Crivo do Tempo", "text": "No início da manutenção de cada jogador, cada jogador remove de jogo o card do topo de seu próprio grimório. O jogador que remover o card com o maior custo de mana convertido joga um turno extra após este turno. Se houver empate entre os cards de dois ou mais jogadores quanto ao maior custo, os jogadores empatados repetem esse processo até que seja desfeito o empate.", "type": "Artefato"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "73261", "cardKingdomId": "72261", "cardsphereId": "31003", "mcmId": "262", "mcmMetaId": "6029", "mtgjsonV4Id": "9496865e-1b2c-5017-8324-6d6b5b88c7c8", "mtgoFoilId": "20194", "mtgoId": "20193", "multiverseId": "49053", "scryfallId": "561cab0e-8874-4534-bf79-0c1488a9f0a5", "scryfallIllustrationId": "3af5e59f-b84a-4cbc-88f0-29a11f0093d1", "scryfallOracleId": "99f8805f-6618-4838-a4e7-a3660e3b087f", "tcgplayerProductId": "11570"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{5}", "manaValue": 5.0, "name": "Timesifter", "number": "262", "originalText": "At the beginning of each player's upkeep, each player removes the top card of his or her library from the game. The player who removed the card with the highest converted mana cost takes an extra turn after this one. If two or more players' cards are tied for highest cost, the tied players repeat this process until the tie is broken.", "originalType": "Artifact", "printings": ["MRD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/0aa34a8b9cc771d7", "cardKingdomFoil": "https://mtgjson.com/links/700530240424d72b", "cardmarket": "https://mtgjson.com/links/81fa53a34b7ec440", "tcgplayer": "https://mtgjson.com/links/9c838406863dbba4"}, "rarity": "rare", "rulings": [{"date": "2004-12-01", "text": "Each time there’s a tie for the highest cost, only the players involved in the tie continue."}, {"date": "2004-12-01", "text": "If a player fails to exile a card, they can’t take the extra turn."}, {"date": "2004-12-01", "text": "If multiple extra turns are created in a game, the most recently created extra turn is taken first."}, {"date": "2004-12-01", "text": "Each player must exile the top card of their library at the start of each upkeep step."}, {"date": "2004-12-01", "text": "If two or more Timesifters are on the battlefield, keep a careful record of which players get which extra turns. With two Timesifters on the battlefield, two extra turns are created for each turn taken."}, {"date": "2004-12-01", "text": "A land card has a converted mana cost of 0."}, {"date": "2004-12-01", "text": "Remember which player would have taken the next turn if Timesifter’s ability hadn’t triggered the first time. After Timesifter leaves the battlefield and all extra turns have been taken, that player takes the next turn."}, {"date": "2006-05-01", "text": "In Two-Headed Giant, triggers only once per upkeep, not once for each player."}], "setCode": "MRD", "subtypes": [], "supertypes": [], "text": "At the beginning of each upkeep, each player exiles the top card of their library. The player who exiled the card with the highest mana value takes an extra turn after this one. If two or more players' cards are tied for highest, the tied players repeat this process until the tie is broken.", "type": "Artifact", "types": ["Artifact"], "uuid": "db9deb44-c440-57e6-bda6-f40703792553"}