{"artist": "Franz Vohwinkel", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 8727, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "247405", "cardsphereId": "78555", "mcmId": "568860", "mcmMetaId": "239495", "mtgjsonV4Id": "dcb45bda-f4a9-564d-be9e-dc24a17fff72", "scryfallId": "dd6124aa-b1cd-4391-8c18-503b50f8452a", "scryfallIllustrationId": "391347b5-49a7-4aee-9417-96c779d819d4", "scryfallOracleId": "93e0fd89-8a0d-4d97-aa22-aafe83d53515", "tcgplayerProductId": "240881"}, "isReprint": true, "language": "English", "layout": "saga", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Time of Ice", "number": "419", "originalReleaseDate": "2021-06-19", "printings": ["DOM", "PLIST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/9102f5ca23517d64", "cardmarket": "https://mtgjson.com/links/93b988cf3f40877f", "tcgplayer": "https://mtgjson.com/links/e023449fcfdbc811"}, "rarity": "uncommon", "rulings": [{"date": "2018-04-27", "text": "The effects of Time of Ice’s first two chapter abilities expire if you lose control of it, even if you immediately regain control of it or cast another Time of Ice."}, {"date": "2018-04-27", "text": "The effect of Time of Ice’s final chapter ability returns creatures that are tapped for any reason, not just those tapped by Time of Ice."}, {"date": "2018-04-27", "text": "As a Saga enters the battlefield, its controller puts a lore counter on it. As your precombat main phase begins (immediately after your draw step), you put another lore counter on each Saga you control. Putting a lore counter on a Saga in either of these ways doesn’t use the stack."}, {"date": "2018-04-27", "text": "Each symbol on the left of a Saga’s text box represents a chapter ability. A chapter ability is a triggered ability that triggers when a lore counter that is put on the Saga causes the number of lore counters on the Saga to become equal to or greater than the ability’s chapter number. Chapter abilities are put onto the stack and may be responded to."}, {"date": "2018-04-27", "text": "A chapter ability doesn’t trigger if a lore counter is put on a Saga that already had a number of lore counters greater than or equal to that chapter’s number. For example, the third lore counter put on a Saga causes the III chapter ability to trigger, but I and II won’t trigger again."}, {"date": "2018-04-27", "text": "Once a chapter ability has triggered, the ability on the stack won’t be affected if the Saga gains or loses counters, or if it leaves the battlefield."}, {"date": "2018-04-27", "text": "If multiple chapter abilities trigger at the same time, their controller puts them on the stack in any order. If any of them require targets, those targets are chosen as you put the abilities on the stack, before any of those abilities resolve."}, {"date": "2018-04-27", "text": "If counters are removed from a Saga, the appropriate chapter abilities will trigger again when the Saga receives lore counters. Removing lore counters won’t cause a previous chapter ability to trigger."}, {"date": "2018-04-27", "text": "Once the number of lore counters on a Saga is greater than or equal to the greatest number among its chapter abilities—in the Dominaria set, this is always three—the Saga’s controller sacrifices it as soon as its chapter ability has left the stack, most likely by resolving or being countered. This state-based action doesn’t use the stack."}], "setCode": "PLIST", "subtypes": ["Saga"], "supertypes": [], "text": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI, II — Tap target creature an opponent controls. It doesn't untap during its controller's untap step for as long as you control Time of Ice.\nIII — Return all tapped creatures to their owners' hands.", "type": "Enchantment — Saga", "types": ["Enchantment"], "uuid": "0c4d0a78-a5cb-5b93-b979-3aa497840fb1"}