{"artist": "Anastasia Ovchinnikova", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 5.0, "edhrecRank": 6003, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "41451886-ce40-503a-9b66-5062d2fbd7bb", "mtgoId": "91215", "scryfallId": "099ebc1f-ac74-4821-8660-c1e6322837a2", "scryfallIllustrationId": "28b7a35d-ef44-4270-ad17-3c3ae584512b", "scryfallOracleId": "a5ae93e9-0385-47fd-9d8f-306e9a6b7fe6"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Eternalize", "Flying", "Plainscycling"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}{W}", "manaValue": 5.0, "name": "Timeless Dragon", "number": "91215", "originalReleaseDate": "2021-06-19", "power": "5", "printings": ["MH2", "PMH2", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-06-18", "text": "If a creature card with eternalize is put into your graveyard during your main phase, you'll have priority immediately afterward. You can activate its eternalize ability before any player can try to exile it, if it's legal for you to do so."}, {"date": "2021-06-18", "text": "Once you've activated an eternalize ability, the card is immediately exiled. Opponents can't try to stop the ability by exiling the card."}, {"date": "2021-06-18", "text": "The token copies exactly what was printed on the original card and nothing else, except the characteristics specifically modified by eternalize. It doesn't copy any information about the object the card was before it was put into your graveyard."}, {"date": "2021-06-18", "text": "The token is a Zombie in addition to its other types and is black instead of its other colors. Its base power and toughness are 4/4. It has no mana cost, and thus its mana value is 0. These are copiable values of the token that other effects may copy."}, {"date": "2021-06-18", "text": "Unlike the normal cycling ability, typecycling doesn't allow you to draw a card. Rather, it lets you search your library for a card with the type or types indicated by the ability name. For example, a card with basic landcycling lets you search for a basic land card, and a card with Wizardcycling lets you search for a Wizard card."}, {"date": "2021-06-18", "text": "Typecycling is a form of cycling. Any ability that triggers on a card being cycled also triggers on a card being typecycled. Any ability that stops a cycling ability from being activated also stops a typecycling ability from being activated."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Dragon"], "supertypes": [], "text": "Flying\nPlainscycling {2} ({2}, Discard this card: Search your library for a Plains card, reveal it, put it into your hand, then shuffle.)\nEternalize {2}{W}{W} ({2}{W}{W}, Exile this card from your graveyard: Create a token that's a copy of it, except it's a 4/4 black Zombie Dragon with no mana cost. Eternalize only as a sorcery.)", "toughness": "5", "type": "Creature — Dragon", "types": ["Creature"], "uuid": "ca25ec14-e569-5808-8610-13b5daa49258"}