{"artist": "Scott M. Fischer", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 6.0, "edhrecRank": 8490, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 86076, "name": "Zeitstopp", "text": "Beende den Zug. (Entferne alle Zauber und Fähigkeiten auf dem Stapel ganz aus dem Spiel, einschließlich dieser Karte. Der Spieler, dessen Zug es ist, wirft Karten ab, bis er nicht mehr Karten, als sein Handkartenlimit angibt, auf der Hand hat. Schaden wird abgetragen, und „in diesem Zug\"- und „bis zum Ende des Zuges\"-Effekte enden.)", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 87304, "name": "Detener el tiempo", "text": "Finaliza el turno. (Remueve del juego todos los hechizos y habilidades en la pila, incluyendo esta carta. El jugador que tiene el turno descarta hasta su tamaño máximo de mano. El daño desaparece y terminan los efectos \"hasta el final del turno\" y \"este turno\".)", "type": "Instantáneo"}, {"language": "French", "multiverseId": 85769, "name": "Arrêt du temps", "text": "Terminez le tour. (Retirez de la partie tous les sorts et capacités sur la pile, y compris cette carte. Le joueur dont c'est le tour se défausse de ses cartes jusqu'à sa taille de main maximale. Les blessures disparaissent et les effets « ce tour » et « jusqu'à la fin du tour » se terminent.)", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 86383, "name": "Blocco Temporale", "text": "Fine del turno. (Rimuovi dal gioco tutte le magie e le abilità presenti nella pila, inclusa questa carta. Il giocatore il cui turno è in corso scarta fino ad avere in mano il massimo di carte consentito. Il danno svanisce e gli effetti \"in questo turno\" e \"fino alla fine del turno\" hanno termine.)", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 86690, "name": "時間停止", "text": "ターンを終了する。（このカードも含め、スタック上のすべての呪文と能力をゲームから取り除く。現在ターンを行っているプレイヤーは、手札の最大枚数を超える分のカードを捨てる。ダメージは取り除かれ、「このターン」と「ターン終了時まで」の効果は終了する。）", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 86997, "name": "Parar o Tempo", "text": "Termina o turno. (Remova de jogo todas as mágicas e habilidades que estiverem na pilha, inclusive este card. O jogador controlador do turno descarta cards até atingir o número máximo de cards permitido na mão. O dano desaparece e os efeitos que ocorrem \"neste turno\" e \"até o final do turno\" cessam.)", "type": "Mágica Instantânea"}, {"language": "Chinese Simplified", "multiverseId": 85462, "name": "时间停止", "text": "结束本回合。（将堆叠中的所有咒语与异能移出对战，且包括这张牌。轮到此回合的牌手将手牌维持在其手牌上限，弃掉多余的牌。生物上的伤害消失，并且注记着「本回合」与「直到回合结束」的效应均结束。）", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "112324", "cardKingdomId": "112025", "cardsphereId": "8321", "mcmId": "12224", "mcmMetaId": "7189", "mtgjsonV4Id": "deb704e1-0e41-5812-aff7-6ae381c3dff2", "mtgoFoilId": "21192", "mtgoId": "21191", "multiverseId": "78184", "scryfallId": "f968c5e9-12a8-4542-90b4-84e0238fa375", "scryfallIllustrationId": "4e7bb8df-ec20-4829-8b1a-b24f51aa6c91", "scryfallOracleId": "55bc6a7e-2356-48f0-a93a-8bf19044ee4b", "tcgplayerProductId": "12205"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U}{U}", "manaValue": 6.0, "name": "Time Stop", "number": "97", "originalText": "End the turn. (Remove all spells and abilities on the stack from the game, including this card. The player whose turn it is discards down to his or her maximum hand size. Damage wears off, and \"this turn\" and \"until end of turn\" effects end.)", "originalType": "Instant", "printings": ["10E", "CHK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/947681e06937e22b", "cardKingdomFoil": "https://mtgjson.com/links/20985e246eaf2f12", "cardmarket": "https://mtgjson.com/links/d88134de1a81a8d3", "tcgplayer": "https://mtgjson.com/links/e2966b8cd1eb6619"}, "rarity": "rare", "rulings": [{"date": "2004-12-01", "text": "Exiling a spell or ability prevents that spell or ability from resolving, but it doesn’t technically “counter” anything. This means that Time Stop can exile spells and abilities that “can’t be countered.”"}, {"date": "2004-12-01", "text": "Unless Time Stop is cast during the Ending phase, any “at the beginning of the end step”-triggered abilities don’t get the chance to trigger on the turn Time Stop is cast. These abilities will trigger at the beginning of the next end step."}, {"date": "2007-07-15", "text": "Ending the turn this way means the following things happen in order: 1) All spells and abilities on the stack are exiled. This includes Time Stop, though it will continue to resolve. It also includes spells and abilities that can’t be countered. 2) All attacking and blocking creatures are removed from combat. 3) State-based actions are checked. No player gets priority, and no triggered abilities are put onto the stack. 4) The current phase and/or step ends. The game skips straight to the cleanup step. The cleanup step happens in its entirety."}, {"date": "2007-07-15", "text": "If any triggered abilities do trigger during this process, they’re put onto the stack during the cleanup step. If this happens, players will have a chance to cast spells and activate abilities, then there will be another cleanup step before the turn finally ends."}], "setCode": "CHK", "subtypes": [], "supertypes": [], "text": "End the turn. (Exile all spells and abilities from the stack, including this card. The player whose turn it is discards down to their maximum hand size. Damage wears off, and \"this turn\" and \"until end of turn\" effects end.)", "type": "Instant", "types": ["Instant"], "uuid": "03dd60b2-6186-5415-a1b5-334888d91b5b"}