{"artist": "Irina Nordsol", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 6.0, "edhrecRank": 5979, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "262365", "cardsphereId": "88289", "mcmId": "662154", "mtgjsonV4Id": "4cd1be4c-5f2d-5a5e-80c8-416e466482fb", "scryfallId": "6f9de8d1-03f9-491b-8871-d297a0543de9", "scryfallIllustrationId": "6d401393-8df1-4a1c-8536-58d5a5f00dcd", "scryfallOracleId": "4f429b99-6aca-409f-9d2e-5743d81f1f22", "tcgplayerProductId": "274462"}, "isPromo": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{5}{U}", "manaValue": 6.0, "name": "Tomb of Horrors Adventurer", "number": "100s", "power": "4", "printings": ["CLB", "PCLB"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/4d84bb119154fd48", "tcgplayer": "https://mtgjson.com/links/3e57a265a31ae68e"}, "rarity": "rare", "rulings": [{"date": "2022-06-10", "text": "When the triggered ability of Tomb of Horrors Adventurer resolves, it creates one or two copies of a spell. You control each of the copies. Those copies are created on the stack, so they're not “cast.” Abilities that trigger when a player casts a spell won't trigger. The copies will then resolve like normal spells, after players get a chance to cast spells and activate abilities."}, {"date": "2022-06-10", "text": "The triggered ability will copy the spell that caused it to trigger even if that spell has been countered by the time that ability resolves."}, {"date": "2022-06-10", "text": "Each of the copies will have the same targets as the spell it's copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can't choose a new legal target, then it remains unchanged (even if the current target is illegal). If there are multiple copies, you may change the targets of each of them to different legal targets."}, {"date": "2022-06-10", "text": "If the spell Tomb of Horrors Adventurer's ability copies is modal (that is, it has a bulleted list of choices), the copies will have the same mode(s). You can't choose different ones."}, {"date": "2022-06-10", "text": "If the spell Tomb of Horrors Adventurer copies has an X whose value was determined as it was cast (like Fireball does), the copy has the same value of X."}, {"date": "2022-06-10", "text": "You can't choose to pay any additional costs for the copies. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copies too. For example, if you sacrifice a 3/3 creature to cast Fling and then copy it with Tomb of Horrors Adventurer, each copy of Fling will also deal 3 damage to its target."}, {"date": "2022-06-10", "text": "A resolving copy of a permanent spell becomes a token, so the token isn't “created.” Effects that care about a token being created won't interact with a token that enters the battlefield because the triggered ability copied a permanent spell."}, {"date": "2022-06-10", "text": "The initiative is a designation a player can have. A player with the initiative designation is said to “have the initiative.” The initiative carries two inherent rules. First, whenever a player takes the initiative, and at the beginning of the upkeep of the player with the initiative, that player ventures into Undercity. Second, whenever one or more creatures a player controls deal combat damage to the player who has the initiative, the first player takes the initiative. Also, some abilities will refer to having the initiative and provide other benefits."}, {"date": "2022-06-10", "text": "There is no initiative in a game until an effect instructs a player to take the initiative. Once a player is instructed to do this, they have the initiative until another player takes the initiative."}, {"date": "2022-06-10", "text": "Only one player can have the initiative at a time. As one player takes the initiative, any other player that had the initiative ceases to have it."}, {"date": "2022-06-10", "text": "A player who currently has the initiative may take the initiative again. This causes that player to venture into Undercity again, but does not cause them to have multiple initiative designations."}, {"date": "2022-06-10", "text": "If the player with the initiative leaves the game, the active player takes the initiative at the same time that player leaves the game. If the active player is leaving the game or if there is no active player, the next player in turn order takes the initiative."}, {"date": "2022-06-10", "text": "In a Two-Headed Giant game, if both players on a team deal combat damage to the player that has the initiative at the same time, the player with the initiative will choose the order of the triggered abilities. Then, as those abilities resolve, one team member takes the initiative (and ventures into Undercity) and then the other team member does the same. The last player to take the initiative keeps it until the initiative changes again."}, {"date": "2022-06-10", "text": "You cannot venture into Undercity unless instructed to do so, either because you have the initiative at the beginning of your upkeep or because you take the initiative. Notably, if you aren’t in a dungeon and an effect instructs you to venture into the dungeon (not venture into Undercity), you can’t start Undercity."}, {"date": "2022-06-10", "text": "Similarly, when instructed to venture into Undercity, you can’t start a dungeon that isn’t Undercity."}, {"date": "2022-06-10", "text": "If you aren’t in a dungeon when instructed to venture into Undercity, you will put Undercity into the command zone and move your venture marker to Secret Entrance (the first room)."}, {"date": "2022-06-10", "text": "If you’re already in a dungeon when instructed to venture into Undercity, you move to the next room of that dungeon. If you are already in the last room, you will complete that dungeon and start Undercity. This is true whether you’re already in Undercity or any other dungeon."}], "securityStamp": "oval", "setCode": "PCLB", "subtypes": ["Elf", "Monk"], "supertypes": [], "text": "When Tomb of Horrors Adventurer enters the battlefield, you take the initiative.\nWhenever you cast your second spell each turn, copy it. If you've completed a dungeon, copy that spell twice instead. You may choose new targets for the copies. (A copy of a permanent spell becomes a token.)", "toughness": "4", "type": "Creature — Elf Monk", "types": ["Creature"], "uuid": "3b8e4a4d-9d54-5fed-868b-b62141c1462d"}