{"artist": "Matt Stikker", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 2384, "faceName": "Toralf's Hammer", "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "53987527-752e-56b1-9c9b-23e4481f7ca9", "mtgoId": "88302", "scryfallId": "e71fdafd-7548-4be6-a6a6-146c4d4ca0b3", "scryfallIllustrationId": "413c2c27-2c15-48b3-b8be-8957af30cfb0", "scryfallOracleId": "fffcb71f-e802-436e-917d-eaa6607ab74f"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Equip"], "language": "English", "layout": "modal_dfc", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}", "manaValue": 2.0, "name": "Toralf, God of Fury // Toralf's Hammer", "number": "88302", "originalReleaseDate": "2021-02-28", "otherFaceIds": ["1b0a3f0d-41a8-5843-97fc-ca3478aefa4c"], "printings": ["KHM", "PKHM", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2021-02-05", "text": "There is a single triangle icon in the top left corner of the front face. There is a double triangle icon in the top left corner of the back face."}, {"date": "2021-02-05", "text": "To determine whether it is legal to play a modal double-faced card, consider only the characteristics of the face you’re playing and ignore the other face’s characteristics."}, {"date": "2021-02-05", "text": "If an effect allows you to play a specific modal double-faced card, you may cast it as a spell or play it as a land, as determined by which face you choose to play. If an effect allows you to cast (rather than “play”) a specific modal double-faced card, you can’t play it as a land."}, {"date": "2021-02-05", "text": "If an effect allows you to play a land or cast a spell from among a group of cards, you may play or cast a modal double-faced card with any face that fits the criteria of that effect."}, {"date": "2021-02-05", "text": "The converted mana cost of a modal double-faced card is based on the characteristics of the face that’s being considered. On the stack and battlefield, consider whichever face is up. In all other zones, consider only the front face. This is different than how the converted mana cost of a transforming double-faced card is determined."}, {"date": "2021-02-05", "text": "A modal double-faced card can’t be transformed or be put onto the battlefield transformed. Ignore any instruction to transform a modal double-faced card or to put one onto the battlefield transformed."}, {"date": "2021-02-05", "text": "If an effect puts a double-faced card onto the battlefield, it enters with its front face up. If that front face can’t be put onto the battlefield, it doesn’t enter the battlefield."}, {"date": "2021-02-05", "text": "If an effect instructs a player to choose a card name, the name of either face may be chosen. If that effect or a linked ability refers to a spell with the chosen name being cast and/or a land with the chosen name being played, it considers only the chosen name, not the other face’s name."}, {"date": "2021-02-05", "text": "In the Commander variant, a double-faced card’s color identity is determined by the mana costs and mana symbols in the rules text of both faces combined. If either face has a color indicator or basic land type, those are also considered."}, {"date": "2021-02-05", "text": "A creature has been dealt excess damage if one or more sources deal more damage to it than the minimum amount of damage required to be lethal damage. In most cases, this means damage greater than its toughness, but consider any damage already dealt to it that turn."}, {"date": "2021-02-05", "text": "A planeswalker is dealt excess damage if it’s dealt damage greater than its current loyalty."}, {"date": "2021-02-05", "text": "Even 1 damage dealt to a creature from a source with deathtouch is considered lethal damage, so any amount greater than that will cause excess damage to be dealt, even if the total amount of damage isn’t greater than the creature’s toughness. Note that a source of damage having deathtouch has no effect on damage dealt to planeswalkers."}, {"date": "2021-02-05", "text": "If a permanent is both a creature and a planeswalker, the minimum amount of damage to be considered lethal damage is used to determine if excess damage has been dealt. For example, if a 5/5 creature that’s also a planeswalker with three loyalty counters on it is dealt 4 noncombat damage, it’s been dealt 1 excess damage and Toralf’s ability will trigger."}, {"date": "2021-02-05", "text": "It doesn’t matter if a creature or planeswalker an opponent controls was dealt combat damage earlier in the turn. The only thing that matters is that the damage dealt to that permanent that caused excess damage to be dealt was noncombat damage."}, {"date": "2021-02-05", "text": "Toralf’s ability doesn’t affect the damage dealt to the creature or planeswalker an opponent controls. That damage will still be dealt as normal."}, {"date": "2021-02-05", "text": "The damage Toralf deals because of its triggered ability is noncombat damage. That damage may cause Toralf’s ability to trigger again."}, {"date": "2021-02-05", "text": "The creature equipped by Toralf’s Hammer is the source of the activated ability, but Toralf’s Hammer is the source of the damage. For example, if the equipped creature is green, that ability can’t target a permanent with protection from green. It could target one with protection from red, though the damage would be prevented as it would have been dealt by a red source (Toralf’s Hammer)."}, {"date": "2021-02-05", "text": "If the target is an illegal target as the ability tries to resolve, the ability won’t resolve and none of its effects will happen. You won’t return Toralf’s Hammer to its owner’s hand."}, {"date": "2021-02-05", "text": "You unattach Toralf’s Hammer as part of the cost of activating the ability. If the ability doesn’t resolve, Toralf’s Hammer doesn’t become reattached."}], "securityStamp": "oval", "setCode": "PRM", "side": "b", "subtypes": ["Equipment"], "supertypes": ["Legendary"], "text": "Equipped creature has \"{1}{R}, {T}, Unattach Toralf's Hammer: It deals 3 damage to any target. Return Toralf's Hammer to its owner's hand.\"\nEquipped creature gets +3/+0 as long as it's legendary.\nEquip {1}{R}", "type": "Legendary Artifact — Equipment", "types": ["Artifact"], "uuid": "c11a090b-4471-5d8b-9708-5b8d66b52061"}