{"artist": "Christine Choi", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 3.0, "edhrecRank": 13386, "finishes": ["nonfoil", "foil"], "flavorText": "\"Where has little Gossamer gone?\"\n—Thaniel, Gatstaf shepherd", "foreignData": [{"flavorText": "„Wo ist das kleine Wöllchen hin?\" —Thaniel, Schäfer aus Gatztow", "language": "German", "multiverseId": 410879, "name": "Zur Schlachtbank führen", "text": "Ein Spieler deiner Wahl opfert eine Kreatur oder einen Planeswalker.\nDelirium — Falls dein Friedhof vier oder mehr unterschiedliche Kartentypen enthält, opfert dieser Spieler stattdessen eine Kreatur und einen Planeswalker.", "type": "Spontanzauber"}, {"flavorText": "\"¿Adónde habrá ido Gasita?\" —Thaniel, pastor de Gatstaf", "language": "Spanish", "multiverseId": 413189, "name": "Al matadero", "text": "El jugador objetivo sacrifica una criatura o un planeswalker.\nDelirio — Si entre las cartas de tu cementerio hay cuatro o más tipos de cartas, en vez de eso, ese jugador sacrifica una criatura y un planeswalker.", "type": "Instantáneo"}, {"flavorText": "« Où est passé le petit Duveteux ? » —Thaniel, berger de Gatstaf", "language": "French", "multiverseId": 411209, "name": "À l'abattoir", "text": "Le joueur ciblé sacrifie une créature ou un planeswalker.\nDélire — S'il y a au moins quatre types de carte parmi les cartes de votre cimetière, à la place ce joueur sacrifie une créature et un planeswalker.", "type": "Éphémère"}, {"flavorText": "\"Dov'è finito il piccolo Vellutino?\" —Thaniel, pastore di Gatstaf", "language": "Italian", "multiverseId": 411539, "name": "Al Macello", "text": "Un giocatore bersaglio sacrifica una creatura o un planeswalker.\nDelirio — Se ci sono quattro o più tipi di carta tra le carte nel tuo cimitero, invece quel giocatore sacrifica una creatura e un planeswalker.", "type": "Istantaneo"}, {"flavorText": "「あの霊糸っ子、どこ行っちまったんだ？」 ――ガツタフの羊飼い、サニアル", "language": "Japanese", "multiverseId": 411869, "name": "餌食", "text": "プレイヤー１人を対象とする。そのプレイヤーはクリーチャー１体かプレインズウォーカー１体を生け贄に捧げる。\n昂揚 ― あなたの墓地にあるカードにカード・タイプが合計４種類以上含まれるなら、代わりに、そのプレイヤーはクリーチャー１体とプレインズウォーカー１体を生け贄に捧げる。", "type": "インスタント"}, {"flavorText": "\"어린 고싸머가 어디로 사라진 거지?\" —갓스타프 목동 타니엘", "language": "Korean", "multiverseId": 412199, "name": "도살자의 손아귀", "text": "플레이어를 목표로 정한다. 그 플레이어는 생물 또는 플레인즈워커 한 개를 희생한다.\n섬망 — 당신의 무덤에 네 개 이상의 카드 유형이 있다면, 대신 그 플레이어는 생물 한 개와 플레인즈워커 한 개를 희생한다.", "type": "순간마법"}, {"flavorText": "\"Para onde foi o pequeno Floquinho?\" —Thaniel, pastor de Gatstaf", "language": "Portuguese (Brazil)", "multiverseId": 412529, "name": "Para o Abate", "text": "O jogador alvo sacrifica uma criatura ou planeswalker.\nDelírio — Se houver quatro ou mais tipos de card entre os cards de seu cemitério, em vez disso, aquele jogador sacrifica uma criatura e um planeswalker.", "type": "Mágica Instantânea"}, {"flavorText": "«Куда делся малыш Пушок?» — Таниел, гастафский пастух", "language": "Russian", "multiverseId": 412859, "name": "На Заклание", "text": "Целевой игрок приносит в жертву существо или planeswalker-а.\nБуйство — Если среди карт на вашем кладбище есть не менее четырех типов карт, вместо этого тот игрок приносит в жертву существо и planeswalker-а.", "type": "Мгновенное заклинание"}, {"flavorText": "「小薄纱跑哪儿去了？」 ～卡兹特牧人萨尼尔", "language": "Chinese Simplified", "multiverseId": 410219, "name": "送入虎口", "text": "目标牌手牺牲一个生物或鹏洛客。\n躁狂～如果你坟墓场中牌的类别有四种或更多，则改为该牌手牺牲一个生物和一个鹏洛客。", "type": "瞬间"}, {"flavorText": "「小薄紗跑哪兒去了？」 ～卡茲特牧人薩尼爾", "language": "Chinese Traditional", "multiverseId": 410549, "name": "送入虎口", "text": "目標玩家犧牲一個生物或鵬洛客。\n躁狂～如果你墳墓場中牌的類別有四種或更多，則改為該玩家犧牲一個生物和一個鵬洛客。", "type": "瞬間"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "206084", "cardKingdomId": "205621", "cardsphereId": "42161", "mcmId": "288923", "mcmMetaId": "222159", "mtgjsonV4Id": "f94ba5e0-dd77-5c13-b6b5-cc3c27249685", "mtgoFoilId": "60317", "mtgoId": "60316", "multiverseId": "409889", "scryfallId": "5a645c8d-7cfb-466b-9fd0-e1c26bf6f652", "scryfallIllustrationId": "68afdfd7-9196-4a70-9d73-5e8a0bd916d2", "scryfallOracleId": "518cf9ce-14aa-4f51-81bf-f8c2692a4244", "tcgplayerProductId": "115435"}, "keywords": ["Delirium"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}", "manaValue": 3.0, "name": "To the Slaughter", "number": "139", "originalText": "Target player sacrifices a creature or planeswalker.\nDelirium — If there are four or more card types among cards in your graveyard, instead that player sacrifices a creature and a planeswalker.", "originalType": "Instant", "printings": ["PSOI", "SOI"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/e494c28c1eff60f6", "cardKingdomFoil": "https://mtgjson.com/links/69c85747fba406d3", "cardmarket": "https://mtgjson.com/links/b55902dd0119dc4d", "tcgplayer": "https://mtgjson.com/links/7e016b6f5a7b8aba"}, "rarity": "rare", "rulings": [{"date": "2016-04-08", "text": "If the delirium ability applies, that player must sacrifice a creature object and a planeswalker object if able. In the unusual case that the player controls a single permanent that’s both a creature and a planeswalker, that player must sacrifice another creature or planeswalker (unless they control no other creatures and no other planeswalkers)."}, {"date": "2016-04-08", "text": "The card types in Magic are artifact, creature, enchantment, instant, land, planeswalker, sorcery, and tribal (a card type that appears on some older cards). Supertypes (such as legendary and basic) and subtypes (such as Human and Equipment) are not counted."}, {"date": "2016-04-08", "text": "The number of card types matters, not the number of cards. For example, Wicker Witch (an artifact creature) along with Catalog (an instant) and Chaplain’s Blessing (a sorcery) will enable delirium."}, {"date": "2016-04-08", "text": "Because you consider only the characteristics of a double-faced card’s front face while it’s not on the battlefield, the types of its back face won’t be counted for delirium."}, {"date": "2016-04-08", "text": "In some rare cases, you can have a token or a copy of a spell in your graveyard at the moment that an object’s delirium ability counts the card types among cards in your graveyard, before that token or copy ceases to exist. Because tokens and copies of spells are not cards, even if they are copies of cards, their types will never be counted."}, {"date": "2016-04-08", "text": "Some delirium abilities that appear on instants and sorceries use the word “instead.” These spells have an upgraded effect when they resolve if there are four or more card types among cards in your graveyard. They check that number only while they’re resolving and don’t count themselves, since they aren’t in your graveyard yet. You only get the upgraded effect, not both effects."}], "securityStamp": "oval", "setCode": "SOI", "subtypes": [], "supertypes": [], "text": "Target player sacrifices a creature or planeswalker.\nDelirium — If there are four or more card types among cards in your graveyard, instead that player sacrifices a creature and a planeswalker.", "type": "Instant", "types": ["Instant"], "uuid": "b4babb4f-3d0c-5a52-a07e-0f457d8245f4"}