{"artist": "Marta Nael", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 6647, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 548640, "name": "Berührung des Geisterreichs", "text": "Wenn die Berührung des Geisterreichs ins Spiel kommt, schicke bis zu ein Artefakt oder eine Kreatur deiner Wahl ins Exil, bis die Berührung des Geisterreichs das Spiel verlässt.\nBlutzoll — {1}{W}, wirf die Berührung des Geisterreichs ab: Schicke ein Artefakt oder eine Kreatur deiner Wahl ins Exil. Bringe es bzw. sie zu Beginn des nächsten Endsegments unter der Kontrolle seines bzw. ihres Besitzers ins Spiel zurück.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 548945, "name": "Tocar el reino espiritual", "text": "Cuando Tocar el reino espiritual entre al campo de batalla, exilia hasta un artefacto o criatura objetivo hasta que Tocar el reino espiritual deje el campo de batalla.\nCanalizar — {1}{W}, descartar Tocar el reino espiritual: Exilia el artefacto o criatura objetivo. Regresa ese permanente al campo de batalla bajo el control de su propietario al comienzo del próximo paso final.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 549250, "name": "Toucher le royaume des esprits", "text": "Quand Toucher le royaume des esprits arrive sur le champ de bataille, exilez jusqu'à un artefact ciblé ou une créature ciblée jusqu'à ce que Toucher le royaume des esprits quitte le champ de bataille.\nTransfert — {1}{W}, défaussez-vous de Toucher le royaume des esprits : Exilez une cible, artefact ou créature. Renvoyez-la sur le champ de bataille sous le contrôle de son propriétaire au début de la prochaine étape de fin.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 549555, "name": "Toccare il Reame degli Spiriti", "text": "Quando Toccare il Reame degli Spiriti entra nel campo di battaglia, esilia fino a un artefatto o una creatura bersaglio finché Toccare il Reame degli Spiriti non lascia il campo di battaglia.\nIncanalare — {1}{W}, Scarta Toccare il Reame degli Spiriti: Esilia un artefatto o una creatura bersaglio. Rimettilo sul campo di battaglia sotto il controllo del suo proprietario all'inizio della prossima sottofase finale.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 549860, "name": "精霊界との接触", "text": "精霊界との接触が戦場に出たとき、アーティファクトやクリーチャーのうち最大１つを対象とする。精霊界との接触が戦場を離れるまで、それを追放する。\n魂力 — {1}{W}, 精霊界との接触を捨てる：アーティファクトやクリーチャーのうち１つを対象とする。それを追放する。次の終了ステップの開始時に、それをオーナーのコントロール下で戦場に戻す。", "type": "エンチャント"}, {"language": "Korean", "multiverseId": 550165, "name": "신령 세계의 손길", "text": "신령 세계의 손길이 전장에 들어올 때, 마법물체 또는 생물을 최대 한 개까지 목표로 정한다. 신령 세계의 손길이 전장을 떠날 때까지 그 목표를 추방한다.\n영력 — {1}{W}, 신령 세계의 손길을 버린다: 마법물체 또는 생물을 목표로 정한다. 그 목표를 추방한다. 다음 종료단 시작에 그 카드를 소유자의 조종하에 전장으로 되돌린다.", "type": "부여마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 550470, "name": "Tocar o Reino dos Espíritos", "text": "Quando Tocar o Reino dos Espíritos entrar no campo de batalha, exile até um artefato ou uma criatura alvo até que Tocar o Reino dos Espíritos deixe o campo de batalha.\nCanalizar — {1}{W}, descarte Tocar o Reino dos Espíritos: Exile o artefato ou a criatura alvo. Devolva-o ao campo de batalha sob o controle de seu dono no início da próxima etapa final.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 550775, "name": "Прикосновение к Царству Духов", "text": "Когда Прикосновение к Царству Духов выходит на поле битвы, изгоните не более одного целевого артефакта или существа до тех пор, пока Прикосновение к Царству Духов не покинет поле битвы.\nПроводник — {1}{W}, сбросьте Прикосновение к Царству Духов: изгоните целевой артефакт или существо. Верните его на поле битвы под контролем его владельца в начале следующего заключительного шага.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 551080, "name": "亲触灵界", "text": "当亲触灵界进战场时，放逐至多一个目标神器或生物，直到亲触灵界离开战场为止。\n魂力～{1}{W}，弃掉亲触灵界：放逐目标神器或生物。在下一个结束步骤开始时，将它在其拥有者的操控下移回战场。", "type": "结界"}, {"language": "Chinese Traditional", "multiverseId": 551385, "name": "親觸靈界", "text": "當親觸靈界進戰場時，放逐至多一個目標神器或生物，直到親觸靈界離開戰場為止。\n魂力～{1}{W}，棄掉親觸靈界：放逐目標神器或生物。在下一個結束步驟開始時，將它在其擁有者的操控下移回戰場。", "type": "結界"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "256913", "cardKingdomId": "256610", "cardsphereId": "84865", "mcmId": "608189", "mcmMetaId": "402142", "mtgArenaId": "79462", "mtgjsonV4Id": "d8b9a24a-8bcf-54cc-b952-e883a933fdac", "mtgoId": "96994", "multiverseId": "548335", "scryfallId": "e16ab44e-4257-4c0c-b705-8ac1e9c1d835", "scryfallIllustrationId": "e6bdc9e4-5277-4e45-99d0-ad588e08fe49", "scryfallOracleId": "52f0dcbd-ccf3-4525-8e55-2d38b4991834", "tcgplayerProductId": "262694"}, "keywords": ["Channel"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}", "manaValue": 3.0, "name": "Touch the Spirit Realm", "number": "40", "originalText": "When Touch the Spirit Realm enters the battlefield, exile up to one target artifact or creature until Touch the Spirit Realm leaves the battlefield.\nChannel — {1}{W}, Discard Touch the Spirit Realm: Exile target artifact or creature. Return it to the battlefield under its owner's control at the beginning of the next end step.", "originalType": "Enchantment", "printings": ["GDY", "NEO"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d8a02bff01553fc6", "cardKingdomFoil": "https://mtgjson.com/links/d89b09b0af05b315", "cardmarket": "https://mtgjson.com/links/9baabd5b5ed158a8", "tcgplayer": "https://mtgjson.com/links/8bdb9d4adb70432e"}, "rarity": "uncommon", "rulings": [{"date": "2022-02-18", "text": "If a double-faced card is exiled and returned to the battlefield with Touch the Spirit Realm or its channel ability, that card will return to the battlefield front-face up."}, {"date": "2022-02-18", "text": "If Touch the Spirit Realm leaves the battlefield before its first ability resolves, the target permanent won't be exiled."}, {"date": "2022-02-18", "text": "Auras attached to the exiled permanent will be put into their owners' graveyards. Any Equipment will become unattached and remain on the battlefield. Any counters on the exiled permanent will cease to exist. When the card returns to the battlefield, it will be a new object with no connection to the card that was exiled."}, {"date": "2022-02-18", "text": "If a token is exiled this way, it will cease to exist and won't return to the battlefield."}, {"date": "2022-02-18", "text": "Discarding the card is part of the cost to activate a channel ability."}, {"date": "2022-02-18", "text": "If a channel ability requires a target, you may not activate it without a target just to discard the card."}], "setCode": "NEO", "subtypes": [], "supertypes": [], "text": "When Touch the Spirit Realm enters the battlefield, exile up to one target artifact or creature until Touch the Spirit Realm leaves the battlefield.\nChannel — {1}{W}, Discard Touch the Spirit Realm: Exile target artifact or creature. Return it to the battlefield under its owner's control at the beginning of the next end step.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "bac741ad-bf92-514e-b051-5f3af2cd7312"}