{"artist": "Scott Murphy", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 2.0, "edhrecRank": 10215, "finishes": ["nonfoil", "foil"], "flavorText": "Scents fade and footprints wash away, but some trails can never be erased.", "foreignData": [{"flavorText": "Gerüche verblassen und Fußspuren verschwinden, aber einige Spuren können nie gelöscht werden.", "language": "German", "multiverseId": 485793, "name": "Aufspüren", "text": "Hellsicht 3, decke dann die oberste Karte deiner Bibliothek auf. Falls es eine Kreaturen- oder Länderkarte ist, ziehe eine Karte. (Schaue dir für Hellsicht 3 die obersten drei Karten deiner Bibliothek an. Du kannst eine beliebige Anzahl davon unter deine Bibliothek legen und den Rest in beliebiger Reihenfolge oben darauf.)", "type": "Hexerei"}, {"flavorText": "Los olores y las pisadas desaparecen, pero algunos rastros no se pueden borrar.", "language": "Spanish", "multiverseId": 486052, "name": "Rastrear", "text": "Adivina 3, luego muestra la primera carta de tu biblioteca. Si es una carta de criatura o de tierra, roba una carta. (Para adivinar 3, mira las tres primeras cartas de tu biblioteca, luego pon cualquier cantidad de ellas en el fondo de tu biblioteca y el resto en la parte superior en cualquier orden.)", "type": "Conjuro"}, {"flavorText": "Les odeurs s'estompent et les empreintes s'effacent, mais certaines pistes ne disparaissent jamais.", "language": "French", "multiverseId": 486311, "name": "Traque", "text": "Regard 3, puis révélez la carte du dessus de votre bibliothèque. Si c'est une carte de créature ou de terrain, piochez une carte. (Pour appliquer regard 3, regardez les trois cartes du dessus de votre bibliothèque. Mettez n'importe quel nombre d'entre elles au-dessous de votre bibliothèque et le reste au-dessus, dans un ordre aléatoire.)", "type": "Rituel"}, {"flavorText": "Gli odori si dileguano e le impronte svaniscono, ma alcune tracce sono indelebili.", "language": "Italian", "multiverseId": 486570, "name": "Rintracciare", "text": "Profetizza 3, poi rivela la prima carta del tuo grimorio. Se è una carta creatura o terra, pesca una carta. (Per profetizzare 3, guarda le prime tre carte del tuo grimorio, poi mettine un qualsiasi numero in fondo al tuo grimorio e le altre in cima in qualsiasi ordine.)", "type": "Stregoneria"}, {"flavorText": "匂いは薄れ足跡は洗い流されるが、決して消せない痕跡もある。", "language": "Japanese", "multiverseId": 486829, "name": "突き止め", "text": "占術３を行い、その後あなたのライブラリーの一番上のカードを公開する。それがクリーチャーや土地であるカードなら、カードを１枚引く。（占術３とは、あなたのライブラリーの一番上からカードを３枚見て、そのうち望む枚数をあなたのライブラリーの一番下に、残りを一番上に、それぞれ望む順番で置くことである。）", "type": "ソーサリー"}, {"flavorText": "냄새는 희미해지고 발자국은 씻겨 사라지지만, 어떤 흔적들은 절대로 없어지지 않는다.", "language": "Korean", "multiverseId": 487088, "name": "추적하기", "text": "점술 3을 한 후, 당신의 서고 맨 위의 카드를 공개한다. 그 카드가 생물 또는 대지 카드라면, 카드 한 장을 뽑는다. (점술 3을 하려면, 당신의 서고 맨 위 카드 세 장을 본다. 당신은 그 카드들 중 원하는 만큼을 당신의 서고 맨 밑에 놓고 나머지를 당신의 서고 맨 위에 원하는 순서대로 놓을 수 있다.)", "type": "집중마법"}, {"flavorText": "Cheiros desvanecem e pegadas somem, mas alguns rastros jamais se apagam.", "language": "Portuguese (Brazil)", "multiverseId": 487347, "name": "Rastrear", "text": "Use vidência 3 e depois revele o card do topo do seu grimório. Se for um card de criatura ou terreno, compre um card. (Para usar vidência 3, olhe os três cards do topo do seu grimório. Depois, coloque qualquer número deles no fundo do seu grimório e o resto no topo em qualquer ordem.)", "type": "Feitiço"}, {"flavorText": "Запахи пропадают, а отпечатки лап смывает дождь, но некоторые следы не стереть никогда.", "language": "Russian", "multiverseId": 487606, "name": "Выслеживание", "text": "Предскажите 3, затем покажите верхнюю карту вашей библиотеки. Если это карта существа или земли, возьмите карту. (Чтобы предсказать 3, посмотрите три верхние карты вашей библиотеки, затем положите любое количество из них в низ вашей библиотеки, а остальные на верх вашей библиотеки в любом порядке.)", "type": "Волшебство"}, {"flavorText": "虽然气味会消散，足印会模糊，但有些踪迹永不会被抹灭。", "language": "Chinese Simplified", "multiverseId": 487865, "name": "追查行踪", "text": "占卜3，然后展示你的牌库顶牌。如果它是生物或地牌，则抓一张牌。（占卜3的流程是检视你牌库顶的三张牌，然后将其中任意数量的牌以任意顺序置于你牌库底，其余则以任意顺序置于你牌库顶。）", "type": "法术"}, {"flavorText": "雖然氣味會消散，足印會模糊，但有些蹤跡永不會被抹滅。", "language": "Chinese Traditional", "multiverseId": 488124, "name": "追查行蹤", "text": "占卜3，然後展示你的牌庫頂牌。如果它是生物或地牌，則抽一張牌。（占卜3的流程是檢視你牌庫頂的三張牌，然後將其中任意數量的牌以任意順序置於你牌庫底，其餘則以任意順序置於你牌庫頂。）", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "234585", "cardKingdomId": "234279", "cardsphereId": "67817", "mcmId": "471924", "mcmMetaId": "308269", "mtgArenaId": "71993", "mtgjsonV4Id": "27e693cb-dd1e-5064-8d45-1b09230edb84", "mtgoId": "81649", "multiverseId": "485534", "scryfallId": "b41b6c8a-bd76-4b69-ae72-4c8acac379b4", "scryfallIllustrationId": "2d8e7f4d-0ab7-492a-8093-96fcf68aa0ff", "scryfallOracleId": "8f28b65b-4b73-4080-9cdc-d236ad99f39c", "tcgplayerProductId": "215919"}, "keywords": ["Scry"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}", "manaValue": 2.0, "name": "Track Down", "number": "211", "originalText": "Scry 3, then reveal the top card of your library. If it's a creature or land card, draw a card. (To scry 3, look at the top three cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)", "originalType": "Sorcery", "printings": ["M21"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/5f9cccd24061f326", "cardKingdomFoil": "https://mtgjson.com/links/0a7b9c6e353a29bf", "cardmarket": "https://mtgjson.com/links/bb06fa3491edc11e", "tcgplayer": "https://mtgjson.com/links/d8e8f347066cda14"}, "rarity": "common", "rulings": [{"date": "2020-06-23", "text": "The card you reveal will be the card you draw, if applicable."}, {"date": "2020-06-23", "text": "If you don't draw the card you reveal, it remains on top of your library."}], "setCode": "M21", "subtypes": [], "supertypes": [], "text": "Scry 3, then reveal the top card of your library. If it's a creature or land card, draw a card. (To scry 3, look at the top three cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "3001f1f9-3062-5207-964b-31e995766280"}