{"artist": "Vincent Proce", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210232", "mcmId": "294475", "mtgjsonV4Id": "00eb4477-6470-5a6e-9e7f-36d4feabc6ed", "multiverseId": "423661", "scryfallId": "f5f307bf-80ac-46cb-9003-3e70a0703e71", "scryfallIllustrationId": "494c9242-4362-47db-a3ac-06f3c6a68e54", "scryfallOracleId": "b2c95c7a-a04c-46ef-a879-6eb08e444093", "tcgplayerProductId": "125645"}, "isOversized": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Trail of the Mage-Rings", "number": "80", "originalText": "Instant and sorcery spells have rebound. (The spell's controller exiles the spell as it resolves if he or she cast it from his or her hand. At the beginning of that player's next upkeep, he or she may cast that card from exile without paying its mana cost.)\nWhenever you roll {Chaos}, you may search your library for an instant or sorcery card, reveal it, put it into your hand, then shuffle your library.", "originalType": "Plane — Vryn", "printings": ["OPC2", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d2e61b1e8229100a", "tcgplayer": "https://mtgjson.com/links/6def8e325ba0bc46"}, "rarity": "common", "rulings": [{"date": "2012-06-01", "text": "Rebound’s delayed triggered ability will let you cast the spell at the beginning of your next upkeep even if the game has left Trail of the Mage-Rings by then."}, {"date": "2013-04-15", "text": "Similarly, if you gain control of an instant or sorcery spell with Commandeer, it will have rebound, but the ability won’t do anything because that spell wasn’t cast from your hand."}, {"date": "2013-04-15", "text": "If a spell with rebound that you cast from your hand doesn’t resolve for any reason (due being countered by a spell like Cancel, or because all of its targets are illegal), rebound has no effect. The spell is simply put into your graveyard. You won’t get to cast it again next turn."}, {"date": "2013-04-15", "text": "If you cast a spell with rebound from anywhere other than your hand (such as from your graveyard due to Sins of the Past, from your library due to cascade, or from your opponent’s hand due to Sen Triplets), rebound won’t have any effect. If you do cast it from your hand, rebound will work regardless of whether you paid its mana cost (for example, if you cast it from your hand due to Maelstrom Archangel)."}, {"date": "2013-04-15", "text": "If a replacement effect would cause a spell with rebound that you cast from your hand to be put somewhere else instead of your graveyard (such as Leyline of the Void might), you choose whether to apply the rebound effect or the other effect as the spell resolves."}, {"date": "2013-04-15", "text": "Rebound will have no effect on copies of spells because you don’t cast them from your hand."}, {"date": "2013-04-15", "text": "If you cast a spell with rebound from your hand and it resolves, it isn’t put into your graveyard. Rather, it’s exiled directly from the stack. Effects that care about cards being put into your graveyard won’t do anything."}, {"date": "2013-04-15", "text": "At the beginning of your upkeep, all delayed triggered abilities created by rebound effects trigger. You may handle them in any order. If you want to cast a card this way, you do so as part of the resolution of its delayed triggered ability. Timing restrictions based on the card’s type (if it’s a sorcery) are ignored. Other restrictions are not (such as the one from Rule of Law)."}, {"date": "2013-04-15", "text": "If you are unable to cast a card from exile this way, or you choose not to, nothing happens when the delayed triggered ability resolves. The card remains exiled for the rest of the game, and you won’t get another chance to cast the card. The same is true if the ability is countered (due to Stifle, perhaps)."}, {"date": "2013-04-15", "text": "If you cast a card from exile this way, it will go to your graveyard when it resolves, fails to resolve, or is countered. It won’t go back to exile."}, {"date": "2013-04-15", "text": "Multiple instances of rebound on the same spell are redundant."}, {"date": "2013-04-15", "text": "The rebound effect is not optional. Each instant and sorcery spell you cast from your hand is exiled instead of being put into your graveyard as it resolves, whether you want it to be or not. Casting the spell during your next upkeep is optional, however."}, {"date": "2013-04-15", "text": "If a spell moves itself into another zone as part of its resolution (as Arc Blade, All Suns’ Dawn, and Beacon of Unrest do), rebound won’t get a chance to apply."}, {"date": "2013-04-15", "text": "If a spell you cast from your hand has both rebound and buyback (and the buyback cost was paid), you choose which effect to apply as it resolves."}, {"date": "2013-04-15", "text": "You’ll be able to cast a spell with flashback three times this way. First you can cast it from your hand. It will be exiled due to rebound as it resolves. Then you can cast it from exile due to rebound’s delayed triggered ability. It will be put into your graveyard as it resolves. Then you can cast it from your graveyard due to flashback. It will be exiled due to flashback as it resolves."}, {"date": "2013-04-15", "text": "If you cast an instant or sorcery spell from your hand and it’s exiled due to rebound, the delayed triggered ability will allow you to cast it during your next upkeep even if Trail of the Mage-Rings has been turned face down by then."}, {"date": "2013-04-15", "text": "If you cast a card from exile “without paying its mana cost,” you can’t pay any alternative costs. Any X in the mana cost will be 0. On the other hand, if the card has optional additional costs (such as kicker or multikicker), you may pay those when you cast the card. If the card has mandatory additional costs (such as Momentous Fall does), you must pay those if you choose to cast the card."}, {"date": "2013-04-15", "text": "If a spell has restrictions on when it can be cast (for example, “Cast [this spell] only during the declare blockers step”), those restrictions may prevent you from casting it from exile during your upkeep."}, {"date": "2013-04-15", "text": "If you cast a spell using the madness or suspend abilities, you’re casting it from exile, not from your hand. Although those spells will have rebound, the ability won’t have any effect."}], "setCode": "OPCA", "subtypes": ["Vryn"], "supertypes": [], "text": "Instant and sorcery spells have rebound. (The spell's controller exiles the spell as it resolves if they cast it from their hand. At the beginning of that player's next upkeep, they may cast that card from exile without paying its mana cost.)\nWhenever you roll {CHAOS}, you may search your library for an instant or sorcery card, reveal it, put it into your hand, then shuffle.", "type": "Plane — Vryn", "types": ["Plane"], "uuid": "912e8a7e-e510-5fe7-ab34-e01c66d5fb49"}