{"artist": "James Ryman", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 1.0, "edhrecRank": 1510, "finishes": ["nonfoil", "foil"], "flavorText": "Under the master's eye, skills are honed sharper and spells cut deeper.", "foreignData": [{"flavorText": "Unter dem Auge des Meisters werden Fähigkeiten geschärft und Zaubersprüche vertieft.", "language": "German", "multiverseId": 217351, "name": "Übungsplätze", "text": "Aktivierte Fähigkeiten von Kreaturen, die du kontrollierst, kosten beim Aktivieren bis zu {2} weniger. Dieser Effekt kann die Menge Mana, die das Aktivieren einer Fähigkeit kostet, nicht unter ein Mana reduzieren.", "type": "Verzauberung"}, {"flavorText": "Bajo la mirada del amo, las habilidades son perfeccionadas y los hechizos son más efectivos.", "language": "Spanish", "multiverseId": 217103, "name": "Área de entrenamiento", "text": "Cuesta hasta {2} menos activar las habilidades activadas de las criaturas que controlas. Este efecto no puede reducir la cantidad de maná que cuesta activar una habilidad a menos de un maná.", "type": "Encantamiento"}, {"flavorText": "Sous le regard du maître, les compétences s'aiguisent et les sorts s'affûtent.", "language": "French", "multiverseId": 215615, "name": "Terrains d'entraînement", "text": "Les capacités activées des créatures que vous contrôlez coûtent jusqu'à {2} de moins à activer. Cet effet ne peut pas réduire la quantité de mana que coûte une capacité pour s'activer à moins de un mana.", "type": "Enchantement"}, {"flavorText": "Sotto l'occhio vigile del maestro, le abilità vengono affinate e le magie approfondite.", "language": "Italian", "multiverseId": 216359, "name": "Zona d'Addestramento", "text": "Le abilità attivate delle creature che controlli costano fino a {2} in meno per essere attivate. Questo effetto non può ridurre la quantità di mana che costa attivare un'abilità a meno di un mana.", "type": "Incantesimo"}, {"flavorText": "師の視線の下で、腕はより強く、呪文はより鋭くなる。", "language": "Japanese", "multiverseId": 216607, "name": "訓練場", "text": "あなたがコントロールするクリーチャーの起動型能力は、それを起動するためのコストが最大{2}少なくなる。 この効果は、いずれかの能力の起動コストのマナの点数を１点未満に減らさない。", "type": "エンチャント"}, {"flavorText": "Sob os olhos do mestre, as habilidades são aprimoradas e as mágicas tornam-se mais poderosas.", "language": "Portuguese (Brazil)", "multiverseId": 216855, "name": "Campos de Treinamento", "text": "As habilidades ativadas das criaturas que você controla custam até {2} a menos para serem ativadas. Este efeito não pode reduzir a quantidade de mana necessária para ativar uma habilidade para menos de um mana.", "type": "Encantamento"}, {"flavorText": "Под присмотром мастера навыки оттачиваются лучше, а заклинания режут глубже.", "language": "Russian", "multiverseId": 215863, "name": "Учебный Полигон", "text": "Активируемые способности существ под вашим контролем стоят до {2} меньше. Этот эффект не может сократить количество маны для оплаты активации способности до менее чем одной маны.", "type": "Чары"}, {"flavorText": "在师父的指导下，技巧更加熟练，咒语也更加强劲。", "language": "Chinese Simplified", "multiverseId": 216111, "name": "训练场", "text": "由你操控的生物之起动式异能至多减少{2}来起动。 此效应无法让起动异能所需的法术力费用少于一点法术力。", "type": "结界"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "131044", "cardKingdomId": "130805", "cardsphereId": "39815", "mcmId": "22543", "mcmMetaId": "11224", "mtgjsonV4Id": "c92e7440-3aef-5517-a982-24ba7abdea4c", "mtgoFoilId": "36451", "mtgoId": "36450", "multiverseId": "193490", "scryfallId": "e2cf16f8-6e69-46b3-8453-1d1a2a5670e2", "scryfallIllustrationId": "82949fe0-6a95-45c2-af98-0479db0b928d", "scryfallOracleId": "8de3eabe-9a8f-4865-beef-a4888c081d39", "tcgplayerProductId": "34785"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{U}", "manaValue": 1.0, "name": "Training Grounds", "number": "91", "originalText": "Activated abilities of creatures you control cost up to {2} less to activate. This effect can't reduce the amount of mana an ability costs to activate to less than one mana.", "originalType": "Enchantment", "printings": ["P22", "PLIST", "ROE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/2735c6dac3736d58", "cardKingdomFoil": "https://mtgjson.com/links/e56e5ab310c8591d", "cardmarket": "https://mtgjson.com/links/58ad92074d171989", "tcgplayer": "https://mtgjson.com/links/e19746b2bbcb37dc"}, "rarity": "rare", "rulings": [{"date": "2010-06-15", "text": "Training Grounds won’t affect a cost that isn’t the cost to activate a creature’s activated ability. For example, it won’t affect Flameblast Dragon’s {X}{R} cost, since that’s a cost paid when a triggered ability resolves, and it won’t affect a kicker cost, since that’s an additional cost to cast a spell. Activated ability costs appear before a colon (:) in a card’s rules text, or, in the case of some keywords, before a colon in reminder text."}, {"date": "2010-06-15", "text": "Training Grounds affects only creatures you control on the battlefield. The costs of activated abilities that work in other zones (such as cycling or unearth) won’t be reduced."}, {"date": "2010-06-15", "text": "Training Grounds won’t affect the part of an activation cost represented by colored mana symbols or snow mana symbols. It also won’t affect nonmana parts of an activation cost, if there are any."}, {"date": "2010-06-15", "text": "Training Grounds can reduce the part of an activation cost represented by generic mana symbols down to nothing, as long as it still costs at least one mana. For example, if an activation cost is {2}{G}, you’d have to pay only {G}. If an activation cost is {2}, though, you’d still have to pay {1}."}, {"date": "2010-06-15", "text": "Training Grounds can reduce the amount you pay for a creature’s activated ability cost that includes {X}. For example, Drana, Kalastria Bloodchief has an activated ability that costs {X}{B}{B}. If you control Training Grounds and you activate the ability with X equal to 5, you’ll have to pay only {3}{B}{B}. This is true even if the ability states that {X} must be paid with a certain color of mana, as Crimson Hellkite’s ability does."}, {"date": "2010-06-15", "text": "If an activated ability of a creature you control costs no generic mana to activate (for example, if it costs {R}{R}, it costs {0}, or it costs only nonmana actions such as {T} or “Sacrifice a creature”), Training Grounds simply won’t affect it. In particular, it won’t increase the cost to include a mana payment of {1}."}, {"date": "2010-06-15", "text": "Training Grounds takes the total cost to activate a creature’s activated ability into account, not just the cost printed on it. For example, Furnace Spirit has an activated ability that costs {R}, and Suppression Field says “Activated abilities cost {2} more to activate unless they’re mana abilities.” Since activating Furnace Spirit’s activated ability would now cost {2}{R}, Training Grounds reduces that cost back to {R}."}, {"date": "2010-06-15", "text": "You may choose not to apply Training Ground’s cost reduction effect. You may also choose to apply only part of it (causing an activated ability of a creature you control to cost just {1} less to activate)."}], "setCode": "ROE", "subtypes": [], "supertypes": [], "text": "Activated abilities of creatures you control cost up to {2} less to activate. This effect can't reduce the mana in that cost to less than one mana.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "49e82b1f-b3d1-5440-b1ee-cd05e3f74318"}