{"artist": "Daarken", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 2.0, "edhrecRank": 6825, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 473410, "name": "Spur aus Brotkrumen", "text": "Wenn die Spur aus Brotkrumen ins Spiel kommt, erzeuge einen Speise-Spielstein.\nImmer wenn du eine Speise opferst, kannst du {1} bezahlen. Falls du dies tust, schaue dir die obersten zwei Karten deiner Bibliothek an. Du kannst davon eine bleibende Karte offen vorzeigen und auf deine Hand nehmen. Lege den Rest in beliebiger Reihenfolge unter deine Bibliothek.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 473679, "name": "Rastro de migajas", "text": "Cuando el Rastro de migajas entre al campo de batalla, crea una ficha de Comida.\nSiempre que sacrifiques una Comida, puedes pagar {1}. Si lo haces, mira las dos primeras cartas de tu biblioteca. Puedes mostrar una carta de permanente que se encuentre entre ellas y ponerla en tu mano. Pon el resto en el fondo de tu biblioteca en cualquier orden.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 473948, "name": "Piste de miettes", "text": "Quand la Piste de miettes arrive sur le champ de bataille, créez un jeton Nourriture.\nÀ chaque fois que vous sacrifiez une nourriture, vous pouvez payer {1}. Si vous faites ainsi, regardez les deux cartes du dessus de votre bibliothèque. Vous pouvez révéler une carte de permanent parmi elles et la mettre dans votre main. Mettez le reste au-dessous de votre bibliothèque, dans l'ordre de votre choix.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 474217, "name": "Sentiero di Briciole", "text": "Quando il Sentiero di Briciole entra nel campo di battaglia, crea una pedina Cibo.\nOgniqualvolta sacrifichi un Cibo, puoi pagare {1}. Se lo fai, guarda le prime due carte del tuo grimorio. Puoi rivelare una carta permanente scelta tra esse e aggiungerla alla tua mano. Metti le altre in fondo al tuo grimorio in qualsiasi ordine.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 474486, "name": "パンくずの道標", "text": "パンくずの道標が戦場に出たとき、食物・トークンを１つ生成する。\nあなたが食物を１つ生け贄に捧げるたび、あなたは{1}を支払ってもよい。そうしたなら、あなたのライブラリーの一番上からカードを２枚見る。あなたはその中からパーマネント・カード１枚を公開してあなたの手札に加えてもよい。残りをあなたのライブラリーの一番下に望む順番で置く。", "type": "エンチャント"}, {"language": "Korean", "multiverseId": 474755, "name": "빵 부스러기 흔적", "text": "빵 부스러기 흔적이 전장에 들어올 때, 음식 토큰 한 개를 만든다.\n당신이 음식을 희생할 때마다, 당신은 {1}을 지불할 수 있다. 그렇게 한다면, 당신의 서고 맨 위 카드 두 장을 본다. 당신은 그중에서 지속물 카드 한 장을 공개하고 당신의 손으로 가져갈 수 있다. 나머지 카드들은 당신이 원하는 순서로 당신의 서고 맨 밑에 놓는다.", "type": "부여마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 475024, "name": "Trilha de Migalhas", "text": "Quando Trilha de Migalhas entrar no campo de batalha, crie uma ficha de Comida.\nToda vez que sacrifica uma Comida, você pode pagar {1}. Se fizer isso, olhe os dois cards do topo de seu grimório. Você pode revelar um card de permanente dentre eles e colocá-lo em sua mão. Coloque o restante no fundo de seu grimório em qualquer ordem.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 475293, "name": "След из Крошек", "text": "Когда След из Крошек выходит на поле битвы, создайте одну фишку Еды.\nКаждый раз, когда вы жертвуете Еду, вы можете заплатить {1}. Если вы это делаете, посмотрите две верхние карты вашей библиотеки. Вы можете показать находящуюся среди них карту перманента и положить ее в вашу руку. Положите остальные карты в низ вашей библиотеки в любом порядке.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 475562, "name": "碎屑路径", "text": "当碎屑路径进战场时，派出一个食品衍生物。\n每当你牺牲一个食品时，你可以支付{1}。若你如此作，则检视你牌库顶的两张牌。你可以展示其中的一张永久物牌，并将它置于你手上。将其余的牌以任意顺序置于你牌库底。", "type": "结界"}, {"language": "Chinese Traditional", "multiverseId": 475831, "name": "碎屑路徑", "text": "當碎屑路徑進戰場時，派出一個食品衍生物。\n每當你犧牲一個食品時，你可以支付{1}。若你如此作，則檢視你牌庫頂的兩張牌。你可以展示其中的一張永久物牌，並將它置於你手上。將其餘的牌以任意順序置於你牌庫底。", "type": "結界"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "227815", "cardKingdomId": "227414", "cardsphereId": "62372", "mcmId": "400104", "mcmMetaId": "281554", "mtgArenaId": "70326", "mtgjsonV4Id": "79753d8d-8bbe-57f1-b850-b0fce6d9ee91", "mtgoId": "78500", "multiverseId": "473141", "scryfallId": "2688ac16-4ed6-4e79-815a-be173deb4603", "scryfallIllustrationId": "70e4a862-5964-4ebd-8cad-f0d3e25b7300", "scryfallOracleId": "185d6356-8f8d-4b32-8259-b4eb0a95866c", "tcgplayerProductId": "198868"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}", "manaValue": 2.0, "name": "Trail of Crumbs", "number": "179", "originalText": "When Trail of Crumbs enters the battlefield, create a Food token.\nWhenever you sacrifice a Food, you may pay {1}. If you do, look at the top two cards of your library. You may reveal a permanent card from among them and put it into your hand. Put the rest on the bottom of your library in any order.", "originalType": "Enchantment", "printings": ["ELD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ff4209e21fef9a62", "cardKingdomFoil": "https://mtgjson.com/links/587f6dc9751da880", "cardmarket": "https://mtgjson.com/links/3ad09dfbbb29f7b6", "tcgplayer": "https://mtgjson.com/links/8426e72b6ca4a045"}, "rarity": "uncommon", "rulings": [{"date": "2019-10-04", "text": "While resolving the second triggered ability, you can't pay {1} multiple times to look at more cards."}, {"date": "2019-10-04", "text": "A permanent card is an artifact, creature, enchantment, land, or planeswalker card."}, {"date": "2019-10-04", "text": "If an effect refers to a Food, it means any Food artifact, not just a Food artifact token. For example, you can sacrifice Gingerbrute to activate the last ability of Tempting Witch."}, {"date": "2019-10-04", "text": "Food is an artifact type. Even though it appears on some creatures (such as Gingerbrute), it's never a creature type."}, {"date": "2019-10-04", "text": "You can't sacrifice a Food token to pay multiple costs. For example, you can't sacrifice a Food token to activate its own ability and also to activate the ability of Tempting Witch."}, {"date": "2019-10-04", "text": "Whatever you do, don't eat the delicious cards."}], "setCode": "ELD", "subtypes": [], "supertypes": [], "text": "When Trail of Crumbs enters the battlefield, create a Food token. (It's an artifact with \"{2}, {T}, Sacrifice this artifact: You gain 3 life.\")\nWhenever you sacrifice a Food, you may pay {1}. If you do, look at the top two cards of your library. You may reveal a permanent card from among them and put it into your hand. Put the rest on the bottom of your library in any order.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "2e5c5bd2-ed4a-556f-a920-10ee0ddcb6cc"}