{"artist": "Lars Grant-West", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G", "U"], "colors": ["G", "U"], "convertedManaCost": 6.0, "edhrecRank": 22439, "finishes": ["nonfoil", "foil"], "flavorText": "Travelers in these waters leave a bit of themselves behind.", "foreignData": [{"flavorText": "Reisende in diesen Gewässern lassen dort immer einen Teil von sich zurück.", "language": "German", "multiverseId": 181692, "name": "Klappmaul-Kelpie", "text": "Aufblitzen\nBeharrlichkeit (Wenn diese Kreatur aus dem Spiel auf einen Friedhof gelegt wird und keine -1/-1-Marke auf ihr lag, bringe sie mit einer -1/-1-Marke unter der Kontrolle ihres Besitzers ins Spiel zurück.)", "type": "Kreatur — Bestie"}, {"flavorText": "Los viajeros de estas aguas dejan un poco de ellos mismos detrás.", "language": "Spanish", "multiverseId": 180792, "name": "Kelpie dientuda", "text": "Destello.\nPersistir. (Cuando esta criatura vaya a un cementerio desde el juego, si no tenía contadores -1/-1 sobre ella, regrésala al juego bajo el control de su propietario con un contador -1/-1.)", "type": "Criatura — Bestia"}, {"flavorText": "Tout voyageur dans ces eaux laisse un peu de lui-même derrière lui.", "language": "French", "multiverseId": 181872, "name": "Kelpie aux mâchoires-collet", "text": "Flash\nPersistance (Quand cette créature est mise dans un cimetière depuis le jeu, si elle n'avait pas de marqueurs -1/-1 sur elle, renvoyez-la en jeu sous le contrôle de son propriétaire avec un marqueur -1/-1 sur elle.)", "type": "Créature : bête"}, {"flavorText": "Quelli che viaggiano in queste acque si lasciano dietro un pezzo.", "language": "Italian", "multiverseId": 181512, "name": "Kelpie Fauce Trappolatrice", "text": "Lampo\nPersistere (Quando questa creatura viene messa in un cimitero dal gioco, se non aveva segnalini -1/-1, rimettila in gioco sotto il controllo del suo proprietario con un segnalino -1/-1.)", "type": "Creatura — Bestia"}, {"flavorText": "この水の中を行く旅人は、自分の欠片を落としていく。", "language": "Japanese", "multiverseId": 181152, "name": "罠顎のケルピー", "text": "瞬速\n頑強 （このクリーチャーが場からいずれかの墓地に置かれたとき、それの上に－１/－１カウンターが置かれていなかった場合、それを－１/－１カウンターが１個置かれた状態でオーナーのコントロール下で場に戻す。）", "type": "クリーチャー — ビースト"}, {"flavorText": "Os viajantes dessas águas deixam um pouco de si para trás.", "language": "Portuguese (Brazil)", "multiverseId": 182052, "name": "Kelpie Boca-Voraz", "text": "Lampejo\nPersistir (Quando esta criatura for colocada num cemitério vinda do jogo, se ela não tiver nenhum marcador -1/-1, devolva-a para o jogo sob o controle de seu dono com um marcador -1/-1.)", "type": "Criatura — Besta"}, {"flavorText": "В этих водах странники оставляют позади части себя.", "language": "Russian", "multiverseId": 181332, "name": "Клацающий Челюстями Келпи", "text": "Миг\nУпорство (Когда это существо попадает из игры на кладбище, если на нем не было жетонов -1/-1, верните его в игру под контролем его владельца с одним жетоном -1/-1 на нем.)", "type": "Существо — Зверь"}, {"flavorText": "涉足这水域的旅者，会把自己的一部分留下来。", "language": "Chinese Simplified", "multiverseId": 180972, "name": "陷阱颚凯尔比", "text": "闪现\n留存 （当此生物从场上置入坟墓场时，若其上没有-1/-1指示物，则将它在其拥有者的操控下返回场上，且其上有一个-1/-1指示物。）", "type": "生物～野兽"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "125488", "cardKingdomId": "125283", "cardsphereId": "17136", "mcmId": "19626", "mcmMetaId": "10014", "mtgjsonV4Id": "802dc724-4c63-51d3-ad80-2b3211819c5e", "mtgoFoilId": "30061", "mtgoId": "30060", "multiverseId": "152140", "scryfallId": "62615f86-0431-4709-b41c-af43f7793fdb", "scryfallIllustrationId": "d0d5afc6-b93e-4a4a-9e0b-c4b71a6b167c", "scryfallOracleId": "0d6fccd5-ec14-4da6-972e-b2f5502818a4", "tcgplayerProductId": "27226"}, "keywords": ["Flash", "Persist"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{G/U}{G/U}", "manaValue": 6.0, "name": "Trapjaw Kelpie", "number": "164", "originalText": "Flash\nPersist (When this creature is put into a graveyard from play, if it had no -1/-1 counters on it, return it to play under its owner's control with a -1/-1 counter on it.)", "originalType": "Creature - Beast", "power": "3", "printings": ["EVE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/ff4ce47b33b9f448", "cardKingdomFoil": "https://mtgjson.com/links/385d7b64318dca19", "cardmarket": "https://mtgjson.com/links/f47b0c083a551cfe", "tcgplayer": "https://mtgjson.com/links/7ea8a3d17c6ccbf6"}, "rarity": "common", "rulings": [{"date": "2013-06-07", "text": "If a creature with persist stops being a creature, persist will still work."}, {"date": "2013-06-07", "text": "The persist ability triggers when the permanent is put into a graveyard. Its last known information (that is, how the creature last existed on the battlefield) is used to determine whether it had a -1/-1 counter on it."}, {"date": "2013-06-07", "text": "If a permanent has multiple instances of persist, they’ll each trigger separately, but the redundant instances will have no effect. If one instance returns the card to the battlefield, the next to resolve will do nothing."}, {"date": "2013-06-07", "text": "If a token with no -1/-1 counters on it has persist, the ability will trigger when the token is put into the graveyard. However, the token will cease to exist and can’t return to the battlefield."}, {"date": "2013-06-07", "text": "When a permanent with persist returns to the battlefield, it’s a new object with no memory of or connection to its previous existence."}, {"date": "2013-06-07", "text": "If multiple creatures with persist are put into the graveyard at the same time (due to combat damage or a spell that destroys all creatures, for example), the active player (the player whose turn it is) puts all of their persist triggers on the stack in any order, then each other player in turn order does the same. The last trigger put on the stack is the first one that resolves. That means that in a two-player game, the nonactive player’s persist creatures will return to the battlefield first, then the active player’s persist creatures do the same. The creatures return to the battlefield one at a time."}, {"date": "2013-06-07", "text": "If a creature with persist that has +1/+1 counters on it receives enough -1/-1 counters to cause it to be destroyed by lethal damage or put into its owner’s graveyard for having 0 or less toughness, persist won’t trigger and the card won’t return to the battlefield. That’s because persist checks the creature’s existence just before it leaves the battlefield, and it still has all those counters on it at that point."}], "setCode": "EVE", "subtypes": ["Beast"], "supertypes": [], "text": "Flash\nPersist (When this creature dies, if it had no -1/-1 counters on it, return it to the battlefield under its owner's control with a -1/-1 counter on it.)", "toughness": "3", "type": "Creature — Beast", "types": ["Creature"], "uuid": "fd46f8e0-3127-5f0c-a5ea-10809dfe8fb6"}