{"artist": "Alex Konstad", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 3.0, "edhrecRank": 2375, "finishes": ["nonfoil", "foil"], "flavorText": "The Law of Givesies Backsies is respected by every noble pursuer of shiny things.", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "07b548c7-0621-5e94-8536-a042f6972b5f", "mtgoId": "70653", "scryfallId": "673d980e-a5eb-4869-beb4-9a03c18d447a", "scryfallIllustrationId": "4da4b80e-b689-4001-b427-2e0bb12f140f", "scryfallOracleId": "20a6d576-a5b2-43b4-8be9-75be001e567d"}, "isOnlineOnly": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}", "manaValue": 3.0, "name": "Treasure Nabber", "number": "70653", "originalReleaseDate": "2018-12-06", "power": "3", "printings": ["C18", "PZ2"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2018-07-13", "text": "An artifact is “tapped for mana” when a player activates a mana ability of an artifact that includes {T} (the tap symbol). Notably, tapping an artifact to pay for a spell with the improvise keyword is not tapping that artifact for mana."}, {"date": "2018-07-13", "text": "If the artifact leaves the battlefield, Treasure Nabber doesn’t nab it from the zone it moved to."}, {"date": "2018-07-13", "text": "The artifact remains tapped when you gain control of it."}, {"date": "2018-07-13", "text": "If an opponent taps an artifact for mana during your turn, you’ll gain control of it and keep control of it until the end of your next turn."}, {"date": "2018-07-13", "text": "If you control multiple Treasure Nabbers, their effects all expire at the same time. You won’t keep an artifact for any longer."}, {"date": "2018-07-13", "text": "If multiple players each control Treasure Nabbers, an artifact tapped for mana will make quite a journey. For example, if player A taps an artifact for mana during their turn, and players B and C are the next players in turn order who control Treasure Nabbers, C’s ability resolves before B and C gains control of the artifact. Then B gains control of the artifact. B keeps it during their turn, and then C regains control of the artifact once B’s effect expires, then A will have it back after C’s expires. However, if B or C taps the artifact for mana, one of them will take it from the other. You may need to pay very careful attention to which effects are still in effect, which have expired, and who owns what."}, {"date": "2018-07-13", "text": "In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. If that player controls any nabbed treasures, the effect giving that player control of those artifacts ends."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": ["Goblin", "Rogue"], "supertypes": [], "text": "Whenever an opponent taps an artifact for mana, gain control of that artifact until the end of your next turn.", "toughness": "2", "type": "Creature — Goblin Rogue", "types": ["Creature"], "uuid": "c21865f2-1d01-5ac6-b4e6-db586ec5fbe7"}