{"artist": "Zack Stella", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 3.0, "edhrecRank": 6831, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 464388, "name": "Schattenhafter Baumhirte", "text": "Verzaubert eine Kreatur\nDie verzauberte Kreatur erhält +0/+2 und weist Kampfschaden in Höhe ihrer Widerstandskraft anstatt ihrer Stärke zu.\nTotembeistand (Falls die verzauberte Kreatur zerstört würde, entferne stattdessen allen Schaden von ihr und zerstöre diese Aura.)", "type": "Verzauberung — Aura"}, {"language": "Spanish", "multiverseId": 464642, "name": "Umbra de pueblo arbóreo", "text": "Encantar criatura.\nLa criatura encantada obtiene +0/+2 y asigna una cantidad de daño de combate igual a su resistencia en vez de su fuerza.\nArmadura tótem. (Si la criatura encantada fuera a ser destruida, en vez de eso, remueve todo el daño de ella y destruye esta Aura.)", "type": "Encantamiento — Aura"}, {"language": "French", "multiverseId": 464896, "name": "Ombre de sylvin", "text": "Enchanter : créature\nLa créature enchantée gagne +0/+2 et attribue un nombre de blessures de combat égal à son endurance à la place de sa force.\nArmure totémique (Si la créature enchantée devait être détruite, à la place, retirez-lui toutes ses blessures et détruisez cette aura.)", "type": "Enchantement : aura"}, {"language": "Italian", "multiverseId": 465150, "name": "Essenza del Silvantropo", "text": "Incanta creatura\nLa creatura incantata prende +0/+2 e assegna danno da combattimento pari alla sua costituzione invece che alla sua forza.\nArmatura totem (Se la creatura incantata sta per essere distrutta, rimuovi invece tutto il danno da essa e distruggi quest'Aura.)", "type": "Incantesimo — Aura"}, {"language": "Japanese", "multiverseId": 465404, "name": "ツリーフォークの陰影", "text": "エンチャント（クリーチャー）\nエンチャントしているクリーチャーは、＋０/＋２の修整を受け、パワーではなくタフネスに等しい点数の戦闘ダメージを割り振る。\n族霊鎧（エンチャントしているクリーチャーが破壊されるなら、代わりにそれが負っているすべてのダメージを取り除いてこのオーラを破壊する。）", "type": "エンチャント — オーラ"}, {"language": "Korean", "multiverseId": 465658, "name": "인목의 그림자", "text": "생물에게 부여\n부여된 생물은 +0/+2를 받고 자신의 공격력 대신 방어력만큼 전투피해를 입힌다.\n토템 갑옷 (부여된 생물이 파괴되려 하면, 대신 그 생물이 입은 피해를 모두 제거하고 이 마법진을 파괴한다.)", "type": "부여마법 — 마법진"}, {"language": "Portuguese (Brazil)", "multiverseId": 465912, "name": "Sombra de Ent", "text": "Encantar criatura\nA criatura encantada recebe +0/+2 e atribui dano de combate igual à própria resistência em vez do próprio poder.\nArmadura de totem (Se a criatura encantada seria destruída, em vez disso, remova todo o dano dela e destrua esta Aura.)", "type": "Encantamento — Aura"}, {"language": "Russian", "multiverseId": 466166, "name": "Дух Лесовика", "text": "Зачаровать существо\nЗачарованное существо получает +0/+2 и распределяет боевые повреждения, равные своей выносливости, а не силе.\nТотемная броня (Если зачарованное существо должно быть уничтожено, вместо этого снимите с него все повреждения и уничтожьте эту Ауру.)", "type": "Чары — Аура"}, {"language": "Chinese Simplified", "multiverseId": 466420, "name": "树妖本影", "text": "结附于生物\n所结附的生物得+0/+2，且依照其防御力来分配战斗伤害，而不是依照力量。\n替身甲（如果所结附的生物将被消灭，则改为移除它受到的所有伤害，并消灭此灵气。）", "type": "结界 ～灵气"}, {"language": "Chinese Traditional", "multiverseId": 466674, "name": "樹妖本影", "text": "結附於生物\n所結附的生物得+0/+2，且依照其防禦力來分配戰鬥傷害，而不是依照力量。\n替身甲（如果所結附的生物將被消滅，則改為移除它受到的所有傷害，並消滅此靈氣。）", "type": "結界 ～靈氣"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "225407", "cardKingdomId": "225132", "cardsphereId": "60236", "mcmId": "375702", "mcmMetaId": "271695", "mtgjsonV4Id": "33247d2a-2660-5873-9be5-55aaf5d62161", "mtgoId": "72742", "multiverseId": "464134", "scryfallId": "677166cf-4e1e-43ac-a67b-afaf33c0d14e", "scryfallIllustrationId": "4132dfc9-d8d6-4958-9836-c606b8eaa2b1", "scryfallOracleId": "fa321366-9bc1-48c7-873a-0b12a026ce49", "tcgplayerProductId": "191770"}, "keywords": ["Enchant", "Totem armor"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}", "manaValue": 3.0, "name": "Treefolk Umbra", "number": "185", "originalText": "Enchant creature\nEnchanted creature gets +0/+2 and assigns combat damage equal to its toughness rather than its power.\nTotem armor (If enchanted creature would be destroyed, instead remove all damage from it and destroy this Aura.)", "originalType": "Enchantment — Aura", "printings": ["MH1"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/9ec340e9ab85ec4d", "cardKingdomFoil": "https://mtgjson.com/links/6c15dde5fa81b1b9", "cardmarket": "https://mtgjson.com/links/0c83202a22b256ab", "tcgplayer": "https://mtgjson.com/links/531810a057f3597c"}, "rarity": "common", "rulings": [{"date": "2019-06-14", "text": "Treefolk Umbra’s effect doesn’t actually change the enchanted creature’s power. It changes only the amount of combat damage the creature assigns. All other rules and effects that check power or toughness use the real values. For example, Savage Swipe won’t cause the enchanted creature to fight with its toughness."}, {"date": "2019-06-14", "text": "Totem armor’s effect is mandatory. If the enchanted creature would be destroyed, you must remove all damage from it (if it has any) and destroy the Aura that has totem armor instead."}, {"date": "2019-06-14", "text": "Totem armor’s effect is applied no matter why the enchanted creature would be destroyed: because it’s been dealt lethal damage, or because an effect is trying to destroy it (such as Mob). In either case, all damage is removed from the creature and the Aura is destroyed instead."}, {"date": "2019-06-14", "text": "Totem armor has no effect if the enchanted creature is put into a graveyard for any other reason, such as if it’s sacrificed, if the “legend rule” applies to it, or if its toughness is 0 or less."}, {"date": "2019-06-14", "text": "If a creature has indestructible and is enchanted with an Aura that has totem armor, lethal damage and effects that try to destroy it simply have no effect. Totem armor won’t do anything because it won’t have to."}, {"date": "2019-06-14", "text": "If a creature you control is enchanted with multiple Auras that have totem armor, and the enchanted creature would be destroyed, one of those Auras is destroyed instead—but only one of them. You choose which one because you control the enchanted creature."}, {"date": "2019-06-14", "text": "If a creature enchanted with an Aura that has totem armor would be destroyed by multiple state-based actions at the same time (most likely because a creature with deathtouch has dealt damage to that creature greater than or equal to its toughness), totem armor’s effect will replace all of them and save the creature."}, {"date": "2019-06-14", "text": "If a spell or ability (such as Force of Vigor) would destroy both an Aura with totem armor and the creature it’s enchanting at the same time, totem armor’s effect will save the enchanted creature from being destroyed. The spell or ability will destroy the Aura in two different ways at the same time, but the result is the same as destroying it once."}, {"date": "2019-06-14", "text": "Totem armor’s effect is not regeneration. Specifically, if totem armor’s effect is applied, the enchanted creature does not become tapped and is not removed from combat as a result. Effects that say the enchanted creature can’t be regenerated (as Pillage does) won’t prevent totem armor’s effect from being applied."}], "setCode": "MH1", "subtypes": ["Aura"], "supertypes": [], "text": "Enchant creature\nEnchanted creature gets +0/+2 and assigns combat damage equal to its toughness rather than its power.\nTotem armor (If enchanted creature would be destroyed, instead remove all damage from it and destroy this Aura.)", "type": "Enchantment — Aura", "types": ["Enchantment"], "uuid": "aa1121c3-bc14-548e-a92a-7a3ee5d218b0"}