{"artist": "Svetlin Velinov", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 7.0, "edhrecRank": 4353, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 500798, "name": "Tiefseegraben-Behemoth", "text": "Bringe ein Land, das du kontrollierst, auf die Hand seines Besitzers zurück: Enttappe den Tiefseegraben-Behemoth. Er erhält Fluchsicherheit bis zum Ende des Zuges.\nImmer wenn ein Land unter deiner Kontrolle ins Spiel kommt, greift eine Kreatur deiner Wahl, die ein Gegner kontrolliert, während der nächsten Kampfphase ihres Beherrschers an, falls möglich.", "type": "Kreatur — Krake"}, {"language": "Spanish", "multiverseId": 500804, "name": "Behemot de la fosa oceánica", "text": "Regresar una tierra que controlas a la mano de su propietario: Endereza el Behemot de la fosa oceánica. Gana la habilidad de antimaleficio hasta el final del turno.\nSiempre que una tierra entre al campo de batalla bajo tu control, la criatura objetivo que controla un oponente ataca durante la siguiente fase de combate de su controlador si puede.", "type": "Criatura — Kraken"}, {"language": "French", "multiverseId": 500810, "name": "Béhémoth des abysses", "text": "Renvoyez un terrain que vous contrôlez dans la main de son propriétaire : Dégagez le Béhémoth des abysses. Il acquiert la défense talismanique jusqu'à la fin du tour.\nÀ chaque fois qu'un terrain arrive sur le champ de bataille sous votre contrôle, une créature ciblée qu'un adversaire contrôle attaque pendant la prochaine phase de combat de son contrôleur si possible.", "type": "Créature : kraken"}, {"language": "Italian", "multiverseId": 500816, "name": "Behemoth delle Fosse", "text": "Fai tornare una terra che controlli in mano al suo proprietario: STAPpa il Behemoth delle Fosse. Ha anti-malocchio fino alla fine del turno.\nOgniqualvolta una terra entra nel campo di battaglia sotto il tuo controllo, una creatura bersaglio controllata da un avversario attacca durante la prossima fase di combattimento del suo controllore, se può farlo.", "type": "Creatura — Kraken"}, {"language": "Japanese", "multiverseId": 500822, "name": "海溝のビヒモス", "text": "あなたがコントロールしている土地を１つオーナーの手札に戻す：海溝のビヒモスをアンタップする。ターン終了時まで、これは呪禁を得る。\n土地が１つあなたのコントロール下で戦場に出るたび、対戦相手がコントロールしているクリーチャー１体を対象とする。それのコントローラーの次の戦闘フェイズに、それは可能なら攻撃する。", "type": "クリーチャー — クラーケン"}, {"language": "Portuguese (Brazil)", "multiverseId": 500828, "name": "Behemoth da Fossa", "text": "Devolva um terreno que você controla para a mão de seu dono: Desvire Behemoth da Fossa. Ele ganha resistência a magia até o final do turno.\nToda vez que um terreno entra no campo de batalha sob seu controle, a criatura alvo que um oponente controla ataca durante a próxima fase de combate de seu controlador se estiver apta.", "type": "Criatura — Kraken"}, {"language": "Russian", "multiverseId": 500834, "name": "Исполин из Бездны", "text": "Верните землю под вашим контролем в руку ее владельца: разверните Исполина из Бездны. Он получает Порчеустойчивость до конца хода.\nКаждый раз, когда земля выходит на поле битвы под вашим контролем, целевое существо под контролем оппонента атакует во время следующей фазы боя контролирующего его игрока, если может.", "type": "Существо — Кракен"}, {"language": "Chinese Simplified", "multiverseId": 500840, "name": "海沟贝西摩斯", "text": "将一个由你操控的地移回其拥有者手上：重置海沟贝西摩斯。它获得辟邪异能直到回合结束。\n每当一个地在你的操控下进战场时，目标由对手操控的生物于其操控者的下一个战斗阶段中若能攻击，则必须攻击。", "type": "生物 ～巨海兽"}, {"language": "Chinese Traditional", "multiverseId": 500846, "name": "海溝貝西摩斯", "text": "將一個由你操控的地移回其擁有者手上：重置海溝貝西摩斯。它獲得辟邪異能直到回合結束。\n每當一個地在你的操控下進戰場時，目標由對手操控的生物於其操控者的下一個回合中若能攻擊，則必須攻擊。", "type": "生物 ～巨海獸"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "239349", "cardsphereId": "72606", "mcmId": "514499", "mtgjsonV4Id": "9a3f2156-095e-5126-9133-976e82a1af81", "mtgoId": "85838", "multiverseId": "500792", "scryfallId": "909dc123-8234-4e81-bb7b-77404d94a87c", "scryfallIllustrationId": "c8dad937-c0f0-437c-9be7-7046dc6dae29", "scryfallOracleId": "dc2b1863-b45c-4213-ad89-5e39432daca7", "tcgplayerProductId": "227230"}, "isStarter": true, "keywords": ["Landfall"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{5}{U}{U}", "manaValue": 7.0, "name": "Trench Behemoth", "number": "366", "originalText": "Return a land you control to its owner's hand: Untap Trench Behemoth. It gains hexproof until end of turn.\nWhenever a land enters the battlefield under your control, target creature an opponent controls attacks during its controller's next combat phase if able.", "originalType": "Creature — Kraken", "power": "7", "printings": ["CMR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/5f9e5a9e920b46d0", "tcgplayer": "https://mtgjson.com/links/0d91492afad69354"}, "rarity": "rare", "rulings": [{"date": "2020-11-10", "text": "You can activate Trench Behemoth’s first ability even if it’s already untapped and/or already has hexproof."}, {"date": "2020-11-10", "text": "If the target creature can’t attack for any reason (such as being tapped), then it doesn’t attack. If there’s a cost associated with having it attack, the player isn’t forced to pay that cost, so it doesn’t have to attack in that case either."}, {"date": "2020-11-10", "text": "If the target creature does attack, its controller still chooses which player or planeswalker it attacks, as normal. It can attack opponents who don’t control untapped Trench Behemoths waiting to crush it, if any are available."}], "securityStamp": "oval", "setCode": "CMR", "subtypes": ["Kraken"], "supertypes": [], "text": "Return a land you control to its owner's hand: Untap Trench Behemoth. It gains hexproof until end of turn.\nLandfall — Whenever a land enters the battlefield under your control, target creature an opponent controls attacks during its controller's next combat phase if able.", "toughness": "7", "type": "Creature — Kraken", "types": ["Creature"], "uuid": "cb556a9c-201f-530c-a2c7-b76e27961a32"}