{"artist": "John Zeleznik", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 5376, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 133124, "name": "Fesseltrick", "text": "Sekundenbruchteil (Solange dieser Zauberspruch sich auf dem Stapel befindet, können Spieler keine Zaubersprüche oder aktivierte Fähigkeiten spielen, die keine Manafähigkeiten sind.)\nNeutralisiere eine aktivierte oder ausgelöste Fähigkeit deiner Wahl. Falls auf diese Weise die Fähigkeit einer bleibenden Karte neutralisiert wurde, können aktivierte Fähigkeiten dieser bleibenden Karte in diesem Zug nicht gespielt werden. (Manafähigkeiten können nicht als Ziel bestimmt werden.)", "type": "Spontanzauber"}, {"language": "Spanish", "multiverseId": 134629, "name": "Truco del lazo", "text": "Fracción de segundo (Mientras este hechizo esté en la pila, los jugadores no pueden jugar hechizos o habilidades activadas que no sean habilidades de maná.)\nContrarresta la habilidad activada o disparada objetivo. Si la habilidad de un permanente es contrarrestada de esta manera, las habilidades activadas de ese permanente no pueden jugarse este turno. (Las habilidades de maná no pueden hacerse objetivo.)", "type": "Instantáneo"}, {"language": "French", "multiverseId": 132823, "name": "Trompentrave", "text": "Fraction de seconde (Tant que ce sort est sur la pile, les joueurs ne peuvent pas jouer de sorts ou de capacités activées qui ne sont pas des capacités de mana.)\nContrecarrez la capacité activée ou déclenchée ciblée. Si une capacité d'un permanent est contrecarrée de cette manière, les capacités activées de ce permanent ne peuvent pas être jouées ce tour-ci. (Les capacités de mana ne peuvent pas être ciblées.)", "type": "Éphémère"}, {"language": "Italian", "multiverseId": 133425, "name": "Vincolo Ingannevole", "text": "Battibaleno (Fintanto che questa magia è in pila, i giocatori non possono giocare magie o abilità attivate che non siano abilità di mana.)\nNeutralizza un'abilità attivata o innescata bersaglio. Se viene neutralizzata l'abilità di un permanente in questo modo, le abilità attivate di quel permanente non possono essere giocate in questo turno. (Le abilità di mana non possono essere scelte come bersaglio.)", "type": "Istantaneo"}, {"language": "Japanese", "multiverseId": 133726, "name": "計略縛り", "text": "刹那 （この呪文がスタックにあるかぎり、プレイヤーは呪文やマナ能力でない起動型能力をプレイできない。）\n起動型能力１つか誘発型能力１つを対象とし、それを打ち消す。 これによりパーマネントの能力が打ち消された場合、このターン、そのパーマネントの起動型能力はプレイできない。 （マナ能力は対象にできない。）", "type": "インスタント"}, {"language": "Portuguese (Brazil)", "multiverseId": 134027, "name": "Magiaprisionar", "text": "Fração de segundo (Enquanto esta mágica estiver na pilha, os jogadores não poderão jogar mágicas ou habilidades ativadas que não sejam habilidades de mana.)\nAnule a habilidade ativada ou desencadeada alvo. Se a habilidade de uma permanente for anulada deste modo, as habilidades ativadas daquela permanente não poderão ser jogadas neste turno. (As habilidades de mana não podem ser alvo.)", "type": "Mágica Instantânea"}, {"language": "Russian", "multiverseId": 134328, "name": "Мысленный Трюк", "text": "Мгновение ока (До тех пор пока это заклинание находится в стеке, игроки не могут играть заклинания или активируемые способности, которые не являются мана-способностями.)\nПрервите целевую активируемую или срабатывающую способность. Если способность перманента была прервана таким способом, то активируемые способности этого перманента не могут быть сыграны в этом ходу. (Нельзя прицелиться в мана-способности.)", "type": "Мгновенное заклинание"}, {"language": "Chinese Simplified", "multiverseId": 132522, "name": "诈缚", "text": "转瞬（只要此咒语在堆叠上，牌手便不能使用咒语或不是法术力异能的起动式异能。）\n反击目标起动式或触发式异能。 如果某永久物的异能以此法被反击，则本回合中不能使用该永久物的起动式异能。 （其目标不能是法术力异能）", "type": "瞬间"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "121713", "cardKingdomId": "121423", "cardsphereId": "44814", "mcmId": "14028", "mcmMetaId": "8555", "mtgjsonV4Id": "56488619-b279-548d-abb8-f2fcc5021abe", "mtgoFoilId": "25554", "mtgoId": "25553", "multiverseId": "110499", "scryfallId": "f2e58ff2-dea3-42b3-8c22-3e6202a7d433", "scryfallIllustrationId": "71e624a7-c04a-47a9-b578-e51be1197d6b", "scryfallOracleId": "0c2abd2a-ca98-45d2-8dd1-984d2c0c266a", "tcgplayerProductId": "14406"}, "keywords": ["Split second"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Trickbind", "number": "88", "originalText": "Split second (As long as this spell is on the stack, players can't play spells or activated abilities that aren't mana abilities.)\nCounter target activated or triggered ability. If a permanent's ability is countered this way, activated abilities of that permanent can't be played this turn. (Mana abilities can't be targeted.)", "originalType": "Instant", "printings": ["TSP"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1400ee9e10b08c0b", "cardKingdomFoil": "https://mtgjson.com/links/78e69fc8dbbcc3b5", "cardmarket": "https://mtgjson.com/links/0d6e1e47fb187e56", "tcgplayer": "https://mtgjson.com/links/eaff4f1258c5426c"}, "rarity": "rare", "rulings": [{"date": "2006-09-25", "text": "If Trickbind counters an activated ability of a permanent, no activated abilities of that permanent can be activated for the remainder of the turn. This includes activated abilities other than the one that was countered, as well as any mana abilities that permanent may have. Other abilities of that permanent, including triggered abilities and static abilities, are unaffected."}, {"date": "2006-09-25", "text": "Trickbind can’t counter or prevent paying the morph cost to turn a face-down creature face up, since that action doesn’t use the stack."}, {"date": "2006-09-25", "text": "Trickbind can be used to counter the flanking triggered ability."}, {"date": "2006-09-25", "text": "Trickbind can be used to counter the echo triggered ability. If so, the echo ability won’t trigger again so the echo cost is never paid."}, {"date": "2006-09-25", "text": "Trickbind can be used to counter the suspend “remove a counter” ability. If so, the counter won’t get removed, but the ability will trigger again as normal later on. Trickbind can also be used to counter the suspend “play this card” ability. If so, the card stays exiled (the ability won’t trigger again). Using suspend to exile a card in your hand is neither an activated nor a triggered ability, so it can’t be countered this way."}, {"date": "2006-09-25", "text": "Trickbind can be used to counter the madness triggered ability. The affected card will remain exiled."}, {"date": "2006-09-25", "text": "Trickbind can be used to counter the storm triggered ability. Doing so prevents the copies from being created, but doesn’t counter the original storm spell."}, {"date": "2016-06-08", "text": "Activated abilities contain a colon. They’re generally written “[Cost]: [Effect].” Some keywords are activated abilities and will have colons in their reminder text."}, {"date": "2021-03-19", "text": "Players still get priority while a card with split second is on the stack; their options are just limited to mana abilities and certain special actions."}, {"date": "2021-03-19", "text": "After a spell with split second resolves (or otherwise leaves the stack), players may again cast spells and activate abilities before the next object on the stack resolves."}, {"date": "2021-03-19", "text": "If the resolution of a triggered ability involves casting a spell, that spell can’t be cast if a spell with split second is on the stack."}, {"date": "2021-03-19", "text": "Casting a spell with split second won’t affect spells and abilities that are already on the stack."}, {"date": "2021-03-19", "text": "Split second doesn’t stop triggered abilities from triggering, such as that of Chalice of the Void. If one does, its controller puts it on the stack and chooses targets for it, if any. Those abilities will resolve as normal."}, {"date": "2021-03-19", "text": "Players may turn face-down creatures face up while a spell with split second is on the stack."}], "setCode": "TSP", "subtypes": [], "supertypes": [], "text": "Split second (As long as this spell is on the stack, players can't cast spells or activate abilities that aren't mana abilities.)\nCounter target activated or triggered ability. If a permanent's ability is countered this way, activated abilities of that permanent can't be activated this turn. (Mana abilities can't be targeted.)", "type": "Instant", "types": ["Instant"], "uuid": "d0620205-b895-51dc-9e02-eecf2166758e"}