{"artist": "Izzy", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 6.0, "edhrecRank": 12031, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "238131", "cardsphereId": "71779", "mcmId": "498880", "mcmMetaId": "209855", "mtgjsonV4Id": "a1f30ed6-831f-5824-a057-fbc010e4685d", "scryfallId": "9d258bcc-3379-4f56-b584-be25979e5244", "scryfallIllustrationId": "fef6a272-7721-4c0e-92ad-6eea29c62162", "scryfallOracleId": "48090c64-f41a-447b-ad7a-54e3194f759b", "tcgplayerProductId": "222563"}, "isReprint": true, "keywords": ["Convoke"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{W}{W}", "manaValue": 6.0, "name": "Triplicate Spirits", "number": "38", "printings": ["J22", "M15", "PLIST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6cc285e507928a6c", "cardmarket": "https://mtgjson.com/links/d5dfa4aa504b3edc", "tcgplayer": "https://mtgjson.com/links/65382947d539e620"}, "rarity": "common", "rulings": [{"date": "2014-07-18", "text": "The rules for convoke have changed slightly since it last appeared in an expansion. Previously, convoke reduced the cost to cast a spell. Under current rules, you tap creatures at the same time you pay the spell’s costs. Tapping a creature this way is simply another way to pay."}, {"date": "2014-07-18", "text": "Convoke doesn’t change a spell’s mana cost or converted mana cost."}, {"date": "2014-07-18", "text": "When calculating a spell’s total cost, include any alternative costs, additional costs, or anything else that increases or reduces the cost to cast the spell. Convoke applies after the total cost is calculated."}, {"date": "2014-07-18", "text": "Because convoke isn’t an alternative cost, it can be used in conjunction with alternative costs."}, {"date": "2014-07-18", "text": "Tapping a multicolored creature using convoke will pay for {1} or one mana of your choice of any of that creature’s colors."}, {"date": "2014-07-18", "text": "When using convoke to cast a spell with {X} in its mana cost, first choose the value for X. That choice, plus any cost increases or decreases, will determine the spell’s total cost. Then you can tap creatures you control to help pay that cost. For example, if you cast Chord of Calling (a spell with convoke and mana cost {X}{G}{G}{G}) and choose X to be 3, the total cost is {3}{G}{G}{G}. If you tap two green creatures and two red creatures, you’ll have to pay {1}{G}."}, {"date": "2014-07-18", "text": "If a creature you control has a mana ability with {T} in the cost, activating that ability while casting a spell with convoke will result in the creature being tapped when you pay the spell’s costs. You won’t be able to tap it again for convoke. Similarly, if you sacrifice a creature to activate a mana ability while casting a spell with convoke, that creature won’t be on the battlefield when you pay the spell’s costs, so you won’t be able to tap it for convoke."}], "setCode": "PLIST", "subtypes": [], "supertypes": [], "text": "Convoke (Your creatures can help cast this spell. Each creature you tap while casting this spell pays for {1} or one mana of that creature's color.)\nCreate three 1/1 white Spirit creature tokens with flying. (They can't be blocked except by creatures with flying or reach.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "1634e149-24e5-584d-b4a8-477bd8dc9400"}