{"artist": "Ryan Barger", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["R", "U"], "colors": ["R"], "convertedManaCost": 5.0, "edhrecRank": 11737, "faceConvertedManaCost": 2.0, "faceManaValue": 2.0, "faceName": "Burn", "finishes": ["nonfoil"], "foreignData": [{"faceName": "Burn", "language": "German", "multiverseId": 456259, "name": "Turn // Burn", "text": "Versengen fügt einem Ziel deiner Wahl 2 Schadenspunkte zu.\nFusion (Du kannst eine oder beide Hälften dieser Karte aus deiner Hand wirken.)", "type": "Spontanzauber"}, {"faceName": "Burn", "language": "Spanish", "multiverseId": 456283, "name": "Turn // Burn", "text": "Arder hace 2 puntos de daño a cualquier objetivo.\nFusionar. (Puedes lanzar una o las dos mitades de esta carta desde tu mano.)", "type": "Instantáneo"}, {"faceName": "Burn", "language": "French", "multiverseId": 456307, "name": "Turn // Burn", "text": "Le Brûlage inflige 2 blessures à n'importe quelle cible.\nFusion (Vous pouvez lancer une ou deux moitiés de cette carte depuis votre main.)", "type": "Éphémère"}, {"faceName": "Burn", "language": "Italian", "multiverseId": 456331, "name": "Turn // Burn", "text": "Incendiare infligge 2 danni a un qualsiasi bersaglio.\nFusione (Puoi lanciare una o entrambe le metà di questa carta dalla tua mano.)", "type": "Istantaneo"}, {"faceName": "Burn", "language": "Japanese", "multiverseId": 456355, "name": "Turn // Burn", "text": "クリーチャー１体かプレインズウォーカー１体かプレイヤー１人を対象とする。点火はそれに２点のダメージを与える。\n融合（あなたはこのカードの片方の半分または両方の半分をあなたの手札から唱えてもよい。）", "type": "インスタント"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardsphereId": "57547", "mcmId": "365269", "mtgjsonV4Id": "03935bdb-2cf6-5f9d-a402-1bd5ea800301", "multiverseId": "456235", "scryfallId": "01ce2601-ae94-4ab5-bbd2-65f47281ca28", "scryfallIllustrationId": "6f292968-be9f-469f-9491-f455c57a5149", "scryfallOracleId": "41841bbf-1c51-494b-b299-c997cce88e44", "tcgplayerProductId": "177342"}, "isReprint": true, "isStarter": true, "keywords": ["Fuse"], "language": "English", "layout": "split", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}", "manaValue": 5.0, "name": "Turn // Burn", "number": "45", "originalText": "Burn deals 2 damage to any target.\n\nFuse (You may cast one or both halves of this card from your hand.)", "originalType": "Instant", "otherFaceIds": ["e971d6ad-d2cc-5c26-af87-efd53971d646"], "printings": ["DGM", "GK1"], "purchaseUrls": {"tcgplayer": "https://mtgjson.com/links/ee474d1f805a767b"}, "rarity": "uncommon", "rulings": [{"date": "2013-04-15", "text": "Turn will cause the creature lose all other colors and creature types, but it will retain any other card types (such as artifact) it may have."}, {"date": "2013-04-15", "text": "Turn overwrites all previous effects that set the targeted creature’s power or toughness to specific values. Effects that set its power or toughness to specific values that start to apply after Turn resolves will overwrite this effect."}, {"date": "2013-04-15", "text": "Turn doesn’t counter abilities that have already triggered or been activated. In particular, there is no way to cast this to stop a creature’s “At the beginning of your upkeep” or “When this creature enters the battlefield” abilities from triggering."}, {"date": "2013-04-15", "text": "If the affected creature gains an ability after Turn resolves, it will keep that ability."}, {"date": "2013-04-15", "text": "Effects that modify the targeted creature’s power or toughness, such as the effects of Phytoburst or Legion’s Initiative, will apply to it no matter when they started to take effect. The same is true for counters that change the creature’s power or toughness (such as +1/+1 counters) and effects that switch its power and toughness."}, {"date": "2013-04-15", "text": "If you’re casting a split card with fuse from any zone other than your hand, you can’t cast both halves. You’ll only be able to cast one half or the other."}, {"date": "2013-04-15", "text": "To cast a fused split spell, pay both of its mana costs. While the spell is on the stack, its converted mana cost is the total amount of mana in both costs."}, {"date": "2013-04-15", "text": "You can choose the same object as the target of each half of a fused split spell, if appropriate."}, {"date": "2013-04-15", "text": "When resolving a fused split spell with multiple targets, treat it as you would any spell with multiple targets. If all targets are illegal when the spell tries to resolve, the spell doesn’t resolve and none of its effects happen. If at least one target is still legal at that time, the spell resolves, but an illegal target can’t perform any actions or have any actions performed on it."}, {"date": "2013-04-15", "text": "When a fused split spell resolves, follow the instructions of the left half first, then the instructions on the right half."}, {"date": "2013-04-15", "text": "On the stack, a split spell that hasn’t been fused has only that half’s characteristics and converted mana cost. The other half is treated as though it didn’t exist."}, {"date": "2013-04-15", "text": "Some split cards with fuse have two monocolor halves of different colors. If such a card is cast as a fused split spell, the resulting spell is multicolored. If only one half is cast, the spell is the color of that half. While not on the stack, such a card is multicolored."}, {"date": "2013-04-15", "text": "Some split cards with fuse have two halves that are both multicolored. That card is multicolored no matter which half is cast, or if both halves are cast. It’s also multicolored while not on the stack."}, {"date": "2013-04-15", "text": "If a player names a card, the player may name either half of a split card, but not both. A split card has the chosen name if one of its two names matches the chosen name."}, {"date": "2013-04-15", "text": "If you cast a split card with fuse from your hand without paying its mana cost, you can choose to use its fuse ability and cast both halves without paying their mana costs."}], "setCode": "GK1", "side": "b", "subtypes": [], "supertypes": [], "text": "Burn deals 2 damage to any target.\nFuse (You may cast one or both halves of this card from your hand.)", "type": "Instant", "types": ["Instant"], "uuid": "384e4e0b-481b-5b31-86af-35ef69bf43be", "watermark": "izzet"}