{"artist": "Chase Stone", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 1085, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 381018, "name": "Zwillingsflamme", "text": "Streben — Zwillingsflamme kostet beim Wirken für jedes Ziel außer dem ersten {2}{R} mehr.\nBestimme eine beliebige Anzahl an Kreaturen deiner Wahl, die du kontrollierst. Bringe für jede dieser Kreaturen einen Spielstein ins Spiel, der eine Kopie dieser Kreatur ist. Diese Spielsteine haben Eile. Schicke sie zu Beginn des nächsten Endsegments ins Exil.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 382173, "name": "Gemelo ígneo", "text": "Esfuerzo — Lanzar el Gemelo ígneo cuesta {2}{R} más por cada objetivo después del primero.\nElige cualquier cantidad de criaturas objetivo que controlas. Por cada una de ellas, pon en el campo de batalla una ficha que es una copia de esa criatura. Esas fichas tienen la habilidad de prisa. Exílialas al comienzo del próximo paso final.", "type": "Conjuro"}, {"language": "French", "multiverseId": 381183, "name": "Pyrojumeau", "text": "Obstination — Le Pyrojumeau coûte {2}{R} de plus à lancer pour chaque cible après la première.\nChoisissez n'importe quel nombre de créatures ciblées que vous contrôlez. Pour chacune d'elles, mettez sur le champ de bataille un jeton qui est une copie de cette créature. Ces jetons ont la célérité. Exilez-les au début de la prochaine étape de fin.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 381348, "name": "Fiamma Gemella", "text": "Sforzo — La Fiamma Gemella costa {2}{R} in più per essere lanciata per ogni bersaglio oltre il primo.\nScegli un qualsiasi numero di creature bersaglio che controlli. Per ognuna di esse, metti sul campo di battaglia una pedina che è una copia di quella creatura. Quelle pedine hanno rapidità. Esiliale all'inizio della prossima sottofase finale.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 381513, "name": "双つ身の炎", "text": "奮励 ― 双つ身の炎を唱えるためのコストは、２つ目以降の対象１つにつき{2}{R}多くなる。\nあなたがコントロールする望む数のクリーチャーを対象とする。それら１体につき、それのコピーであるトークンを１体戦場に出す。それらのトークンは速攻を持つ。次の終了ステップの開始時に、それらをすべて追放する。", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 381678, "name": "쌍둥이 불꽃", "text": "분투 — 쌍둥이 불꽃은 한 개를 초과하는 목표의 수만큼 발동하는 데 {2}{R}씩 비용이 더 든다.\n당신이 조종하는 생물을 원하는 수만큼 목표로 선택한다. 목표로 한 각 생물마다, 그 생물의 복사본인 토큰 한 개를 전장에 놓는다. 그 토큰들은 신속을 가진다. 다음 종료단 시작에 그 토큰들을 추방한다.", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 381843, "name": "Gêmeo Incandescente", "text": "Esforço — Gêmeo Incandescente custa {2}{R} a mais para ser conjurado para cada alvo além do primeiro.\nEscolha qualquer número de criaturas alvo que você controla. Para cada uma delas, coloque no campo de batalha uma ficha que seja uma cópia daquela criatura. Aquelas fichas têm ímpeto. Exile-as no início da próxima etapa final.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 382008, "name": "Пламенный Двойник", "text": "Стремление — За каждую цель после первой разыгрывание Пламенного Двойника стоит на {2}{R} больше.\nВыберите любое количество целевых существ под вашим контролем. Для каждого из них положите на поле битвы одну фишку, являющуюся копией того существа. У тех фишек есть Ускорение. Изгоните их в начале следующего заключительного шага.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 380688, "name": "焰塑双身", "text": "积力～焰塑双身在第一个目标之外每有一个目标，便增加{2}{R}来施放。\n选择任意数量目标由你操控的生物。对每个这类生物而言，各将一个衍生物放进战场，此衍生物为该生物的复制品。这些衍生物具有敏捷异能。在下一个结束步骤开始时，将它们放逐。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 380853, "name": "焰塑雙身", "text": "積力～焰塑雙身在第一個目標之外每有一個目標，便增加{2}{R}來施放。\n選擇任意數量目標由你操控的生物。對每個這類生物而言，各將一個衍生物放進戰場，此衍生物為該生物的複製品。這些衍生物具有敏捷異能。在下一個結束步驟開始時，將它們放逐。", "type": "巫術"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "194226", "cardKingdomId": "193967", "cardsphereId": "22301", "mcmId": "266630", "mcmMetaId": "209526", "mtgjsonV4Id": "c70091d3-7176-5ba6-ace8-96bf1e930e69", "mtgoFoilId": "52241", "mtgoId": "52240", "multiverseId": "380523", "scryfallId": "207128b3-2de3-495a-bf29-eec50c3bd752", "scryfallIllustrationId": "cc7ddbed-f5b2-4b97-990a-255a3f2a8f3d", "scryfallOracleId": "83cf1169-5853-4332-b897-7b17d72d76ab", "tcgplayerProductId": "82238"}, "keywords": ["Strive"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R}", "manaValue": 2.0, "name": "Twinflame", "number": "115", "originalText": "Strive — Twinflame costs {2}{R} more to cast for each target beyond the first.\nChoose any number of target creatures you control. For each of them, put a token that's a copy of that creature onto the battlefield. Those tokens have haste. Exile them at the beginning of the next end step.", "originalType": "Sorcery", "printings": ["2X2", "JOU"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7209cde77fb29e82", "cardKingdomFoil": "https://mtgjson.com/links/afcde0e33681cfe1", "cardmarket": "https://mtgjson.com/links/eda52da0f1920d93", "tcgplayer": "https://mtgjson.com/links/81125ced8d5482de"}, "rarity": "rare", "rulings": [{"date": "2014-04-26", "text": "The tokens copy exactly what was printed on the original creature and nothing else (unless that permanent is copying something else or is a token; see below). It doesn't copy whether that creature is tapped or untapped, whether it has any counters on it or Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, and so on."}, {"date": "2014-04-26", "text": "If the copied creature has {X} in its mana cost, X is considered to be 0."}, {"date": "2014-04-26", "text": "If the copied creature is copying something else (for example, if the copied creature is a Clone), then the token enters the battlefield as whatever that creature copied."}, {"date": "2014-04-26", "text": "If the copied creature is a token, the token created by Twinflame copies the original characteristics of that token as stated by the effect that put that token onto the battlefield."}, {"date": "2014-04-26", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when the token enters the battlefield. Any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities of the copied creature will also work."}, {"date": "2014-04-26", "text": "The tokens see each other enter the battlefield. If any of them have a triggered ability that triggers whenever a creature enters the battlefield, they'll trigger for one another."}, {"date": "2014-04-26", "text": "If another creature becomes or enters the battlefield as a copy of the token, that creature will have haste, but you won't exile it. However, if Twinflame creates multiple tokens copying a single creature due to a replacement effect (like the one Doubling Season creates), you'll exile each of them."}, {"date": "2014-04-26", "text": "You choose how many targets each spell with a strive ability has and what those targets are as you cast it. It's legal to cast such a spell with no targets, although this is rarely a good idea. You can't choose the same target more than once for a single strive spell."}, {"date": "2014-04-26", "text": "The mana cost and mana value of strive spells don't change no matter how many targets they have. Strive abilities affect only what you pay."}, {"date": "2014-04-26", "text": "If all of the spell's targets are illegal when the spell tries to resolve, it won't resolve and none of its effects will happen. If one or more of its targets are legal when it tries to resolve, the spell will resolve and affect only those legal targets. It will have no effect on any illegal targets."}, {"date": "2014-04-26", "text": "If such a spell is copied, and the effect that copies the spell allows a player to choose new targets for the copy, the number of targets can't be changed. The player may change any number of the targets, including all of them or none of them. If, for one of the targets, the player can't choose a new legal target, then it remains unchanged (even if the current target is illegal)."}, {"date": "2014-04-26", "text": "If a spell or ability allows you to cast a strive spell without paying its mana cost, you must pay the additional costs for any targets beyond the first."}], "setCode": "JOU", "subtypes": [], "supertypes": [], "text": "Strive — This spell costs {2}{R} more to cast for each target beyond the first.\nChoose any number of target creatures you control. For each of them, create a token that's a copy of that creature, except it has haste. Exile those tokens at the beginning of the next end step.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "c28f4206-0029-533d-823f-26e882fbb2a2"}