{"artist": "Mike Bierek", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 1084, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 560212, "name": "Verdoppelnder Stab", "text": "Falls du einen Zauberspruch ein- oder mehrmals kopieren würdest, kopiere ihn stattdessen so oft plus ein weiteres Mal. Du kannst neue Ziele für die zusätzliche Kopie bestimmen.\n{7}, {T}: Kopiere einen Spontanzauber oder eine Hexerei deiner Wahl, den bzw. die du kontrollierst. Du kannst neue Ziele für die Kopie bestimmen.", "type": "Artefakt"}, {"language": "Spanish", "multiverseId": 560469, "name": "Cetro duplicador", "text": "Si fueras a copiar un hechizo una o más veces, en vez de eso, cópialo esa cantidad de veces más una vez más. Puedes elegir nuevos objetivos para la copia adicional.\n{7}, {T}: Copia el hechizo de instantáneo o de conjuro objetivo que controlas. Puedes elegir nuevos objetivos para la copia.", "type": "Artefacto"}, {"language": "French", "multiverseId": 560726, "name": "Bâton dédoublant", "text": "Si vous deviez copier un sort au moins une fois, à la place copiez-le autant de fois plus une fois supplémentaire. Vous pouvez choisir de nouvelles cibles pour la copie supplémentaire.\n{7}, {T} : Copiez un sort d'éphémère ou de rituel ciblé que vous contrôlez. Vous pouvez choisir de nouvelles cibles pour cette copie.", "type": "Artefact"}, {"language": "Italian", "multiverseId": 560983, "name": "Bastone Sdoppiante", "text": "Se stai per copiare una magia una o più volte, invece copiala una volta in più. Puoi scegliere nuovi bersagli per la copia addizionale.\n{7}, {T}: Copia una magia istantaneo o stregoneria bersaglio che controlli. Puoi scegliere nuovi bersagli per la copia.", "type": "Artefatto"}, {"language": "Japanese", "multiverseId": 561240, "name": "双晶の杖", "text": "あなたが呪文１つを１回以上コピーするなら、代わりに、それをその回数に加えて追加でもう１回コピーする。あなたはその追加のコピーの新しい対象を選んでもよい。\n{7}, {T}：あなたがコントロールしていてインスタントやソーサリーである呪文１つを対象とする。それをコピーする。あなたはそのコピーの新しい対象を選んでもよい。", "type": "アーティファクト"}, {"language": "Portuguese (Brazil)", "multiverseId": 561497, "name": "Cajado Gemelar", "text": "Se você copiaria uma mágica uma ou mais vezes, em vez disso, copie aquela mágica aquela quantidade de vezes mais uma vez adicional. Você pode escolher novos alvos para a cópia adicional.\n{7}, {T}: Copie a mágica instantânea ou o feitiço alvo que você controla. Você pode escolher novos alvos para a cópia.", "type": "Artefato"}, {"language": "Russian", "multiverseId": 561754, "name": "Раздваивающий Посох", "text": "Если вы должны скопировать заклинание один или несколько раз, вместо этого скопируйте его столько же раз плюс один дополнительный раз. Вы можете выбрать новые цели для той дополнительной копии.\n{7}, {T}: скопируйте целевое мгновенное заклинание или заклинание волшебства под вашим контролем. Вы можете выбрать новые цели для той копии.", "type": "Артефакт"}, {"language": "Chinese Simplified", "multiverseId": 562011, "name": "双身杖", "text": "如果你将把某咒语复制一次或数次，则改为如此复制加上额外复制一次。你可以为该额外的复制品选择新的目标。\n{7}，{T}：复制目标由你操控的瞬间或法术咒语。你可以为该复制品选择新的目标。", "type": "神器"}, {"language": "Chinese Traditional", "multiverseId": 562268, "name": "雙身杖", "text": "如果你將把某咒語複製一次或數次，則改為如此複製加上額外複製一次。你可以為該額外的複製品選擇新的目標。\n{7}，{T}：複製目標由你操控的瞬間或巫術咒語。你可以為該複製品選擇新的目標。", "type": "神器"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "259433", "cardsphereId": "87187", "mcmId": "652967", "mtgjsonV4Id": "7bb53cff-10e5-506a-848f-0f4fe1f140b4", "multiverseId": "559955", "scryfallId": "5cdcc324-1427-453c-9940-c21f5d04c997", "scryfallIllustrationId": "552df54e-b368-4d29-8c8e-6726e1d2e8dc", "scryfallOracleId": "3ca8113b-f5b8-41a7-aae6-ebb32554dfe3", "tcgplayerProductId": "269353"}, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}", "manaValue": 3.0, "name": "Twinning Staff", "number": "383", "originalText": "If you would copy a spell one or more times, instead copy it that many times plus an additional time. You may choose new targets for the additional copy.\n{7}, {T}: Copy target instant or sorcery spell you control. You may choose new targets for the copy.", "originalType": "Artifact", "printings": ["C20", "NCC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/b2df87b1466ff1c4", "tcgplayer": "https://mtgjson.com/links/7cff2e5bbce1b5ef"}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "If the spell that's copied has an X whose value was determined as it was cast, the copy will have the same value of X."}, {"date": "2020-04-17", "text": "If the spell has damage divided as it was cast (like Mythos of Vadrok), the division can't be changed, although the targets receiving that damage still can. The same is true of spells that distribute counters."}, {"date": "2020-04-17", "text": "You choose whether the additional copy is put onto the stack before or after the original copy. If a spell is being copied more than once, you can even have the additional copy put onto the stack in between the original copies."}, {"date": "2020-04-17", "text": "If you have a second Twinning Staff, copying a spell results in two additional copies. If you have a third, you get three additional copies, and so on."}, {"date": "2020-04-17", "text": "If an effect copies a card rather than a spell (such as that of God-Eternal Kefnet), this doesn't cause an additional copy to be created."}, {"date": "2020-04-17", "text": "Twinning Staff's last ability can copy any instant or sorcery spell you control, not just one with targets."}, {"date": "2020-04-17", "text": "The copy is created on the stack, so it's not “cast.” Abilities that trigger when a player casts a spell won't trigger. It will resolve before the original spell does."}, {"date": "2020-04-17", "text": "The copy will have the same targets as the spell it's copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can't choose a new legal target, then it remains unchanged (even if the current target is illegal)."}, {"date": "2020-04-17", "text": "If the spell that's copied is modal (that is, it says “Choose one —” or the like), the copy will have the same mode. A different mode can't be chosen."}, {"date": "2020-04-17", "text": "You may choose new targets for the additional copy, even if you can't choose new targets for the original copy or copies."}, {"date": "2020-04-17", "text": "The controller of a copy can't choose to pay any alternative or additional costs for the copy. However, effects based on any alternative or additional costs that were paid for the original spell are copied as though those same costs were paid for the copy."}], "securityStamp": "oval", "setCode": "NCC", "subtypes": [], "supertypes": [], "text": "If you would copy a spell one or more times, instead copy it that many times plus an additional time. You may choose new targets for the additional copy.\n{7}, {T}: Copy target instant or sorcery spell you control. You may choose new targets for the copy.", "type": "Artifact", "types": ["Artifact"], "uuid": "eeeabbd7-adde-5505-a593-bf18765dfbf1"}