{"artist": "Vincent Proce", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 3.0, "edhrecRank": 8521, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 476623, "name": "Tymaret ruft die Toten", "text": "(Je eine Sagenmarke beim Ins-Spiel-Kommen und nach deinem Ziehsegment. Opfern nach III.)\nI, II — Lege die obersten drei Karten deiner Bibliothek auf deinen Friedhof. Dann kannst du eine Kreaturen- oder Verzauberungskarte aus deinem Friedhof ins Exil schicken. Falls du dies tust, erzeuge einen 2/2 schwarzen Zombie-Kreaturenspielstein.\nIII — Du erhältst X Lebenspunkte dazu und wendest Hellsicht X an, wobei X gleich der Anzahl an Zombies ist, die du kontrollierst.", "type": "Verzauberung — Sage"}, {"language": "Spanish", "multiverseId": 476877, "name": "Tymaret llama a los muertos", "text": "(En cuanto esta Saga entre y después de tu paso de robar, agrega un contador de sabiduría. Sacrifícala después de III.)\nI, II — Pon las tres primeras cartas de tu biblioteca en tu cementerio. Luego puedes exiliar una carta de criatura o de encantamiento de tu cementerio. Si lo haces, crea una ficha de criatura Zombie negra 2/2.\nIII — Ganas X vidas y adivinas X, donde X es la cantidad de Zombies que controlas.", "type": "Encantamiento — Saga"}, {"language": "French", "multiverseId": 477131, "name": "Tymaret appelle les morts", "text": "(Au moment où cette saga arrive sur le champ de bataille et après votre étape de pioche, ajoutez un marqueur « sapience ». Sacrifiez après III.)\nI, II — Mettez les trois cartes du dessus de votre bibliothèque dans votre cimetière. Vous pouvez ensuite exiler une carte de créature ou d'enchantement depuis votre cimetière. Si vous faites ainsi, créez un jeton de créature 2/2 noire Zombie.\nIII — Vous gagnez X points de vie et regard X, X étant le nombre de zombies que vous contrôlez.", "type": "Enchantement : saga"}, {"language": "Italian", "multiverseId": 477385, "name": "Tymaret Evoca i Morti", "text": "(Mentre questa Saga entra e dopo la tua sottofase di acquisizione, aggiungi un segnalino sapere. Sacrifica dopo III.)\nI, II — Metti nel tuo cimitero le prime tre carte del tuo grimorio. Poi puoi esiliare una carta creatura o incantesimo dal tuo cimitero. Se lo fai, crea una pedina creatura Zombie 2/2 nera.\nIII — Guadagni X punti vita e profetizzi X, dove X è il numero di Zombie che controlli.", "type": "Incantesimo — Saga"}, {"language": "Japanese", "multiverseId": 477639, "name": "ティマレット、死者を呼び出す", "text": "（この英雄譚が出た際とあなたのドロー・ステップの後に、伝承カウンターを１個加える。IIIの後に、生け贄に捧げる。）\nI, II ― あなたのライブラリーの一番上からカードを３枚あなたの墓地に置く。その後、あなたはあなたの墓地からクリーチャーかエンチャントであるカード１枚を追放してもよい。そうしたなら、黒の２/２のゾンビ・クリーチャー・トークンを１体生成する。\nIII ― あなたはＸ点のライフを得て占術Ｘを行う。Ｘはあなたがコントロールしているゾンビの総数に等しい。", "type": "エンチャント — 英雄譚"}, {"language": "Korean", "multiverseId": 477893, "name": "티마렛이 망자를 부르다", "text": "(이 서사시가 들어오면서 그리고 당신의 뽑기단 후에, 전승 카운터 한 개를 추가한다. III 이후에 희생한다.)\nI, II — 당신의 서고 맨 위 카드 세 장을 당신의 무덤에 넣는다. 그 후 당신은 당신의 무덤에서 생물 또는 부여마법 카드 한 장을 추방할 수 있다. 그렇게 한다면, 2/2 흑색 좀비 생물 토큰 한 개를 만든다.\nIII — 당신은 생명 X점을 얻고 점술 X를 한다. X는 당신이 조종하는 좀비의 수이다.", "type": "부여마법 — 서사시"}, {"language": "Portuguese (Brazil)", "multiverseId": 478147, "name": "Tymaret Convoca os Mortos", "text": "(Conforme esta Saga entra e após sua etapa de compra, adicione um marcador de conhecimento. Sacrifique-a após III.)\nI, II — Coloque os três cards do topo de seu grimório em seu cemitério. Em seguida, você pode exilar um card de criatura ou encantamento de seu cemitério. Se fizer isso, crie uma ficha de criatura preta 2/2 do tipo Zumbi.\nIII — Você ganha X pontos de vida e usa vidência X, sendo X o número de Zumbis que você controla.", "type": "Encantamento — Saga"}, {"language": "Russian", "multiverseId": 478401, "name": "Тимарет Созывает Мертвых", "text": "(При выходе этой Саги и после вашего шага взятия карты добавьте один жетон знаний. Пожертвуйте после III.)\nI, II — Положите три верхние карты вашей библиотеки на ваше кладбище. Затем вы можете изгнать карту существа или чар из вашего кладбища. Если вы это делаете, создайте одну фишку существа 2/2 черный Зомби.\nIII — Вы получаете X жизней и предсказываете X, где X — количество Зомби под вашим контролем.", "type": "Чары — Сага"}, {"language": "Chinese Simplified", "multiverseId": 478655, "name": "提玛瑞召亡录", "text": "（于此传纪进战场时及于你抓牌步骤后，加一个学问指示物。到III后牺牲之。）\nI, II — 将你牌库顶的三张牌置入你的坟墓场。然后你可以从你的坟墓场放逐一张生物或结界牌。若你如此作，则派出一个2/2黑色灵俑衍生生物。\nIII — 你获得X点生命且占卜X，X为由你操控的灵俑数量。", "type": "结界 ～传纪"}, {"language": "Chinese Traditional", "multiverseId": 478909, "name": "提瑪瑞召亡錄", "text": "（於此傳紀進戰場時及於你抽牌步驟後，加一個學問指示物。到III後犧牲之。）\nI, II — 將你牌庫頂的三張牌置入你的墳墓場。然後你可以從你的墳墓場放逐一張生物或結界牌。若你如此作，則派出一個2/2黑色殭屍衍生生物。\nIII — 你獲得X點生命且占卜X，X為由你操控的殭屍數量。", "type": "結界 ～傳紀"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "231062", "cardKingdomId": "230728", "cardsphereId": "65453", "mcmId": "430084", "mcmMetaId": "290819", "mtgArenaId": "70629", "mtgjsonV4Id": "66f708b2-f4cb-5204-9011-b0d930314c02", "mtgoId": "79360", "multiverseId": "476369", "scryfallId": "68c0d087-540a-4249-9265-f13cc8e776ea", "scryfallIllustrationId": "2beb32a3-8323-408a-9f59-1be0535e85e4", "scryfallOracleId": "1d09ebb7-c4c9-4bb7-b6bf-3c8330b954e8", "tcgplayerProductId": "206625"}, "keywords": ["Mill", "Scry"], "language": "English", "layout": "saga", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}", "manaValue": 3.0, "name": "Tymaret Calls the Dead", "number": "118", "originalText": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI, II — Put the top three cards of your library into your graveyard. Then you may exile a creature or enchantment card from your graveyard. If you do, create a 2/2 black Zombie creature token.\nIII — You gain X life and scry X, where X is the number of Zombies you control.", "originalType": "Enchantment — Saga", "printings": ["PTHB", "THB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/b2c6d8201aef0ff4", "cardKingdomFoil": "https://mtgjson.com/links/64285f0b2fe4d267", "cardmarket": "https://mtgjson.com/links/47922d7f49d3a7e9", "tcgplayer": "https://mtgjson.com/links/07e49bc28b7d3268"}, "rarity": "rare", "rulings": [{"date": "2020-01-24", "text": "The card that you exile for the first two chapter abilities may be one of the cards that you just put into your graveyard."}, {"date": "2020-01-24", "text": "While resolving the first two chapter abilities, you can’t exile multiple cards to create multiple Zombies."}, {"date": "2020-01-24", "text": "If X is greater than the number of cards in your library while resolving the third chapter ability, you look at your entire library and put it back in any order. You still gain life equal to the full value of X."}, {"date": "2020-01-24", "text": "As a Saga enters the battlefield, its controller puts a lore counter on it. As your precombat main phase begins (immediately after your draw step), you put another lore counter on each Saga you control. Putting a lore counter on a Saga in either of these ways doesn’t use the stack."}, {"date": "2020-01-24", "text": "Each symbol on the left of a Saga’s text box represents a chapter ability. A chapter ability is a triggered ability that triggers when a lore counter that is put on the Saga causes the number of lore counters on the Saga to become equal to or greater than the ability’s chapter number. Chapter abilities are put onto the stack and may be responded to."}, {"date": "2020-01-24", "text": "A chapter ability doesn’t trigger if a lore counter is put on a Saga that already had a number of lore counters greater than or equal to that chapter’s number. For example, the third lore counter put on a Saga causes the III chapter ability to trigger, but I and II won’t trigger again."}, {"date": "2020-01-24", "text": "Once a chapter ability has triggered, the ability on the stack won’t be affected if the Saga gains or loses counters, or if it leaves the battlefield."}, {"date": "2020-01-24", "text": "If multiple chapter abilities trigger at the same time, their controller puts them on the stack in any order. If any of them require targets, those targets are chosen as you put the abilities on the stack, before any of those abilities resolve."}, {"date": "2020-01-24", "text": "Removing lore counters won’t cause a previous chapter ability to trigger. If lore counters are removed from a Saga, the appropriate chapter abilities will trigger again when the Saga receives lore counters."}, {"date": "2020-01-24", "text": "Once the number of lore counters on a Saga is greater than or equal to the greatest number among its chapter abilities, the Saga’s controller sacrifices it as soon as its chapter ability has left the stack, most likely by resolving or being countered. This state-based action doesn’t use the stack."}], "securityStamp": "oval", "setCode": "THB", "subtypes": ["Saga"], "supertypes": [], "text": "(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI, II — Mill three cards. Then you may exile a creature or enchantment card from your graveyard. If you do, create a 2/2 black Zombie creature token.\nIII — You gain X life and scry X, where X is the number of Zombies you control.", "type": "Enchantment — Saga", "types": ["Enchantment"], "uuid": "b0067ca9-1abb-57fa-8894-651fb74a73a9"}