{"artist": "Matt Stewart", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 4740, "finishes": ["nonfoil", "foil"], "flavorText": "\"I have found the courage to face death—twice, if I must.\"", "foreignData": [{"flavorText": "„Ich habe den Mut aufgebracht, dem Tod entgegenzutreten — zur Not sogar zweimal.\"", "language": "German", "multiverseId": 217302, "name": "Schattenhafter Mystiker", "text": "Auren, die an bleibende Karten angelegt sind, die du kontrollierst, haben Totembeistand. (Falls eine verzauberte bleibende Karte, die du kontrollierst, zerstört würde, entferne stattdessen allen Schaden von ihr und zerstöre eine an sie angelegte Aura.)", "type": "Kreatur — Mensch, Zauberer"}, {"flavorText": "\"Encontré el valor para enfrentarme a la muerte... dos veces si hace falta.\"", "language": "Spanish", "multiverseId": 217054, "name": "Mística de la umbra", "text": "Las auras anexadas a los permanentes que controlas tienen la habilidad de armadura tótem. (Si un permanente encantado que controlas fuera a ser destruido, en vez de eso, remueve todo el daño sobre él y destruye el aura anexada a él.)", "type": "Criatura — Hechicero humano"}, {"flavorText": "« J'ai trouvé le courage d'affronter la mort — deux fois, s'il le faut. »", "language": "French", "multiverseId": 215566, "name": "Mystique des ombres", "text": "Les auras attachées aux permanents que vous contrôlez ont l'armure totémique. (Si un permanent enchanté que vous contrôlez devait être détruit, à la place, retirez toutes ses blessures et détruisez une aura qui y est attachée.)", "type": "Créature : humain et sorcier"}, {"flavorText": "\"Ho trovato il coraggio per affrontare la morte... anche due volte, se devo.\"", "language": "Italian", "multiverseId": 216310, "name": "Mistica delle Essenze", "text": "Le Aure assegnate ai permanenti che controlli hanno armatura totem. (Se un permanente incantato che controlli sta per essere distrutto, rimuovi invece tutto il danno da esso e distruggi un'Aura assegnata ad esso.)", "type": "Creatura — Mago Umano"}, {"flavorText": "「死に立ち向かう勇気ができた――必要なら、二度だとて。」", "language": "Japanese", "multiverseId": 216558, "name": "陰影の神秘家", "text": "あなたがコントロールするパーマネントにつけられているオーラは族霊鎧を持つ。 （あなたがコントロールするエンチャントされているパーマネントが破壊される場合、代わりにそれからすべてのダメージを取り除いて、それにつけられているオーラを１つ破壊する。）", "type": "クリーチャー — 人間・ウィザード"}, {"flavorText": "\"Encontrei a coragem de enfrentar a morte — duas vezes, se for preciso.\"", "language": "Portuguese (Brazil)", "multiverseId": 216806, "name": "Místico da Sombra", "text": "As auras anexadas a permanentes que você controla têm armadura de totem. (Se uma permanente encantada que você controla seria destruída, em vez disso remova todo o dano dela e destrua uma Aura anexada a ela.)", "type": "Criatura — Humano Mago"}, {"flavorText": "«Я имею смелость посмотреть смерти в лицо — дважды, если придется».", "language": "Russian", "multiverseId": 215814, "name": "Мистик Духов", "text": "Ауры, прикрепленные к перманентам под вашим контролем, имеют Тотемную броню. (Если зачарованный перманент под вашим контролем должен быть уничтожен, вместо этого снимите с него все повреждения и уничтожьте прикрепленную к нему Ауру.)", "type": "Существо — Человек Чародей"}, {"flavorText": "「我已找到面对死亡的勇气～如果有必要的话还可以面对两次。」", "language": "Chinese Simplified", "multiverseId": 216062, "name": "本影秘教徒", "text": "结附于由你操控之永久物上的灵气具有替身甲异能。 （如果所结附的永久物将被消灭，则改为移除它受过的所有伤害，并消灭结附它的一个灵气。）", "type": "生物～人类／法术师"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "131016", "cardKingdomId": "130775", "cardsphereId": "39829", "mcmId": "22630", "mcmMetaId": "11307", "mtgjsonV4Id": "d67ea986-c57e-52c9-a39b-2152c39f21ee", "mtgoFoilId": "36353", "mtgoId": "36352", "multiverseId": "193416", "scryfallId": "a55705d3-8640-478e-ace4-f4f900d617c5", "scryfallIllustrationId": "4aa9a150-ab4f-4b06-86a0-ddd058250c76", "scryfallOracleId": "c0a4f47c-c7f9-4b95-aa1b-30580e4cf030", "tcgplayerProductId": "34746"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}", "manaValue": 3.0, "name": "Umbra Mystic", "number": "52", "originalText": "Auras attached to permanents you control have totem armor. (If an enchanted permanent you control would be destroyed, instead remove all damage from it and destroy an Aura attached to it.)", "originalType": "Creature — Human Wizard", "power": "2", "printings": ["ROE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/0c89e15002fede96", "cardKingdomFoil": "https://mtgjson.com/links/65fe9f7d32d87d26", "cardmarket": "https://mtgjson.com/links/9aa8227aad78517c", "tcgplayer": "https://mtgjson.com/links/aa3ca576df7de69c"}, "rarity": "rare", "rulings": [{"date": "2010-06-15", "text": "If a creature enchanted with an Aura that has totem armor would be destroyed by multiple state-based actions at the same time the totem armor’s effect will replace all of them and save the creature."}, {"date": "2010-06-15", "text": "If a spell or ability (such as Planar Cleansing) would destroy both an Aura with totem armor and the permanent it’s enchanting at the same time, totem armor’s effect will save the enchanted permanent from being destroyed. Instead, the spell or ability will destroy the Aura in two different ways at the same time, but the result is the same as destroying it once."}, {"date": "2010-06-15", "text": "Totem armor’s effect is not regeneration. Specifically, if totem armor’s effect is applied, the enchanted permanent does not become tapped and is not removed from combat as a result. Effects that say the enchanted permanent can’t be regenerated (as Vendetta does) won’t prevent totem armor’s effect from being applied."}, {"date": "2010-06-15", "text": "Say you control a permanent enchanted with an Aura that has totem armor, and the enchanted permanent has gained a regeneration shield. The next time it would be destroyed, you choose whether to apply the regeneration effect or the totem armor effect. The other effect is unused and remains, in case the permanent would be destroyed again."}, {"date": "2010-06-15", "text": "If a spell or ability says that it would “destroy” a permanent enchanted with an Aura that has totem armor, that spell or ability causes the Aura to be destroyed instead. (This matters for cards such as Karmic Justice.) Totem armor doesn’t destroy the Aura; rather, it changes the effects of the spell or ability. On the other hand, if a spell or ability deals lethal damage to a creature enchanted with an Aura that has totem armor, the game rules regarding lethal damage cause the Aura to be destroyed, not that spell or ability."}, {"date": "2010-06-15", "text": "Totem armor’s effect is mandatory. If the enchanted permanent would be destroyed, you must remove all damage from it and destroy the Aura that has totem armor instead."}, {"date": "2010-06-15", "text": "Umbra Mystic grants totem armor to Auras attached to permanents you control, regardless of who controls those Auras. Conversely, it doesn’t grant totem armor to Auras you control that are attached to permanents controlled by other players."}, {"date": "2010-06-15", "text": "If a permanent you control would be destroyed, and it’s enchanted by an Aura with totem armor, it doesn’t matter who controls that Aura. The totem armor effect is mandatory. If that permanent is enchanted by multiple Auras, you choose which one is destroyed, regardless of who controls them."}, {"date": "2010-06-15", "text": "Say you control a permanent that’s enchanted by an Aura you control, and that Aura is itself enchanted by an Aura. If the permanent would be destroyed, instead the first Aura is destroyed... but since that Aura would be destroyed, instead the second Aura is destroyed."}, {"date": "2010-06-15", "text": "Multiple instances of totem armor on the same Aura are redundant."}, {"date": "2010-06-15", "text": "All _Rise of the Eldrazi_ cards printed with totem armor are Auras with “enchant creature.” But Umbra Mystic grants totem armor to Auras attached to any permanent you control, not just creatures. The ability works the same way even if the Aura is enchanting a land, an artifact, or any other permanent."}, {"date": "2010-06-15", "text": "Totem armor’s effect is applied no matter why the enchanted permanent would be destroyed: because it’s been dealt lethal damage, or because it’s being affected by an effect that says to “destroy” it (such as Doom Blade). In either case, all damage is removed from the permanent and the Aura is destroyed instead."}, {"date": "2010-06-15", "text": "If a permanent you control is enchanted with multiple Auras that have totem armor, and the enchanted permanent would be destroyed, one of those Auras is destroyed instead — but only one of them. You choose which one because you control the enchanted permanent."}, {"date": "2013-07-01", "text": "Totem armor has no effect if the enchanted permanent is put into a graveyard for any other reason, such as if it’s sacrificed, if it’s legendary and another legendary permanent with the same name is controlled by the same player, or if its toughness is 0 or less."}, {"date": "2013-07-01", "text": "If a creature enchanted with an Aura that has totem armor has indestructible, lethal damage and effects that try to destroy it simply have no effect. Totem armor won’t do anything because it won’t have to."}, {"date": "2013-07-01", "text": "Say you control a permanent enchanted with an Aura that has totem armor, and that Aura has gained a regeneration shield. The next time the enchanted permanent would be destroyed, the Aura would be destroyed instead — but it regenerates, so nothing is destroyed at all. Alternately, if that Aura somehow gains indestructible, the enchanted permanent is effectively indestructible as well."}], "setCode": "ROE", "subtypes": ["Human", "Wizard"], "supertypes": [], "text": "Auras attached to permanents you control have totem armor. (If an enchanted permanent you control would be destroyed, instead remove all damage from it and destroy an Aura attached to it.)", "toughness": "2", "type": "Creature — Human Wizard", "types": ["Creature"], "uuid": "c27aa762-f53c-5fd5-b5ea-db33f5f8d31a"}