{"artist": "Tomasz Jedruszek", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 3.0, "edhrecRank": 2644, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "245137", "cardsphereId": "76985", "mcmId": "557953", "mcmMetaId": "271194", "mtgjsonV4Id": "39ff0364-41ff-5e1c-9a65-df8ea022fea0", "scryfallId": "19907ce2-345d-44a9-a8f5-5c74efc86915", "scryfallIllustrationId": "7b925036-5821-48c3-993d-3b8de9f693b2", "scryfallOracleId": "4db030f5-d7c4-4aa0-ae2e-12943e2683d7", "tcgplayerProductId": "235275"}, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}", "manaValue": 3.0, "name": "Unbound Flourishing", "number": "376", "originalReleaseDate": "2021-04-24", "printings": ["MH1", "PLIST"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/d03b22dcb4668f0f", "cardmarket": "https://mtgjson.com/links/2b276e968377e7bc", "tcgplayer": "https://mtgjson.com/links/bf971950d69cfb52"}, "rarity": "mythic", "rulings": [{"date": "2019-06-14", "text": "Spells with additional costs that include {X} won’t be affected by Unbound Flourishing. {X} must be in the spell’s mana cost."}, {"date": "2019-06-14", "text": "An ability with a cost that includes X, but not the mana symbol {X}, won’t be copied."}, {"date": "2019-06-14", "text": "Activated abilities contain a colon. They’re generally written “[Cost]: [Effect].” Some keyword abilities are activated abilities and will have a colon in their reminder text. Triggered abilities (starting with “when,” “whenever,” or “at”) that ask a player to pay {X} aren’t copied."}, {"date": "2019-06-14", "text": "If the value chosen for X is 0, Unbound Flourishing will double the value to 0 for permanent spells, and copy other spells and abilities."}, {"date": "2019-06-14", "text": "Unbound Flourishing raises the value of X for permanent spells, but you don’t pay any more mana."}, {"date": "2019-06-14", "text": "If a permanent has an ability that triggers when it’s cast and that references the value of X, you choose whether to double the value of X before or after that ability resolves."}, {"date": "2019-06-14", "text": "If you control two Unbound Flourishings, the value of X for permanent spells will be multiplied by four. If you control three, it will be multiplied by eight, and so on. On the other hand, spells and abilities that include {X} will only be copied twice if you control two Unbound Flourishings, three times if you control three, and so on."}, {"date": "2019-06-14", "text": "Unbound Flourishing’s ability will copy any instant spell, sorcery spell, or activated ability whose mana cost or activation cost contains {X}, not just one with targets."}, {"date": "2019-06-14", "text": "A copy is created even if the spell or ability that caused Unbound Flourishing’s ability to trigger has been countered by the time that ability resolves. The copy resolves before the original spell."}, {"date": "2019-06-14", "text": "The copy will have the same targets as the spell or ability it’s copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. The new targets must be legal."}, {"date": "2019-06-14", "text": "If the spell or ability that’s copied is modal (that is, it says “Choose one —” or the like), the copy will have the same mode or modes. You can’t choose different ones."}, {"date": "2019-06-14", "text": "The copy has the same value of X."}, {"date": "2019-06-14", "text": "You can’t choose to pay any additional costs for a copied spell. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too."}, {"date": "2019-06-14", "text": "The copy that Unbound Flourishing’s ability creates is created on the stack, so it’s not “cast” or “activated.” Abilities that trigger when a player casts a spell or activates an ability won’t trigger."}], "securityStamp": "oval", "setCode": "PLIST", "subtypes": [], "supertypes": [], "text": "Whenever you cast a permanent spell with a mana cost that contains {X}, double the value of X.\nWhenever you cast an instant or sorcery spell or activate an ability, if that spell's mana cost or that ability's activation cost contains {X}, copy that spell or ability. You may choose new targets for the copy.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "5c12d16a-24af-5901-8bf6-f3540030b8a8"}