{"artist": "Lie Setiawan", "availability": ["arena", "mtgo", "paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 2.0, "edhrecRank": 289, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "231297", "cardKingdomId": "230738", "cardsphereId": "65513", "mcmId": "430209", "mcmMetaId": "290834", "mtgjsonV4Id": "10e7f277-bc04-5904-a8ba-ca204b733b1e", "scryfallId": "18e1bdc9-be60-4abd-9756-d3e70e2fcdb5", "scryfallIllustrationId": "096145fa-4695-428e-8ba1-7b6465acfae6", "scryfallOracleId": "27e0948b-9916-473b-8d8c-a51bdfbc7457", "tcgplayerProductId": "206643"}, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Banned", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Banned", "modern": "Legal", "pioneer": "Banned", "vintage": "Legal"}, "manaCost": "{1}{R}", "manaValue": 2.0, "name": "Underworld Breach", "number": "324", "printings": ["PRM", "PTHB", "THB"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/e2809351da36cdcd", "cardKingdomFoil": "https://mtgjson.com/links/b8bff53d2cc9a473", "cardmarket": "https://mtgjson.com/links/26c1013192cb4be0", "tcgplayer": "https://mtgjson.com/links/0cb0171252efeee0"}, "rarity": "rare", "rulings": [{"date": "2020-01-24", "text": "If a card with escape is put into your graveyard during your turn, you’ll be able to cast it right away if it’s legal to do so, before an opponent can take any actions."}, {"date": "2020-01-24", "text": "Once you begin casting a spell with escape, it immediately moves to the stack. Players can’t take any other actions until you’re done casting the spell."}, {"date": "2020-01-24", "text": "If a card has no mana cost, its escape cost is an unpayable cost, so you can’t cast it for that cost."}, {"date": "2020-01-24", "text": "If you’re casting an adventurer card or split card with escape, you choose how you wish to cast it, then pay the appropriate cost (for the Adventure, the creature, or the half of the split card you chose) plus exiling three cards."}, {"date": "2020-01-24", "text": "If a spell you’re casting with escape has an additional cost of discarding cards or sacrificing permanents, you may exile cards discarded or sacrificed this way to pay that part of its escape cost."}, {"date": "2020-01-24", "text": "Escape’s permission doesn’t change when you may cast the spell from your graveyard."}, {"date": "2020-01-24", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost you’re paying (such as an escape cost), add any cost increases, then apply any cost reductions. The converted mana cost of the spell remains unchanged, no matter what the total cost to cast it was and no matter whether an alternative cost was paid."}, {"date": "2020-01-24", "text": "After an escaped spell resolves, it returns to its owner’s graveyard if it’s not a permanent spell. If it is a permanent spell, it enters the battlefield and will return to its owner’s graveyard if it dies later. Perhaps it will escape again—good underworld security is so hard to come by these days."}, {"date": "2020-01-24", "text": "If a card has multiple abilities giving you permission to cast it, such as two escape abilities or an escape ability and a flashback ability, you choose which one to apply. The others have no effect."}, {"date": "2020-01-24", "text": "If you cast a spell with its escape permission, you can’t choose to apply any other alternative costs or to cast it without paying its mana cost. If it has any additional costs, you must pay those."}], "securityStamp": "oval", "setCode": "THB", "subtypes": [], "supertypes": [], "text": "Each nonland card in your graveyard has escape. The escape cost is equal to the card's mana cost plus exile three other cards from your graveyard. (You may cast cards from your graveyard for their escape cost.)\nAt the beginning of the end step, sacrifice Underworld Breach.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "1f438093-8e90-5ded-bca1-34686856abc0", "variations": ["4ef5567b-6c15-5306-b7d6-c434b71c5e7b"]}