{"artist": "Nino Is", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 5.0, "edhrecRank": 9148, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 563290, "name": "Unterkellersäuberung", "text": "Wenn die Unterkellersäuberung ins Spiel kommt, übernimmst du die Initiative.\nImmer wenn du angreifst und falls du oder ein Spieler, den du angreifst, die Initiative hat, erzeugst du zwei getappte und angreifende 1/1 weiße Soldat-Kreaturenspielsteine.", "type": "Verzauberung"}, {"language": "Spanish", "multiverseId": 563650, "name": "Redada en la Bodega Baja", "text": "Cuando la Redada en la Bodega Baja entre al campo de batalla, tomas la iniciativa.\nSiempre que ataques, si tú o un jugador al que estás atacando tienen la iniciativa, creas dos fichas de criatura Soldado blancas 1/1 que están giradas y atacando.", "type": "Encantamiento"}, {"language": "French", "multiverseId": 564010, "name": "Fouille du Cellier", "text": "Quand la Fouille du Cellier arrive sur le champ de bataille, vous prenez l'initiative.\nÀ chaque fois que vous attaquez, si vous ou un joueur que vous attaquez détient l'initiative, vous créez deux jetons de créature 1/1 blanche Soldat, engagés et attaquants.", "type": "Enchantement"}, {"language": "Italian", "multiverseId": 564370, "name": "Perlustrare la Cantina Sepolta", "text": "Quando Perlustrare la Cantina Sepolta entra nel campo di battaglia, prendi l'iniziativa.\nOgniqualvolta attacchi, se tu o un giocatore che stai attaccando avete l'iniziativa, crei due pedine creatura Soldato 1/1 bianche TAPpate e attaccanti.", "type": "Incantesimo"}, {"language": "Japanese", "multiverseId": 564730, "name": "地下の地下の一掃", "text": "地下の地下の一掃が戦場に出たとき、あなたはイニシアチブを得る。\nあなたが攻撃するたび、あなたかあなたが攻撃しているプレイヤー１人にイニシアチブがある場合、白の１/１の兵士・クリーチャー・トークン２体をタップ状態かつ攻撃している状態で生成する。", "type": "エンチャント"}, {"language": "Korean", "multiverseId": 565090, "name": "지하창고 수색", "text": "지하창고 수색이 전장에 들어올 때, 당신이 이니셔티브를 차지한다.\n당신이 공격할 때마다, 당신 또는 당신이 공격 중인 플레이어에게 이니셔티브가 있다면, 당신은 탭되어 공격 중인 1/1 백색 병사 생물 토큰 두 개를 만든다.", "type": "부여마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 565450, "name": "Busca no Subcelário", "text": "Quando Busca no Subcelário entra no campo de batalha, você assume a dianteira.\nToda vez que você ataca, se você ou um jogador que você está atacando estiver na dianteira, você cria duas fichas de criatura Soldado branca 1/1 viradas e atacando.", "type": "Encantamento"}, {"language": "Russian", "multiverseId": 565810, "name": "Обыск Погребов", "text": "Когда Обыск Погребов выходит на поле битвы, вы получаете инициативу.\nКаждый раз, когда вы атакуете, если у вас или игрока, которого вы атакуете, есть инициатива, вы создаете две фишки существа 1/1 белый Солдат повернутыми и атакующими.", "type": "Чары"}, {"language": "Chinese Simplified", "multiverseId": 566170, "name": "地下窖扫荡", "text": "当地下窖扫荡进战场时，你掌握先制。\n每当你攻击时，若你或任一你正向其攻击的牌手握有先制，则你派出两个1/1白色士兵衍生生物，其为横置且正进行攻击。", "type": "结界"}, {"language": "Chinese Traditional", "multiverseId": 566530, "name": "地下窖掃蕩", "text": "當地下窖掃蕩進戰場時，你掌握先制。\n每當你攻擊時，若你或任一你正向其攻擊的玩家握有先制，則你派出兩個1/1白色士兵衍生生物，其為橫置且正進行攻擊。", "type": "結界"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "261609", "cardKingdomId": "261200", "cardsphereId": "89066", "mcmId": "660715", "mcmMetaId": "408625", "mtgjsonV4Id": "d23e0339-99bc-50c0-ad8f-1211b3a7df9b", "mtgoId": "100092", "multiverseId": "562930", "scryfallId": "f8ca369b-4e04-4c80-923b-1212183419d8", "scryfallIllustrationId": "2c3c6083-ba57-4cda-a035-f3fa3165ffee", "scryfallOracleId": "2a747cdb-afbe-451d-8b1b-9458401a5419", "tcgplayerProductId": "273438"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{W}", "manaValue": 5.0, "name": "Undercellar Sweep", "number": "47", "originalText": "When Undercellar Sweep enters the battlefield, you take the initiative.\nWhenever you attack, if you or a player you're attacking has the initiative, you create two 1/1 white Soldier creature tokens that are tapped and attacking.", "originalType": "Enchantment", "printings": ["CLB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/be77c5bb43302dce", "cardKingdomFoil": "https://mtgjson.com/links/035e8858d59eb7be", "cardmarket": "https://mtgjson.com/links/25a5cc96be0ca38a", "tcgplayer": "https://mtgjson.com/links/c0592458fbc7b7f6"}, "rarity": "uncommon", "rulings": [{"date": "2022-06-10", "text": "The initiative is a designation a player can have. A player with the initiative designation is said to “have the initiative.” The initiative carries two inherent rules. First, whenever a player takes the initiative, and at the beginning of the upkeep of the player with the initiative, that player ventures into Undercity. Second, whenever one or more creatures a player controls deal combat damage to the player who has the initiative, the first player takes the initiative. Also, some abilities will refer to having the initiative and provide other benefits."}, {"date": "2022-06-10", "text": "There is no initiative in a game until an effect instructs a player to take the initiative. Once a player is instructed to do this, they have the initiative until another player takes the initiative."}, {"date": "2022-06-10", "text": "Only one player can have the initiative at a time. As one player takes the initiative, any other player that had the initiative ceases to have it."}, {"date": "2022-06-10", "text": "A player who currently has the initiative may take the initiative again. This causes that player to venture into Undercity again, but does not cause them to have multiple initiative designations."}, {"date": "2022-06-10", "text": "If the player with the initiative leaves the game, the active player takes the initiative at the same time that player leaves the game. If the active player is leaving the game or if there is no active player, the next player in turn order takes the initiative."}, {"date": "2022-06-10", "text": "In a Two-Headed Giant game, if both players on a team deal combat damage to the player that has the initiative at the same time, the player with the initiative will choose the order of the triggered abilities. Then, as those abilities resolve, one team member takes the initiative (and ventures into Undercity) and then the other team member does the same. The last player to take the initiative keeps it until the initiative changes again."}, {"date": "2022-06-10", "text": "You cannot venture into Undercity unless instructed to do so, either because you have the initiative at the beginning of your upkeep or because you take the initiative. Notably, if you aren’t in a dungeon and an effect instructs you to venture into the dungeon (not venture into Undercity), you can’t start Undercity."}, {"date": "2022-06-10", "text": "Similarly, when instructed to venture into Undercity, you can’t start a dungeon that isn’t Undercity."}, {"date": "2022-06-10", "text": "If you aren’t in a dungeon when instructed to venture into Undercity, you will put Undercity into the command zone and move your venture marker to Secret Entrance (the first room)."}, {"date": "2022-06-10", "text": "If you’re already in a dungeon when instructed to venture into Undercity, you move to the next room of that dungeon. If you are already in the last room, you will complete that dungeon and start Undercity. This is true whether you’re already in Undercity or any other dungeon."}], "setCode": "CLB", "subtypes": [], "supertypes": [], "text": "When Undercellar Sweep enters the battlefield, you take the initiative.\nWhenever you attack, if you or a player you're attacking has the initiative, you create two 1/1 white Soldier creature tokens that are tapped and attacking.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "0b9b12f5-b9d8-545f-9a8c-92334f518414"}