{"artist": "Svetlin Velinov", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "R"], "colors": ["B", "R"], "convertedManaCost": 5.0, "edhrecRank": 14517, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 374413, "name": "Zerberus der Unterwelt", "text": "Der Zerberus der Unterwelt kann nicht geblockt werden, außer von drei oder mehr Kreaturen.\nKarten in Friedhöfen können nicht das Ziel von Zaubersprüchen oder Fähigkeiten sein.\nWenn der Zerberus der Unterwelt stirbt, schicke ihn ins Exil und jeder Spieler bringt alle Kreaturenkarten aus seinem Friedhof auf seine Hand zurück.", "type": "Kreatur — Hund"}, {"language": "Spanish", "multiverseId": 376156, "name": "Cerbero del Inframundo", "text": "El Cerbero del Inframundo no puede ser bloqueado excepto por tres o más criaturas.\nLas cartas de los cementerios no pueden ser objetivo de hechizos o habilidades.\nCuando el Cerbero del Inframundo muera, exílialo y cada jugador regresa todas las cartas de criatura de su cementerio a su mano.", "type": "Criatura — Perro"}, {"language": "French", "multiverseId": 374662, "name": "Cerbère du Monde souterrain", "text": "Le Cerbère du Monde souterrain ne peut pas être bloqué excepté par trois créatures ou plus.\nLes cartes des cimetières ne peuvent pas être la cible de sorts ou de capacités.\nQuand le Cerbère du Monde souterrain meurt, exilez-le et chaque joueur renvoie dans sa main toutes les cartes de créature de son cimetière.", "type": "Créature : chien de chasse"}, {"language": "Italian", "multiverseId": 374911, "name": "Cerbero dell'Ade", "text": "Il Cerbero dell'Ade non può essere bloccato tranne che da tre o più creature.\nLe carte nei cimiteri non possono essere bersaglio di magie o abilità.\nQuando il Cerbero dell'Ade muore, esilialo e ogni giocatore riprende in mano tutte le carte creatura dal proprio cimitero.", "type": "Creatura — Segugio"}, {"language": "Japanese", "multiverseId": 375160, "name": "死の国のケルベロス", "text": "死の国のケルベロスは、３体以上のクリーチャーによってしかブロックされない。\n墓地にあるカードは呪文や能力の対象にならない。\n死の国のケルベロスが死亡したとき、これを追放し、各プレイヤーはそれぞれ自分の墓地にあるすべてのクリーチャー・カードを自分の手札に戻す。", "type": "クリーチャー — 猟犬"}, {"language": "Korean", "multiverseId": 375409, "name": "저승 켈베로스", "text": "저승 켈베로스는 세 개 이상의 생물에게만 방어될 수 있다.\n무덤에 있는 카드는 주문이나 능력의 목표로 정해질 수 없다.\n저승 켈베로스가 죽을 때, 저승 켈베로스를 추방하고 각 플레이어는 자신의 무덤에 있는 모든 생물 카드를 손으로 되돌린다.", "type": "생물 — 사냥개"}, {"language": "Portuguese (Brazil)", "multiverseId": 375658, "name": "Cérbero do Submundo", "text": "Cérbero do Submundo só pode ser bloqueado por três ou mais criaturas.\nOs cards nos cemitérios não podem ser alvo de mágicas nem de habilidades.\nQuando Cérbero do Submundo morrer, exile-o, e cada jogador devolve todos os cards de criatura do próprio cemitério para a própria mão.", "type": "Criatura — Sabujo"}, {"language": "Russian", "multiverseId": 375907, "name": "Цербер из Подземного Царства", "text": "Цербер из Подземного Царства не может быть заблокирован менее чем тремя существами.\nКарты на кладбищах не могут быть целями заклинаний или способностей.\nКогда Цербер из Подземного Царства умирает, изгоните его, и каждый игрок возвращает все карты существ из своего кладбища в свою руку.", "type": "Существо — Пес"}, {"language": "Chinese Simplified", "multiverseId": 373915, "name": "冥界狱犬", "text": "冥界狱犬只能被三个或更多生物阻挡。\n坟墓场中的牌不能成为咒语或异能的目标。\n当冥界狱犬死去时，将它放逐且每位牌手各将其坟墓场中所有生物牌移回其手上。", "type": "生物～猎犬"}, {"language": "Chinese Traditional", "multiverseId": 374164, "name": "冥界獄犬", "text": "冥界獄犬只能被三個或更多生物阻擋。\n墳墓場中的牌不能成為咒語或異能的目標。\n當冥界獄犬死去時，將它放逐且每位玩家將其墳墓場中所有生物牌移回其手上。", "type": "生物～獵犬"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "191489", "cardKingdomId": "191150", "cardsphereId": "44038", "mcmId": "264062", "mcmMetaId": "208661", "mtgjsonV4Id": "6e7dbe8d-f58c-5c52-a423-964f49513322", "mtgoFoilId": "50393", "mtgoId": "50392", "multiverseId": "373666", "scryfallId": "3a078c3d-88db-4459-9667-ce610ae2f660", "scryfallIllustrationId": "5a5ca4ee-16ec-48d4-9c44-37c2714e5c50", "scryfallOracleId": "a36c2b76-d595-42ba-b8c2-bb8f02639981", "tcgplayerProductId": "71037"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}{R}", "manaValue": 5.0, "name": "Underworld Cerberus", "number": "208", "originalText": "Underworld Cerberus can't be blocked except by three or more creatures.\nCards in graveyards can't be the targets of spells or abilities.\nWhen Underworld Cerberus dies, exile it and each player returns all creature cards from his or her graveyard to his or her hand.", "originalType": "Creature — Hound", "power": "6", "printings": ["THS"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/4c6c0d5ef7c39100", "cardKingdomFoil": "https://mtgjson.com/links/19a1706909b0ba8b", "cardmarket": "https://mtgjson.com/links/e00611589cb62b39", "tcgplayer": "https://mtgjson.com/links/8684f4caeaf42e8a"}, "rarity": "mythic", "rulings": [{"date": "2013-09-15", "text": "If you can’t exile Underworld Cerberus when its last ability resolves, perhaps because it’s been exiled by another spell or ability, each player will still return all creature cards from their graveyard to their hand."}, {"date": "2013-09-15", "text": "If two of these die at the same time, the last ability of each will trigger. If each player controlled one, the nonactive player’s ability will resolve first. The Underworld Cerberus controlled by that player will be exiled, and all other creature cards in graveyards (including the Underworld Cerberus controlled by the active player) will be returned to their owners’ hands. Then the active player’s ability will resolve. That Underworld Cerberus won’t be exiled, but any creature cards in graveyards at that time, perhaps because they died in response to this ability, will be returned to their owners’ hands."}], "setCode": "THS", "subtypes": ["Dog"], "supertypes": [], "text": "Underworld Cerberus can't be blocked except by three or more creatures.\nCards in graveyards can't be the targets of spells or abilities.\nWhen Underworld Cerberus dies, exile it and each player returns all creature cards from their graveyard to their hand.", "toughness": "6", "type": "Creature — Dog", "types": ["Creature"], "uuid": "6b83a1c3-cdee-5e33-9c35-b954645b643c"}