{"artist": "Tsutomu Kawade", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 6.0, "edhrecRank": 18133, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 105373, "name": "Unvergängliche Flammen", "text": "Entferne Karten oben von deiner Bibliothek ganz aus dem Spiel, bis du eine Karte entfernst, die kein Land ist. Unvergängliche Flammen fügt einer Kreatur oder einem Spieler deiner Wahl Schadenspunkte in Höhe der umgewandelten Manakosten dieser Karte zu. Episch (Für den Rest des Spiels kannst du keine Zaubersprüche spielen. Kopiere zu Beginn jedes deiner Versorgungssegmente diesen Zauberspruch außer seiner epischen Fähigkeit. Du kannst neue Ziele für die Kopie bestimmen.)", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 106033, "name": "Llamas inmortales", "text": "Remueve del juego cartas de la parte superior de tu biblioteca hasta que remuevas una carta que no sea tierra. Las Llamas inmortales hacen daño a la criatura o jugador objetivo igual al coste de maná convertido de esa carta. Épico (No puedes jugar hechizos por el resto del juego. Al comienzo de cada uno de tus mantenimientos, copia este hechizo excepto por su habilidad épica. Puedes elegir un nuevo objetivo para la copia.)", "type": "Conjuro"}, {"language": "French", "multiverseId": 105208, "name": "Flammes inextinguibles", "text": "Retirez de la partie les cartes du dessus de votre bibliothèque jusqu'à ce que vous retiriez une carte non-terrain. Les Flammes inextinguibles infligent à une cible, créature ou joueur, un nombre de blessures égal au coût converti de mana de cette carte. Épique (Pour le restant de la partie, vous ne pouvez pas jouer de sorts. Au début de chacun de vos entretiens, copiez ce sort à l'exception de sa capacité d'épique. Vous pouvez choisir une nouvelle cible pour cette copie.)", "type": "Rituel"}, {"language": "Italian", "multiverseId": 105538, "name": "Fiamme Imperiture", "text": "Rimuovi dal gioco le carte in cima al tuo grimorio fino a quando rimuovi una carta non terra. Le Fiamme Imperiture infliggono un danno pari al costo di mana convertito di quella carta a una creatura o a un giocatore bersaglio. Epopea (Per il resto della partita, non puoi giocare magie. All'inizio di ogni tuo mantenimento, copia questa magia tranne la sua abilità epopea. Puoi scegliere un nuovo bersaglio per la copia.)", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 105703, "name": "不死の炎", "text": "クリーチャー１体かプレイヤー１人を対象とする。あなたのライブラリーのカードを一番上から順に、土地でないカードが取り除かれるまで取り除く。 不死の炎はそのクリーチャーかプレイヤーに、そのカードの点数で見たマナ・コストに等しい点数のダメージを与える。 歴伝 （残りのゲームの間、あなたは呪文をプレイできない。 あなたの各アップキープの開始時に、この呪文を歴伝能力を除いてコピーする。 あなたはコピーの新しい対象を選んでもよい。）", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 105868, "name": "Chamas Imortais", "text": "Remove de jogo os cards do topo de seu grimório até que você remova um card que não seja um terreno. Chamas Imortais causa uma quantidade de dano à criatura ou ao jogador alvo igual ao custo de mana convertido daquele card. Épica (Você não pode jogar mágicas pelo resto do duelo. No início de cada uma de suas manutenções, copie esta mágica menos sua habilidade épica. Você pode escolher um novo alvo para a cópia.)", "type": "Feitiço"}, {"language": "Chinese Simplified", "multiverseId": 105043, "name": "不熄烈焰", "text": "从你牌库顶开始将牌移出对战，直到你将一张非地的牌移出对战为止。 不熄烈焰对目标生物或牌手造成伤害，其数量等同于该牌的总法术力费用。 历传（这盘游戏结束之前，你不能使用咒语。 在你每回合的维持开始时，复制此咒语，但不包含其历传异能。 你可以为该复制选择新的目标。）", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "117493", "cardKingdomId": "117162", "cardsphereId": "40203", "mcmId": "12783", "mcmMetaId": "7374", "mtgjsonV4Id": "6ad41fde-e2be-574a-bf5e-f77f018c7ff2", "mtgoFoilId": "22183", "mtgoId": "22182", "multiverseId": "87602", "scryfallId": "606206c7-1a8a-46f4-b368-cf18e02f3df8", "scryfallIllustrationId": "d175c4d3-f654-4445-90c3-840e2dd28897", "scryfallOracleId": "5db128ed-69c0-41f3-b8b4-fb7cefdb236c", "tcgplayerProductId": "12555"}, "keywords": ["Epic"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{R}{R}", "manaValue": 6.0, "name": "Undying Flames", "number": "119", "originalText": "Remove cards from the top of your library from the game until you remove a nonland card. Undying Flames deals damage to target creature or player equal to that card's converted mana cost.\nEpic (For the rest of the game, you can't play spells. At the beginning of each of your upkeeps, copy this spell except for its epic ability. You may choose a new target for the copy.)", "originalType": "Sorcery", "printings": ["SOK"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/fcd20f1e670c0048", "cardKingdomFoil": "https://mtgjson.com/links/92c210638b72a38d", "cardmarket": "https://mtgjson.com/links/da84ef806d35c905", "tcgplayer": "https://mtgjson.com/links/c47fc4f1e24b9daa"}, "rarity": "rare", "rulings": [{"date": "2005-06-01", "text": "If you have no cards in your library, Undying Flames does nothing."}], "setCode": "SOK", "subtypes": [], "supertypes": [], "text": "Exile cards from the top of your library until you exile a nonland card. Undying Flames deals damage to any target equal to that card's mana value.\nEpic (For the rest of the game, you can't cast spells. At the beginning of each of your upkeeps, copy this spell except for its epic ability. You may choose a new target for the copy.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "fef17dfb-64dd-58f4-acd0-919f5b917ed3"}