{"artist": "Fariba Khamseh", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 3.0, "edhrecRank": 11611, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 548734, "name": "Unbarmherziges Wesen", "text": "Bedrohlich (Diese Kreatur kann nicht geblockt werden, außer von zwei oder mehr Kreaturen.)\nImmer wenn das Unbarmherzige Wesen angreift, bringe eine Kreaturenkarte deiner Wahl mit Manabetrag X oder weniger aus deinem Friedhof ins Spiel zurück, wobei X gleich der Anzahl an modifizierten Kreaturen ist, die du kontrollierst. (Auren, die du kontrollierst, Ausrüstungen und Marken sind Modifizierungen.)", "type": "Kreatur — Geist"}, {"language": "Spanish", "multiverseId": 549039, "name": "Ente implacable", "text": "Amenaza. (Esta criatura no puede ser bloqueada excepto por dos o más criaturas.)\nSiempre que el Ente implacable ataque, regresa la carta de criatura objetivo con valor de maná de X o menos de tu cementerio al campo de batalla, donde X es la cantidad de criaturas modificadas que controlas. (Las Auras que controlas, los Equipos y los contadores son modificaciones.)", "type": "Criatura — Espíritu"}, {"language": "French", "multiverseId": 549344, "name": "L'Impitoyable", "text": "Menace (Cette créature ne peut pas être bloquée excepté par deux créatures ou plus.)\nÀ chaque fois que l'Impitoyable attaque, renvoyez sur le champ de bataille une carte de créature avec une valeur de mana inférieure ou égale à X ciblée depuis votre cimetière, X étant le nombre de créatures modifiées que vous contrôlez. (Les équipements, les auras que vous contrôlez et les marqueurs sont des modifications.)", "type": "Créature : esprit"}, {"language": "Italian", "multiverseId": 549649, "name": "Colui che Non Perdona", "text": "Minacciare (Questa creatura non può essere bloccata tranne che da due o più creature.)\nOgniqualvolta Colui che Non Perdona attacca, rimetti sul campo di battaglia dal tuo cimitero una carta creatura bersaglio con valore di mana pari o inferiore a X, dove X è il numero di creature modificate che controlli. (Equipaggiamenti, Aure che controlli e segnalini sono modifiche.)", "type": "Creatura — Spirito"}, {"language": "Japanese", "multiverseId": 549954, "name": "慈悲無き者", "text": "威迫（このクリーチャーは２体以上のクリーチャーにしかブロックされない。）\n慈悲無き者が攻撃するたび、あなたの墓地にありマナ総量がＸ以下であるクリーチャー・カード１枚を対象とする。それを戦場に戻す。Xはあなたがコントロールしていて改善されているクリーチャーの数に等しい。（装備品やあなたがコントロールしているオーラがついているかカウンターが置かれているクリーチャーは改善されている。）", "type": "クリーチャー — スピリット"}, {"language": "Korean", "multiverseId": 550259, "name": "가차없는 자", "text": "호전적 (이 생물은 두 개 이상의 생물에만 방어될 수 있다.)\n가차없는 자가 공격할 때마다, 당신의 무덤에 있는 마나 값이 X 이하인 생물 카드를 목표로 정한다. 그 카드를 전장으로 되돌린다. X는 당신이 조종하는 수정된 생물들의 수이다. (장비, 당신이 조종하는 마법진, 카운터들이 수정 사항이다.)", "type": "생물 — 신령"}, {"language": "Portuguese (Brazil)", "multiverseId": 550564, "name": "O Impiedoso", "text": "Ameaçar (Esta criatura só pode ser bloqueada por duas ou mais criaturas.)\nToda vez que O Impiedoso atacar, devolva de seu cemitério para o campo de batalha o card de criatura alvo com valor de mana igual ou inferior a X, sendo X o número de criaturas modificadas que você controla. (Os Equipamentos, as Auras que você controla e os marcadores são modificações.)", "type": "Criatura — Espírito"}, {"language": "Russian", "multiverseId": 550869, "name": "Непрощающий", "text": "Угроза (Это существо не может быть заблокировано менее чем двумя существами.)\nКаждый раз, когда Непрощающий атакует, верните целевую карту существа с мановой ценностью не более X из вашего кладбища на поле битвы, где X — количество измененных существ под вашим контролем. (Снаряжение, Ауры под вашим контролем и жетоны являются изменениями.)", "type": "Существо — Дух"}, {"language": "Chinese Simplified", "multiverseId": 551174, "name": "记怨魂", "text": "威慑（此生物只能被两个或更多生物阻挡。）\n每当记怨魂攻击时，将目标法术力值等于或小于X的生物牌从你的坟墓场移回战场，X为由你操控且有饰装的生物数量。（武具，指示物，以及由你操控的灵气均为饰装。）", "type": "生物 ～精怪"}, {"language": "Chinese Traditional", "multiverseId": 551479, "name": "記怨魂", "text": "威懾（此生物只能被兩個或更多生物阻擋。）\n每當記怨魂攻擊時，將目標魔法力值等於或小於X的生物牌從你的墳墓場移回戰場，X為由你操控且有飾裝的生物數量。（武具，指示物，以及由你操控的靈氣均為飾裝。）", "type": "生物 ～精靈"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "256911", "cardKingdomId": "256608", "cardsphereId": "85114", "mcmId": "608227", "mcmMetaId": "402178", "mtgArenaId": "79556", "mtgjsonV4Id": "1ec44b35-b3b1-5da8-a548-f88d66349efd", "mtgoId": "97182", "multiverseId": "548429", "scryfallId": "cfb20c08-a84a-4773-a90c-fb007b94644b", "scryfallIllustrationId": "e09f8bf5-a7b7-4791-a144-a5174e2fc23b", "scryfallOracleId": "9ec2114c-023b-45c3-a44c-6a9f6462bc85", "tcgplayerProductId": "262758"}, "keywords": ["Menace"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}", "manaValue": 3.0, "name": "Unforgiving One", "number": "127", "originalText": "Menace (This creature can't be blocked except by two or more creatures.)\nWhenever Unforgiving One attacks, return target creature card with mana value X or less from your graveyard to the battlefield, where X is the number of modified creatures you control. (Equipment, Auras you control, and counters are modifications.)", "originalType": "Creature — Spirit", "power": "2", "printings": ["NEO"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/da8d1c20d82cb780", "cardKingdomFoil": "https://mtgjson.com/links/cfcfc7905c9d1a5d", "cardmarket": "https://mtgjson.com/links/e11b5cfb90fdcc53", "tcgplayer": "https://mtgjson.com/links/7465ba0dc827b4b9"}, "rarity": "uncommon", "rulings": [{"date": "2022-02-18", "text": "The value of X needs to be determined both when the ability triggers (so you can choose a target) and again when the ability resolves (to check if that target is still legal). If the number of modified creatures you control has decreased enough in that time to make the target illegal, Unforgiving One's ability won't resolve."}, {"date": "2022-02-18", "text": "An Aura controlled by an opponent does not cause a creature you control to be modified."}, {"date": "2022-02-18", "text": "A creature with a counter on it is considered modified no matter what kind of counter it is or which player put it on that creature."}, {"date": "2022-02-18", "text": "A creature that is equipped is considered modified no matter who controls the Equipment that's attached to it."}, {"date": "2022-02-18", "text": "Only creatures can be modified. If a modified creature stops being a creature, it is no longer considered modified."}], "setCode": "NEO", "subtypes": ["Spirit"], "supertypes": [], "text": "Menace (This creature can't be blocked except by two or more creatures.)\nWhenever Unforgiving One attacks, return target creature card with mana value X or less from your graveyard to the battlefield, where X is the number of modified creatures you control. (Equipment, Auras you control, and counters are modifications.)", "toughness": "3", "type": "Creature — Spirit", "types": ["Creature"], "uuid": "f33c2238-b3c3-52a9-a333-f5da2b157191"}