{"artist": "William Simpson", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 2.0, "edhrecRank": 3743, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 144939, "name": "Vedalken-Äthermagier", "text": "Aufblitzen (Du kannst diesen Zauberspruch zu jedem Zeitpunkt spielen, zu dem du einen Spontanzauber spielen könntest.)\n Wenn der Vedalken-Äthermagier ins Spiel kommt, bringe einen Remasuri deiner Wahl auf die Hand seines Besitzers zurück.\n Zaubererumwandlung {3} ({3}, wirf diese Karte aus deiner Hand ab: Durchsuche deine Bibliothek nach einer Zaubererkarte, zeige diese Karte offen vor und nimm sie auf deine Hand. Mische danach deine Bibliothek.)", "type": "Kreatur — Vedalken, Zauberer"}, {"language": "Spanish", "multiverseId": 145263, "name": "Maga etérea vedalken", "text": "Destello (Puedes jugar este hechizo en cualquier momento en que pudieras jugar un instantáneo.)\u2028\nCuando la Maga etérea vedalken entre en juego, regresa el Fragmentado objetivo a la mano de su propietario.\u2028\nCiclo de hechicero {3} ({3}, descartar esta carta: Busca en tu biblioteca una carta de Hechicero, muéstrala y ponla en tu mano. Luego baraja tu biblioteca.)", "type": "Criatura — Hechicero vedalken"}, {"language": "French", "multiverseId": 145344, "name": "Aethermage vedalken", "text": "Flash (Vous pouvez jouer ce sort à tout moment où vous pourriez jouer un éphémère.)\nQuand l'Aethermage vedalken arrive en jeu, renvoyez le slivoïde ciblé dans la main de son propriétaire.\nRecyclage de sorcier {3} ({3}, défaussez-vous de cette carte : Cherchez dans votre bibliothèque une carte de sorcier, révélez-la, et mettez-la dans votre main. Mélangez ensuite votre bibliothèque.)", "type": "Créature : vedalken et sorcier"}, {"language": "Italian", "multiverseId": 144858, "name": "Etermaga Vedalken", "text": "Lampo (Puoi giocare questa magia in ogni momento in cui potresti giocare un istantaneo.)\nQuando l'Etermaga Vedalken entra in gioco, fai tornare un Tramutante bersaglio in mano al suo proprietario.\nCiclomago {3} ({3}, Scarta questa carta: Passa in rassegna il tuo grimorio per una carta Mago, rivelala e aggiungila alla tua mano. Poi rimescola il tuo grimorio.)", "type": "Creatura — Mago Vedalken"}, {"language": "Japanese", "multiverseId": 145425, "name": "ヴィダルケンの霊気魔道士", "text": "瞬速 （あなたはこの呪文を、あなたがインスタントをプレイできるときならいつでもプレイしてよい。）\n ヴィダルケンの霊気魔道士が場に出たとき、スリヴァー１体を対象とし、それをオーナーの手札に戻す。\n ウィザード・サイクリング {3} （{3}, このカードを捨てる：あなたのライブラリーからウィザード・カードを１枚探し、それを公開してあなたの手札に加える。 その後、あなたのライブラリーを切り直す。）", "type": "クリーチャー — ヴィダルケン・ウィザード"}, {"language": "Portuguese (Brazil)", "multiverseId": 145101, "name": "Maga Etérea Vedalkeana", "text": "Lampejo (Você pode jogar esta mágica a qualquer momento em que puder jogar uma mágica instantânea.)\nQuando Maga Etérea Vedalkeana entrar em jogo, devolva o Fractius alvo para a mão de seu dono.\nReciclar mago {3} ({3}, Descarte este card: Procure em seu grimório por um card de Mago, revele-o e coloque-o em sua mão. Depois, embaralhe seu grimório.)", "type": "Criatura — Mago Vedalkeano"}, {"language": "Russian", "multiverseId": 145020, "name": "Эфиромаг Ведалкенов", "text": "Миг (Вы можете разыграть это заклинание при любой возможности разыгрывать мгновенные заклинания.)\nКогда Эфиромаг Ведалкенов входит в игру, верните целевую Щепку в руку её владельца.\nЦикл Чародеев {3} ({3}, Сбросьте эту карту: Найдите в вашей библиотеке карту Чародея, покажите её и положите в вашу руку. Затем перетасуйте вашу библиотеку.)", "type": "Существо — Ведалкен Чародей"}, {"language": "Chinese Simplified", "multiverseId": 145182, "name": "维多肯乙太法师", "text": "闪现（你可以于你能够使用瞬间的时机下使用此咒语。）\n当维多肯乙太法师进场时，将目标裂片妖移回其拥有者手上。\n循环法术师{3}（{3}，从你手上弃掉此牌：从你的牌库中搜寻一张法术师牌，展示该牌，并置于你手上。 然后将你的牌库洗牌。）", "type": "生物～维多肯／法术师"}], "frameVersion": "future", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "122578", "cardKingdomId": "122398", "cardsphereId": "18882", "mcmId": "15053", "mtgjsonV4Id": "1ba3ddff-025b-5953-9074-1aeab1c34194", "mtgoFoilId": "26675", "mtgoId": "26674", "multiverseId": "130325", "scryfallId": "496eb37d-5c8f-4dd7-a0a7-3ed1bd2210d6", "scryfallIllustrationId": "6fec026f-e657-4299-831e-933b60df479f", "scryfallOracleId": "271b37b6-b60b-4687-bd82-ecacf3b66cb3", "tcgplayerProductId": "15012"}, "isTimeshifted": true, "keywords": ["Flash", "Wizardcycling"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pauper": "Legal", "paupercommander": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}", "manaValue": 2.0, "name": "Vedalken Aethermage", "number": "61", "originalText": "Flash (You may play this spell any time you could play an instant.)\nWhen Vedalken Æthermage comes into play, return target Sliver to its owner's hand.\nWizardcycling {3} ({3}, Discard this card: Search your library for a Wizard card, reveal it, and put it into your hand. Then shuffle your library.)", "originalType": "Creature - Vedalken Wizard", "power": "1", "printings": ["FUT"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/14d6ced61aeaf2bd", "cardKingdomFoil": "https://mtgjson.com/links/7554a22821b6d339", "tcgplayer": "https://mtgjson.com/links/745a629ccc1d0263"}, "rarity": "common", "rulings": [{"date": "2009-02-01", "text": "Unlike the normal cycling ability, Wizardcycling doesn’t allow you to draw a card. Instead, it lets you search your library for a Wizard card. After you find a Wizard card in your library, you reveal it, put it into your hand, then shuffle your library."}, {"date": "2009-02-01", "text": "Wizardcycling is a form of cycling. Any ability that triggers on a card being cycled also triggers on Wizardcycling this card. Any ability that stops a cycling ability from being activated also stops Wizardcycling from being activated."}, {"date": "2009-02-01", "text": "Wizardcycling is an activated ability. Effects that interact with activated abilities (such as Stifle or Rings of Brighthearth) will interact with Wizardcycling. Effects that interact with spells (such as Remove Soul or Faerie Tauntings) will not."}, {"date": "2009-02-01", "text": "You can choose to find any card with the Wizard creature type, even if it isn’t a creature card. This includes, for example, Tribal cards with the Changeling ability. You can also choose not to find a card, even if there is a Wizard card in your library."}], "setCode": "FUT", "subtypes": ["Vedalken", "Wizard"], "supertypes": [], "text": "Flash (You may cast this spell any time you could cast an instant.)\nWhen Vedalken Aethermage enters the battlefield, return target Sliver to its owner's hand.\nWizardcycling {3} ({3}, Discard this card: Search your library for a Wizard card, reveal it, put it into your hand, then shuffle.)", "toughness": "2", "type": "Creature — Vedalken Wizard", "types": ["Creature"], "uuid": "924bc581-766c-5c20-984a-699f33732de0"}