{"artist": "Igor Kieryluk", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 5.0, "edhrecRank": 8191, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 263740, "name": "Rachsüchtiger Pharao", "text": "Todesberührung (Eine beliebige Menge Schadenspunkte, die er einer Kreatur zufügt, sind ausreichend, um sie zu zerstören.)\nImmer wenn dir oder einem Planeswalker, den du kontrollierst, Kampfschaden zugefügt wird, zerstöre eine angreifende Kreatur deiner Wahl, falls der Rachsüchtige Pharao in deinem Friedhof ist, und lege dann den Rachsüchtigen Pharao oben auf deine Bibliothek.", "type": "Kreatur — Zombie"}, {"language": "Spanish", "multiverseId": 264985, "name": "Faraón vengativo", "text": "Toque mortal. (Cualquier cantidad de daño que esto haga a una criatura es suficiente para destruirla.)\nSiempre que te hagan daño de combate a ti o a un planeswalker que controles, si el Faraón vengativo está en tu cementerio, destruye la criatura atacante objetivo y luego pon al Faraón vengativo en la parte superior de tu biblioteca.", "type": "Criatura — Zombie"}, {"language": "French", "multiverseId": 263491, "name": "Pharaon vengeur", "text": "Contact mortel (Le nombre de blessures que cette créature inflige à une créature, quel qu'il soit, est suffisant pour la détruire.)\nÀ chaque fois que des blessures de combat sont infligées à vous ou à un planeswalker que vous contrôlez, si le Pharaon vengeur est dans votre cimetière, détruisez une créature attaquante ciblée, puis mettez le Pharaon vengeur au-dessus de votre bibliothèque.", "type": "Créature : zombie"}, {"language": "Italian", "multiverseId": 263989, "name": "Faraone Vendicativo", "text": "Tocco letale (Qualsiasi danno che questa creatura infligge a una creatura è sufficiente a distruggerla.)\nOgniqualvolta viene inflitto danno da combattimento a te o a un planeswalker che controlli, se il Faraone Vendicativo è nel tuo cimitero, distruggi una creatura attaccante bersaglio, poi metti il Faraone Vendicativo in cima al tuo grimorio.", "type": "Creatura — Zombie"}, {"language": "Japanese", "multiverseId": 264238, "name": "復讐に燃えたファラオ", "text": "接死 （これが何らかのダメージをクリーチャーに与えた場合、それだけで破壊される。）\nあなたかあなたがコントロールするプレインズウォーカーに戦闘ダメージが与えられるたび、復讐に燃えたファラオがあなたの墓地にある場合、攻撃クリーチャー１体を対象とし、それを破壊し、その後復讐に燃えたファラオをあなたのライブラリーの一番上に置く。", "type": "クリーチャー — ゾンビ"}, {"language": "Korean", "name": "복수심의 파라오", "text": "치명타 (이 생물에게 피해를 입은 생물은 얼마의 피해를 입든 파괴된다.)당신이나 당신이 조종하는 플레인즈워커가 전투피해를 입을 때마다, 만약 당신이 무덤에 복수심의 파라오가 있다면, 공격생물 한 개를 목표로 정해 파괴하고 나서, 복수심의 파라오를 당신의 서고 맨 위에 올려놓는다.", "type": "생물 — 좀비"}, {"language": "Portuguese (Brazil)", "multiverseId": 264487, "name": "Faraó Vingativo", "text": "Toque mortífero (Qualquer quantidade de dano que esta criatura cause a uma criatura é suficiente para destruí-la.)\nToda vez que você ou um planeswalker que você controla sofrer dano de combate, se Faraó Vingativo estiver em seu cemitério, destrua a criatura atacante alvo e depois coloque Faraó Vingativo no topo de seu grimório.", "type": "Criatura — Zumbi"}, {"language": "Russian", "multiverseId": 264736, "name": "Мстительный Фараон", "text": "Смертельное касание (Любое количество повреждений, которое этот объект наносит существу, достаточно, чтобы его уничтожить.)\nКаждый раз когда вам или planeswalker-у под вашим контролем наносятся боевые повреждения, если Мстительный Фараон находится на вашем кладбище, уничтожьте целевое атакующее существо, затем положите Мстительного Фараона на верх вашей библиотеки.", "type": "Существо — Зомби"}, {"language": "Chinese Simplified", "multiverseId": 262993, "name": "复仇法老", "text": "死触 （它对生物造成的任何数量伤害都足以消灭后者。）\n每当你或由你操控之鹏洛客受到战斗伤害时，若复仇法老在你的坟墓场中，则消灭目标进行攻击的生物，然后将复仇法老置于你的牌库顶。", "type": "生物～灵俑"}, {"language": "Chinese Traditional", "multiverseId": 263242, "name": "復仇法老", "text": "死觸 （它對生物造成的任何數量傷害都足以消滅後者。）\n每當你或由你操控之鵬洛客受到戰鬥傷害時，若復仇法老在你的墳墓場中，則消滅目標進行攻擊的生物，然後將復仇法老置於你的牌庫頂。", "type": "生物～殭屍"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "185388", "cardKingdomId": "185121", "cardsphereId": "27220", "mcmId": "247885", "mcmMetaId": "203463", "mtgjsonV4Id": "f35ad515-187f-5c75-876b-2b13e115d71c", "mtgoFoilId": "41402", "mtgoId": "41401", "multiverseId": "220170", "scryfallId": "12e0ca97-bc57-4084-86b4-e2e06152cb1c", "scryfallIllustrationId": "a6d645c7-e2a2-42f1-95ca-96b6adba0004", "scryfallOracleId": "7e465cfe-d2ee-4420-87f4-945728f58f87", "tcgplayerProductId": "47628"}, "keywords": ["Deathtouch"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}{B}{B}", "manaValue": 5.0, "name": "Vengeful Pharaoh", "number": "116", "originalText": "Deathtouch (Any amount of damage this deals to a creature is enough to destroy it.)\nWhenever combat damage is dealt to you or a planeswalker you control, if Vengeful Pharaoh is in your graveyard, destroy target attacking creature, then put Vengeful Pharaoh on top of your library.", "originalType": "Creature — Zombie", "power": "5", "printings": ["M12"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/53e363243d17c374", "cardKingdomFoil": "https://mtgjson.com/links/830a952399136c17", "cardmarket": "https://mtgjson.com/links/2228b12e2d1d7fd9", "tcgplayer": "https://mtgjson.com/links/ab1b152891a47f45"}, "rarity": "rare", "rulings": [{"date": "2011-09-22", "text": "Vengeful Pharaoh must be in your graveyard when combat damage is dealt to you or a planeswalker you control in order for its ability to trigger. That is, it can’t die and trigger from your graveyard during the same combat damage step."}, {"date": "2011-09-22", "text": "If Vengeful Pharaoh is no longer in your graveyard when the triggered ability would resolve, the triggered ability won’t do anything."}, {"date": "2011-09-22", "text": "If the attacking creature is an illegal target when the triggered ability tries to resolve, it won’t resolve and none of its effects will happen. Vengeful Pharaoh will remain in your graveyard."}, {"date": "2011-09-22", "text": "If multiple creatures deal combat damage to you simultaneously, Vengeful Pharaoh will only trigger once."}, {"date": "2011-09-22", "text": "If multiple creatures deal combat damage to you and to a planeswalker you control simultaneously, Vengeful Pharaoh will trigger twice. The first trigger will cause Vengeful Pharaoh to be put on top of your library. The second trigger will then do nothing, as Vengeful Pharaoh is no longer in your graveyard when it tries to resolve. Note that the second trigger will do nothing even if Vengeful Pharaoh is put back into your graveyard before it tries to resolve, as it’s a different Vengeful Pharaoh than the one that was there before."}, {"date": "2011-09-22", "text": "If your own attacking creatures deal combat damage to you or a planeswalker you control (perhaps because combat damage was redirected), Vengeful Pharaoh will still trigger. You must target and destroy one of your own attacking creatures."}], "setCode": "M12", "subtypes": ["Zombie"], "supertypes": [], "text": "Deathtouch (Any amount of damage this deals to a creature is enough to destroy it.)\nWhenever combat damage is dealt to you or a planeswalker you control, if Vengeful Pharaoh is in your graveyard, destroy target attacking creature, then put Vengeful Pharaoh on top of your library.", "toughness": "4", "type": "Creature — Zombie", "types": ["Creature"], "uuid": "b1718a39-096e-518f-b2f7-2ac876c1a0a6"}