{"artist": "Gaboleps", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 4.0, "edhrecRank": 7649, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 567276, "name": "Ins Abenteuer wagen", "text": "Schicke Karten oben von deiner Bibliothek ins Exil, bis du eine Länderkarte ins Exil schickst. Bringe sie ins Spiel und lege den Rest in zufälliger Reihenfolge unter deine Bibliothek. Schicke Ins Abenteuer wagen mit drei Zeitmarken ins Exil.\nAussetzen 3 — {1}{G}", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 567304, "name": "Seguir adelante", "text": "Exilia cartas de la parte superior de tu biblioteca hasta que exilies una carta de tierra. Pon esa carta en el campo de batalla y el resto en el fondo de tu biblioteca en un orden aleatorio. Exilia Seguir adelante con tres contadores de tiempo sobre él.\nSuspender 3—{1}{G}.", "type": "Conjuro"}, {"language": "French", "multiverseId": 567332, "name": "Aventures droit devant", "text": "Exilez les cartes du dessus de votre bibliothèque jusqu'à ce que vous exiliez une carte de terrain. Mettez cette carte sur le champ de bataille et le reste au-dessous de votre bibliothèque dans un ordre aléatoire. Exilez les Aventures droit devant avec trois marqueurs « temps » sur elles.\nSuspension 3 — {1}{G}", "type": "Rituel"}, {"language": "Italian", "multiverseId": 567360, "name": "Partire all'Avventura", "text": "Esilia carte dalla cima del tuo grimorio finché non esili una carta terra. Metti quella carta sul campo di battaglia e le altre in fondo al tuo grimorio in ordine casuale. Esilia Partire all'Avventura con tre segnalini tempo su di essa.\nSospendere 3—{1}{G}", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 567388, "name": "冒険の先へ", "text": "あなたが土地・カード１枚を追放するまで、あなたのライブラリーの一番上から１枚ずつ追放していく。そのカードを戦場に、残りをあなたのライブラリーの一番下に無作為の順番で置く。冒険の先へを時間カウンター３個が置かれた状態で追放する。\n待機３―{1}{G}", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 567416, "name": "Seguir em Frente", "text": "Exile cards do topo de seu grimório até exilar um card de terreno. Coloque aquele card no campo de batalha e o restante no fundo de seu grimório em ordem aleatória. Exile Seguir em Frente com três marcadores temporais.\nSuspender 3 — {1}{G}", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 567444, "name": "Дорога Дальше", "text": "Изгоняйте карты с верха вашей библиотеки до тех пор, пока вы не изгоните карту земли. Положите ту карту на поле битвы, а остальные — в низ вашей библиотеки в случайном порядке. Изгоните Дорогу Дальше с тремя временными жетонами на ней.\nОтсрочка 3 — {1}{G}", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 567472, "name": "继续向前", "text": "从你的牌库顶开始放逐牌，直到放逐一张地牌为止。将该牌放进战场，其余则以随机顺序置于你的牌库底。放逐继续向前，且上面有三个计时指示物。\n延缓3～{1}{G}", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 567500, "name": "繼續向前", "text": "從你的牌庫頂開始放逐牌，直到放逐一張地牌為止。將該牌放進戰場，其餘則以隨機順序置於你的牌庫底。放逐繼續向前，且上面有三个計時指示物。\n延緩3～{1}{G}", "type": "巫術"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "262034", "mcmId": "661383", "mtgjsonV4Id": "c241cdeb-0417-5c50-9207-8d9fe9d55060", "mtgoId": "101464", "multiverseId": "567248", "scryfallId": "bb4db814-3821-47ea-9e33-0e9f49128a36", "scryfallIllustrationId": "a501ae67-a5de-46c8-ad9b-a2275d4959f9", "scryfallOracleId": "261f371f-bcda-4761-810f-3216608b31d8", "tcgplayerProductId": "273675"}, "keywords": ["Suspend"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{G}", "manaValue": 4.0, "name": "Venture Forth", "number": "683", "originalText": "Exile cards from the top of your library until you exile a land card. Put that card onto the battlefield and the rest on the bottom of your library in a random order. Exile Venture Forth with three time counters on it.\nSuspend 3—{1}{G}", "originalType": "Sorcery", "printings": ["CLB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/f1e7255d4ef3c341", "tcgplayer": "https://mtgjson.com/links/8546387748e2805d"}, "rarity": "rare", "rulings": [{"date": "2022-06-10", "text": "You can exile a card in your hand using suspend any time you could cast that card. Consider its card type, any effect that affects when you could cast it (such as flash) and any other effects that could stop you from casting it (such as Revel in Silence's effect) to determine if and when you can do this. Whether or not you could actually complete all steps in casting the card is irrelevant. For example, you can exile a card with suspend that has no mana cost or requires a target even if no legal targets are available at that time."}, {"date": "2022-06-10", "text": "Exiling a card with suspend isn't casting that card. This action doesn't use the stack and can't be responded to."}, {"date": "2022-06-10", "text": "If the first triggered ability of suspend (the one that removes time counters) is countered, no time counter is removed. The ability will trigger again during the card's owner's next upkeep."}, {"date": "2022-06-10", "text": "When the last time counter is removed, the second triggered ability of suspend will trigger. It doesn't matter why the last time counter was removed or what effect removed it."}, {"date": "2022-06-10", "text": "If the second triggered ability of suspend (the one that lets you cast the card) is countered, the card can't be cast. It remains exiled with no time counters on it, and it's no longer suspended."}, {"date": "2022-06-10", "text": "As the second triggered ability resolves, you must cast the card if able. Timing restrictions based on the card's type are ignored."}, {"date": "2022-06-10", "text": "If you can't cast the card, perhaps because there are no legal targets available, it remains exiled with no time counters on it, and it's no longer suspended."}], "securityStamp": "oval", "setCode": "CLB", "subtypes": [], "supertypes": [], "text": "Exile cards from the top of your library until you exile a land card. Put that card onto the battlefield and the rest on the bottom of your library in a random order. Exile Venture Forth with three time counters on it.\nSuspend 3—{1}{G}", "type": "Sorcery", "types": ["Sorcery"], "uuid": "c5204d0e-11d0-5927-95fe-56d093a28eda", "variations": ["520b5930-93bf-55ba-900a-845ab1d01950"]}