{"artist": "Wylie Beckert", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 5052, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "8470ad1a-2b79-5d59-a6e2-b0089e133db6", "mtgoId": "103402", "scryfallId": "121ab454-3f69-404d-8650-f1e5de94334b", "scryfallIllustrationId": "1dd6d107-6b96-431c-86d6-b30c27339bd9", "scryfallOracleId": "6058fab1-9878-42b7-93be-b0a5aa99bd6d"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Vesuvan Duplimancy", "number": "103402", "originalReleaseDate": "2022-09-09", "printings": ["DMU", "PDMU", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2022-09-09", "text": "The triggered ability of Vesuvan Duplimancy triggers only if you cast a spell that targets a single artifact or a single creature and nothing else. The ability will resolve before the spell that caused it to trigger, and a token will be created even if the spell you cast was countered or permanent it was targeting is now an illegal target."}, {"date": "2022-09-09", "text": "If the target of the spell leaves the battlefield before the triggered ability resolves, use its characteristics as it last existed on the battlefield to determine the characteristics of the token created."}, {"date": "2022-09-09", "text": "If the target of the spell is changed after the triggered ability is put on the stack, the token that is created is a copy of the spell’s original target, not the new target."}, {"date": "2022-09-09", "text": "The token copies exactly what was printed on the original artifact or creature and nothing else (unless that permanent is copying something else or is a token; see below). It doesn’t copy whether that permanent is tapped or untapped, whether it has any counters on it or Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, and so on."}, {"date": "2022-09-09", "text": "The token isn’t legendary, and this exception is copiable. If something else copies the token later, that copy also won’t be legendary. If you control two or more permanents with the same name but only one is legendary, the “legend rule” doesn’t apply."}, {"date": "2022-09-09", "text": "If the copied permanent has {X} in its mana cost, X is considered to be 0."}, {"date": "2022-09-09", "text": "If the copied permanent is a token, the token that’s created copies the original characteristics of that token as stated by the effect that created that token."}, {"date": "2022-09-09", "text": "If the copied permanent is copying something else (for example, if the copied creature is a Clone), then the token enters the battlefield as whatever that permanent copied."}, {"date": "2022-09-09", "text": "Any enters-the-battlefield abilities of the copied permanent will trigger when the token enters the battlefield. Any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities of the copied permanent will also work."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": [], "supertypes": [], "text": "Whenever you cast a spell that targets only a single artifact or creature you control, create a token that's a copy of that artifact or creature, except it's not legendary.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "7a3f2035-385f-5107-a5a2-8dd55234cc34"}