{"artist": "Quinton Hoover", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 3681, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 509751, "name": "Vesuvischer Gestaltwandler", "text": "Sowie der Vesuvische Gestaltwandler ins Spiel kommt oder aufgedeckt wird, kannst du eine andere Kreatur im Spiel bestimmen. Falls du dies tust und bis er erneut verdeckt wird, wird der Vesuvische Gestaltwandler zu einer Kopie der Kreatur, außer dass er „Zu Beginn deines Versorgungssegments kannst du diese Kreatur verdecken\" hat.\nMorph {1}{U}", "type": "Kreatur — Gestaltwandler"}, {"language": "Spanish", "multiverseId": 510040, "name": "Metamorfo vesuvano", "text": "En cuanto el Metamorfo vesuvano entre al campo de batalla o se ponga boca arriba, puedes elegir otra criatura en el campo de batalla. Si lo haces, hasta que el Metamorfo vesuvano se ponga boca abajo, se convierte en una copia de esa criatura, excepto que tiene \"Al comienzo de tu mantenimiento, puedes poner esta criatura boca abajo\".\nMetamorfosis {1}{U}.", "type": "Criatura — Metamorfo"}, {"language": "French", "multiverseId": 510329, "name": "Changeforme vésuvéen", "text": "Au moment où le Changeforme vésuvéen arrive sur le champ de bataille ou qu'il est retourné face visible, vous pouvez choisir une autre créature sur le champ de bataille. Si vous faites ainsi, jusqu'à ce que le Changeforme vésuvéen soit retourné face cachée, il devient une copie de cette créature, excepté qu'il a « Au début de votre entretien, vous pouvez retourner cette créature face cachée. »\nMue {1}{U}", "type": "Créature : changeforme"}, {"language": "Italian", "multiverseId": 510618, "name": "Polimorfo di Vesuva", "text": "Mentre il Polimorfo di Vesuva entra nel campo di battaglia o viene girato a faccia in su, puoi scegliere un'altra creatura sul campo di battaglia. Se lo fai, finché il Polimorfo di Vesuva non viene girato a faccia in giù, diventa una copia di quella creatura, tranne che ha \"All'inizio del tuo mantenimento, puoi girare questa creatura a faccia in giù\".\nMetamorfosi {1}{U}", "type": "Creatura — Polimorfo"}, {"language": "Japanese", "multiverseId": 510907, "name": "ヴェズーヴァの多相の戦士", "text": "ヴェズーヴァの多相の戦士が戦場に出るか表向きになるに際し、あなたは、他の、戦場にあるクリーチャー１体を選んでもよい。そうしたなら、ヴェズーヴァの多相の戦士が裏向きになるまで、これは、「あなたのアップキープの開始時に、あなたはこのクリーチャーを裏向きにしてもよい。」を持つことを除き、そのクリーチャーのコピーになる。\n変異{1}{U}", "type": "クリーチャー — 多相の戦士"}, {"language": "Portuguese (Brazil)", "multiverseId": 511196, "name": "Metamorfo Vesuvano", "text": "Conforme Metamorfo Vesuvano entra no campo de batalha ou é voltado para cima, você pode escolher outra criatura no campo de batalha. Se fizer isso, até que Metamorfo Vesuvano seja voltado para baixo, ele se torna uma cópia daquela criatura, exceto por ter \"No início de sua manutenção, você pode voltar a face desta criatura para baixo\".\nMetamorfose {1}{U}", "type": "Criatura — Metamorfo"}, {"language": "Russian", "multiverseId": 511485, "name": "Везуванский Oборотень", "text": "При выходе Везуванского Оборотня на поле битвы или при его переворачивании рубашкой вниз вы можете выбрать другое существо на поле битвы. Если вы это делаете, то до тех пор, пока Везуванский Оборотень не перевернется рубашкой вверх, он становится копией того существа, но при этом у него есть способность «В начале вашего шага поддержки вы можете перевернуть это существо рубашкой вверх».\nОборотень {1}{U}", "type": "Существо — Имитатор"}, {"language": "Chinese Simplified", "multiverseId": 511774, "name": "维苏瓦变形兽", "text": "于维苏瓦变形兽进战场或翻回正面时，你可以选择战场上的另一个生物。如果你如此作，则直到维苏瓦变形兽翻为牌面朝下为止，它成为该生物的复制品，但它具有「在你的维持开始时，你可以将此生物翻为牌面朝下。」\n变身{1}{U}", "type": "生物 ～变形兽"}, {"language": "Chinese Traditional", "multiverseId": 512063, "name": "維蘇瓦變形獸", "text": "於維蘇瓦變形獸進戰場或翻回正面時，你可以選擇戰場上的另一個生物。如果你如此作，則直到維蘇瓦變形獸翻為牌面朝下為止，它成為該生物的複製品，但它具有「在你的維持開始時，你可以將此生物翻為牌面朝下。」\n變身{1}{U}", "type": "生物 ～變形獸"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "243011", "cardKingdomId": "242506", "cardsphereId": "74744", "mcmId": "542936", "mcmMetaId": "8568", "mtgjsonV4Id": "d4f6a080-8463-51b5-9f47-52f83ce86d34", "mtgoId": "86557", "multiverseId": "509462", "scryfallId": "0b1b59d2-ad4b-4dc6-a730-0d19f2774ae9", "scryfallIllustrationId": "f6e24eaf-c6bf-455f-8e75-00451f4209b4", "scryfallOracleId": "ec577886-fb25-455b-9c3d-5fd610959436", "tcgplayerProductId": "233778"}, "isReprint": true, "keywords": ["Morph"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}{U}", "manaValue": 5.0, "name": "Vesuvan Shapeshifter", "number": "97", "originalText": "As Vesuvan Shapeshifter enters the battlefield or is turned face up, you may choose another creature on the battlefield. If you do, until Vesuvan Shapeshifter is turned face down, it becomes a copy of that creature, except it has \"At the beginning of your upkeep, you may turn this creature face down.\"\nMorph {1}{U}", "originalType": "Creature — Shapeshifter", "power": "0", "printings": ["A25", "C19", "TSP", "TSR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/f5e574b44e1202f2", "cardKingdomFoil": "https://mtgjson.com/links/21038877277740c1", "cardmarket": "https://mtgjson.com/links/bb75c058d61c9198", "tcgplayer": "https://mtgjson.com/links/aea5e426807c9348"}, "rarity": "rare", "rulings": [{"date": "2021-03-19", "text": "If a copied creature has {X} in its mana cost, X is 0."}, {"date": "2021-03-19", "text": "If a copied creature is copying something else, Vesuvan Shapeshifter uses the copiable values of that creature. In most cases, Vesuvan Shapeshifter will copy whatever that creature is copying."}, {"date": "2021-03-19", "text": "Vesuvan Shapeshifter copies exactly what is printed on the creature it’s copying and nothing else (unless it’s copying a creature that’s copying something else or that’s a token; see below). It doesn’t copy whether a creature is tapped or untapped, whether it has any counters on it or Auras and/or Equipment attached to it, or any non-copy effects that changed its power, toughness, types, color, and so on. Most notably, if it copies a creature that’s not normally a creature, it won’t be a creature."}, {"date": "2021-03-19", "text": "If a copied creature is a token that isn’t a copy of something else, Vesuvan Shapeshifter copies the original characteristics of that token as stated by the effect that created it. Vesuvan Shapeshifter isn’t a token in this case."}, {"date": "2021-03-19", "text": "Any enters-the-battlefield abilities of the copied creature will trigger if Vesuvan Shapeshifter is entering the battlefield. Any “As [this creature] enters the battlefield” or “[This creature] enters the battlefield with” abilities of the copied creature will also work. If a Vesuvan Shapeshifter becomes a copy of a creature after it’s already on the battlefield, these abilities won’t apply as Vesuvan Shapeshifter becomes a copy since it’s not entering the battlefield; instead, any “As [this creature] is turned face up” or “When [this creature] is turned face up” abilities will apply."}, {"date": "2021-03-19", "text": "If something copies Vesuvan Shapeshifter, the new copy will also have the triggered ability to turn it face down. However, once face-down, it won’t have Vesuvan Shapeshifter’s morph ability, so it can’t be turned face up unless whatever it’s copying also has a morph ability."}], "securityStamp": "oval", "setCode": "TSR", "subtypes": ["Shapeshifter"], "supertypes": [], "text": "As Vesuvan Shapeshifter enters the battlefield or is turned face up, you may choose another creature on the battlefield. If you do, until Vesuvan Shapeshifter is turned face down, it becomes a copy of that creature, except it has \"At the beginning of your upkeep, you may turn this creature face down.\"\nMorph {1}{U}", "toughness": "0", "type": "Creature — Shapeshifter", "types": ["Creature"], "uuid": "73286290-15c5-5fc5-b084-e79b2f882d52"}