{"artist": "Quinton Hoover", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "white", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 10736, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "1993", "hasFoil": false, "hasNonFoil": true, "identifiers": {"mcmId": "16714", "mtgjsonV4Id": "25c5acad-f82f-5e4a-84a6-8d57b52cd574", "scryfallId": "92808879-895f-4e65-854c-2c92f170a1e3", "scryfallIllustrationId": "5994977a-3846-494b-a620-c00ade6b40ba", "scryfallOracleId": "aeaccab9-3e2c-4a40-a483-52c4972b2014", "tcgplayerProductId": "211877"}, "isReprint": true, "isReserved": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "oldschool": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}{U}", "manaValue": 5.0, "name": "Vesuvan Doppelganger", "number": "88", "power": "0", "printings": ["2ED", "30A", "3ED", "CED", "CEI", "FBB", "LEA", "LEB", "ME1", "OLEP", "SUM"], "purchaseUrls": {"tcgplayer": "https://mtgjson.com/links/2676c30b2aece43f"}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "When the Doppelganger switches creatures, the creature it used to be is not considered to have left the battlefield. Such effects will consider the creature to have left the battlefield when the Doppelganger leaves the battlefield."}, {"date": "2004-10-04", "text": "Damage is not removed when it changes forms."}, {"date": "2004-10-04", "text": "Can switch to the same creature it is currently a copy of."}, {"date": "2004-10-04", "text": "When it takes on the characteristics of the other card, it is no longer of creature type Shapeshifter."}, {"date": "2004-10-04", "text": "When changing forms, any text changes that exist on the Doppelganger are applied to the new text, if appropriate."}, {"date": "2004-12-01", "text": "If a Doppelganger is flipped, and it copies a flip card in any state, it will copy both “sides” of that card but use the flipped side. If a Doppelganger is unflipped, and it copies a flip card in any state, it will copy both “sides” of that card but use the unflipped side. In the second case, if it ever meets the flip conditions of its new ability, it will flip and used the flipped side of what it is copying."}, {"date": "2007-09-16", "text": "Although Vesuvan Doppelganger’s triggered ability is targeted, its “as enters the battlefield” ability is not."}, {"date": "2007-09-16", "text": "When Vesuvan Doppelganger’s triggered ability triggers, you must choose a target for it. You determine whether to have the Doppelganger become a copy of that target when the ability resolves."}, {"date": "2007-09-16", "text": "Vesuvan Doppelganger copies the mana cost of the creature it’s copying but doesn’t copy its color."}, {"date": "2007-09-16", "text": "If another creature copies Vesuvan Doppelganger, the new creature will become a copy of whatever Vesuvan Doppelganger is copying except for its color, will copy Vesuvan Doppelganger’s color, and will gain Vesuvan Doppelganger’s triggered ability."}, {"date": "2007-09-16", "text": "Vesuvan Doppelganger’s triggered ability may cause it to become a copy of itself. A Vesuvan Doppelganger that becomes a copy of a Vesuvan Doppelganger (either itself or a different one) will gain another instance of its triggered ability. Each instance of that ability will trigger during its controller’s upkeep. They’ll all be put on the stack and resolve one at a time. The last one to resolve determines the Doppelganger’s characteristics for the rest of the turn."}, {"date": "2007-09-16", "text": "Vesuvan Doppelganger copies a face-down creature, it becomes a face-up 2/2 blue creature with no name and no abilities other than the one it gives itself."}], "setCode": "SUM", "subtypes": ["Shapeshifter"], "supertypes": [], "text": "You may have Vesuvan Doppelganger enter the battlefield as a copy of any creature on the battlefield, except it doesn't copy that creature's color and it has \"At the beginning of your upkeep, you may have this creature become a copy of target creature, except it doesn't copy that creature's color and it has this ability.\"", "toughness": "0", "type": "Creature — Shapeshifter", "types": ["Creature"], "uuid": "317649db-31b9-5d13-b95c-c89dc813936d"}