{"artist": "James Paick", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": [], "convertedManaCost": 8.0, "edhrecRank": 11511, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 414969, "name": "Lästiger Krabbler", "text": "Auftauchen {6}{U} (Du kannst diesen Zauberspruch wirken, indem du eine Kreatur opferst und die Auftauchen-Kosten bezahlst, abzüglich der umgewandelten Manakosten der geopferten Kreatur.)\nWenn du den Lästigen Krabbler wirkst, kannst du eine Spontanzauber- oder Hexerei-Karte deiner Wahl aus deinem Friedhof auf deine Hand zurückbringen.", "type": "Kreatur — Eldrazi, Krabbe"}, {"language": "Spanish", "multiverseId": 416530, "name": "Atormentador insidioso", "text": "Emerger {6}{U}. (Puedes lanzar este hechizo sacrificando una criatura y pagando el coste de emerger menos el coste de maná convertido de esa criatura.)\nCuando lances el Atormentador insidioso, puedes regresar la carta de instantáneo o de conjuro objetivo de tu cementerio a tu mano.", "type": "Criatura — Cangrejo eldrazi"}, {"language": "French", "multiverseId": 415192, "name": "Coursier vexatoire", "text": "Émergence {6}{U} (Vous pouvez lancer ce sort en sacrifiant une créature et en payant le coût d'émergence, moins le coût converti de mana de cette créature.)\nQuand vous lancez le Coursier vexatoire, vous pouvez renvoyer une carte d'éphémère ou de rituel ciblée depuis votre cimetière dans votre main.", "type": "Créature : eldrazi et crabe"}, {"language": "Italian", "multiverseId": 415415, "name": "Affondatore Opprimente", "text": "Emergere {6}{U} (Puoi lanciare questa magia sacrificando una creatura e pagando il costo di emergere meno il costo di mana convertito di quella creatura.)\nQuando lanci l'Affondatore Opprimente, puoi riprendere in mano una carta istantaneo o stregoneria bersaglio dal tuo cimitero.", "type": "Creatura — Granchio Eldrazi"}, {"language": "Japanese", "multiverseId": 415638, "name": "厄介な船沈め", "text": "現出{6}{U}（あなたはこの呪文を、クリーチャー１体を生け贄に捧げるとともに{X}だけ減らした現出コストを支払って唱えてもよい。Ｘはそのクリーチャーの点数で見たマナ・コストに等しい。）\nあなたが厄介な船沈めを唱えたとき、あなたの墓地からインスタント・カード１枚かソーサリー・カード１枚を対象とする。あなたはそれをあなたの手札に戻してもよい。", "type": "クリーチャー — エルドラージ・カニ"}, {"language": "Korean", "multiverseId": 415861, "name": "짜증나는 침몰꾼", "text": "출현 {6}{U} (생물 하나를 희생하고 출현 비용에서 그 생물의 전환마나비용을 뺀 만큼을 지불해서 이 주문을 발동할 수 있다.)\n짜증나는 침몰꾼을 발동할 때, 당신의 무덤에 있는 순간마법이나 집중마법 카드를 목표로 정한다. 당신은 그 카드를 당신의 손으로 되돌릴 수 있다.", "type": "생물 — 엘드라지 게"}, {"language": "Portuguese (Brazil)", "multiverseId": 416084, "name": "Naufragador Irritante", "text": "Emergir {6}{U} (Você pode conjurar esta mágica sacrificando uma criatura e pagando o custo de emergir menos o custo de mana convertido daquela criatura.)\nQuando você conjura Naufragador Irritante, você pode devolver o card de mágica instantânea ou feitiço alvo de seu cemitério para sua mão.", "type": "Criatura — Eldrazi Caranguejo"}, {"language": "Russian", "multiverseId": 416307, "name": "Кошмарный Топитель", "text": "Явление {6}{U} (Вы можете разыграть это заклинание, пожертвовав существо и оплатив стоимость Явления, уменьшенную на конвертированную мана-стоимость того существа.)\nКогда вы разыгрываете Кошмарного Топителя, вы можете вернуть целевую карту мгновенного заклинания или волшебства из вашего кладбища в вашу руку.", "type": "Существо — Эльдрази Краб"}, {"language": "Chinese Simplified", "multiverseId": 414523, "name": "恼人凿孔蟹", "text": "化生{6}{U}（你可以牺牲一个生物并支付化生费用来施放此咒语，此时总费用会扣除该生物之总法术力费用。）\n当你施放恼人凿孔蟹时，你可以将目标瞬间或法术牌从你的坟墓场移回你手上。", "type": "生物～奥札奇／蟹"}, {"language": "Chinese Traditional", "multiverseId": 414746, "name": "惱人鑿孔蟹", "text": "化生{6}{U}（你可以犧牲一個生物並支付化生費用來施放此咒語，此時總費用會扣除該生物之總魔法力費用。）\n當你施放惱人鑿孔蟹時，你可以將目標瞬間或巫術牌從你的墳墓場移回你手上。", "type": "生物～奧札奇／蟹"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "207873", "cardKingdomId": "207627", "cardsphereId": "16258", "mcmId": "291189", "mcmMetaId": "223183", "mtgjsonV4Id": "3edcd55a-7541-5a98-8b1f-8882437235a6", "mtgoFoilId": "61359", "mtgoId": "61358", "multiverseId": "414300", "scryfallId": "1c3dd0aa-f6e9-435c-af64-20e9de67efe9", "scryfallIllustrationId": "ea5a8cff-77cc-471b-912b-cdd48af4af1a", "scryfallOracleId": "2a5605a8-606e-4866-9473-7a2240ac6b8c", "tcgplayerProductId": "120553"}, "keywords": ["Emerge"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{8}", "manaValue": 8.0, "name": "Vexing Scuttler", "number": "11", "originalText": "Emerge {6}{U} (You may cast this spell by sacrificing a creature and paying the emerge cost reduced by that creature's converted mana cost.)\nWhen you cast Vexing Scuttler, you may return target instant or sorcery card from your graveyard to your hand.", "originalType": "Creature — Eldrazi Crab", "power": "4", "printings": ["EMN"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/5e130ad927f49a46", "cardKingdomFoil": "https://mtgjson.com/links/c8c86f3fb2511f9d", "cardmarket": "https://mtgjson.com/links/fda04a2a26f58fa0", "tcgplayer": "https://mtgjson.com/links/7724df188c4e47d2"}, "rarity": "uncommon", "rulings": [{"date": "2016-07-13", "text": "You may sacrifice a creature with converted mana cost greater than or equal to the emerge cost. If you do, you’ll pay only the colored mana component of the emerge cost."}, {"date": "2016-07-13", "text": "A “when you cast” triggered ability resolves before the original spell resolves. It resolves even if the original spell is countered, and the original spell resolves even if the triggered ability is countered."}, {"date": "2016-07-13", "text": "Each card with emerge is colorless and has an emerge cost that includes one or more colors of mana. These cards are still colorless if you pay the emerge cost."}, {"date": "2016-07-13", "text": "A creature’s converted mana cost is determined solely by the mana symbols printed in its upper right corner (unless that creature is the back face of a double-faced card, is a melded permanent, or is copying something else; see below). If the mana cost includes {X}, X is considered to be 0. If it’s a single-faced card with no mana symbols in its upper right corner (because it’s an animated land, for example), its converted mana cost is 0. Ignore any alternative costs or additional costs (such as kicker) that were paid as the creature was cast."}, {"date": "2016-07-13", "text": "Colored mana components of emerge costs can’t be reduced with emerge."}, {"date": "2016-07-13", "text": "You may sacrifice a creature with a converted mana cost of 0, such as a token creature that’s not a copy of another permanent, to cast a spell for its emerge cost. You’ll just pay the full emerge cost with no reduction."}, {"date": "2016-07-13", "text": "If you sacrifice a creature with {X} in its mana cost, that X is considered to be 0."}, {"date": "2016-07-13", "text": "The converted mana cost of the back face of a double-faced card is the converted mana cost of its front face. The converted mana cost of a melded permanent is the sum of the converted mana costs of its front faces. A creature that’s a copy of either has a converted mana cost of 0."}, {"date": "2016-07-13", "text": "The converted mana cost of a creature spell with emerge isn’t affected by whether its emerge cost is paid. For example, if you cast Elder Deep-Fiend for its emerge cost and sacrifice a creature whose converted mana cost is 3, Elder Deep-Fiend’s converted mana cost remains 8."}, {"date": "2016-07-13", "text": "The creature chosen to be sacrificed is still on the battlefield up through the time that you activate mana abilities. Its abilities may affect the spell’s cost, be activated to generate mana, and so on. However, if it has an ability that triggers when a spell is cast, it will have been sacrificed before that ability can trigger."}, {"date": "2016-07-13", "text": "Once you begin to cast a spell with emerge, no player may take actions until you’re done. Notably, opponents can’t try to remove the creature you wish to sacrifice."}], "setCode": "EMN", "subtypes": ["Eldrazi", "Crab"], "supertypes": [], "text": "Emerge {6}{U} (You may cast this spell by sacrificing a creature and paying the emerge cost reduced by that creature's mana value.)\nWhen you cast this spell, you may return target instant or sorcery card from your graveyard to your hand.", "toughness": "5", "type": "Creature — Eldrazi Crab", "types": ["Creature"], "uuid": "42573b73-ef26-5b35-b07e-35b291f95a4d"}