{"artist": "Mathias Kollros", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R", "U"], "colors": ["R", "U"], "convertedManaCost": 3.0, "edhrecRank": 1317, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "c2d68ac8-4ec9-54fe-8e82-6739540e583e", "mtgoId": "90282", "scryfallId": "d63c45da-2fb7-4d52-b0d8-3d26954f5baf", "scryfallIllustrationId": "b0932e3f-263b-4663-9588-0197e2252295", "scryfallOracleId": "d57a6b19-bd06-4b07-8ee1-0b45612ba9e4"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Magecraft"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}{R}", "manaValue": 3.0, "name": "Veyran, Voice of Duality", "number": "90282", "originalReleaseDate": "2021-05-01", "power": "2", "printings": ["C21", "PRM"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2021-04-16", "text": "Veyran, Voice of Duality’s last ability causes each of your magecraft abilities, including Veyran’s own, to trigger an additional time."}, {"date": "2021-04-16", "text": "Veyran’s effect doesn’t copy the triggered ability; it just causes the ability to trigger again. Any choices you make as you put the ability on the stack, such as modes and targets, are made separately for each instance of the ability. Any choices made on resolution are also made individually."}, {"date": "2021-04-16", "text": "If you somehow control two Veyrans (which would be poetic), you casting an instant or sorcery spell causes abilities to trigger three times. A third Veyran (less poetic) causes abilities to trigger four times, and so on."}, {"date": "2021-04-16", "text": "Each magecraft ability has a different effect, although they all have the same trigger condition, whenever you cast or copy an instant or sorcery spell."}, {"date": "2021-04-16", "text": "For example, if you control Archmage Emeritus and cast an instant or sorcery spell, Archmage Emeritus’s magecraft ability will trigger and you will draw a card."}, {"date": "2021-04-16", "text": "If an effect creates a copy of an instant or sorcery spell, this will also cause the magecraft ability to trigger."}, {"date": "2021-04-16", "text": "If an effect creates multiple copies of an instant or sorcery spell, magecraft abilities trigger once for each copy created by the effect."}, {"date": "2021-04-16", "text": "Some effects instruct you to copy an instant or sorcery card in a zone other than the stack. These copies do not cause magecraft abilities to trigger. However, most effects that do this also allow you to cast the copy, and casting the copy will cause magecraft abilities to trigger."}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Efreet", "Wizard"], "supertypes": ["Legendary"], "text": "Magecraft — Whenever you cast or copy an instant or sorcery spell, Veyran, Voice of Duality gets +1/+1 until end of turn.\nIf you casting or copying an instant or sorcery spell causes a triggered ability of a permanent you control to trigger, that ability triggers an additional time.", "toughness": "2", "type": "Legendary Creature — Efreet Wizard", "types": ["Creature"], "uuid": "f250c7dd-c774-520a-a8ac-efb72c499cd8"}