{"artist": "Deruchenko Alexander", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["B", "R"], "colors": ["B", "R"], "convertedManaCost": 3.0, "edhrecRank": 6694, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "30d39531-9d30-537c-b0fd-bac4da03fee3", "mtgoId": "62329", "scryfallId": "39851da3-84d0-420d-8d07-85f81eafc796", "scryfallIllustrationId": "c2b8a853-e4ad-49ae-b7cd-1a4598d5ca95", "scryfallOracleId": "1b355139-4891-436c-9079-0ce17ecc2d65"}, "isOnlineOnly": true, "isReprint": true, "isStarter": true, "keywords": ["Partner"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Restricted", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{1}{B}{R}", "manaValue": 3.0, "name": "Vial Smasher the Fierce", "number": "49", "power": "2", "printings": ["C16", "CMR", "PRM", "PZ2"], "purchaseUrls": {}, "rarity": "mythic", "rulings": [{"date": "2017-04-17", "text": "Vial Smasher the Fierce is banned as a commander in Duel Commander format, but it may be part of your deck."}, {"date": "2020-11-10", "text": "An effect that checks whether you control your commander is satisfied if you control one or both of your two commanders."}, {"date": "2020-11-10", "text": "Vial Smasher’s triggered ability triggers when you cast your first spell each turn, regardless of whose turn it is."}, {"date": "2020-11-10", "text": "Vial Smasher has to be on the battlefield at the moment you cast your first spell. If that spell causes Vial Smasher to leave the battlefield as an additional cost to cast it, Vial Smasher’s ability can’t trigger. If that spell is Vial Smasher itself, Vial Smasher’s ability can’t trigger."}, {"date": "2020-11-10", "text": "For spells with {X} in their mana costs, use the value chosen for X to determine the spell’s converted mana cost."}, {"date": "2020-11-10", "text": "Vial Smasher’s triggered ability resolves before the spell that caused it to trigger. If Vial Smasher’s ability resolves and the spell that caused it to trigger has been countered, use that spell’s converted mana cost as it last existed on the stack to determine how much damage is dealt."}, {"date": "2020-11-10", "text": "The opponent to be dealt damage is chosen at random while the triggered ability is resolving. After that opponent is chosen, you choose whether damage will be dealt to that player or to a planeswalker they control, and if so, which planeswalker. No player may take any actions between the damage recipient being chosen and the damage being dealt."}, {"date": "2020-11-10", "text": "If your Commander deck has two commanders, you can only include cards whose own color identities are also found in your commanders’ combined color identities. If Falthis and Kediss are your commanders, your deck may contain cards with black and/or red in their color identity, but not cards with green, white, or blue."}, {"date": "2020-11-10", "text": "Both commanders start in the command zone, and the remaining 98 cards (or 58 cards in a Commander Draft game) of your deck are shuffled to become your library."}, {"date": "2020-11-10", "text": "To have two commanders, both must have the partner ability as the game begins. Losing the ability during the game doesn’t cause either to cease to be your commander."}, {"date": "2020-11-10", "text": "Once the game begins, your two commanders are tracked separately. If you cast one, you won’t have to pay an additional {2} the first time you cast the other. A player loses the game after having been dealt 21 damage from any one of them, not from both of them combined."}, {"date": "2020-11-10", "text": "If something refers to your commander while you have two commanders, it refers to one of them of your choice. If you are instructed to perform an action on your commander (e.g. put it from the command zone into your hand due to Command Beacon), you choose one of your commanders at the time the effect happens."}, {"date": "2020-11-10", "text": "You can choose two commanders with partner that are the same color or colors. In Commander Draft, you can even choose two of the same commander with partner if you drafted them. If you do this, make sure you keep the number of times you’ve cast each from the command zone clear for “commander tax” purposes."}], "securityStamp": "oval", "setCode": "PZ2", "subtypes": ["Goblin", "Berserker"], "supertypes": ["Legendary"], "text": "Whenever you cast your first spell each turn, choose an opponent at random. Vial Smasher the Fierce deals damage equal to that spell's mana value to that player or a planeswalker that player controls.\nPartner (You can have two commanders if both have partner.)", "toughness": "3", "type": "Legendary Creature — Goblin Berserker", "types": ["Creature"], "uuid": "84dde0bb-cbd7-5436-9ecb-67cf62737e01"}