{"artist": "Cristi Balanescu", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 10450, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 563398, "name": "Bösartiger Schlachtenwüter", "text": "Wenn der Bösartige Schlachtenwüter ins Spiel kommt, übernimmst du die Initiative.\nStachelige Vergeltung — Immer wenn der Bösartige Schlachtenwüter von einer Kreatur geblockt wird, verliert der Beherrscher der Kreatur 5 Lebenspunkte.", "type": "Kreatur — Zwerg, Barbar"}, {"language": "Spanish", "multiverseId": 563758, "name": "Camorrista brutal", "text": "Cuando el Camorrista brutal entre al campo de batalla, tomas la iniciativa.\nCastigo punzante — Siempre que el Camorrista brutal sea bloqueado por una criatura, el controlador de esa criatura pierde 5 vidas.", "type": "Criatura — Bárbaro enano"}, {"language": "French", "multiverseId": 564118, "name": "Fou de guerre violent", "text": "Quand le Fou de guerre violent arrive sur le champ de bataille, vous prenez l'initiative.\nReprésailles pointues — À chaque fois que le Fou de guerre violent devient bloqué par une créature, le contrôleur de cette créature perd 5 points de vie.", "type": "Créature : nain et barbare"}, {"language": "Italian", "multiverseId": 564478, "name": "Furia Combattente Crudele", "text": "Quando la Furia Combattente Crudele entra nel campo di battaglia, prendi l'iniziativa.\nCastigo Chiodato — Ogniqualvolta la Furia Combattente Crudele viene bloccata da una creatura, il controllore di quella creatura perde 5 punti vita.", "type": "Creatura — Barbaro Nano"}, {"language": "Japanese", "multiverseId": 564838, "name": "物騒なバトルレイジャー", "text": "物騒なバトルレイジャーが戦場に出たとき、あなたはイニシアチブを得る。\n反撃の棘 ― 物騒なバトルレイジャーがクリーチャー１体にブロックされた状態になるたび、そのクリーチャーのコントローラーは５点のライフを失う。", "type": "クリーチャー — ドワーフ・バーバリアン"}, {"language": "Korean", "multiverseId": 565198, "name": "잔인한 전투격노전사", "text": "잔인한 전투격노전사가 전장에 들어올 때, 당신이 이니셔티브를 차지한다.\n징 박힌 응징 — 잔인한 전투격노전사가 생물에게 방어될 때마다, 그 생물의 조종자는 생명 5점을 잃는다.", "type": "생물 — 드워프 야만인"}, {"language": "Portuguese (Brazil)", "multiverseId": 565558, "name": "Furioso de Batalha Ferino", "text": "Quando Furioso de Batalha Ferino entra no campo de batalha, você assume a dianteira.\nRetaliação espinhosa — Toda vez que Furioso de Batalha Ferino se torna bloqueado por uma criatura, o controlador daquela criatura perde 5 pontos de vida.", "type": "Criatura — Anão Bárbaro"}, {"language": "Russian", "multiverseId": 565918, "name": "Свирепый Бушующий в Бою", "text": "Когда Свирепый Бушующий в Бою выходит на поле битвы, вы получаете инициативу.\nКолючее возмездие — Каждый раз, когда Свирепый Бушующий в Бою становится заблокирован существом, контролирующий то существо игрок теряет 5 жизней.", "type": "Существо — Гном Варвар"}, {"language": "Chinese Simplified", "multiverseId": 566278, "name": "邪恶战怒者", "text": "当邪恶战怒者进战场时，你掌握先制。\n尖刺反击～每当邪恶战怒者被一个生物阻挡时，该生物的操控者失去5点生命。", "type": "生物 ～矮人／野蛮人"}, {"language": "Chinese Traditional", "multiverseId": 566638, "name": "邪惡戰怒者", "text": "當邪惡戰怒者進戰場時，你掌握先制。\n尖刺反擊～每當邪惡戰怒者被一個生物阻擋時，該生物的操控者失去5點生命。", "type": "生物 ～矮人／野蠻人"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "261681", "cardKingdomId": "261288", "cardsphereId": "89210", "mcmId": "660884", "mcmMetaId": "408700", "mtgjsonV4Id": "d3dd2f92-f6aa-5c81-a6ae-a81369069a7a", "mtgoId": "100330", "multiverseId": "563038", "scryfallId": "20f939d8-3d41-4d8b-baea-7f022104c704", "scryfallIllustrationId": "52557053-61a0-44b9-9505-64991ea7d995", "scryfallOracleId": "b8942c72-16ce-4f2f-875f-97a56e85a03e", "tcgplayerProductId": "273415"}, "keywords": ["Spiked Retribution"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "pauper": "Banned", "paupercommander": "Legal", "vintage": "Legal"}, "manaCost": "{3}{B}", "manaValue": 4.0, "name": "Vicious Battlerager", "number": "155", "originalText": "When Vicious Battlerager enters the battlefield, you take the initiative.\nSpiked Retribution — Whenever Vicious Battlerager becomes blocked by a creature, that creature's controller loses 5 life.", "originalType": "Creature — Dwarf Barbarian", "power": "1", "printings": ["CLB"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/20828f353ba41975", "cardKingdomFoil": "https://mtgjson.com/links/5f7fd70bbc22cbdb", "cardmarket": "https://mtgjson.com/links/0fc2309bce32b505", "tcgplayer": "https://mtgjson.com/links/85fc2dc917f1a598"}, "rarity": "common", "rulings": [{"date": "2022-06-10", "text": "If Vicious Battlerager becomes blocked by more than one creature, its triggered ability triggers once for each creature that blocked it."}, {"date": "2022-06-10", "text": "The initiative is a designation a player can have. A player with the initiative designation is said to “have the initiative.” The initiative carries two inherent rules. First, whenever a player takes the initiative, and at the beginning of the upkeep of the player with the initiative, that player ventures into Undercity. Second, whenever one or more creatures a player controls deal combat damage to the player who has the initiative, the first player takes the initiative. Also, some abilities will refer to having the initiative and provide other benefits."}, {"date": "2022-06-10", "text": "There is no initiative in a game until an effect instructs a player to take the initiative. Once a player is instructed to do this, they have the initiative until another player takes the initiative."}, {"date": "2022-06-10", "text": "Only one player can have the initiative at a time. As one player takes the initiative, any other player that had the initiative ceases to have it."}, {"date": "2022-06-10", "text": "A player who currently has the initiative may take the initiative again. This causes that player to venture into Undercity again, but does not cause them to have multiple initiative designations."}, {"date": "2022-06-10", "text": "If the player with the initiative leaves the game, the active player takes the initiative at the same time that player leaves the game. If the active player is leaving the game or if there is no active player, the next player in turn order takes the initiative."}, {"date": "2022-06-10", "text": "In a Two-Headed Giant game, if both players on a team deal combat damage to the player that has the initiative at the same time, the player with the initiative will choose the order of the triggered abilities. Then, as those abilities resolve, one team member takes the initiative (and ventures into Undercity) and then the other team member does the same. The last player to take the initiative keeps it until the initiative changes again."}, {"date": "2022-06-10", "text": "You cannot venture into Undercity unless instructed to do so, either because you have the initiative at the beginning of your upkeep or because you take the initiative. Notably, if you aren’t in a dungeon and an effect instructs you to venture into the dungeon (not venture into Undercity), you can’t start Undercity."}, {"date": "2022-06-10", "text": "Similarly, when instructed to venture into Undercity, you can’t start a dungeon that isn’t Undercity."}, {"date": "2022-06-10", "text": "If you aren’t in a dungeon when instructed to venture into Undercity, you will put Undercity into the command zone and move your venture marker to Secret Entrance (the first room)."}, {"date": "2022-06-10", "text": "If you’re already in a dungeon when instructed to venture into Undercity, you move to the next room of that dungeon. If you are already in the last room, you will complete that dungeon and start Undercity. This is true whether you’re already in Undercity or any other dungeon."}], "setCode": "CLB", "subtypes": ["Dwarf", "Barbarian"], "supertypes": [], "text": "When Vicious Battlerager enters the battlefield, you take the initiative.\nSpiked Retribution — Whenever Vicious Battlerager becomes blocked by a creature, that creature's controller loses 5 life.", "toughness": "5", "type": "Creature — Dwarf Barbarian", "types": ["Creature"], "uuid": "ffacac1a-8fdc-5452-a61c-386ff95c744f"}