{"artist": "Joshua Hagler", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 7.0, "edhrecRank": 6054, "finishes": ["nonfoil", "foil"], "flavorText": "\"Thrashes of the ancient past still linger in spirit and shadow, desperate to sink their claws into our souls.\"\n—Rakka Mar", "foreignData": [{"flavorText": "„Die Banden der Urzeiten haben als Geister und Schatten überlebt. Sie warten nur darauf, ihre Klauen in unsere Seelen zu versenken.\" —Rakka Mar", "language": "German", "multiverseId": 187586, "name": "Bösartige Schatten", "text": "Immer wenn eine Kreatur aus dem Spiel auf einen Friedhof gelegt wird, kannst du die Bösartige Schatten einem Spieler deiner Wahl so viele Schadenspunkte zufügen lassen, wie dieser Spieler Karten auf der Hand hat.", "type": "Verzauberung"}, {"flavorText": "\"Las azotadas del pasado todavía permanecen en espíritu, desesperadas por clavar sus garras en nuestras almas.\" —Rakka Mar", "language": "Spanish", "multiverseId": 187835, "name": "Sombras perversas", "text": "Siempre que una criatura vaya a un cementerio desde el juego, puedes hacer que las Sombras perversas hagan daño al jugador objetivo igual a la cantidad de cartas en la mano de ese jugador.", "type": "Encantamiento"}, {"flavorText": "« Les ombres et les esprits des rosses de jadis sont toujours là, désespérant de pouvoir plonger leurs griffes dans nos âmes. » —Rakka Mar", "language": "French", "multiverseId": 188582, "name": "Ombres vicieuses", "text": "À chaque fois qu'une créature est mise dans un cimetière depuis le jeu, vous pouvez faire que les Ombres vicieuses infligent au joueur ciblé un nombre de blessures égal au nombre de cartes dans la main de ce joueur.", "type": "Enchantement"}, {"flavorText": "\"Le batoste dell'antico passato permangono in spirito e ombra, con un bisogno disperato di affondare i loro artigli nelle nostre anime.\" —Rakka Mar", "language": "Italian", "multiverseId": 188333, "name": "Ombre Crudeli", "text": "Ogniqualvolta una creatura viene messa in un cimitero dal gioco, puoi fare infliggere dalle Ombre Crudeli a un giocatore bersaglio danno pari al numero di carte in mano a quel giocatore.", "type": "Incantesimo"}, {"flavorText": "「昔の襲撃団は意志として影の中に未だに息づいていて、私達の魂の奥にまで爪を立てようとしているわね。」 ――ラッカ・マー", "language": "Japanese", "multiverseId": 187088, "name": "不純な影", "text": "クリーチャーが１体場からいずれかの墓地に置かれるたび、プレイヤー１人を対象とする。あなたは「不純な影はそのプレイヤーに、そのプレイヤーの手札のカードの枚数に等しい点数のダメージを与える。」を選んでもよい。", "type": "エンチャント"}, {"flavorText": "\"O espírito e as sombras dos surradores do passado longínquo ainda perambulam por aí, desesperados por enfiar suas garras em nossas almas.\" — Rakka Mar", "language": "Portuguese (Brazil)", "multiverseId": 188084, "name": "Sombras Viciosas", "text": "Toda vez que uma criatura é colocada no cemitério vinda do jogo, você pode fazer com que Sombras Viciosas cause dano ao jogador alvo igual ao número de cards na mão daquele jogador.", "type": "Encantamento"}, {"flavorText": "«Стаи из глубокого прошлого не спешат покидать этот мир ни духом, ни тенью, отчаянно желая вцепиться когтями в наши души». — Ракка Мар", "language": "Russian", "multiverseId": 188831, "name": "Злобные Тени", "text": "Каждый раз, когда существо попадает из игры на кладбище, вы можете заставить Злобные Тени нанести повреждения целевому игроку, равные количеству карт в руке того игрока.", "type": "Чары"}, {"flavorText": "「古老的击族依旧以灵魂与阴影的型态逗留着，亟欲将其利爪刺进我们的灵魂。」 ～拉卡玛", "language": "Chinese Simplified", "multiverseId": 187337, "name": "恶毒阴影", "text": "每当一个生物从场上置入坟墓场时，你可以让恶毒阴影对目标牌手造成等同于该牌手之手牌数量的伤害。", "type": "结界"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "126125", "cardKingdomId": "125890", "cardsphereId": "42715", "mcmId": "19879", "mcmMetaId": "10191", "mtgjsonV4Id": "08561b2f-7121-56de-9c53-489be0bbd338", "mtgoFoilId": "31118", "mtgoId": "31117", "multiverseId": "175048", "scryfallId": "d040791e-eee4-4eef-ace1-507216a5d268", "scryfallIllustrationId": "87783e71-8269-4399-b82b-1a88561d7c97", "scryfallOracleId": "9707ac4f-6493-47fe-9c31-4daf469b5c6e", "tcgplayerProductId": "27838"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{6}{R}", "manaValue": 7.0, "name": "Vicious Shadows", "number": "119", "originalText": "Whenever a creature is put into a graveyard from play, you may have Vicious Shadows deal damage to target player equal to the number of cards in that player's hand.", "originalType": "Enchantment", "printings": ["ALA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/b73373825c70d941", "cardKingdomFoil": "https://mtgjson.com/links/ba16f4feb6e8080e", "cardmarket": "https://mtgjson.com/links/87edf3997f28d5a9", "tcgplayer": "https://mtgjson.com/links/15130e698ef0e170"}, "rarity": "rare", "rulings": [{"date": "2008-10-01", "text": "The player you target doesn’t have to be the controller of the creature that was put into a graveyard."}, {"date": "2008-10-01", "text": "The number of cards in the targeted opponent’s hand is checked only when the ability resolves."}], "setCode": "ALA", "subtypes": [], "supertypes": [], "text": "Whenever a creature dies, you may have Vicious Shadows deal damage to target player equal to the number of cards in that player's hand.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "7511cfb7-63a5-54cb-a741-ccac0e802724"}