{"artist": "Andrew Mar", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 4362, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 539183, "name": "Visionen der Verheerung", "text": "Jeder Gegner opfert ein Artefakt. Für jedes auf diese Weise geopferte Artefakt erzeugst du einen Schatz-Spielstein.\nRückblende {8}{R}{R}. Auf diese Weise gewirkt, kostet dieser Zauberspruch {X} weniger, wobei X gleich dem höchsten Manabetrag eines Kommandeurs ist, den du besitzt und der sich in der Kommandozone oder im Spiel befindet.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 539221, "name": "Visiones de catástrofe", "text": "Cada oponente sacrifica un artefacto. Por cada artefacto sacrificado de esta manera, creas una ficha de Tesoro.\nRetrospectiva {8}{R}{R}. Te cuesta {X} menos lanzar este hechizo de esta manera, donde X es el mayor valor de maná de un comandante del cual eres propietario en el campo de batalla o en la zona de mando.", "type": "Conjuro"}, {"language": "French", "multiverseId": 539259, "name": "Visions de ruine", "text": "Chaque adversaire sacrifie un artefact. Pour chaque artefact sacrifié de cette manière, vous créez un jeton Trésor.\nFlashback {8}{R}{R}. Ce sort coûte {X} de moins à lancer de cette manière, X étant la valeur de mana la plus élevée d'un commandant que vous possédez sur le champ de bataille ou dans la zone de commandement.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 539297, "name": "Visioni di Rovina", "text": "Ogni avversario sacrifica un artefatto. Per ogni artefatto sacrificato in questo modo, crei una pedina Tesoro.\nFlashback {8}{R}{R}. Questa magia costa {X} in meno per essere lanciata in questo modo, dove X è il valore di mana maggiore di un comandante che possiedi sul campo di battaglia o nella zona di comando.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 539335, "name": "喪失の光景", "text": "各対戦相手はそれぞれ、アーティファクト１つを生け贄に捧げる。あなたは、これにより生け贄に捧げたアーティファクト１つにつき１つの宝物・トークンを生成する。\nフラッシュバック{8}{R}{R}。これによりこの呪文を唱えるためのコストは{X}少なくなる。Ｘは、戦場か統率領域にありあなたがオーナーである統率者のうち最大のマナ総量に等しい。", "type": "ソーサリー"}], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "250399", "cardsphereId": "81782", "mcmId": "575515", "mtgjsonV4Id": "b8a46c4f-a4c8-53c4-acf4-d4168f7e3696", "multiverseId": "539145", "scryfallId": "e7b630d4-4088-4811-bcff-df2fa1e66ab8", "scryfallIllustrationId": "13d7b122-b9a4-4906-8b19-d7a12ccf17e5", "scryfallOracleId": "3570001c-844f-4319-9850-ab997d62a83b", "tcgplayerProductId": "247941"}, "isStarter": true, "keywords": ["Flashback"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}", "manaValue": 4.0, "name": "Visions of Ruin", "number": "74", "originalText": "Each opponent sacrifices an artifact. For each artifact sacrificed this way, you create a Treasure token.\nFlashback {8}{R}{R}. This spell costs {X} less to cast this way, where X is the greatest mana value of a commander you own on the battlefield or in the command zone.", "originalType": "Sorcery", "printings": ["MIC"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/42f880bc31370a37", "tcgplayer": "https://mtgjson.com/links/0cd059704a3c1ed1"}, "rarity": "rare", "rulings": [{"date": "2021-09-24", "text": "“Flashback [cost]” means “You may cast this card from your graveyard by paying [cost] rather than paying its mana cost” and “If the flashback cost was paid, exile this card instead of putting it anywhere else any time it would leave the stack.”"}, {"date": "2021-09-24", "text": "You must still follow any timing restrictions and permissions, including those based on the card's type. For instance, you can cast a sorcery using flashback only when you could normally cast a sorcery."}, {"date": "2021-09-24", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a flashback cost) you're paying, add any cost increases, then apply any cost reductions. The mana value of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2021-09-24", "text": "A spell cast using flashback will always be exiled afterward, whether it resolves, is countered, or leaves the stack in some other way."}, {"date": "2021-09-24", "text": "You can cast a spell using flashback even if it was somehow put into your graveyard without having been cast."}, {"date": "2021-09-24", "text": "If a card with flashback is put into your graveyard during your turn, you can cast it if it's legal to do so before any other player can take any actions."}], "securityStamp": "oval", "setCode": "MIC", "subtypes": [], "supertypes": [], "text": "Each opponent sacrifices an artifact. For each artifact sacrificed this way, you create a Treasure token.\nFlashback {8}{R}{R}. This spell costs {X} less to cast this way, where X is the greatest mana value of a commander you own on the battlefield or in the command zone. (You may cast this card from your graveyard for its flashback cost. Then exile it.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "8e76e6ae-2cd2-50c9-b087-d92935d6e462", "variations": ["349a5fae-7a38-583a-8b5c-d92043f70946"]}