{"artist": "Andrew Mar", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 3.0, "edhrecRank": 10445, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 539181, "name": "Visionen des Grauens", "text": "Ein Gegner deiner Wahl bringt eine Kreaturenkarte, die er bestimmt, aus seinem Friedhof unter deiner Kontrolle ins Spiel.\nRückblende {8}{B}{B}. Auf diese Weise gewirkt, kostet dieser Zauberspruch {X} weniger, wobei X gleich dem höchsten Manabetrag eines Kommandeurs ist, den du besitzt und der sich in der Kommandozone oder im Spiel befindet.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 539219, "name": "Visiones de pavor", "text": "El oponente objetivo pone en el campo de batalla bajo tu control una carta de criatura de su elección de su cementerio.\nRetrospectiva {8}{B}{B}. Te cuesta {X} menos lanzar este hechizo de esta manera, donde X es el mayor valor de maná de un comandante del cual eres propietario en el campo de batalla o en la zona de mando.", "type": "Conjuro"}, {"language": "French", "multiverseId": 539257, "name": "Visions d'effroi", "text": "Un adversaire ciblé met sur le champ de bataille, sous votre contrôle, une carte de créature de son choix depuis son cimetière.\nFlashback {8}{B}{B}. Ce sort coûte {X} de moins à lancer de cette manière, X étant la valeur de mana la plus élevée d'un commandant que vous possédez sur le champ de bataille ou dans la zone de commandement.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 539295, "name": "Visioni di Terrore", "text": "Un avversario bersaglio mette sul campo di battaglia sotto il tuo controllo una carta creatura a sua scelta dal suo cimitero.\nFlashback {8}{B}{B}. Questa magia costa {X} in meno per essere lanciata in questo modo, dove X è il valore di mana maggiore di un comandante che possiedi sul campo di battaglia o nella zona di comando.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 539333, "name": "戦慄の光景", "text": "対戦相手１人を対象とする。そのプレイヤーは自分の墓地にあるクリーチャー・カード１枚を選び、あなたのコントロール下で戦場に出す。\nフラッシュバック{8}{B}{B}。これによりこの呪文を唱えるためのコストは{X}少なくなる。Ｘは、戦場か統率領域にありあなたがオーナーである統率者のうち最大のマナ総量に等しい。", "type": "ソーサリー"}], "frameEffects": ["extendedart"], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "250397", "cardsphereId": "81774", "mcmId": "575513", "mtgjsonV4Id": "76cfba9e-526d-55bb-b5da-a34125e28fb6", "multiverseId": "539143", "scryfallId": "8ab0d0a1-207d-4160-b9c3-dfc639b89d42", "scryfallIllustrationId": "de1d45ff-1c72-442f-a7f1-90aeb514fa15", "scryfallOracleId": "0b12fee3-1ad1-4dc3-bd19-e9ccce5cb829", "tcgplayerProductId": "247937"}, "isStarter": true, "keywords": ["Flashback"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}", "manaValue": 3.0, "name": "Visions of Dread", "number": "72", "originalText": "Target opponent puts a creature card of their choice from their graveyard onto the battlefield under your control.\nFlashback {8}{B}{B}. This spell costs {X} less to cast this way, where X is the greatest mana value of a commander you own on the battlefield or in the command zone.", "originalType": "Sorcery", "printings": ["MIC"], "promoTypes": ["boosterfun"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/63b341508afa92be", "tcgplayer": "https://mtgjson.com/links/8e46d6652ede1f72"}, "rarity": "rare", "rulings": [{"date": "2021-09-24", "text": "If you leave the game while controlling permanents owned by other players that entered the battlefield under your control, those permanents are exiled. If the other players leave the game, they take their cards with them. (By contrast, if you leave the game while controlling permanents owned by another player you gained control of, those control-changing effects end and the permanents return to their previous controllers.)"}, {"date": "2021-09-24", "text": "If your commander is under the control of another player as you cast Visions of Dread using its flashback ability, that commander's mana value can be used to determine the value of X."}, {"date": "2021-09-24", "text": "The cost-reduction effect that applies if you cast Visions of Dread using flashback applies only to the generic portion of the cost to cast it, although it can apply to any additional costs there may be to cast the spell. It can't reduce any colored mana required to cast the spell."}, {"date": "2021-09-24", "text": "“Flashback [cost]” means “You may cast this card from your graveyard by paying [cost] rather than paying its mana cost” and “If the flashback cost was paid, exile this card instead of putting it anywhere else any time it would leave the stack.”"}, {"date": "2021-09-24", "text": "You must still follow any timing restrictions and permissions, including those based on the card's type. For instance, you can cast a sorcery using flashback only when you could normally cast a sorcery."}, {"date": "2021-09-24", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a flashback cost) you're paying, add any cost increases, then apply any cost reductions. The mana value of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2021-09-24", "text": "A spell cast using flashback will always be exiled afterward, whether it resolves, is countered, or leaves the stack in some other way."}, {"date": "2021-09-24", "text": "You can cast a spell using flashback even if it was somehow put into your graveyard without having been cast."}, {"date": "2021-09-24", "text": "If a card with flashback is put into your graveyard during your turn, you can cast it if it's legal to do so before any other player can take any actions."}], "securityStamp": "oval", "setCode": "MIC", "subtypes": [], "supertypes": [], "text": "Target opponent puts a creature card of their choice from their graveyard onto the battlefield under your control.\nFlashback {8}{B}{B}. This spell costs {X} less to cast this way, where X is the greatest mana value of a commander you own on the battlefield or in the command zone. (You may cast this card from your graveyard for its flashback cost. Then exile it.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "69ffbad8-6e91-5e63-bc1b-e1c0210e8a1d", "variations": ["a8bf636c-f04f-5360-8f69-e98b72b4824b"]}