{"artist": "Ryan Yee", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 2887, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "212379", "cardsphereId": "49482", "mcmId": "297633", "mtgjsonV4Id": "101d5dd9-5cdd-56a3-980c-b1bbddf74ff6", "scryfallId": "386577fe-9322-4168-bdcd-ecebb2f51e01", "scryfallIllustrationId": "70ddc09e-78bc-4806-9527-62a54bf61aab", "scryfallOracleId": "55bceb83-bbba-477f-98ce-6e0a80b91080", "tcgplayerProductId": "130678"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Embalm"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{U}", "manaValue": 4.0, "name": "Vizier of Many Faces", "number": "74s", "power": "0", "printings": ["AKH", "AKR", "PAKH"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/cdda6d0ff70ff754", "tcgplayer": "https://mtgjson.com/links/36429de49fbb94b3"}, "rarity": "rare", "rulings": [{"date": "2017-04-18", "text": "If the chosen creature has {X} in its mana cost, X is considered to be 0."}, {"date": "2017-04-18", "text": "If the chosen creature is copying something else (for example, if the chosen creature is another Vizier of Many Faces), then Vizier of Many Faces enters the battlefield as whatever the chosen creature copied."}, {"date": "2017-04-18", "text": "If the chosen creature is a token, Vizier of Many Faces copies the original characteristics of that token as stated by the effect that created the token. Vizier of Many Faces is not a token in this case unless it’s embalmed."}, {"date": "2017-04-18", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when Vizier of Many Faces enters the battlefield. Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities of the chosen creature will also work."}, {"date": "2017-04-18", "text": "Vizier of Many Faces copies exactly what was printed on the original creature (unless that creature is copying something else or is a token; see below). It doesn’t copy whether that creature is tapped or untapped, whether it has any counters on it or Auras attached to it, or any non-copy effects that have changed its power, toughness, types, color, or so on."}, {"date": "2017-04-18", "text": "For each card with embalm, a corresponding game play supplement token can be found in some Amonkhet booster packs. These supplements are not required to play with cards with embalm; you can use the same items to represent an embalmed token as you would any other token."}, {"date": "2017-04-18", "text": "The token copies exactly what was printed on the original card and nothing else. It doesn’t copy any information about the object the card was before it was put into your graveyard."}, {"date": "2017-04-18", "text": "The token is a Zombie in addition to its other types and is white instead of its other colors. It has no mana cost, and thus its converted mana cost is 0. These are copiable values of the token that other effects may copy."}, {"date": "2017-04-18", "text": "If the card copied by the token had any “when [this permanent] enters the battlefield” abilities, then the token also has those abilities and will trigger them when it’s created. Similarly, any “as [this permanent] enters the battlefield” or “[this permanent] enters the battlefield with” abilities that the token has copied will also work."}, {"date": "2017-04-18", "text": "If Vizier of Many Faces somehow enters the battlefield at the same time as another creature, Vizier of Many Faces can’t become a copy of that creature. You may choose only a creature that’s already on the battlefield."}, {"date": "2017-04-18", "text": "The characteristics Vizier of Many Faces gains as part of its copy effect are copiable values that other effects may copy."}, {"date": "2017-07-14", "text": "If a spell or ability puts a creature card with embalm into your graveyard during your main phase, you’ll have priority immediately after that spell or ability resolves. You can activate the creature card’s embalm ability before any player can exile it with an effect, such as that of Crook of Condemnation, if it’s legal for you to do so."}, {"date": "2017-07-14", "text": "Once you’ve activated an embalm ability, the card is immediately exiled. Opponents can’t try to stop the ability by exiling the card with an effect such as that of Crook of Condemnatnion."}], "securityStamp": "oval", "setCode": "PAKH", "subtypes": ["Shapeshifter", "Cleric"], "supertypes": [], "text": "You may have Vizier of Many Faces enter the battlefield as a copy of any creature on the battlefield, except if Vizier of Many Faces was embalmed, the token has no mana cost, it's white, and it's a Zombie in addition to its other types.\nEmbalm {3}{U}{U}", "toughness": "0", "type": "Creature — Shapeshifter Cleric", "types": ["Creature"], "uuid": "c13a88ef-d4aa-558d-bdd9-d8f954af7964"}