{"artist": "Ryan Pancoast", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "W"], "colors": ["B", "W"], "convertedManaCost": 5.0, "edhrecRank": 15175, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 366972, "name": "Vizkopa-Beichtvater", "text": "Abnötigen (Immer wenn du einen Zauberspruch wirkst, kannst du {W/B} bezahlen. Falls du dies tust, verliert jeder Gegner 1 Lebenspunkt und du erhältst ebenso viele Lebenspunkte dazu.)\nWenn der Vizkopa-Beichtvater ins Spiel kommt, zahle eine beliebige Anzahl an Lebenspunkten. Ein Gegner deiner Wahl zeigt ebenso viele Karten von seiner Hand offen vor. Du bestimmst eine von ihnen und schickst sie ins Exil.", "type": "Kreatur — Mensch, Kleriker"}, {"language": "Spanish", "multiverseId": 368154, "name": "Confesor de Vizkopa", "text": "Extorsionar. (Siempre que lances un hechizo, puedes pagar {W/B}. Si lo haces, cada oponente pierde 1 vida y tú ganas esa cantidad de vidas.)Cuando el Confesor de Vizkopa entre al campo de batalla, paga cualquier cantidad de vidas. El oponente objetivo muestra esa misma cantidad de cartas de su mano. Tú eliges una de ellas y la exilias.", "type": "Criatura — Clérigo humano"}, {"language": "French", "multiverseId": 366625, "name": "Confesseur de Vizkopa", "text": "Extorsion (À chaque fois que vous lancez un sort, vous pouvez payer {W/B}. Si vous faites ainsi, chaque adversaire perd 1 point de vie et vous gagnez autant de points de vie.)\nQuand le Confesseur de Vizkopa arrive sur le champ de bataille, payez le nombre de points de vie de votre choix. L'adversaire ciblé révèle autant de cartes de sa main. Vous choisissez l'une d'elles et vous l'exilez.", "type": "Créature : humain et clerc"}, {"language": "Italian", "multiverseId": 367134, "name": "Confessore di Vizkopa", "text": "Estorsione (Ogniqualvolta lanci una magia, puoi pagare {W/B}. Se lo fai, ogni avversario perde 1 punto vita e tu guadagni altrettanti punti vita.)\nQuando il Confessore di Vizkopa entra nel campo di battaglia, paga un qualsiasi ammontare di punti vita. Un avversario bersaglio rivela altrettante carte dalla sua mano. Scegli una di esse ed esiliala.", "type": "Creatura — Chierico Umano"}, {"language": "Japanese", "multiverseId": 368471, "name": "ヴィズコーパの聴罪司祭", "text": "強請（あなたが呪文を１つ唱えるたび、あなたは{W/B}を支払ってもよい。そうした場合、各対戦相手はそれぞれ１点のライフを失い、あなたはその点数分のライフを得る。）ヴィズコーパの聴罪司祭が戦場に出たとき、ライフを望む点数だけ支払う。対戦相手１人を対象とする。そのプレイヤーはその点数に等しい枚数のカードを自分の手札から公開する。あなたはその中から１枚を選んで追放する。", "type": "クリーチャー — 人間・クレリック"}, {"language": "Korean", "multiverseId": 367457, "name": "비즈코파 고해 신부", "text": "착취 (당신이 주문을 발동할 때마다 당신은 {W/B}를 지불할 수 있다. 그렇게 한다면, 각 상대는 생명 1점을 잃고 당신은 그만큼의 생명점을 얻는다.)\n비즈코파 고해 신부가 전장에 들어올 때, 생명점을 원하는 만큼 지불한다. 상대 한 명을 목표로 정한다. 그 상대는 당신이 지불한 생명점만큼의 카드를 손에서 공개한다. 상대가 손에서 공개한 카드 한 장을 골라 추방한다.", "type": "생물 — 인간 성직자"}, {"language": "Portuguese (Brazil)", "multiverseId": 367602, "name": "Confessor de Vizkopa", "text": "Extorquir (Toda vez que você conjurar uma mágica, poderá pagar {W/B}. Se fizer isso, cada oponente perderá 1 ponto de vida e você ganhará uma quantidade equivalente de pontos de vida.)Quando Confessor de Vizkopa entrar no campo de batalha, pague qualquer quantidade de pontos de vida. O oponente alvo revela a mesma quantidade de cards da própria mão. Você escolhe um deles e o exila.", "type": "Criatura — Humano Clérigo"}, {"language": "Russian", "multiverseId": 367728, "name": "Исповедник из Визкопы", "text": "Вымогательство (Каждый раз, когда вы разыгрываете заклинание, вы можете заплатить {W/B}. Если вы это делаете, каждый оппонент теряет 1 жизнь, а вы получаете столько же жизней.)\nКогда Исповедник из Визкопы выходит на поле битвы, заплатите любое количество жизней. Целевой оппонент показывает такое же количество карт из своей руки. Выберите одну из них и изгоните ее.", "type": "Существо — Человек Священник"}, {"language": "Chinese Simplified", "multiverseId": 365778, "name": "伟柯帕告解僧", "text": "敲诈（每当你施放一个咒语时，你可以支付{W/B}。若你如此作，则每位对手各失去1点生命，且你获得等量的生命。）\n当伟柯帕告解僧进战场时，支付任意数量的生命。目标对手自其手牌展示等量的牌。你从中选择一张，并将该牌放逐。", "type": "生物～人类／僧侣"}, {"language": "Chinese Traditional", "multiverseId": 366101, "name": "偉柯帕告解僧", "text": "敲詐（每當你施放一個咒語時，你可以支付{W/B}。若你如此作，則每位對手各失去1點生命，且你獲得等量的生命。）\n當偉柯帕告解僧進戰場時，支付任意數量的生命。 目標對手自其手牌展示等量的牌。你從中選擇一張，並將該牌放逐。", "type": "生物～人類／僧侶"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "189210", "cardKingdomId": "188911", "cardsphereId": "19442", "mcmId": "259892", "mcmMetaId": "207130", "mtgjsonV4Id": "418dc58b-18cf-58fd-87a3-36e3348784b6", "mtgoFoilId": "47702", "mtgoId": "47701", "multiverseId": "366267", "scryfallId": "cac639b9-6c20-45ac-a61f-082bdcebdb83", "scryfallIllustrationId": "0598462e-b808-404f-bd6c-8e2401d76cc0", "scryfallOracleId": "9db7cb7f-1309-4f1d-9c9d-423c91c0896c", "tcgplayerProductId": "67406"}, "keywords": ["Extort"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}{B}", "manaValue": 5.0, "name": "Vizkopa Confessor", "number": "205", "originalText": "Extort (Whenever you cast a spell, you may pay {WB}. If you do, each opponent loses 1 life and you gain that much life.)\nWhen Vizkopa Confessor enters the battlefield, pay any amount of life. Target opponent reveals that many cards from his or her hand. You choose one of them and exile it.", "originalType": "Creature — Human Cleric", "power": "1", "printings": ["GTC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6e14d8be38d8116c", "cardKingdomFoil": "https://mtgjson.com/links/25a149a08ce6b1e2", "cardmarket": "https://mtgjson.com/links/66edb81b00f4674b", "tcgplayer": "https://mtgjson.com/links/5cca96d4860bc12b"}, "rarity": "uncommon", "rulings": [{"date": "2013-01-24", "text": "You may pay 0 life when Vizkopa Confessor’s enters-the-battlefield ability resolves. If you do, no cards are revealed or exiled."}, {"date": "2013-01-24", "text": "The amount of life you pay is chosen when Vizkopa Confessor’s last ability resolves."}, {"date": "2013-01-24", "text": "If the target opponent is an illegal target when Vizkopa Confessor’s last ability tries to resolve, it won’t resolve and none of its effects will happen. You won’t pay life and no player will reveal any cards."}, {"date": "2013-04-15", "text": "You may pay {W/B} a maximum of one time for each extort triggered ability. You decide whether to pay when the ability resolves."}, {"date": "2013-04-15", "text": "The amount of life you gain from extort is based on the total amount of life lost, not necessarily the number of opponents you have. For example, if your opponent’s life total can’t change (perhaps because that player controls Platinum Emperion), you won’t gain any life."}, {"date": "2013-04-15", "text": "The extort ability doesn’t target any player."}], "setCode": "GTC", "subtypes": ["Human", "Cleric"], "supertypes": [], "text": "Extort (Whenever you cast a spell, you may pay {W/B}. If you do, each opponent loses 1 life and you gain that much life.)\nWhen Vizkopa Confessor enters the battlefield, pay any amount of life. Target opponent reveals that many cards from their hand. You choose one of them and exile it.", "toughness": "3", "type": "Creature — Human Cleric", "types": ["Creature"], "uuid": "e8401ce4-67a0-59f2-9514-d70d8912c70e", "watermark": "orzhov"}