{"artist": "rk post", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 5.0, "edhrecRank": 22284, "finishes": ["nonfoil", "foil"], "flavorText": "As Grixis collided with the rest of Alara, the worlds began to hear the hateful whispers of the forgotten dead.", "foreignData": [{"flavorText": "Als Grixis mit dem Rest von Alara zusammenstieß, begannen die anderen Welten das hasserfüllte Geflüster der vergessenen Toten zu hören.", "language": "German", "multiverseId": 193158, "name": "Stimmen aus der Leere", "text": "Domäne Ein Spieler deiner Wahl wirft für jeden Standardlandtyp unter den Ländern, die du kontrollierst, eine Karte aus der Hand ab.", "type": "Hexerei"}, {"flavorText": "Cuando Grixis chocó con el resto de Alara, los mundos empezaron a oír los odiosos susurros de los muertos.", "language": "Spanish", "multiverseId": 192288, "name": "Voces del vacío", "text": "Dominio El jugador objetivo descarta una carta por cada tipo de tierra básica entre las tierras que controlas.", "type": "Conjuro"}, {"flavorText": "Quand Grixis entra en collision avec le reste d'Alara, les mondes commencèrent à entendre les murmures honnis des morts oubliés.", "language": "French", "multiverseId": 192433, "name": "Voix venues du vide", "text": "Domaine — Le joueur ciblé se défausse d'une carte pour chaque type de terrain de base parmi les terrains que vous contrôlez.", "type": "Rituel"}, {"flavorText": "Non appena Grixis si fuse al resto di Alara, gli altri mondi cominciarono a udire i sussurri carichi d'odio dei morti a lungo dimenticati.", "language": "Italian", "multiverseId": 192578, "name": "Voci dal Nulla", "text": "Dominio Un giocatore bersaglio scarta una carta per ogni tipo di terra base tra le terre che controlli.", "type": "Stregoneria"}, {"flavorText": "グリクシスがアラーラの他の世界とぶつかり合った時から、世界は忘れ去られた死者の憎悪に満ちた囁きを耳にすることになった。", "language": "Japanese", "multiverseId": 193013, "name": "虚空からの声", "text": "版図 ― プレイヤー１人を対象とする。そのプレイヤーは、あなたがコントロールする土地の中の基本土地タイプ１つにつきカードを１枚捨てる。", "type": "ソーサリー"}, {"flavorText": "Quando Grixis colidiu com o restante de Alara, os mundos começaram a ouvir os sussurros abomináveis dos mortos esquecidos.", "language": "Portuguese (Brazil)", "multiverseId": 193303, "name": "Vozes do Vácuo", "text": "Dominar O jogador alvo descarta um card para cada tipo de terreno básico entre os terrenos que você controla.", "type": "Feitiço"}, {"flavorText": "Когда Гриксис столкнулся с другими мирами Алары, в них стал слышен мерзкий шепот забытых мертвецов.", "language": "Russian", "multiverseId": 192868, "name": "Голоса из Пустоты", "text": "Владения Целевой игрок сбрасывает одну карту за каждый тип базовой земли среди земель под вашим контролем.", "type": "Волшебство"}, {"flavorText": "随着格利极遭逢阿拉若的其余部份，世界开始听闻被遗忘亡者的怨恨细语。", "language": "Chinese Simplified", "multiverseId": 192723, "name": "虚空之音", "text": "领土～由你操控的地之中每有一种基本地类别，目标牌手便弃一张牌。", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "126568", "cardKingdomId": "126414", "cardsphereId": "11255", "mcmId": "20698", "mcmMetaId": "10324", "mtgjsonV4Id": "9d882587-cb85-5c3b-abf7-12af21e5eee4", "mtgoFoilId": "31658", "mtgoId": "31657", "multiverseId": "150847", "scryfallId": "faf285d7-c414-48ab-ad1f-1f49e586c278", "scryfallIllustrationId": "60bbcda7-94e1-4dd7-a087-806d11fa76ae", "scryfallOracleId": "8c5264d2-8544-4e83-8ebc-7261dde80f01", "tcgplayerProductId": "28628"}, "keywords": ["Domain"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{B}", "manaValue": 5.0, "name": "Voices from the Void", "number": "55", "originalText": "Domain Target player discards a card for each basic land type among lands you control.", "originalType": "Sorcery", "printings": ["CON"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/78b86d8141bf86ea", "cardKingdomFoil": "https://mtgjson.com/links/1c3d71ee231aca4e", "cardmarket": "https://mtgjson.com/links/e85bddac05198530", "tcgplayer": "https://mtgjson.com/links/7b2cce0f66e90489"}, "rarity": "uncommon", "rulings": [{"date": "2009-02-01", "text": "To determine the number of basic land types among lands you control, look at the lands you have on the battlefield and ask yourself whether the subtypes Plains, Island, Swamp, Mountain, and Forest appear within that group. The number of times you say yes (topping out at five) tells you how powerful your domain abilities will be."}, {"date": "2009-02-01", "text": "How many lands you control of a particular basic land type is irrelevant to a domain ability, as long as that number is greater than zero. As far as domain is concerned, ten Forests is the same as one Forest."}, {"date": "2009-02-01", "text": "A number of nonbasic lands have basic land types. Domain abilities don’t count the number of lands you control — they count the number of basic land types among lands you control, even if that means checking the same land twice. For example, if you control a Tundra, an Overgrown Tomb, and a Madblind Mountain, you’ll have a Plains, Island, Swamp, Mountain, and Forest among the lands you control. Your domain abilities will be maxed out."}], "setCode": "CON", "subtypes": [], "supertypes": [], "text": "Domain — Target player discards a card for each basic land type among lands you control.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "a076d053-e117-592c-8b29-9a64062eae45"}