{"artist": "Heonhwa Choe", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["B", "G", "U"], "colors": ["B", "G", "U"], "convertedManaCost": 5.0, "edhrecRank": 7173, "finishes": ["foil"], "foreignData": [{"language": "German", "multiverseId": 470899, "name": "Volrath der Gestalträuber", "text": "Zu Beginn des Kampfes in deinem Zug legst du eine -1/-1-Marke auf bis zu eine Kreatur deiner Wahl.\n{1}: Bis zu deinem nächsten Zug wird Volrath der Gestalträuber zu einer Kopie einer Kreatur deiner Wahl, auf der mindestens eine Marke liegt, außer dass er 7/5 ist und diese Fähigkeit hat.", "type": "Legendäre Kreatur — Gestaltwandler"}, {"language": "Spanish", "multiverseId": 471201, "name": "Volrath, el Robaformas", "text": "Al comienzo del combate en tu turno, pon un contador -1/-1 sobre hasta una criatura objetivo.\n{1}: Hasta tu próximo turno, Volrath, el Robaformas se convierte en una copia de la criatura objetivo con un contador sobre ella, excepto que es una criatura 7/5 y tiene esta habilidad.", "type": "Criatura legendaria — Metamorfo"}, {"language": "French", "multiverseId": 471503, "name": "Wöhlrajh, le voleur de forme", "text": "Au début du combat pendant votre tour, mettez un marqueur -1/-1 sur jusqu'à une créature ciblée.\n{1} : Jusqu'à votre prochain tour, Wöhlrajh, le voleur de forme devient une copie d'une créature ciblée avec un marqueur sur elle, excepté qu'il est 7/5 et qu'il a cette capacité.", "type": "Créature légendaire : changeforme"}, {"language": "Italian", "multiverseId": 471805, "name": "Volrath, il Rubaforma", "text": "Scegli fino a una creatura bersaglio. All'inizio del combattimento nel tuo turno, metti un segnalino -1/-1 su quella creatura.\n{1}: Fino al tuo prossimo turno, Volrath, il Rubaforma diventa una copia di una creatura bersaglio con un segnalino, tranne che è 7/5 e ha questa abilità.", "type": "Creatura Leggendaria — Polimorfo"}, {"language": "Japanese", "multiverseId": 472107, "name": "姿奪い、ヴォルラス", "text": "あなたのターンの戦闘の開始時に、クリーチャー最大１体を対象とし、それの上に－１/－１カウンターを１個置く。\n{1}：カウンターが置かれているクリーチャー１体を対象とする。 あなたの次のターンまで、姿奪い、ヴォルラスは、７/５でありこの能力を持つことを除きそれのコピーになる。", "type": "伝説のクリーチャー — 多相の戦士"}, {"language": "Portuguese (Brazil)", "multiverseId": 472409, "name": "Volrath, o Ladrão de Formas", "text": "No início do combate no seu turno, coloque um marcador -1/-1 em até uma criatura alvo.\n{1}: Até seu próximo turno, Volrath, o Ladrão de Formas, torna-se uma cópia da criatura alvo com um marcador, com a exceção de ser 7/5 e ter esta habilidade.", "type": "Criatura Lendária — Metamorfo"}, {"language": "Russian", "multiverseId": 472711, "name": "Волрат, Вор Облика", "text": "В начале боя во время вашего хода положите один жетон -1/-1 на не более чем одно целевое существо.\n{1}: до вашего следующего хода Волрат, Вор Облика становится копией целевого существа с жетоном на нем, но при этом он 7/5 и имеет эту способность.", "type": "Легендарное Существо — Имитатор"}], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "226951", "cardsphereId": "61385", "mcmId": "391332", "mcmMetaId": "278557", "mtgjsonV4Id": "caec7042-1ade-5a4a-af59-6b90261d1912", "mtgoId": "77156", "multiverseId": "470597", "scryfallId": "a149d6a5-c865-475a-87b7-596a19f6c80d", "scryfallIllustrationId": "9732694a-0466-4ad0-83c1-f7c08f351787", "scryfallOracleId": "a70d8e3d-a62d-4c4c-890b-e502e48c4475", "tcgplayerProductId": "196450"}, "isStarter": true, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}{G}{U}", "manaValue": 5.0, "name": "Volrath, the Shapestealer", "number": "51", "originalText": "At the beginning of combat on your turn, put a -1/-1 counter on up to one target creature.\n{1}: Until your next turn, Volrath, the Shapestealer becomes a copy of target creature with a counter on it, except it's 7/5 and it has this ability.", "originalType": "Legendary Creature — Shapeshifter", "power": "7", "printings": ["C19"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/fdf45cea46ca3ec8", "cardmarket": "https://mtgjson.com/links/ff116763906a75b0", "tcgplayer": "https://mtgjson.com/links/d34246ef0167aa86"}, "rarity": "mythic", "rulings": [{"date": "2019-08-23", "text": "Activating Volrath’s last ability causes it to lose its first ability until your next turn, so if you activate it before the beginning of combat step, it won’t trigger during that turn. Players can cast instant spells and activate abilities (such as the second ability) during the beginning of combat step after that first ability has triggered or resolved but before attackers are chosen in the declare attackers step."}, {"date": "2019-08-23", "text": "If a creature has +1/+1 counters and -1/-1 counters on it, state-based actions remove the same number of each so that it has only one of those kinds of counters on it. This may cause the creature to no longer have any counters on it."}, {"date": "2019-08-23", "text": "Volrath copies the printed values of the target creature, plus any copy effects that have been applied to it. It won’t copy counters on that creature. It also won’t copy any effects that have changed its power, toughness, types, color, or so on. Notably, it won’t copy effects that made the target become a creature if it’s not normally a creature."}, {"date": "2019-08-23", "text": "If Volrath becomes a copy of a face-down creature, Volrath becomes a 7/5 creature with no color, cost, or creature type. Volrath is still face up."}, {"date": "2019-08-23", "text": "If Volrath copies a creature that’s copying something else, it will become whatever the target is copying."}, {"date": "2019-08-23", "text": "If the target creature is a token, Volrath copies the original characteristics of that token as stated by the effect that created the token. Volrath doesn’t become a token in this case."}, {"date": "2019-08-23", "text": "If an effect begins to apply to Volrath before it becomes a copy of another creature, that effect will continue to apply."}, {"date": "2019-08-23", "text": "If Volrath copies a creature the same turn Volrath enters the battlefield, you can’t attack with it or use any of its {T} abilities (if it gains any) unless the copied creature has haste."}, {"date": "2019-08-23", "text": "If Volrath becomes a copy of a legendary creature you control, you’ll put one of them into your graveyard."}, {"date": "2019-08-23", "text": "If another object becomes a copy of Volrath, it has the ability to become a copy of something else and it’s 7/5."}, {"date": "2019-08-23", "text": "If Volrath becomes a copy of a creature whose power and toughness are defined by an ability (usually printed as */* or similar), Volrath doesn’t copy the ability that defines its power and toughness. Volrath remains a 7/5 creature."}, {"date": "2019-08-23", "text": "If Volrath copies a creature with an ability that can be activated only once each turn (such as Chainer, Nightmare Adept), you can activate that ability once. If Volrath then becomes a copy of that same creature, you can activate that ability another time, and so on."}], "securityStamp": "oval", "setCode": "C19", "subtypes": ["Phyrexian", "Shapeshifter"], "supertypes": ["Legendary"], "text": "At the beginning of combat on your turn, put a -1/-1 counter on up to one target creature.\n{1}: Until your next turn, Volrath, the Shapestealer becomes a copy of target creature with a counter on it, except it's 7/5 and it has this ability.", "toughness": "5", "type": "Legendary Creature — Phyrexian Shapeshifter", "types": ["Creature"], "uuid": "8af7fe48-28f6-5bfe-9af4-514b2d866c3b"}