{"artist": "Sandra Everingham", "availability": ["mtgo"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 6.0, "edhrecRank": 22044, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "3c4a9de4-6fe1-5ff6-ba13-58ac428d920f", "mtgoFoilId": "33621", "mtgoId": "33620", "multiverseId": "206084", "scryfallId": "c60ea64d-0209-4ca4-bee6-f9eb63784c9e", "scryfallIllustrationId": "4b5a1077-0d17-4633-8a74-0eadc4ff779b", "scryfallOracleId": "4d330c40-3d72-4528-a254-d036683958d3"}, "isOnlineOnly": true, "isReprint": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "penny": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{6}", "manaValue": 6.0, "name": "Voodoo Doll", "number": "203", "originalText": "At the beginning of your upkeep, put a pin counter on Voodoo Doll.\nAt the beginning of your end step, if Voodoo Doll is untapped, sacrifice it and it deals damage equal to the number of pin counters on it to you.\n{X}{X}, {T}: Voodoo Doll deals X damage to target creature or player. X is the number of pin counters on Voodoo Doll.", "originalType": "Artifact", "printings": ["CHR", "LEG", "ME3"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2009-10-01", "text": "Voodoo Doll’s second ability has an “intervening ‘if’ clause.” That means (1) the ability won’t trigger at all unless Voodoo Doll is untapped, and (2) the ability will do nothing if Voodoo Doll is tapped by the time it resolves. If Voodoo Doll is no longer on the battlefield as the ability resolves, its last existence on the battlefield is checked to see if it was tapped or untapped."}, {"date": "2009-10-01", "text": "Each X in the cost of Voodoo Doll’s third ability is the number of pin counters on Voodoo Doll at the time you activate the ability. The X in the ability’s effect is the number of pin counters on Voodoo Doll at the time it resolves, which may not be the same number (if a spell or ability put counters on it or removed counters from it in the meantime). If Voodoo Doll is no longer on the battlefield as the ability resolves, its last existence on the battlefield is checked to see how many pin counters were on it."}, {"date": "2011-01-01", "text": "Voodoo Doll’s second ability causes it to be destroyed regardless of whether it actually deals damage to you or not. Voodoo Doll is destroyed even if all the damage is prevented or redirected."}], "setCode": "ME3", "subtypes": [], "supertypes": [], "text": "At the beginning of your upkeep, put a pin counter on Voodoo Doll.\nAt the beginning of your end step, if Voodoo Doll is untapped, destroy Voodoo Doll and it deals damage to you equal to the number of pin counters on it.\n{X}{X}, {T}: Voodoo Doll deals damage equal to the number of pin counters on it to any target. X is the number of pin counters on Voodoo Doll.", "type": "Artifact", "types": ["Artifact"], "uuid": "c55818ec-baf1-57c2-8c6d-08618733a728"}