{"artist": "Yongjae Choi", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["deck"], "borderColor": "black", "colorIdentity": ["B", "G"], "colors": ["B", "G"], "convertedManaCost": 6.0, "edhrecRank": 16621, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 455626, "name": "Vraskas Steinblick", "text": "Zerstöre eine Kreatur deiner Wahl. Du erhältst Lebenspunkte in Höhe ihrer Widerstandskraft dazu. Du kannst deine Bibliothek und/oder deinen Friedhof nach einer Karte namens Vraska, majestätische Gorgo, durchsuchen, sie offen vorzeigen und auf deine Hand nehmen. Falls du auf diese Weise deine Bibliothek durchsuchst, mische sie danach.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 455640, "name": "Mirada pétrea de Vraska", "text": "Destruye la criatura objetivo. Ganas una cantidad de vidas igual a su resistencia. Puedes buscar en tu biblioteca y/o cementerio una carta llamada Vraska, gorgona real, mostrarla y ponerla en tu mano. Si buscas en tu biblioteca de esta manera, barájala.", "type": "Conjuro"}, {"language": "French", "multiverseId": 455654, "name": "Regard pétrificateur de Vraska", "text": "Détruisez la créature ciblée. Vous gagnez un nombre de points de vie égal à son endurance. Vous pouvez chercher dans votre bibliothèque et/ou votre cimetière une carte appelée Vraska, gorgone royale, la révéler et la mettre dans votre main. Si vous cherchez dans votre bibliothèque de cette manière, mélangez-la.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 455668, "name": "Sguardo Pietrificante di Vraska", "text": "Distruggi una creatura bersaglio. Guadagni punti vita pari alla sua costituzione. Puoi passare in rassegna il tuo grimorio e/o il tuo cimitero per una carta chiamata Vraska, Gorgone Regale, rivelarla e aggiungerla alla tua mano. Se passi in rassegna il tuo grimorio in questo modo, rimescolalo.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 455682, "name": "ヴラスカの石睨", "text": "クリーチャー１体を対象とし、それを破壊する。あなたはそれのタフネスに等しい点数のライフを得る。あなたはあなたのライブラリーやあなたの墓地から「威厳あるゴルゴン、ヴラスカ」という名前のカード１枚を探し、それを公開してあなたの手札に加えてもよい。あなたがこれによりあなたのライブラリーからカードを探したなら、あなたのライブラリーを切り直す。", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 455696, "name": "브라스카의 석화시키는 눈빛", "text": "생물 한 개를 목표로 정한다. 그 생물을 파괴한다. 당신은 그 생물의 방어력만큼 생명점을 얻는다. 당신은 당신의 서고 및/또는 무덤에서 이름이 근엄한 고르곤, 브라스카인 카드 한 장을 찾아 공개한 후 당신의 손으로 가져갈 수 있다. 당신이 이런 식으로 당신의 서고를 찾아보았다면, 당신의 서고를 섞는다.", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 455710, "name": "Olhar Pétreo de Vraska", "text": "Destrua a criatura alvo. Você ganha uma quantidade de pontos de vida igual à resistência dela. Você pode procurar um card com o nome Vraska, Górgona Régia, em seu grimório e/ou cemitério, revelá-lo e colocá-lo em sua mão. Se procurar em seu grimório desta maneira, embaralhe-o.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 455724, "name": "Каменный Взгляд Враски", "text": "Уничтожьте целевое существо. Вы получаете количество жизней, равное его выносливости. Вы можете найти в вашей библиотеке и (или) на вашем кладбище карту с именем Враска, Царственная Горгона, показать ее и положить в вашу руку. Если вы ищете таким образом в вашей библиотеке, перетасуйте ее.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 455738, "name": "瓦丝卡的瞪视", "text": "消灭目标生物。你获得等同于其防御力的生命。你可以从你的牌库和／或坟墓场中搜寻一张名称为蛇发女王瓦丝卡的牌，展示该牌，并将它置于你手上。如果你以此法搜寻你的牌库，则将它洗牌。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 455752, "name": "瓦絲卡的瞪視", "text": "消滅目標生物。你獲得等同於其防禦力的生命。你可以從你的牌庫和／或墳墓場中搜尋一張名稱為蛇髮女王瓦絲卡的牌，展示該牌，並將它置於你手上。如果你以此法搜尋你的牌庫，則將它洗牌。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "221418", "cardsphereId": "57377", "mcmId": "363834", "mtgArenaId": "68753", "mtgjsonV4Id": "b37b11c9-3274-5599-aa80-4b7727edcb0e", "mtgoId": "69371", "multiverseId": "455612", "scryfallId": "27fc4db6-a5f5-4254-ae64-c8eaf2c98030", "scryfallIllustrationId": "f8d915ba-04f1-4574-a039-7ed78b61c9e2", "scryfallOracleId": "c39e2046-173a-44b6-8e93-b22ede35485d", "tcgplayerProductId": "175570"}, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{4}{B}{G}", "manaValue": 6.0, "name": "Vraska's Stoneglare", "number": "272", "originalText": "Destroy target creature. You gain life equal to its toughness. You may search your library and/or graveyard for a card named Vraska, Regal Gorgon, reveal it, and put it into your hand. If you search your library this way, shuffle it.", "originalType": "Sorcery", "printings": ["GRN"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/997ccb56bdd24381", "tcgplayer": "https://mtgjson.com/links/c54d0868c9ace698"}, "rarity": "rare", "rulings": [{"date": "2018-10-05", "text": "If the target creature becomes an illegal target for Vraska’s Stoneglare, the spell doesn’t resolve. You don’t gain life or search for Vraska, Regal Gorgon."}, {"date": "2018-10-05", "text": "The amount of life gained is equal to the destroyed creature’s toughness as it last existed on the battlefield. If it wasn’t destroyed (most likely because it has indestructible), you gain life equal to its toughness as it currently exists on the battlefield."}], "securityStamp": "oval", "setCode": "GRN", "subtypes": [], "supertypes": [], "text": "Destroy target creature. You gain life equal to its toughness. You may search your library and/or graveyard for a card named Vraska, Regal Gorgon, reveal it, and put it into your hand. If you search your library this way, shuffle.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "116d77fe-d09d-516b-87e7-736686ee122e", "watermark": "golgari"}