{"artist": "Jason Felix", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 3148, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 470861, "name": "Mauer der gestohlenen Identität", "text": "Du kannst die Mauer der gestohlenen Identität als Kopie einer beliebigen Kreatur im Spiel ins Spiel kommen lassen, außer dass sie zusätzlich zu ihren anderen Typen eine Mauer ist und Verteidiger hat. Wenn du dies tust, tappe die kopierte Kreatur. Sie enttappt nicht während des Enttappsegments ihres Beherrschers, solange du die Mauer der gestohlenen Identität kontrollierst.", "type": "Kreatur — Gestaltwandler, Mauer"}, {"language": "Spanish", "multiverseId": 471163, "name": "Muro de la identidad usurpada", "text": "Puedes hacer que el Muro de la identidad usurpada entre al campo de batalla como una copia de cualquier criatura en el campo de batalla, excepto que es un Muro además de sus otros tipos y tiene la habilidad de defensor. Cuando lo hagas, gira la criatura copiada y no se endereza durante el paso de enderezar de su controlador mientras controles el Muro de la identidad usurpada.", "type": "Criatura — Muro metamorfo"}, {"language": "French", "multiverseId": 471465, "name": "Mur d'identité volée", "text": "Vous pouvez faire que le Mur d'identité volée arrive sur le champ de bataille comme une copie de n'importe quelle créature sur le champ de bataille, excepté que c'est un mur en plus de ses autres types et qu'il a le défenseur. Quand vous faites ainsi, engagez la créature copiée et elle ne se dégage pas pendant l'étape de dégagement de son contrôleur tant que vous contrôlez le Mur d'identité volée.", "type": "Créature : changeforme et mur"}, {"language": "Italian", "multiverseId": 471767, "name": "Muro dell'Identità Rubata", "text": "Puoi far entrare il Muro dell'Identità Rubata nel campo di battaglia come una copia di qualsiasi creatura sul campo di battaglia, tranne che è un Muro in aggiunta ai suoi altri tipi e ha difensore. Quando lo fai, TAPpa la creatura copiata ed essa non STAPpa durante lo STAP del suo controllore fintanto che controlli il Muro dell'Identità Rubata.", "type": "Creatura — Muro Polimorfo"}, {"language": "Japanese", "multiverseId": 472069, "name": "なりすましの壁", "text": "あなたはなりすましの壁を、それの他のタイプに加えて壁であり防衛を持つことを除き、戦場にあるクリーチャー１体のコピーとして戦場に出してもよい。そうしたとき、コピー元のクリーチャーをタップし、あなたがなりすましの壁をコントロールし続けているかぎり、それはそれのコントローラーのアンタップ・ステップにアンタップしない。", "type": "クリーチャー — 多相の戦士・壁"}, {"language": "Portuguese (Brazil)", "multiverseId": 472371, "name": "Barreira de Identidade Roubada", "text": "Você pode fazer com que Barreira de Identidade Roubada entre no campo de batalha como cópia de qualquer criatura no campo de batalha, com a exceção de ser uma Barreira além de seus outros tipos e ter defensor. Quando fizer isso, vire a criatura copiada. Ela não será desvirada durante a etapa de desvirar de seu controlador enquanto você controlar Barreira de Identidade Roubada.", "type": "Criatura — Metamorfo Barreira"}, {"language": "Russian", "multiverseId": 472673, "name": "Стена Краденых Личностей", "text": "Вы можете заставить Стену Краденых Личностей выйти на поле битвы в качестве копии любого существа на поле битвы, но при этом она является Стеной в дополнение к своим другим типам и имеет способность Защитника. Когда вы это делаете, поверните скопированное существо, и оно не разворачивается во время шага разворота контролирующего его игрока, пока вы контролируете Стену Краденых Личностей.", "type": "Существо — Имитатор Стена"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "227029", "cardsphereId": "61387", "mcmId": "391667", "mcmMetaId": "278702", "mtgjsonV4Id": "b0a2c64b-86ae-540b-849c-367a562ddc3a", "mtgoId": "77080", "multiverseId": "470559", "scryfallId": "359cc32c-ba90-43e0-b584-09efd321a672", "scryfallIllustrationId": "728d2a89-296e-46d1-9995-5aacf9e1e011", "scryfallOracleId": "92c58354-e106-402f-8348-6c7cdb67c6df", "tcgplayerProductId": "196487"}, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}", "manaValue": 4.0, "name": "Wall of Stolen Identity", "number": "13", "originalText": "You may have Wall of Stolen Identity enter the battlefield as a copy of any creature on the battlefield, except it's a Wall in addition to its other types and has defender. When you do, tap the copied creature and it doesn't untap during its controller's untap step for as long as you control Wall of Stolen Identity.", "originalType": "Creature — Shapeshifter Wall", "power": "0", "printings": ["C19"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/7b3b6aca20923104", "cardmarket": "https://mtgjson.com/links/aff233851d0fc574", "tcgplayer": "https://mtgjson.com/links/1bc7343d54f2d305"}, "rarity": "rare", "rulings": [{"date": "2019-08-23", "text": "If Wall of Stolen Identity somehow enters the battlefield at the same time as another creature, it can’t become a copy of that creature. You may choose only a creature that’s already on the battlefield."}, {"date": "2019-08-23", "text": "Wall of Stolen Identity copies exactly what was printed on the original creature (unless that creature is copying something else or is a token; see below). It doesn’t copy whether that creature is tapped or untapped, whether it has any counters on it or any Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, or so on."}, {"date": "2019-08-23", "text": "If Wall of Stolen Identity copies a creature that’s normally not a creature (such as Mutavault), the copied permanent will be tapped and will remain tapped even when it’s no longer a creature for as long as you control Wall of Stolen Identity."}, {"date": "2019-08-23", "text": "If the copied creature has {X} in its mana cost, X is considered to be 0."}, {"date": "2019-08-23", "text": "If the chosen creature is copying something else (for example, if the chosen creature is another Wall of Stolen Identity), then Wall of Stolen Identity enters the battlefield as whatever the chosen creature copied."}, {"date": "2019-08-23", "text": "If the chosen creature is a token, Wall of Stolen Identity copies the original characteristics of that token as stated by the effect that created the token. Wall of Stolen Identity doesn’t become a token in this case."}, {"date": "2019-08-23", "text": "Any enters-the-battlefield abilities of the copied creature will trigger when Wall of Stolen Identity enters the battlefield. Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities of the chosen creature will also work."}, {"date": "2019-08-23", "text": "Once Wall of Stolen Identity has entered the battlefield and stolen a creature’s identity, players can take actions before the creature is tapped."}, {"date": "2019-08-23", "text": "If another player gains control of Wall of Stolen Identity, its effect keeping the creature tapped expires. It won’t keep the creature from untapping anymore, even if you later regain control of Wall of Stolen Identity."}, {"date": "2019-08-23", "text": "Wall of Stolen Identity can copy a tapped creature. That creature just remains tapped and doesn’t untap during its controller’s next untap step for as long as you control Wall of Stolen Identity."}, {"date": "2019-08-23", "text": "If Wall of Stolen Identity leaves the battlefield before its triggered ability has resolved, the copied creature will be tapped, but it will untap as normal."}], "securityStamp": "oval", "setCode": "C19", "subtypes": ["Shapeshifter", "Wall"], "supertypes": [], "text": "You may have Wall of Stolen Identity enter the battlefield as a copy of any creature on the battlefield, except it's a Wall in addition to its other types and has defender. When you do, tap the copied creature and it doesn't untap during its controller's untap step for as long as you control Wall of Stolen Identity.", "toughness": "0", "type": "Creature — Shapeshifter Wall", "types": ["Creature"], "uuid": "9362e405-425d-5a37-970f-fbff3221255f"}