{"artist": "Nils Hamm", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 5.0, "edhrecRank": 18518, "finishes": ["nonfoil", "foil"], "flavorText": "His tales are as tall as he is, and only a giant's life is long enough to listen to them all.", "foreignData": [{"flavorText": "Seine Geschichten dauern so lang, wie er groß ist, und man müsste so alt werden wie ein Riese, wollte man sie alle hören.", "language": "German", "multiverseId": 163533, "name": "Herumwandernder Graubart", "text": "Verwandtschaft Zu Beginn deines Versorgungssegments kannst du dir die oberste Karte deiner Bibliothek anschauen. Hat sie mindestens einen Kreaturentyp mit dem Herumwandernden Graubart gemeinsam, kannst du sie offen vorzeigen. Falls du dies tust, erhältst du 4 Lebenspunkte dazu.", "type": "Kreatur — Riese, Zauberer"}, {"flavorText": "Sus cuentos son tan grandes como él y sólo la vida de un gigante es lo suficientemente larga como para escucharlos todos.", "language": "Spanish", "multiverseId": 163383, "name": "Barbagris errante", "text": "Hermandad Al comienzo de tu mantenimiento, puedes mirar la primera carta de tu biblioteca. Si comparte un tipo de criatura con el Barbagris errante, puedes mostrarla. Si lo haces, ganas 4 vidas.", "type": "Criatura — Hechicero gigante"}, {"flavorText": "Ses récits sont aussi longs que sa barbe, et seuls les géants vivent assez vieux pour les écouter tous.", "language": "French", "multiverseId": 164283, "name": "Grisebarbe vagabond", "text": "Parenté — Au début de votre entretien, vous pouvez regarder la carte du dessus de votre bibliothèque. Si elle partage un type de créature avec le Grisebarbe vagabond, vous pouvez la révéler. Si vous faites ainsi, vous gagnez 4 points de vie.", "type": "Créature : géant et sorcier"}, {"flavorText": "Le sue storie sono lunghe quanto lui è alto, e solo la vita di un gigante dura abbastanza per ascoltarle tutte.", "language": "Italian", "multiverseId": 163683, "name": "Vagabondo Barbagrigia", "text": "Parentela All'inizio del tuo mantenimento, puoi guardare la prima carta del tuo grimorio. Se condivide un tipo di creatura con il Vagabondo Barbagrigia, puoi rivelarla. Se lo fai, guadagni 4 punti vita.", "type": "Creatura — Mago Gigante"}, {"flavorText": "彼の話は彼自身と同じぐらい大げさだし、その話を全部聞けるほど長生きできるのは巨人ぐらいだ。", "language": "Japanese", "multiverseId": 163983, "name": "さまよう灰髭", "text": "族系 ― あなたのアップキープの開始時に、あなたはあなたのライブラリーの一番上のカードを見てもよい。 それがさまよう灰髭と共通のクリーチャー・タイプを持つ場合、あなたはそれを公開してもよい。 そうした場合、あなたは４点のライフを得る。", "type": "クリーチャー — 巨人・ウィザード"}, {"flavorText": "Seus contos são tão compridos quanto ele, e somente a vida de um gigante é longa o suficiente para ouvir a todos eles.", "language": "Portuguese (Brazil)", "multiverseId": 163833, "name": "Barba-Cinza Andarilho", "text": "Parentesco No início de sua manutenção, você pode olhar o card do topo do seu grimório. Se ele compartilhar um tipo de criatura com Barba-Cinza Andarilho, você poderá revelá-lo. Se fizer isso, você ganhará 4 pontos de vida.", "type": "Criatura — Gigante Mago"}, {"flavorText": "В его баснях столько же вранья, сколько в нем роста, и только долгой жизни гиганта хватит на то, чтобы все их выслушать.", "language": "Russian", "multiverseId": 164433, "name": "Седобородый Скиталец", "text": "Сходство В начале вашего шага поддержки вы можете посмотреть верхнюю карту вашей библиотеки. Если у нее есть такой же тип существа, как у Седобородого Скитальца, вы можете ее показать. Если вы это делаете, вы получаете 4 жизни.", "type": "Существо — Гигант Чародей"}, {"flavorText": "他的故事情节夸大程度一如其身高，还得长命如巨人才能全听完。", "language": "Chinese Simplified", "multiverseId": 164133, "name": "灰须漫游客", "text": "血族～在你的维持开始时，你可以检视你的牌库顶牌。 如果它与灰须漫游客有共通之生物类别，你可以展示该牌。 若你如此作，则你获得4点生命。", "type": "生物～巨人／法术师"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "124454", "cardKingdomId": "124304", "cardsphereId": "32694", "mcmId": "18856", "mcmMetaId": "9444", "mtgjsonV4Id": "3beabf80-9481-511a-bd78-449705f2c8e5", "mtgoFoilId": "29059", "mtgoId": "29058", "multiverseId": "152672", "scryfallId": "ea5c82f9-4bc5-4326-92c0-d2aa4b4838a5", "scryfallIllustrationId": "9e7b2893-710d-476b-b936-f6e27cd38b9c", "scryfallOracleId": "ea7d5ada-78ac-405b-887e-b262e4935bd3", "tcgplayerProductId": "18087"}, "keywords": ["Kinship"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}{W}", "manaValue": 5.0, "name": "Wandering Graybeard", "number": "27", "originalText": "Kinship At the beginning of your upkeep, you may look at the top card of your library. If it shares a creature type with Wandering Graybeard, you may reveal it. If you do, you gain 4 life.", "originalType": "Creature - Giant Wizard", "power": "4", "printings": ["MOR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1fffa488b5215788", "cardKingdomFoil": "https://mtgjson.com/links/19caaf00bfa701bd", "cardmarket": "https://mtgjson.com/links/6ba54d96e0849c6b", "tcgplayer": "https://mtgjson.com/links/78ee06205af6fd44"}, "rarity": "uncommon", "rulings": [{"date": "2008-04-01", "text": "If the top card of your library is already revealed (due to Magus of the Future, for example), you still have the option to reveal it or not as part of a kinship ability’s effect."}, {"date": "2008-04-01", "text": "Kinship is an ability word that indicates a group of similar triggered abilities that appear on _Morningtide_ creatures. It doesn’t have any special rules associated with it."}, {"date": "2008-04-01", "text": "The first two sentences of every kinship ability are the same (except for the creature’s name). Only the last sentence varies from one kinship ability to the next."}, {"date": "2008-04-01", "text": "You don’t have to reveal the top card of your library, even if it shares a creature type with the creature that has the kinship ability."}, {"date": "2008-04-01", "text": "After the kinship ability finishes resolving, the card you looked at remains on top of your library."}, {"date": "2008-04-01", "text": "If you have multiple creatures with kinship abilities, each triggers and resolves separately. You’ll look at the same card for each one, unless you have some method of shuffling your library or moving that card to a different zone."}], "setCode": "MOR", "subtypes": ["Giant", "Wizard"], "supertypes": [], "text": "Kinship — At the beginning of your upkeep, you may look at the top card of your library. If it shares a creature type with Wandering Graybeard, you may reveal it. If you do, you gain 4 life.", "toughness": "4", "type": "Creature — Giant Wizard", "types": ["Creature"], "uuid": "de139dc6-5d5c-540b-a3dd-810df3742c35"}