{"artist": "Ron Spencer", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 8.0, "edhrecRank": 5466, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 111886, "name": "Verformte Welt", "text": "Jeder Spieler mischt alle bleibenden Karten, die er besitzt, in seine Bibliothek und deckt dann ebenso viele Karten oben von seiner Bibliothek auf. Jeder Spieler bringt alle auf diese Weise aufgedeckten Artefakte, Kreaturen und Länder ins Spiel, bringt dann alle auf diese Weise aufgedeckten Verzauberungen ins Spiel und legt den Rest der Karten in beliebiger Reihenfolge unter seine Bibliothek.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 113416, "name": "Deformar el mundo", "text": "Cada jugador baraja todos los permanentes que le pertenezcan en su biblioteca, luego muestra esa misma cantidad de cartas de la parte superior de su biblioteca. Cada jugador pone en juego todas las cartas de artefacto, criatura y tierra mostradas de esta manera, luego pone en juego todas las cartas de encantamiento mostradas de esta manera, luego pone el resto en la parte inferior de su biblioteca en cualquier orden.", "type": "Conjuro"}, {"language": "French", "multiverseId": 112192, "name": "Distorsion du monde", "text": "Chaque joueur mélange tous les permanents qu'ils possède à sa bibliothèque et révèle ensuite autant de cartes du dessus de sa bibliothèque. Chaque joueur met en jeu toutes les cartes d'artefact, de créature et de terrain révélées de cette manière, met ensuite en jeu toutes les cartes d'enchantement révélées de cette manière, et met ensuite le reste au-dessous de sa bibliothèque, dans n'importe quel ordre.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 112498, "name": "Deformare il Mondo", "text": "Ogni giocatore rimescola tutti i permanenti che possiede nel proprio grimorio, poi rivela altrettante carte dalla cima del proprio grimorio. Ogni giocatore mette in gioco tutte le carte artefatto, creatura e terra rivelate in questo modo, poi mette in gioco tutte le carte incantesimo rivelate in questo modo, quindi mette le rimanenti in fondo al proprio grimorio nell'ordine che preferisce.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 112804, "name": "歪んだ世界", "text": "各プレイヤーは自分がオーナーであるすべてのパーマネントを自分のライブラリーに加えて切り直し、自分のライブラリーの一番上からその総数に等しい枚数のカードを公開する。 各プレイヤーは、これにより公開されたすべてのアーティファクト・カードとクリーチャー・カードと土地カードを場に出し、その後これにより公開されたすべてのエンチャント・カードを場に出し、その後残りのカードを自分のライブラリーの一番下に望む順番で置く。", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 113110, "name": "Mundo Corrompido", "text": "Cada jogador embaralha todas as permanentes que lhe pertencem em seu grimório e revela aquela quantidade de cards do topo de seu grimório. Cada jogador coloca em jogo todos os cards de artefato, criatura e terreno revelados desta forma; em seguida, coloca em jogo todos os cards de encantamento revelados desta forma; e, depois, coloca o restante no fundo de seu grimório, em qualquer ordem.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 114518, "name": "Искривленный мир", "text": "Каждый игрок кладет все свои перманенты в свою библиотеку, перетасовывает ее и показывает столько же карт из своей библиотеки сверху, сколько было положено перманентов. Каждый игрок вводит в игру все артефакты, существа и земли, открытые таким образом, затем вводит в игру все карты чар, открытые таким образом, а затем кладет все остальные карты в свою библиотеку снизу в произвольном порядке.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 111580, "name": "歪曲世相", "text": "每位牌手把由他拥有的所有永久物洗回其牌库，然后从其牌库顶展示等量的牌。 每位牌手把以此法展示的所有神器，生物，与地牌放置进场，然后把以此法展示的所有结界放置进场，然后将其余的牌以任意顺序置于其牌库底。", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "118928", "cardKingdomId": "118637", "cardsphereId": "38449", "mcmId": "13590", "mcmMetaId": "8143", "mtgjsonV4Id": "a39c2c4a-7ec2-5b4f-afd1-1b2f64625232", "mtgoFoilId": "23479", "mtgoId": "23478", "multiverseId": "89084", "scryfallId": "fdbf743a-6e28-47c4-acfe-1c5d42f80eee", "scryfallIllustrationId": "7067789f-ff46-4900-a817-6f59e8c0482f", "scryfallOracleId": "50a228a2-c8b6-4416-b0ab-417926a9b9b6", "tcgplayerProductId": "13472"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{5}{R}{R}{R}", "manaValue": 8.0, "name": "Warp World", "number": "150", "originalText": "Each player shuffles all permanents he or she owns into his or her library, then reveals that many cards from the top of his or her library. Each player puts all artifact, creature, and land cards revealed this way into play, then puts all enchantment cards revealed this way into play, then puts the rest on the bottom of his or her library in any order.", "originalType": "Sorcery", "printings": ["10E", "M10", "PLIST", "RAV"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/65a3741f420224b7", "cardKingdomFoil": "https://mtgjson.com/links/24bd5f68c59511e5", "cardmarket": "https://mtgjson.com/links/c00eea74921a12ec", "tcgplayer": "https://mtgjson.com/links/db704b5c1c79a8c7"}, "rarity": "rare", "rulings": [{"date": "2006-10-15", "text": "Anything that triggers during the resolution of this will wait to be put on the stack until everything is put onto the battlefield and resolution is complete. The player whose turn it is will put all of their triggered abilities on the stack in any order, then each other player in turn order will do the same. (The last ability put on the stack will be the first one that resolves.)"}, {"date": "2009-10-01", "text": "Taking it slowly, here's what happens when Warp World resolves: 1) Each player counts the number of permanents they own. 2) Each player shuffles those permanents into their library. 3) Each player reveals cards from the top of their library equal to the number that player counted. 4) Each player puts all artifact, land, and creature cards revealed this way onto the battlefield. All of these cards enter the battlefield at the same time. 5) Each player puts all enchantment cards revealed this way onto the battlefield. An Aura put onto the battlefield this way can enchant an artifact, land, or creature that was already put onto the battlefield, but can't enchant an enchantment that's being put onto the battlefield at the same time as it. If multiple players have Auras to put onto the battlefield, the player whose turn it is announces what their Auras will enchant, then each other player in turn order does the same, then all enchantments (both Auras and non-Auras) enter the battlefield at the same time. 6) Each player puts all of their other revealed cards (instants, sorceries, planeswalkers, and Auras that can't enchant anything) on the bottom of their library in any order."}, {"date": "2009-10-01", "text": "Tokens are permanents but not cards. They’ll count toward the number of permanents shuffled into your library, so you’ll get a card back for each token you owned. But the tokens themselves should be ignored while you’re revealing *cards* from your library. In practice, you shouldn’t actually shuffle them into your library since they’ll cease to exist as soon as Warp World finishes resolving. Note that a token’s owner is the player under whose control it first entered the battlefield."}, {"date": "2019-05-03", "text": "If a permanent leaves the battlefield this way but ends up in a zone other than a library (most likely because it’s a player’s commander in the Commander variant), it’s still counted to determine how many cards to reveal."}], "setCode": "RAV", "subtypes": [], "supertypes": [], "text": "Each player shuffles all permanents they own into their library, then reveals that many cards from the top of their library. Each player puts all artifact, creature, and land cards revealed this way onto the battlefield, then does the same for enchantment cards, then puts all cards revealed this way that weren't put onto the battlefield on the bottom of their library.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "5be4d719-cb8c-56ef-8cc4-e354a3006fa6"}