{"artist": "Jack Wang", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B"], "colors": [], "convertedManaCost": 3.0, "edhrecRank": 14056, "finishes": ["foil"], "foreignData": [], "frameEffects": ["devoid"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "204811", "cardsphereId": "37550", "mcmId": "285021", "mtgjsonV4Id": "a8541fd0-9ef5-539a-af1a-95a18f0b80aa", "scryfallId": "d7777518-2c63-44af-b85a-fd4c79eb8ea1", "scryfallIllustrationId": "d2864653-c59f-41ca-a093-eb1103ead9b4", "scryfallOracleId": "197f3b17-ce21-430e-8e41-f5d02d5e3637", "tcgplayerProductId": "105952"}, "isPromo": true, "isStarter": true, "keywords": ["Devoid"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}", "manaValue": 3.0, "name": "Wasteland Strangler", "number": "102s", "power": "3", "printings": ["BFZ", "PBFZ"], "promoTypes": ["setpromo", "prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/2dec413abbf8aab1", "tcgplayer": "https://mtgjson.com/links/d7da7d82ba10bad1"}, "rarity": "rare", "rulings": [{"date": "2015-08-25", "text": "Cards with devoid use frames that are variations of the transparent frame traditionally used for Eldrazi. The top part of the card features some color over a background based on the texture of the hedrons that once imprisoned the Eldrazi. This coloration is intended to aid deckbuilding and game play."}, {"date": "2015-08-25", "text": "A card with devoid is just colorless. It’s not colorless and the colors of mana in its mana cost."}, {"date": "2015-08-25", "text": "Other cards and abilities can give a card with devoid color. If that happens, it’s just the new color, not that color and colorless."}, {"date": "2015-08-25", "text": "Devoid works in all zones, not just on the battlefield."}, {"date": "2015-08-25", "text": "If a card loses devoid, it will still be colorless. This is because effects that change an object’s color (like the one created by devoid) are considered before the object loses devoid."}, {"date": "2015-08-25", "text": "If a spell or ability requires that you put more than one exiled card into the graveyard, you may choose cards owned by different opponents. Each card chosen will be put into its owner’s graveyard."}, {"date": "2015-08-25", "text": "If a replacement effect will cause cards that would be put into a graveyard from anywhere to be exiled instead (such as the one created by Anafenza, the Foremost), you can still put an exiled card into its opponent’s graveyard. The card becomes a new object and remains in exile. In this situation, you can’t use a single exiled card if required to put more than one exiled card into the graveyard. Conversely, you could use the same card in this situation if two separate spells or abilities each required you to put a single exiled card into its owner’s graveyard."}, {"date": "2015-08-25", "text": "You can’t look at face-down cards in exile unless an effect allows you to."}, {"date": "2015-08-25", "text": "Face-down cards in exile are grouped using two criteria: what caused them to be exiled face down and when they were exiled face down. If you want to put a face-down card in exile into its owner’s graveyard, you must first choose one of these groups and then choose a card from within that group at random. For example, say an artifact causes your opponent to exile their hand of three cards face down. Then on a later turn, that artifact causes your opponent to exile another two cards face down. If you use Wasteland Strangler to put one of those cards into their graveyard, you would pick the first or second pile and put a card chosen at random from that pile into the graveyard."}], "securityStamp": "oval", "setCode": "PBFZ", "subtypes": ["Eldrazi", "Processor"], "supertypes": [], "text": "Devoid (This card has no color.)\nWhen Wasteland Strangler enters the battlefield, you may put a card an opponent owns from exile into that player's graveyard. If you do, target creature gets -3/-3 until end of turn.", "toughness": "2", "type": "Creature — Eldrazi Processor", "types": ["Creature"], "uuid": "605f6153-5f49-5ca7-9814-3a8f6fe23787"}