{"artist": "Jack Wang", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 3.0, "edhrecRank": 22968, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "multiverseId": 394166, "name": "Wächter des Spähnests", "text": "FliegendMorph—Zeige eine weiße Karte auf deiner Hand offen vor. (Du kannst diese Karte verdeckt für {3} als eine 2/2 Kreatur wirken. Decke sie zu einem beliebigen Zeitpunkt für ihre Morph-Kosten auf.)Wenn der Wächter des Spähnests aufgedeckt wird, erhältst du 2 Lebenspunkte dazu.", "type": "Kreatur — Vogel, Soldat"}, {"language": "Spanish", "multiverseId": 394348, "name": "Vigilante del nido", "text": "Vuela.Metamorfosis—Muestra una carta blanca de tu mano. (Puedes lanzar esta carta boca abajo como una criatura 2/2 pagando {3}. Ponla boca arriba en cualquier momento pagando su coste de metamorfosis.)Cuando el Vigilante del nido se ponga boca arriba, ganas 2 vidas.", "type": "Criatura — Soldado ave"}, {"language": "French", "multiverseId": 394192, "name": "Gardien du perchoir", "text": "VolMue — Révélez une carte blanche de votre main. (Vous pouvez lancer cette carte face cachée comme une créature 2/2 pour {3}. Retournez-la à tout moment pour son coût de mue.)Quand le Gardien du perchoir est retourné face visible, vous gagnez 2 points de vie.", "type": "Créature : oiseau et soldat"}, {"language": "Italian", "multiverseId": 394218, "name": "Guardiano del Trespolo", "text": "VolareMetamorfosi—Rivela una carta bianca dalla tua mano. (Puoi lanciare questa carta a faccia in giù come una creatura 2/2 pagando {3}. Girala a faccia in su in qualsiasi momento pagando il suo costo di metamorfosi.)Quando il Guardiano del Trespolo viene girato a faccia in su, guadagni 2 punti vita.", "type": "Creatura — Soldato Uccello"}, {"language": "Japanese", "multiverseId": 394244, "name": "休息地の見張り", "text": "飛行変異 ― あなたの手札にある白のカードを１枚公開する。（あなたはこのカードを、{3}で２/２クリーチャーとして裏向きに唱えてもよい。これの変異コストで、これをいつでも表向きにしてよい。）休息地の見張りが表向きになったとき、あなたは２点のライフを得る。", "type": "クリーチャー — 鳥・兵士"}, {"language": "Korean", "multiverseId": 394270, "name": "둥지 파수꾼", "text": "비행변이—당신의 손에서 백색 카드 한 장을 공개한다. (당신은 {3}을 지불해서 이 카드를 뒷면 상태의 2/2 생물로 발동할 수 있다. 언제든지 변이 비용을 지불하고 앞면이 보이도록 뒤집을 수 있다.)둥지 파수꾼이 앞면으로 뒤집히면, 당신은 생명 2점을 얻는다.", "type": "생물 — 조류 병사"}, {"language": "Portuguese (Brazil)", "multiverseId": 394296, "name": "Vigia do Poleiro", "text": "VoarMetamorfose — Revele um card branco na sua mão. (Você pode conjurar este card com a face voltada para baixo como uma criatura 2/2 por {3}. Volte sua face para cima a qualquer momento pagando seu custo de metamorfose.)Quando Vigia do Poleiro é voltado para cima, você ganha 2 pontos de vida.", "type": "Criatura — Ave Soldado"}, {"language": "Russian", "multiverseId": 394322, "name": "Дозорный Насеста", "text": "ПолетОборотень — Покажите белую карту, находящуюся в вашей руке. (Вы можете разыграть эту карту рубашкой вверх как существо 2/2 за {3}. Переверните ее рубашкой вниз в любой момент за ее стоимость Оборотня.)Когда Дозорный Насеста переворачивается рубашкой вниз, вы получаете 2 жизни.", "type": "Существо — Птица Солдат"}, {"language": "Chinese Simplified", "multiverseId": 394114, "name": "眺巢看守", "text": "飞行变身～从你手上展示一张白色牌。（你可牌面朝下地施放此牌并支付{3}，将其当成2/2生物。可随时支付其变身费用使其翻回正面。）当眺巢看守翻回正面时，你获得2点生命。", "type": "生物～鸟／士兵"}, {"language": "Chinese Traditional", "multiverseId": 394140, "name": "眺巢看守", "text": "飛行變身～從你手上展示一張白色牌。（你可牌面朝下地施放此牌並支付{3}，將其當成2/2生物。可隨時支付其變身費用使其翻回正面。）當眺巢看守翻回正面時，你獲得2點生命。", "type": "生物～鳥／士兵"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "205507", "cardsphereId": "45225", "mcmId": "271983", "mtgjsonV4Id": "5842392e-38bc-531e-82a4-2bf43ad0bf35", "multiverseId": "394088", "scryfallId": "2b4dc6f3-2660-4d6f-b3b7-58f4673095cd", "scryfallIllustrationId": "f81a197c-4109-4ece-832e-e58b59461c17", "scryfallOracleId": "92cf18ab-dd7b-4bc8-8b85-a81b8cb5192c", "tcgplayerProductId": "95602"}, "isPromo": true, "isReprint": true, "keywords": ["Flying", "Morph"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{W}", "manaValue": 3.0, "name": "Watcher of the Roost", "number": "30", "originalText": "Flying\nMorph—\nReveal a white card in your hand. (You may cast this card face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.)\nWhen Watcher of the Roost is turned face up, you gain 2 life.", "originalType": "Creature — Bird Soldier", "power": "2", "printings": ["KTK", "PRM", "UGIN"], "promoTypes": ["setpromo"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6bdeab890abaf3c3", "tcgplayer": "https://mtgjson.com/links/c7b02a4b8bcd09e9"}, "rarity": "uncommon", "rulings": [{"date": "2014-09-20", "text": "Morph lets you cast a card face down by paying {3}, and lets you turn the face-down permanent face up any time you have priority by paying its morph cost."}, {"date": "2014-09-20", "text": "The face-down spell has no mana cost and has a converted mana cost of 0. When you cast a face-down spell, put it on the stack face down so no other player knows what it is, and pay {3}. This is an alternative cost."}, {"date": "2014-09-20", "text": "When the spell resolves, it enters the battlefield as a 2/2 creature with no name, mana cost, creature types, or abilities. It’s colorless and has a converted mana cost of 0. Other effects that apply to the creature can still grant it any of these characteristics."}, {"date": "2014-09-20", "text": "Any time you have priority, you may turn the face-down creature face up by revealing what its morph cost is and paying that cost. This is a special action. It doesn’t use the stack and can’t be responded to. Only a face-down permanent can be turned face up this way; a face-down spell cannot."}, {"date": "2014-09-20", "text": "Because the permanent is on the battlefield both before and after it’s turned face up, turning a permanent face up doesn’t cause any enters-the-battlefield abilities to trigger."}, {"date": "2014-09-20", "text": "A permanent that turns face up or face down changes characteristics but is otherwise the same permanent. Spells and abilities that were targeting that permanent, as well as Auras and Equipment that were attached to the permanent, aren’t affected."}, {"date": "2014-09-20", "text": "At any time, you can look at a face-down spell or permanent you control. You can’t look at face-down spells or permanents you don’t control unless an effect instructs you to do so."}, {"date": "2014-09-20", "text": "You must ensure that your face-down spells and permanents can easily be differentiated from each other. You’re not allowed to mix up the cards that represent them on the battlefield in order to confuse other players. The order they entered the battlefield should remain clear. Common methods for doing this include using markers or dice, or simply placing them in order on the battlefield."}, {"date": "2014-09-20", "text": "If a face-down permanent leaves the battlefield, you must reveal it. You must also reveal all face-down spells and permanents you control if you leave the game or if the game ends."}], "securityStamp": "oval", "setCode": "UGIN", "subtypes": ["Bird", "Soldier"], "supertypes": [], "text": "Flying\nMorph—Reveal a white card in your hand. (You may cast this card face down as a 2/2 creature for {3}. Turn it face up any time for its morph cost.)\nWhen Watcher of the Roost is turned face up, you gain 2 life.", "toughness": "1", "type": "Creature — Bird Soldier", "types": ["Creature"], "uuid": "78850823-354e-58d4-bc21-1e4ad4acd0fa", "watermark": "dromoka"}