{"artist": "Eric Fortune", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 16419, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 163562, "name": "Wasserhosenweber", "text": "Verwandtschaft Zu Beginn deines Versorgungssegments kannst du dir die oberste Karte deiner Bibliothek anschauen. Hat sie mindestens einen Kreaturentyp mit dem Wasserhosenweber gemeinsam, kannst du sie offen vorzeigen. Falls du dies tust, erhalten alle Kreaturen, die du kontrollierst, bis zum Ende des Zuges Flugfähigkeit.", "type": "Kreatur — Meervolk, Zauberer"}, {"language": "Spanish", "multiverseId": 163412, "name": "Tejedoras de torbellino", "text": "Hermandad Al comienzo de tu mantenimiento, puedes mirar la primera carta de tu biblioteca. Si comparte un tipo de criatura con las Tejedoras de torbellino, puedes mostrarla. Si lo haces, cada criatura que controlas gana la habilidad de volar hasta el final del turno.", "type": "Criatura — Hechicero tritón"}, {"language": "French", "multiverseId": 164312, "name": "Tisseuses de trombes", "text": "Parenté — Au début de votre entretien, vous pouvez regarder la carte du dessus de votre bibliothèque. Si elle partage un type de créature avec les Tisseuses de trombes, vous pouvez la révéler. Si vous faites ainsi, chaque créature que vous contrôlez acquiert le vol jusqu'à la fin du tour.", "type": "Créature : ondin et sorcier"}, {"language": "Italian", "multiverseId": 163712, "name": "Tessitrici di Vortici", "text": "Parentela All'inizio del tuo mantenimento, puoi guardare la prima carta del tuo grimorio. Se condivide un tipo di creatura con le Tessitrici di Vortici, puoi rivelarla. Se lo fai, ogni creatura che controlli ha volare fino alla fine del turno.", "type": "Creatura — Mago Tritone"}, {"language": "Japanese", "multiverseId": 164012, "name": "竜巻編み", "text": "族系 ― あなたのアップキープの開始時に、あなたはあなたのライブラリーの一番上のカードを見てもよい。 それが竜巻編みと共通のクリーチャー・タイプを持つ場合、あなたはそれを公開してもよい。 そうした場合、あなたがコントロールする各クリーチャーは、それぞれターン終了時まで飛行を得る。", "type": "クリーチャー — マーフォーク・ウィザード"}, {"language": "Portuguese (Brazil)", "multiverseId": 163862, "name": "Tecelãs de Tromba D'Água", "text": "Parentesco No início de sua manutenção, você pode olhar o card do topo do seu grimório. Se ele compartilhar um tipo de criatura com Tecelãs de Tromba D'Água, você poderá revelá-lo. Se fizer isso, cada criatura que você controla ganhará a habilidade de voar até o final do turno.", "type": "Criatura — Tritão Mago"}, {"language": "Russian", "multiverseId": 164462, "name": "Плетельщицы Водяного Смерча", "text": "Сходство В начале вашего шага поддержки вы можете посмотреть верхнюю карту вашей библиотеки. Если у нее есть такой же тип существа, как у Плетельщиц Водяного Смерча, вы можете ее показать. Если вы это делаете, каждое существо под вашим контролем получает Полет до конца хода.", "type": "Существо — Мерфолк Чародей"}, {"language": "Chinese Simplified", "multiverseId": 164162, "name": "水龙卷织者", "text": "血族～在你的维持开始时，你可以检视你的牌库顶牌。 如果它与水龙卷织者有共通之生物类别，你可以展示该牌。 如果你如此作，则由你操控的每个生物获得飞行异能直到回合结束。", "type": "生物～人鱼／法术师"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "124457", "cardKingdomId": "124307", "cardsphereId": "32700", "mcmId": "18885", "mcmMetaId": "9473", "mtgjsonV4Id": "ba1f41c8-ec45-5179-9448-997079d91037", "mtgoFoilId": "29047", "mtgoId": "29046", "multiverseId": "152656", "scryfallId": "7db5c04f-fd5e-4e4c-9146-f9e6ef20a159", "scryfallIllustrationId": "918d9217-5240-4de5-9489-2b35dfada437", "scryfallOracleId": "7ab01e23-cbf5-458c-880c-50e061ece688", "tcgplayerProductId": "18090"}, "keywords": ["Kinship"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{U}{U}", "manaValue": 5.0, "name": "Waterspout Weavers", "number": "56", "originalText": "Kinship At the beginning of your upkeep, you may look at the top card of your library. If it shares a creature type with Waterspout Weavers, you may reveal it. If you do, each creature you control gains flying until end of turn.", "originalType": "Creature - Merfolk Wizard", "power": "3", "printings": ["MOR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/89a83348d15a7e4d", "cardKingdomFoil": "https://mtgjson.com/links/225893dbd29c75d5", "cardmarket": "https://mtgjson.com/links/abe37d873ad354ea", "tcgplayer": "https://mtgjson.com/links/12497a695b556a3b"}, "rarity": "uncommon", "rulings": [{"date": "2008-04-01", "text": "You don’t have to reveal the top card of your library, even if it shares a creature type with the creature that has the kinship ability."}, {"date": "2008-04-01", "text": "After the kinship ability finishes resolving, the card you looked at remains on top of your library."}, {"date": "2008-04-01", "text": "The first two sentences of every kinship ability are the same (except for the creature’s name). Only the last sentence varies from one kinship ability to the next."}, {"date": "2008-04-01", "text": "Kinship is an ability word that indicates a group of similar triggered abilities that appear on _Morningtide_ creatures. It doesn’t have any special rules associated with it."}, {"date": "2008-04-01", "text": "If you have multiple creatures with kinship abilities, each triggers and resolves separately. You’ll look at the same card for each one, unless you have some method of shuffling your library or moving that card to a different zone."}, {"date": "2008-04-01", "text": "If the top card of your library is already revealed (due to Magus of the Future, for example), you still have the option to reveal it or not as part of a kinship ability’s effect."}], "setCode": "MOR", "subtypes": ["Merfolk", "Wizard"], "supertypes": [], "text": "Kinship — At the beginning of your upkeep, you may look at the top card of your library. If it shares a creature type with Waterspout Weavers, you may reveal it. If you do, each creature you control gains flying until end of turn.", "toughness": "3", "type": "Creature — Merfolk Wizard", "types": ["Creature"], "uuid": "35d2419c-39c9-55a2-8fce-3f3f66d22906"}