{"artist": "Jim Pavelec", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["R", "W"], "colors": ["R", "W"], "convertedManaCost": 5.0, "edhrecRank": 5672, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 181676, "name": "Wellen der Aggression", "text": "Enttappe alle Kreaturen, die in diesem Zug angegriffen haben. Nach dieser Hauptphase gibt es eine zusätzliche Kampfphase, der eine zusätzliche Hauptphase folgt.\nZurückverfolgen (Du kannst diese Karte aus deinem Friedhof spielen, indem du zusätzlich zu ihren anderen Kosten eine Länderkarte aus deiner Hand abwirfst.)", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 180776, "name": "Olas de agresión", "text": "Endereza todas las criaturas que atacaron este turno. Después de esta fase principal, hay una fase de combate adicional seguida de una fase principal adicional.\nDesandar. (Puedes jugar esta carta desde tu cementerio descartando una carta de tierra además de pagar sus otros costes.)", "type": "Conjuro"}, {"language": "French", "multiverseId": 181856, "name": "Vagues d'agressivité", "text": "Dégagez toutes les créatures qui ont attaqué ce tour-ci. Cette phase principale est suivie d'une phase de combat supplémentaire, puis d'une phase principale supplémentaire.\nPistage (Vous pouvez jouer cette carte depuis votre cimetière en vous défaussant d'une carte de terrain en plus de payer ses autres coûts.)", "type": "Rituel"}, {"language": "Italian", "multiverseId": 181496, "name": "Ondate di Aggressione", "text": "STAPpa tutte le creature che hanno attaccato in questo turno. Dopo questa fase principale, c'è una fase di combattimento addizionale seguita da una fase principale addizionale.\nRievocare (Puoi giocare questa carta dal tuo cimitero scartando una carta terra oltre a pagare gli altri suoi costi.)", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 181136, "name": "攻撃の波", "text": "このターン攻撃したすべてのクリーチャーをアンタップする。 このメイン・フェイズの後に、追加の戦闘フェイズとその後の追加のメイン・フェイズを加える。\n回顧 （あなたはこのカードを、それの他のコストの支払いに追加して土地カードを１枚捨てることで、あなたの墓地からプレイしてもよい。）", "type": "ソーサリー"}, {"language": "Portuguese (Brazil)", "multiverseId": 182036, "name": "Ondas de Agressão", "text": "Desvire todas as criaturas que atacaram neste turno. Após esta fase principal, há uma fase adicional de combate seguida por uma fase principal adicional.\nRetraçar (Você pode jogar este card de seu cemitério descartando um card de terreno, além de pagar seus outros custos.)", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 181316, "name": "Волны Насилия", "text": "Разверните все существа, которые атаковали в этом ходу. После этой главной фазы идет дополнительная фаза боя, а за ней дополнительная главная фаза.\nВозвращение (Вы можете разыграть эту карту из вашего кладбища, сбросив карту земли в дополнение к оплате других ее стоимостей.)", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 180956, "name": "侵略浪潮", "text": "重置所有于本回合中曾经攻击的生物。 在此行动阶段后，额外多出一个战斗阶段，以及接于其后之一个额外的行动阶段。\n追溯 （你可以从你的坟墓场使用此牌，但必须支付其所需费用，并额外弃掉一张地牌。）", "type": "法术"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "125495", "cardKingdomId": "125290", "cardsphereId": "17156", "mcmId": "19610", "mcmMetaId": "9998", "mtgjsonV4Id": "7450b214-b85a-5c2d-8451-770c9a68cce0", "mtgoFoilId": "30241", "mtgoId": "30240", "multiverseId": "158107", "scryfallId": "83d52ba7-ffb3-4c24-85d8-8635ef1880d9", "scryfallIllustrationId": "01c359e4-992a-45c0-8980-c06ef60d82a6", "scryfallOracleId": "10991b1a-7dd3-4fbf-a4c8-200dc62fc605", "tcgplayerProductId": "27236"}, "keywords": ["Retrace"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R/W}{R/W}", "manaValue": 5.0, "name": "Waves of Aggression", "number": "148", "originalText": "Untap all creatures that attacked this turn. After this main phase, there is an additional combat phase followed by an additional main phase.\nRetrace (You may play this card from your graveyard by discarding a land card in addition to paying its other costs.)", "originalType": "Sorcery", "printings": ["EVE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/375729b793c1622e", "cardKingdomFoil": "https://mtgjson.com/links/6c26cfdc19c756bc", "cardmarket": "https://mtgjson.com/links/7b84f479c71d2dfc", "tcgplayer": "https://mtgjson.com/links/37358eeccafed309"}, "rarity": "rare", "rulings": [{"date": "2008-08-01", "text": "Casting a card by using its retrace ability works just like casting any other spell, with two exceptions: You’re casting it from your graveyard rather than your hand, and you must discard a land card in addition to any other costs."}, {"date": "2008-08-01", "text": "A retrace card cast from your graveyard follows the normal timing rules for its card type."}, {"date": "2008-08-01", "text": "When a retrace card you cast from your graveyard resolves, fails to resolve, or is countered, it’s put back into your graveyard. You may use the retrace ability to cast it again."}, {"date": "2008-08-01", "text": "If the active player casts a spell that has retrace, that player may cast that card again after it resolves, before another player can remove the card from the graveyard. The active player has priority after the spell resolves, so they can immediately cast a new spell. Since casting a card with retrace from the graveyard moves that card onto the stack, no one else would have the chance to affect it while it’s still in the graveyard."}, {"date": "2008-08-01", "text": "Waves of Aggression untaps all creatures that attacked this turn, not just those that attacked during the most recent combat phase."}, {"date": "2008-08-01", "text": "If it’s somehow not a main phase when Waves of Aggression resolves, all it does is untap all creatures that attacked that turn. No new phases are created."}], "setCode": "EVE", "subtypes": [], "supertypes": [], "text": "Untap all creatures that attacked this turn. After this main phase, there is an additional combat phase followed by an additional main phase.\nRetrace (You may cast this card from your graveyard by discarding a land card in addition to paying its other costs.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "fb6b216a-e05a-5558-953e-760fe475fbf3"}