{"artist": "Peter Mohrbacher", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G", "W"], "colors": ["G", "W"], "convertedManaCost": 3.0, "edhrecRank": 5660, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 355945, "name": "Wandernder Tempel", "text": "Stärke und Widerstandskraft des Wandernden Tempels sind gleich der Anzahl der Kreaturen, die du kontrollierst.\nImmer wenn der Wandernde Tempel einem Spieler Kampfschaden zufügt, führe Bevölkern durch. (Bringe einen Spielstein ins Spiel, der eine Kopie eines Kreaturenspielsteins ist, den du kontrollierst.)", "type": "Kreatur — Elementarwesen"}, {"language": "Spanish", "multiverseId": 365667, "name": "Templo caminante", "text": "Tanto la fuerza como la resistencia del Templo caminante son iguales al número de criaturas que controlas.\nSiempre que el Templo caminante haga daño de combate a un jugador, repuebla. (Pon en el campo de batalla una ficha que es una copia de una ficha de criatura que controlas.)", "type": "Criatura — Elemental"}, {"language": "French", "multiverseId": 356219, "name": "Temple des voyageurs", "text": "La force et l'endurance du Temple des voyageurs sont chacune égales au nombre de créatures que vous contrôlez.\nÀ chaque fois que le Temple des voyageurs inflige des blessures de combat à un joueur, peuplez. (Mettez sur le champ de bataille un jeton qui est une copie d'un jeton de créature que vous contrôlez.)", "type": "Créature : élémental"}, {"language": "Italian", "multiverseId": 356493, "name": "Tempio Viaggiatore", "text": "La forza e la costituzione del Tempio Viaggiatore sono pari al numero di creature che controlli.\nOgniqualvolta il Tempio Viaggiatore infligge danno da combattimento a un giocatore, popola. (Metti sul campo di battaglia una pedina che è una copia di una pedina creatura che controlli.)", "type": "Creatura — Elementale"}, {"language": "Japanese", "multiverseId": 356767, "name": "旅する寺院", "text": "旅する寺院のパワーとタフネスは、それぞれあなたがコントロールするクリーチャーの総数に等しい。\n旅する寺院がプレイヤー１人に戦闘ダメージを与えるたび、居住を行う。（あなたがコントロールするクリーチャー・トークン１体のコピーであるトークンを１体戦場に出す。）", "type": "クリーチャー — エレメンタル"}, {"language": "Korean", "multiverseId": 357589, "name": "방랑하는 신전", "text": "방랑하는 신전의 공격력과 방어력은 각각 당신이 조종하는 생물의 수와 같다.\n방랑하는 신전이 플레이어에게 전투피해를 입힐 때마다, 소집한다. (당신이 조종하는 어느 생물 토큰의 복사본인 토큰 한 개를 전장에 놓는다.)", "type": "생물 — 정령"}, {"language": "Portuguese (Brazil)", "multiverseId": 357041, "name": "Templo Viajante", "text": "O poder e a resistência de Templo Viajante são ambos iguais ao número de criaturas que você controla.\nToda vez que Templo Viajante causar dano de combate a um jogador, povoe. (Coloque no campo de batalha uma ficha que seja uma cópia de uma ficha de criatura que você controla.)", "type": "Criatura — Elemental"}, {"language": "Russian", "multiverseId": 355397, "name": "Странствующий Храм", "text": "Сила и выносливость Странствующего Храма равны количеству существ под вашим контролем.\nКаждый раз, когда Странствующий Храм наносит боевые повреждения игроку, используйте Заселение. (Положите на поле битвы одну фишку, являющуюся копией фишки существа под вашим контролем.)", "type": "Существо — Элементаль"}, {"language": "Chinese Simplified", "multiverseId": 357315, "name": "行路殿堂", "text": "行路殿堂的力量及防御力各等同于由你操控的生物之数量。\n每当行路殿堂对牌手造成战斗伤害时，殖民。（将一个衍生物放进战场，此衍生物为由你操控的某衍生生物之复制品。）", "type": "生物～元素"}, {"language": "Chinese Traditional", "multiverseId": 355671, "name": "行路殿堂", "text": "行路殿堂的力量及防禦力各等同於由你操控的生物之數量。\n每當行路殿堂對玩家造成戰鬥傷害時，殖民。（將一個衍生物放進戰場，此衍生物為由你操控的某衍生生物之複製品。）", "type": "生物～元素"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "188455", "cardKingdomId": "188099", "cardsphereId": "39040", "mcmId": "258223", "mcmMetaId": "206443", "mtgjsonV4Id": "533ec5ec-891f-5fd4-9557-a2cf8e5ea211", "mtgoFoilId": "46476", "mtgoId": "46475", "multiverseId": "253539", "scryfallId": "2125e6aa-f916-4dfa-a9fe-82bb546012af", "scryfallIllustrationId": "1c05c2c8-394b-4dc7-b523-6e7a62e87358", "scryfallOracleId": "c0525645-9b5a-488d-b4d1-e80f16a1e4e1", "tcgplayerProductId": "66407"}, "keywords": ["Populate"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{G}{W}", "manaValue": 3.0, "name": "Wayfaring Temple", "number": "209", "originalText": "Wayfaring Temple's power and toughness are each equal to the number of creatures you control.\nWhenever Wayfaring Temple deals combat damage to a player, populate. (Put a token onto the battlefield that's a copy of a creature token you control.)", "originalType": "Creature — Elemental", "power": "*", "printings": ["C19", "MB1", "MM3", "RTR"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/602a297cf07eb415", "cardKingdomFoil": "https://mtgjson.com/links/d23944a74feaef08", "cardmarket": "https://mtgjson.com/links/63f2741fb9159ec8", "tcgplayer": "https://mtgjson.com/links/4d0a5e1580faf143"}, "rarity": "rare", "rulings": [{"date": "2013-04-15", "text": "The new creature token copies the characteristics of the original token as stated by the effect that put the original token onto the battlefield."}, {"date": "2013-04-15", "text": "The new token doesn’t copy whether the original token is tapped or untapped, whether it has any counters on it or Auras and Equipment attached to it, or any noncopy effects that have changed its power, toughness, color, and so on."}, {"date": "2013-04-15", "text": "You can choose any creature token you control for populate. If a spell or ability puts a token onto the battlefield under your control and then instructs you to populate (as Coursers’ Accord does), you may choose to copy the token you just created, or you may choose to copy another creature token you control."}, {"date": "2013-04-15", "text": "If you control no creature tokens when you populate, nothing will happen."}, {"date": "2013-04-15", "text": "Any “as [this creature] enters the battlefield” or “[this creature] enters the battlefield with” abilities of the new token will work."}, {"date": "2013-04-15", "text": "If you choose to copy a creature token that’s a copy of another creature, the new creature token will copy the characteristics of whatever the original token is copying."}, {"date": "2017-03-14", "text": "The ability that defines Wayfaring Temple’s power and toughness works in all zones, not just the battlefield."}, {"date": "2017-03-14", "text": "As long as Wayfaring Temple is on the battlefield, its first ability will count itself, so it’ll be at least 1/1."}], "setCode": "RTR", "subtypes": ["Elemental"], "supertypes": [], "text": "Wayfaring Temple's power and toughness are each equal to the number of creatures you control.\nWhenever Wayfaring Temple deals combat damage to a player, populate. (Create a token that's a copy of a creature token you control.)", "toughness": "*", "type": "Creature — Elemental", "types": ["Creature"], "uuid": "7bfb1a19-dcfd-51c6-9c1a-20f79be810ec", "watermark": "selesnya"}