{"artist": "Chris Rahn", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 3.0, "edhrecRank": 963, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 440010, "name": "Halsstarriger Schwertzahn", "text": "Aufstieg (Falls du zehn oder mehr bleibende Karten kontrollierst, erhältst du für den Rest der Partie den Segen der Stadt.)\nDu darfst in jedem deiner Züge ein zusätzliches Land spielen.\nDer Halsstarrige Schwertzahn kann nicht angreifen oder blocken, es sei denn, du hast den Segen der Stadt.", "type": "Kreatur — Dinosaurier"}, {"language": "Spanish", "multiverseId": 440213, "name": "Colmilloespada descontrolado", "text": "Ascender. (Si controlas diez o más permanentes, obtienes la bendición de la ciudad durante el resto del juego.)\nPuedes jugar una tierra adicional en cada uno de tus turnos.\nEl Colmilloespada descontrolado no puede atacar ni bloquear a menos que tengas la bendición de la ciudad.", "type": "Criatura — Dinosaurio"}, {"language": "French", "multiverseId": 440416, "name": "Crocs-de-sabre rétif", "text": "Ascension (Si vous contrôlez au moins dix permanents, vous gagnez l'agrément de la cité pour le reste de la partie.)\nVous pouvez jouer un terrain supplémentaire pendant chacun de vos tours.\nLe Crocs-de-sabre rétif ne peut ni attaquer ni bloquer à moins que vous n'ayez l'agrément de la cité.", "type": "Créature : dinosaure"}, {"language": "Italian", "multiverseId": 440619, "name": "Lamadonte Fuori Controllo", "text": "Ascesa (Se controlli dieci o più permanenti, ottieni la benedizione della città per il resto della partita.)\nPuoi giocare una terra addizionale in ognuno dei tuoi turni.\nIl Lamadonte Fuori Controllo non può attaccare o bloccare a meno che tu non abbia la benedizione della città.", "type": "Creatura — Dinosauro"}, {"language": "Japanese", "multiverseId": 440822, "name": "むら気な長剣歯", "text": "昇殿（あなたがパーマネントを10個以上コントロールしているなら、このゲームの間、あなたは都市の承認を得る。）\nあなたの各ターンに、あなたは追加の土地を１つプレイしてもよい。\nあなたが都市の承認を持っていないかぎり、むら気な長剣歯では攻撃したりブロックしたりできない。", "type": "クリーチャー — 恐竜"}, {"language": "Korean", "multiverseId": 441025, "name": "고집센 검이빨", "text": "승격 (당신이 지속물을 열 개 이상 조종한다면, 당신은 이 게임이 끝날 때까지 도시의 축복을 받는다.)\n당신은 당신의 각 턴에 대지 한 개를 추가로 플레이할 수 있다.\n고집센 검이빨은 당신이 도시의 축복을 가지고 있지 않다면 공격하거나 방어할 수 없다.", "type": "생물 — 공룡"}, {"language": "Portuguese (Brazil)", "multiverseId": 441228, "name": "Gladiodonte Descontrolado", "text": "Ascender (Se você controla dez ou mais permanentes, você recebe a bênção da cidade pelo restante do jogo.)\nVocê pode jogar um terreno adicional em cada um de seus turnos.\nGladiodonte Descontrolado não pode atacar nem bloquear, a menos que você tenha a bênção da cidade.", "type": "Criatura — Dinossauro"}, {"language": "Russian", "multiverseId": 441431, "name": "Норовистый Мечезуб", "text": "Возвышение (Если под вашим контролем есть десять или больше перманентов, вы получаете благословение города до конца партии.)\nВы можете разыгрывать одну дополнительную землю в каждом из ваших ходов.\nНоровистый Мечезуб не может атаковать или блокировать, если только у вас нет благословения города.", "type": "Существо — Динозавр"}, {"language": "Chinese Simplified", "multiverseId": 441634, "name": "刚愎剑齿龙", "text": "登殿（如果你操控十个或更多永久物，则于这盘游戏接下来的时段中，你得到黄金城祝福。）\n你在自己的每个回合中可以额外使用一个地。\n除非你有黄金城祝福，否则刚愎剑齿龙不能进行攻击或阻挡。", "type": "生物 ～恐龙"}, {"language": "Chinese Traditional", "multiverseId": 441837, "name": "剛愎劍齒龍", "text": "登殿（如果你操控十個或更多永久物，則於這盤遊戲接下來的時段中，你得到黃金城祝福。）\n你在自己的每個回合中可以額外使用一個地。\n除非你有黃金城祝福，否則剛愎劍齒龍不能進行攻擊或阻擋。", "type": "生物 ～恐龍"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "216470", "cardKingdomId": "216259", "cardsphereId": "53338", "mcmId": "315452", "mcmMetaId": "236244", "mtgArenaId": "66917", "mtgjsonV4Id": "5efdabd8-f2e3-58a7-b72a-6da070d4bd82", "mtgoId": "66753", "multiverseId": "439807", "scryfallId": "351e8b1b-4e4e-4ffc-a134-3cf0e2a1dd6d", "scryfallIllustrationId": "a2ea7198-bc00-419c-b4a9-01f25543ab72", "scryfallOracleId": "3875aef0-3102-4fbf-be90-e4139f7a2348", "tcgplayerProductId": "155797"}, "keywords": ["Ascend"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}", "manaValue": 3.0, "name": "Wayward Swordtooth", "number": "150", "originalText": "Ascend (If you control ten or more permanents, you get the city's blessing for the rest of the game.)\nYou may play an additional land on each of your turns.\nWayward Swordtooth can't attack or block unless you have the city's blessing.", "originalType": "Creature — Dinosaur", "power": "5", "printings": ["PRIX", "RIX"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/e81c93041f3d9d02", "cardKingdomFoil": "https://mtgjson.com/links/f9a692fdb359fea4", "cardmarket": "https://mtgjson.com/links/14aeaf926696e7e0", "tcgplayer": "https://mtgjson.com/links/bf01affb86496ead"}, "rarity": "rare", "rulings": [{"date": "2018-01-19", "text": "Wayward Swordtooth’s middle ability is cumulative if you control more than one. It’s also cumulative with other effects that let you play additional lands, such as the one from Enter the Unknown."}, {"date": "2018-01-19", "text": "Once you have the city’s blessing, you have it for the rest of the game, even if you lose control of some or all of your permanents. The city’s blessing isn’t a permanent itself and can’t be removed by any effect."}, {"date": "2018-01-19", "text": "A permanent is any object on the battlefield, including tokens and lands. Spells and emblems aren’t permanents."}, {"date": "2018-01-19", "text": "If you cast a spell with ascend, you don’t get the city’s blessing until it resolves. Players may respond to that spell by trying to change whether you get the city’s blessing."}, {"date": "2018-01-19", "text": "If you control ten permanents but don’t control a permanent or resolving spell with ascend, you don’t get the city’s blessing. For example, if you control ten permanents, lose control of one, then cast Golden Demise, you won’t have the city’s blessing and the spell will affect creatures you control."}, {"date": "2018-01-19", "text": "If your tenth permanent enters the battlefield and then a permanent leaves the battlefield immediately afterwards (most likely due to the “Legend Rule” or due to being a creature with 0 toughness), you get the city’s blessing before it leaves the battlefield."}, {"date": "2018-01-19", "text": "Ascend on a permanent isn’t a triggered ability and doesn’t use the stack. Players can respond to a spell that will give you your tenth permanent, but they can’t respond to getting the city’s blessing once you control that tenth permanent. This means that if your tenth permanent is a land you play, players can’t respond before you get the city’s blessing."}], "securityStamp": "oval", "setCode": "RIX", "subtypes": ["Dinosaur"], "supertypes": [], "text": "Ascend (If you control ten or more permanents, you get the city's blessing for the rest of the game.)\nYou may play an additional land on each of your turns.\nWayward Swordtooth can't attack or block unless you have the city's blessing.", "toughness": "5", "type": "Creature — Dinosaur", "types": ["Creature"], "uuid": "19f97ee8-9e55-530f-b86d-ca7525625700"}