{"artist": "David Palumbo", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 4.0, "edhrecRank": 13835, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 410832, "name": "Willkommen im Bund", "text": "Wahnsinn {X}{U}{U} (Falls du diese Karte abwirfst, wirf sie ins Exil ab. Wenn du dies tust, wirke sie für ihre Wahnsinn-Kosten oder lege sie auf deinen Friedhof.)\nÜbernimm die Kontrolle über eine Kreatur deiner Wahl, falls ihre Widerstandskraft 2 oder weniger beträgt. Falls die Wahnsinn-Kosten von Willkommen im Bund bezahlt wurden, übernimm stattdessen die Kontrolle über diese Kreatur, falls ihre Widerstandskraft X oder weniger beträgt.", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 413142, "name": "Bienvenida al redil", "text": "Demencia {X}{U}{U}. (Si descartas esta carta, exíliala. Cuando lo hagas, lánzala por su coste de demencia o ponla en tu cementerio.)\nGanas el control de la criatura objetivo si su resistencia es 2 o menos. Si se pagó el coste de demencia de Bienvenida al redil, en vez de eso, ganas el control de la criatura objetivo si su resistencia es X o menos.", "type": "Conjuro"}, {"language": "French", "multiverseId": 411162, "name": "Bienvenue au bercail", "text": "Folie {X}{U}{U} (Si vous vous défaussez de cette carte, défaussez-vous en vers l'exil. Quand vous le faites, lancez-la pour son coût de folie ou mettez-la dans votre cimetière.)\nAcquérez le contrôle de la créature ciblée si son endurance est inférieure ou égale à 2. Si le coût de folie de Bienvenue au bercail a été payé, à la place acquérez le contrôle de cette créature si son endurance est inférieure ou égale à X.", "type": "Rituel"}, {"language": "Italian", "multiverseId": 411492, "name": "Benvenuto nel Gregge", "text": "Follia {X}{U}{U} (Se scarti questa carta, scartala in esilio. Quando lo fai, lanciala pagando il suo costo di follia o mettila nel tuo cimitero.)\nPrendi il controllo di una creatura bersaglio se la sua costituzione è pari o inferiore a 2. Se è stato pagato il costo di follia di Benvenuto nel Gregge, invece prendi il controllo di quella creatura se la sua costituzione è pari o inferiore a X.", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 411822, "name": "教団の歓迎", "text": "マッドネス{X}{U}{U}（あなたがこのカードを捨てるなら、これを追放領域に捨てる。あなたがそうしたとき、マッドネス・コストでこれを唱えるか、これをあなたの墓地に置く。）\nクリーチャー１体を対象とする。そのクリーチャーのタフネスが２以下であるなら、それのコントロールを得る。教団の歓迎のマッドネス・コストが支払われていたなら、代わりに、そのクリーチャーのタフネスがＸ以下であるなら、それのコントロールを得る。", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 412152, "name": "단체 가입", "text": "광기 {X}{U}{U} (이 카드를 버리는 경우, 추방 영역에 버린다. 그렇게 할 때, 광기 비용을 지불하고 이 카드를 발동하거나 당신의 무덤에 이 카드를 놓는다.)\n생물을 목표로 정한다. 그 생물의 방어력이 2 이하라면, 그 생물의 조종권을 얻는다. 단체 가입의 광기 비용을 지불했다면, 대신 그 생물의 방어력이 X 이하인 경우 그 생물의 조종권을 얻는다.", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 412482, "name": "Bem-vindo ao Rebanho", "text": "Loucura {X}{U}{U} (Se você descartar este card, descarte-o para o exílio. Quando fizer isso, conjure-o por seu custo de loucura ou coloque-o em seu cemitério.)\nGanhe o controle da criatura alvo se a resistência dela for igual ou inferior a 2. Se o custo de loucura de Bem-vindo ao Rebanho foi pago, em vez disso, ganhe o controle daquela criatura se a resistência dela for igual ou inferior a X.", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 412812, "name": "Прием в Паству", "text": "Бешенство {X}{U}{U} (Если вы сбрасываете эту карту, сбросьте ее в изгнание. Когда вы это делаете, разыграйте ее за ее стоимость Бешенства или положите на ваше кладбище.)\nПолучите контроль над целевым существом, если его выносливость равна 2 или меньше. Если стоимость Бешенства Приема в Паству была оплачена, вместо этого получите контроль над тем существом, если его выносливость равна X или меньше.", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 410172, "name": "受拥入教", "text": "疯魔{X}{U}{U}（如果你弃掉此牌，将之弃到放逐区。当你如此作时，支付其疯魔费用施放之，否则便将其置入你的坟墓场。）\n如果目标生物的防御力等于或小于2，则获得该生物的操控权。如果曾支付受拥入教的疯魔费用，则改为如果该生物的防御力等于或小于X，则获得其操控权。", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 410502, "name": "受擁入教", "text": "瘋魔{X}{U}{U}（如果你棄掉此牌，將之棄到放逐區。當你如此作時，支付其瘋魔費用施放之，否則便將其置入你的墳墓場。）\n如果目標生物的防禦力等於或小於2，則獲得該生物的操控權。如果曾支付受擁入教的瘋魔費用，則改為如果該生物的防禦力等於或小於X，則獲得其操控權。", "type": "巫術"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "206115", "cardKingdomId": "205692", "cardsphereId": "42218", "mcmId": "288998", "mcmMetaId": "222193", "mtgjsonV4Id": "72417641-5f49-59bf-9d1d-eb62f73cd772", "mtgoFoilId": "60337", "mtgoId": "60336", "multiverseId": "409842", "scryfallId": "2d07fbe1-e66a-4893-86ee-7752ad77b120", "scryfallIllustrationId": "1dd332fc-9c65-4a4a-ac6b-ab5983882f34", "scryfallOracleId": "b8647f54-f50b-4bc6-bd44-fda25ef189fa", "tcgplayerProductId": "115916"}, "keywords": ["Madness"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{U}", "manaValue": 4.0, "name": "Welcome to the Fold", "number": "96", "originalText": "Madness {X}{U}{U} (If you discard this card, discard it into exile. When you do, cast it for its madness cost or put it into your graveyard.)\nGain control of target creature if its toughness is 2 or less. If Welcome to the Fold's madness cost was paid, instead gain control of that creature if its toughness is X or less.", "originalType": "Sorcery", "printings": ["PSOI", "SOI"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/90043d8bc6daea51", "cardKingdomFoil": "https://mtgjson.com/links/eed2aad56bc90368", "cardmarket": "https://mtgjson.com/links/128f94891a00008e", "tcgplayer": "https://mtgjson.com/links/cb5646b0954e4ebf"}, "rarity": "rare", "rulings": [{"date": "2016-04-08", "text": "The toughness of the creature is checked only as Welcome to the Fold resolves. It doesn’t matter if it has higher toughness as you cast Welcome to the Fold, or if its toughness becomes higher after Welcome to the Fold has resolved."}, {"date": "2016-04-08", "text": "Cards are discarded in a Magic game only from a player’s hand. Effects that put cards from a player’s library into that player’s graveyard do not cause those cards to be discarded."}, {"date": "2016-04-08", "text": "A spell cast for its madness cost is put onto the stack like any other spell. It can be countered, copied, and so on. As it resolves, it’s put onto the battlefield if it’s a permanent card or into its owner’s graveyard if it’s an instant or sorcery card."}, {"date": "2016-04-08", "text": "Casting a spell for its madness cost doesn’t change its mana cost or its converted mana cost. You just pay the madness cost instead."}, {"date": "2016-04-08", "text": "Effects that cause you to pay more or less for a spell will cause you to pay that much more or less for its madness cost, too."}, {"date": "2016-04-08", "text": "Madness works independently of why you’re discarding the card. You could discard it to pay a cost, because a spell or ability tells you to, or even because you have too many cards in your hand at the end of your turn. You can’t discard a card with madness just because you want to, though."}, {"date": "2016-04-08", "text": "When you cast a card with madness, it was still discarded. If it was discarded to pay a cost, that cost is still paid. Abilities that trigger when a card is discarded will still trigger."}, {"date": "2016-04-08", "text": "If you choose not to cast a card with madness when the madness triggered ability resolves, it’s put into your graveyard. You don’t get another chance to cast it later."}, {"date": "2016-04-08", "text": "If you discard a card with madness to pay the cost of a spell or activated ability, that card’s madness trigger (and the spell that card becomes, if you choose to cast it) will resolve before the spell or ability the discard paid for."}, {"date": "2016-04-08", "text": "If you discard a card with madness while resolving a spell or ability, it moves immediately to exile. Continue resolving that spell or ability—the card is not in your graveyard at this time. Its madness trigger will be placed onto the stack once that spell or ability has completely resolved."}], "securityStamp": "oval", "setCode": "SOI", "subtypes": [], "supertypes": [], "text": "Madness {X}{U}{U} (If you discard this card, discard it into exile. When you do, cast it for its madness cost or put it into your graveyard.)\nGain control of target creature if its toughness is 2 or less. If this spell's madness cost was paid, instead gain control of that creature if its toughness is X or less.", "type": "Sorcery", "types": ["Sorcery"], "uuid": "2663e21b-d349-55af-8aff-288ab0c25f0a"}