{"artist": "Yeong-Hao Han", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 4.0, "edhrecRank": 775, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 374456, "name": "Peitsche des Erebos", "text": "Alle Kreaturen, die du kontrollierst, haben Lebensverknüpfung.\n{2}{B}{B}, {T}: Bringe eine Kreaturenkarte deiner Wahl aus deinem Friedhof ins Spiel zurück. Sie hat Eile. Schicke sie zu Beginn des nächsten Endsegments ins Exil. Falls sie das Spiel verlassen würde, schicke sie ins Exil, anstatt sie irgendwo anders hinzulegen. Aktiviere diese Fähigkeit nur zu einem Zeitpunkt, zu dem du auch eine Hexerei wirken könntest.", "type": "Legendäres Verzauberungsartefakt"}, {"language": "Spanish", "multiverseId": 376199, "name": "Látigo de Erebos", "text": "Las criaturas que controlas tienen la habilidad de vínculo vital.\n{2}{B}{B}, {T}: Regresa la carta de criatura objetivo de tu cementerio al campo de batalla. Gana la habilidad de prisa. Exíliala al comienzo del próximo paso final. Si fuera a dejar el campo de batalla, exíliala en vez de ponerla en cualquier otro lado. Activa esta habilidad solo cuando puedas lanzar un conjuro.", "type": "Artefacto encantamiento legendario"}, {"language": "French", "multiverseId": 374705, "name": "Fouet d'Érébos", "text": "Les créatures que vous contrôlez ont le lien de vie.\n{2}{B}{B}, {T} : Renvoyez une carte de créature ciblée depuis votre cimetière sur le champ de bataille. Elle acquiert la célérité. Exilez-la au début de la prochaine étape de fin. Si elle devait quitter le champ de bataille, exilez-la à la place de la mettre autre part. N'activez cette capacité que lorsque vous pourriez lancer un rituel.", "type": "Artefact-enchantement légendaire"}, {"language": "Italian", "multiverseId": 374954, "name": "Frusta di Erebos", "text": "Le creature che controlli hanno legame vitale.\n{2}{B}{B}, {T}: Rimetti sul campo di battaglia una carta creatura bersaglio dal tuo cimitero. Ha rapidità. Esiliala all'inizio della prossima sottofase finale. Se sta per lasciare il campo di battaglia, esiliala invece di metterla in qualsiasi altra zona. Attiva questa abilità solo quando potresti lanciare una stregoneria.", "type": "Artefatto Incantesimo Leggendario"}, {"language": "Japanese", "multiverseId": 375203, "name": "エレボスの鞭", "text": "あなたがコントロールするクリーチャーは絆魂を持つ。\n{2}{B}{B}, {T}：あなたの墓地にあるクリーチャー・カード１枚を対象とし、それを戦場に戻す。それは速攻を得る。次の終了ステップの開始時に、それを追放する。それが戦場を離れる場合、それを他のいずれかの領域に置く代わりにそれを追放する。この能力は、あなたがソーサリーを唱えられるときにのみ起動できる。", "type": "伝説のアーティファクト・エンチャント"}, {"language": "Korean", "multiverseId": 375452, "name": "에레보스의 채찍", "text": "당신이 조종하는 생물들은 생명연결 능력을 가진다.\n{2}{B}{B}, {T}: 당신의 무덤에 있는 생물 카드 한 장을 목표로 정한다. 그 카드를 전장으로 되돌린다. 그 생물은 신속 능력을 얻는다. 다음 종료단 시작에 그 생물을 추방한다. 그 생물이 전장을 떠나려 한다면, 대신 다른 곳에 놓지 않고 추방한다. 당신이 집중마법을 발동할 수 있는 시기에만 이 능력을 활성화할 수 있다.", "type": "전설적 부여마법 마법물체"}, {"language": "Portuguese (Brazil)", "multiverseId": 375701, "name": "Chicote de Érebo", "text": "As criaturas que você controla têm vínculo com a vida.\n{2}{B}{B}, {T}: Devolva o card de criatura alvo de seu cemitério para o campo de batalha. Ele ganha ímpeto. Exile-o no início da próxima etapa final. Se ele for deixar o campo de batalha, em vez de colocá-lo em qualquer outro lugar, exile-o. Ative esta habilidade somente nos momentos em que poderia conjurar um feitiço.", "type": "Artefato Encantamento Lendário"}, {"language": "Russian", "multiverseId": 375950, "name": "Кнут Эреба", "text": "Существа под вашим контролем имеют Цепь жизни.\n{2}{B}{B}, {T}: верните целевую карту существа из вашего кладбища на поле битвы. Оно получает Ускорение. Изгоните его в начале следующего заключительного шага. Если оно должно покинуть поле битвы, изгоните его вместо того, чтобы поместить его в какую-либо другую зону. Активируйте эту способность только при возможности разыгрывать волшебство.", "type": "Легендарные Чары Артефакт"}, {"language": "Chinese Simplified", "multiverseId": 373958, "name": "厄睿柏斯的神鞭", "text": "由你操控的生物具有系命异能。\n{2}{B}{B}，{T}：将目标生物牌从你的坟墓场移回战场。它获得敏捷异能。在下一个结束步骤开始时，将它放逐。如果它将离开战场，则改为将它放逐，而非置入其他区域。你只可以于你能施放法术的时机下起动此异能。", "type": "传奇结界神器"}, {"language": "Chinese Traditional", "multiverseId": 374207, "name": "厄睿柏斯的神鞭", "text": "由你操控的生物具有繫命異能。\n{2}{B}{B}，{T}：將目標生物牌從你的墳墓場移回戰場。它獲得敏捷異能。在下一個結束步驟開始時，將它放逐。如果它將離開戰場，則改為將它放逐，而非置入其他區域。你只可以於你能施放巫術的時機下起動此異能。", "type": "傳奇結界神器"}], "frameEffects": ["nyxtouched"], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "191568", "cardKingdomId": "191292", "cardsphereId": "44058", "mcmId": "264126", "mcmMetaId": "208699", "mtgjsonV4Id": "7b442b09-bdb8-5191-ba9e-e4bcebdc6843", "mtgoFoilId": "50409", "mtgoId": "50408", "multiverseId": "373709", "scryfallId": "9e5ec47c-47a2-4eda-b81a-4a07f04e5989", "scryfallIllustrationId": "a2c1d958-f29c-4fcf-9927-197a7722985e", "scryfallOracleId": "53987a39-c18c-4c13-b1ea-fd1b2a369f9e", "tcgplayerProductId": "71354"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{B}{B}", "manaValue": 4.0, "name": "Whip of Erebos", "number": "110", "originalText": "Creatures you control have lifelink.\n{2}{B}{B}, {T}: Return target creature card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step. If it would leave the battlefield, exile it instead of putting it anywhere else. Activate this ability only any time you could cast a sorcery.", "originalType": "Legendary Enchantment Artifact", "printings": ["CP2", "PRM", "THS"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/98efa7be8c172a99", "cardKingdomFoil": "https://mtgjson.com/links/07db6663b1a949c7", "cardmarket": "https://mtgjson.com/links/4f813f27e34e96a8", "tcgplayer": "https://mtgjson.com/links/bb4a52f23138aa35"}, "rarity": "rare", "rulings": [{"date": "2013-09-15", "text": "At the beginning of the next end step, the creature returned to the battlefield with Whip of Erebos is exiled. This is a delayed triggered ability. If the ability is countered, the creature will stay on the battlefield and the delayed trigger won’t trigger again. However, the replacement effect will still exile the creature when it eventually leaves the battlefield."}, {"date": "2013-09-15", "text": "Whip of Erebos grants haste to the creature that’s returned to the battlefield. However, neither of the “exile” abilities is granted to that creature. If that creature loses all its abilities, it will still be exiled at the beginning of the end step, and if it would leave the battlefield, it is still exiled instead."}, {"date": "2013-09-15", "text": "If a creature returned to the battlefield with Whip of Erebos would leave the battlefield for any reason, it’s exiled instead. However, if that creature is already being exiled, then the replacement effect won’t apply. If the spell or ability that exiles it later returns it to the battlefield (as Chained to the Rocks might, for example), the creature card will return to the battlefield as a new object with no relation to its previous existence. The effects from Whip of Erebos will no longer apply to it."}, {"date": "2013-09-15", "text": "The exiled creature is never put into the graveyard. Any abilities the creature has that trigger when it dies won’t trigger."}], "setCode": "THS", "subtypes": [], "supertypes": ["Legendary"], "text": "Creatures you control have lifelink.\n{2}{B}{B}, {T}: Return target creature card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step. If it would leave the battlefield, exile it instead of putting it anywhere else. Activate only as a sorcery.", "type": "Legendary Enchantment Artifact", "types": ["Enchantment", "Artifact"], "uuid": "cacb3198-0a84-57d7-91fc-319f7ecd13f7"}