{"artist": "Clint Cearley", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B", "U"], "colors": ["B", "U"], "convertedManaCost": 4.0, "edhrecRank": 1777, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 366907, "name": "Eingeflüsterter Wahnsinn", "text": "Jeder Spieler wirft alle Karten von seiner Hand ab und zieht dann so viele Karten, wie der Spieler, der auf diese Weise am meisten Karten abgeworfen hat, abgeworfen hat.\nChiffrieren (Dann kannst du diese Zauberspruchkarte auf eine Kreatur codiert, die du kontrollierst, ins Exil schicken. Immer wenn diese Kreatur einem Spieler Kampfschaden zufügt, kann ihr Beherrscher eine Kopie der codierten Karte wirken, ohne ihre Manakosten zu bezahlen.)", "type": "Hexerei"}, {"language": "Spanish", "multiverseId": 368120, "name": "Locura susurrante", "text": "Cada jugador descarta su mano y luego roba una cantidad de cartas igual a la mayor cantidad de cartas que un jugador descartó de esta manera.Cifrar. (Luego puedes exiliar esta carta de hechizo, cifrándola en una criatura que controles. Siempre que esa criatura haga daño de combate a un jugador, su controlador puede lanzar una copia de la carta cifrada sin pagar su coste de maná.)", "type": "Conjuro"}, {"language": "French", "multiverseId": 366660, "name": "Folie susurrante", "text": "Chaque joueur se défausse de sa main, puis il pioche un nombre de cartes égal au plus grand nombre de cartes dont un joueur s'est défaussé de cette manière.\nCryptage (Vous pouvez ensuite exiler cette carte de sort cryptée sur une créature que vous contrôlez. À chaque fois que cette créature inflige des blessures de combat à un joueur, son contrôleur peut lancer une copie de la carte cryptée sans payer son coût de mana.)", "type": "Rituel"}, {"language": "Italian", "multiverseId": 367128, "name": "Follia Sussurrante", "text": "Ogni giocatore scarta la propria mano, poi pesca carte pari al maggior numero di carte che un giocatore ha scartato in questo modo.\nCifrare (Poi puoi esiliare questa carta magia codificata su una creatura che controlli. Ogniqualvolta quella creatura infligge danno da combattimento a un giocatore, il suo controllore può lanciare una copia della carta codificata senza pagare il suo costo di mana.)", "type": "Stregoneria"}, {"language": "Japanese", "multiverseId": 368270, "name": "囁く狂気", "text": "各プレイヤーは自分の手札を捨て、その後これによりプレイヤー１人が捨てたカードの枚数のうち最も大きいものに等しい枚数のカードを引く。暗号（その後、あなたはあなたがコントロールするクリーチャー１体に暗号化した状態で、この呪文カードを追放してもよい。そのクリーチャーがプレイヤー１人に戦闘ダメージを与えるたび、あなたはその暗号化したカードのコピーを、それのマナ・コストを支払うことなく唱えてもよい。）", "type": "ソーサリー"}, {"language": "Korean", "multiverseId": 367466, "name": "속삭이는 광기", "text": "각 플레이어는 손에 있는 모든 카드를 버린 다음 카드를 가장 많이 버린 플레이어가 버린 카드 수만큼의 카드를 뽑는다.\n암호문 (그런 다음 당신은 이 주문 카드를 추방하고 당신이 조종하는 생물 한 개에 암호화할 수 있다. 그 생물이 플레이어에게 전투피해를 입힐 때마다, 그 생물의 조종자는 암호화한 카드의 복사본을 마나비용의 지불 없이 발동할 수 있다.)", "type": "집중마법"}, {"language": "Portuguese (Brazil)", "multiverseId": 367625, "name": "Loucura Sussurrante", "text": "Cada jogador descarta a própria mão e depois compra uma quantidade de cards igual ao maior número de cards descartados por um jogador dessa maneira.Cifrar (Depois, você pode exilar este card de mágica cifrado numa criatura que você controla. Toda vez que aquela criatura causar dano de combate a um jogador, seu controlador poderá conjurar uma cópia do card cifrado sem pagar seu custo de mana.)", "type": "Feitiço"}, {"language": "Russian", "multiverseId": 367735, "name": "Шепчущее Безумие", "text": "Каждый игрок сбрасывает свою руку, затем берет количество карт, равное наибольшему количеству карт, сброшенному кем-либо из игроков таким образом.\nШифр (Затем вы можете изгнать эту карту заклинания, закодировав ее на существе под вашим контролем. Каждый раз, когда то существо наносит боевые повреждения игроку, контролирующий его игрок может разыграть копию закодированной карты без уплаты ее мана-стоимости.)", "type": "Волшебство"}, {"language": "Chinese Simplified", "multiverseId": 365812, "name": "疯狂耳语", "text": "每位牌手各弃掉手牌，然后抓若干牌，其数量等同于牌手中以此法弃牌的最多数量。\n暗码（然后你可以放逐此咒语牌，并赋码于一个由你操控的生物上。每当该生物对任一牌手造成战斗伤害时，其操控者可以施放所赋码之牌的复制品，且不需支付其法术力费用。）", "type": "法术"}, {"language": "Chinese Traditional", "multiverseId": 366155, "name": "瘋狂耳語", "text": "每位玩家各棄掉手牌，然後抓若干牌，其數量等同於玩家中以此法棄牌的最多數量。\n暗碼（然後你可以放逐此咒語牌，並賦碼於一個由你操控的生物上。每當該生物對任一玩家造成戰鬥傷害時，其操控者可以施放所賦碼之牌的複製品，且不需支付其魔法力費用。）", "type": "巫術"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "189155", "cardKingdomId": "188851", "cardsphereId": "19456", "mcmId": "259822", "mcmMetaId": "207090", "mtgjsonV4Id": "7ff92873-5705-5a1a-9b7f-92168fa925c5", "mtgoFoilId": "47880", "mtgoId": "47879", "multiverseId": "366263", "scryfallId": "64e4b0cc-e611-4a4b-8392-b37bfc3a77e1", "scryfallIllustrationId": "98a14caa-2bb1-4c92-8403-1ada8cf33462", "scryfallOracleId": "7bbc5f3a-f8fb-47e8-837e-ce319bc489de", "tcgplayerProductId": "67334"}, "keywords": ["Cipher"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{U}{B}", "manaValue": 4.0, "name": "Whispering Madness", "number": "207", "originalText": "Each player discards his or her hand, then draws cards equal to the greatest number of cards a player discarded this way.\nCipher (Then you may exile this spell card encoded on a creature you control. Whenever that creature deals combat damage to a player, its controller may cast a copy of the encoded card without paying its mana cost.)", "originalType": "Sorcery", "printings": ["C16", "GTC"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/eb003375444d4628", "cardKingdomFoil": "https://mtgjson.com/links/a2062d2b8fc2a59f", "cardmarket": "https://mtgjson.com/links/9eec95a95c995f0f", "tcgplayer": "https://mtgjson.com/links/44c782a9728ce871"}, "rarity": "rare", "rulings": [{"date": "2013-01-24", "text": "You’ll draw cards before deciding which creature (if any) Whispering Madness will be encoded on."}, {"date": "2013-01-24", "text": "Each player draws cards simultaneously. If this causes a player to draw more cards than are left in their library, that player will lose the game. If this causes all players to do so, the game is a draw. (In multiplayer games, multiple players drawing from an empty library will cause those players to lose although the game may continue.)"}, {"date": "2013-04-15", "text": "If a creature with an encoded card deals combat damage to more than one player simultaneously (perhaps because some of the combat damage was redirected), the triggered ability will trigger once for each player it deals combat damage to. Each ability will create a copy of the exiled card and allow you to cast it."}, {"date": "2013-04-15", "text": "The exiled card with cipher grants a triggered ability to the creature it’s encoded on. If that creature loses that ability and subsequently deals combat damage to a player, the triggered ability won’t trigger. However, the exiled card will continue to be encoded on that creature."}, {"date": "2013-04-15", "text": "If another player gains control of the creature, that player will control the triggered ability. That player will create a copy of the encoded card and may cast it."}, {"date": "2013-04-15", "text": "The spell with cipher is encoded on the creature as part of that spell’s resolution, just after the spell’s other effects. That card goes directly from the stack to exile. It never goes to the graveyard."}, {"date": "2013-04-15", "text": "You choose the creature as the spell resolves. The cipher ability doesn’t target that creature, although the spell with cipher may target that creature (or a different creature) because of its other abilities."}, {"date": "2013-04-15", "text": "If the spell with cipher doesn’t resolve, none of its effects will happen, including cipher. The card will go to its owner’s graveyard and won’t be encoded on a creature."}, {"date": "2013-04-15", "text": "If the creature leaves the battlefield, the exiled card will no longer be encoded on any creature. It will stay exiled."}, {"date": "2013-04-15", "text": "If you want to encode the card with cipher onto a noncreature permanent such as a Keyrune that can turn into a creature, that permanent has to be a creature before the spell with cipher starts resolving. You can choose only a creature to encode the card onto."}, {"date": "2013-04-15", "text": "The copy of the card with cipher is created in and cast from exile."}, {"date": "2013-04-15", "text": "You cast the copy of the card with cipher during the resolution of the triggered ability. Ignore timing restrictions based on the card’s type."}, {"date": "2013-04-15", "text": "If you choose not to cast the copy, or you can’t cast it (perhaps because there are no legal targets available), the copy will cease to exist the next time state-based actions are performed. You won’t get a chance to cast the copy at a later time."}], "setCode": "GTC", "subtypes": [], "supertypes": [], "text": "Each player discards their hand, then draws cards equal to the greatest number of cards a player discarded this way.\nCipher (Then you may exile this spell card encoded on a creature you control. Whenever that creature deals combat damage to a player, its controller may cast a copy of the encoded card without paying its mana cost.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "ae621fea-aa1d-57cb-ba21-74c6ef03f881", "watermark": "dimir"}