{"artist": "Adam Paquette", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G"], "colors": ["G"], "convertedManaCost": 2.0, "edhrecRank": 17378, "finishes": ["nonfoil"], "flavorText": "A howl on the wind hides many dangers.", "foreignData": [{"flavorText": "Das Heulen des Windes verbirgt viele Gefahren.", "language": "German", "multiverseId": 394167, "name": "Wildruf", "text": "Manifestiere die oberste Karte deiner Bibliothek und lege dann X +1/+1-Marken auf sie. (Um eine Karte zu manifestieren, bringe sie als eine 2/2 Kreatur verdeckt ins Spiel. Decke sie zu einem beliebigen Zeitpunkt für ihre Manakosten auf, falls es eine Kreaturenkarte ist.)", "type": "Hexerei"}, {"flavorText": "Un aullido en el viento esconde muchos peligros.", "language": "Spanish", "multiverseId": 394349, "name": "Llamada salvaje", "text": "Manifiesta la primera carta de tu biblioteca, luego pon X contadores +1/+1 sobre ella. (Para manifestar una carta, ponla en el campo de batalla boca abajo como una criatura 2/2. Ponla boca arriba en cualquier momento por su coste de maná si es una carta de criatura.)", "type": "Conjuro"}, {"flavorText": "Un hurlement porté par le vent cache de nombreux dangers.", "language": "French", "multiverseId": 394193, "name": "Appel sauvage", "text": "Manifestez la carte du dessus de votre bibliothèque, puis mettez X marqueurs +1/+1 sur elle. (Pour manifester une carte, mettez-la sur le champ de bataille face cachée comme une créature 2/2. Retournez-la face visible à tout moment pour son coût de mana si c'est une carte de créature.)", "type": "Rituel"}, {"flavorText": "Un ululato nel vento cela molti pericoli.", "language": "Italian", "multiverseId": 394219, "name": "Richiamo Selvaggio", "text": "Manifesta la prima carta del tuo grimorio, poi metti X segnalini +1/+1 su di essa. (Per manifestare una carta, mettila sul campo di battaglia a faccia in giù come una creatura 2/2. Se è una carta creatura, girala a faccia in su in qualsiasi momento pagando il suo costo di mana.)", "type": "Stregoneria"}, {"flavorText": "風のうなる音は多くの危険を隠す。", "language": "Japanese", "multiverseId": 394245, "name": "野生呼び", "text": "あなたのライブラリーの一番上のカードを予示し、その後、それの上に＋１/＋１カウンターをＸ個置く。（カードを予示するには、それを裏向きの状態で２/２クリーチャーとして戦場に出す。それがクリーチャー・カードであるなら、そのマナ・コストで、いつでも表向きにしてよい。）", "type": "ソーサリー"}, {"flavorText": "바람을 타고 들리는 울부짖음은 많은 위험을 숨긴다.", "language": "Korean", "multiverseId": 394271, "name": "야생의 부름", "text": "당신의 서고 맨 위의 카드를 구현화한 다음, 그 생물에 +1/+1 카운터 X 개를 올려놓는다. (카드를 구현화하려면 해당 카드를 뒷면 상태의 2/2 생물로 전장에 내려놓는다. 그 카드가 생물 카드라면 언제든 마나 비용을 지불하고 앞면 상태로 뒤집을 수 있다.)", "type": "집중마법"}, {"flavorText": "Um uivo no vento esconde muitos perigos.", "language": "Portuguese (Brazil)", "multiverseId": 394297, "name": "Chamado Selvagem", "text": "Manifeste o card do topo do seu grimório e coloque X marcadores +1/+1 nele. (Para manifestar um card, coloque-o no campo de batalha com a face voltada para baixo como uma criatura 2/2. Volte sua face para cima a qualquer momento pagando seu custo de mana se for um card de criatura.)", "type": "Feitiço"}, {"flavorText": "Вой, несущийся по ветру, сулит множество опасностей.", "language": "Russian", "multiverseId": 394323, "name": "Дикий Зов", "text": "Воплотите верхнюю карту вашей библиотеки, затем положите на нее X жетонов +1/+1. (Чтобы воплотить карту, положите ее на поле битвы рубашкой вверх как существо 2/2. Если это карта существа, вы в любой момент можете перевернуть ее рубашкой вниз, оплатив ее мана-стоимость.)", "type": "Волшебство"}, {"flavorText": "呼啸风声掩藏了许多危险。", "language": "Chinese Simplified", "multiverseId": 394115, "name": "荒野呼唤", "text": "显化你的牌库顶牌，然后在其上放置X个+1/+1指示物。（显化某张牌的流程是，将该牌面朝下地放进战场，当成2/2生物。如果该牌是生物牌，则可随时支付其法术力费用使其翻回正面。）", "type": "法术"}, {"flavorText": "呼嘯風聲掩藏了許多危險。", "language": "Chinese Traditional", "multiverseId": 394141, "name": "荒野呼喚", "text": "顯化你的牌庫頂牌，然後在其上放置X個+1/+1指示物。（顯化某張牌的流程是，將該牌面朝下地放進戰場，當成2/2生物。如果該牌是生物牌，則可隨時支付其魔法力費用使其翻回正面。）", "type": "巫術"}], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "198992", "cardsphereId": "45226", "mcmId": "272052", "mtgjsonV4Id": "4874fd9e-1d19-5fb8-94aa-79de085a679f", "multiverseId": "394089", "scryfallId": "00020b05-ecb9-4603-8cc1-8cfa7a14befc", "scryfallIllustrationId": "b90c25fd-2ee1-4372-89d1-fc806d01d501", "scryfallOracleId": "d96ac790-428b-4a64-8dbd-6baa73eb6210", "tcgplayerProductId": "95585"}, "isPromo": true, "isReprint": true, "keywords": ["Manifest"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{X}{G}{G}", "manaValue": 2.0, "name": "Wildcall", "number": "146", "originalText": "Manifest the top card of your library, then put X +1/+1 counters on it. (To manifest a card, put it onto the battlefield face down as a 2/2 creature. Turn it face up any time for its mana cost if it's a creature card.)", "originalType": "Sorcery", "printings": ["FRF", "PFRF", "PRM", "UGIN"], "promoTypes": ["setpromo"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/cf333e6b63ba1094", "tcgplayer": "https://mtgjson.com/links/97b56ab40389d97d"}, "rarity": "rare", "rulings": [{"date": "2014-11-24", "text": "If you choose 0 for X, you’ll just manifest the top card of your library."}, {"date": "2014-11-24", "text": "The face-down permanent is a 2/2 creature with no name, mana cost, creature types, or abilities. It’s colorless and has a converted mana cost of 0. Other effects that apply to the permanent can still grant or change any of these characteristics."}, {"date": "2014-11-24", "text": "Any time you have priority, you may turn a manifested creature face up by revealing that it’s a creature card (ignoring any copy effects or type-changing effects that might be applying to it) and paying its mana cost. This is a special action. It doesn’t use the stack and can’t be responded to."}, {"date": "2014-11-24", "text": "If a manifested creature would have morph if it were face up, you may also turn it face up by paying its morph cost."}, {"date": "2014-11-24", "text": "Unlike a face-down creature that was cast using the morph ability, a manifested creature may still be turned face up after it loses its abilities if it’s a creature card."}, {"date": "2014-11-24", "text": "Because the permanent is on the battlefield both before and after it’s turned face up, turning a permanent face up doesn’t cause any enters-the-battlefield abilities to trigger."}, {"date": "2014-11-24", "text": "Because face-down creatures don’t have names, they can’t have the same name as any other creature, even another face-down creature."}, {"date": "2014-11-24", "text": "A permanent that turns face up or face down changes characteristics but is otherwise the same permanent. Spells and abilities that were targeting that permanent, as well as Auras and Equipment that were attached to the permanent, aren’t affected."}, {"date": "2014-11-24", "text": "Turning a permanent face up or face down doesn’t change whether that permanent is tapped or untapped."}, {"date": "2014-11-24", "text": "At any time, you can look at a face-down permanent you control. You can’t look at face-down permanents you don’t control unless an effect allows you to or instructs you to."}, {"date": "2014-11-24", "text": "If a face-down permanent you control leaves the battlefield, you must reveal it. You must also reveal all face-down spells and permanents you control if you leave the game or if the game ends."}, {"date": "2014-11-24", "text": "You must ensure that your face-down spells and permanents can easily be differentiated from each other. You’re not allowed to mix up the cards that represent them on the battlefield in order to confuse other players. The order they entered the battlefield should remain clear. Common methods for indicating this include using markers or dice, or simply placing them in order on the battlefield. You must also track how each became face down (manifested, cast face down using the morph ability, and so on)."}, {"date": "2014-11-24", "text": "There are no cards in the Fate Reforged set that would turn a face-down instant or sorcery card on the battlefield face up, but some older cards can try to do this. If something tries to turn a face-down instant or sorcery card on the battlefield face up, reveal that card to show all players it’s an instant or sorcery card. The permanent remains on the battlefield face down. Abilities that trigger when a permanent turns face up won’t trigger, because even though you revealed the card, it never turned face up."}, {"date": "2014-11-24", "text": "Some older Magic sets feature double-faced cards, which have a Magic card face on each side rather than a Magic card face on one side and a Magic card back on the other. The rules for double-faced cards are changing slightly to account for the possibility that they are manifested. If a double-faced card is manifested, it will be put onto the battlefield face down. While face down, it can’t transform. If the front face of the card is a creature card, you can turn it face up by paying its mana cost. If you do, its front face will be up. A double-faced permanent on the battlefield still can’t be turned face down."}], "securityStamp": "oval", "setCode": "UGIN", "subtypes": [], "supertypes": [], "text": "Manifest the top card of your library, then put X +1/+1 counters on it. (To manifest a card, put it onto the battlefield face down as a 2/2 creature. Turn it face up any time for its mana cost if it's a creature card.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "bcb7123f-e1f5-55f2-b807-86257c1a8c4d"}