{"artist": "Dan Scott", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 4.0, "edhrecRank": 2148, "finishes": ["nonfoil"], "flavorText": "\"May your day never match your expectations.\"\n@-Scriptus Fleen, flectomancer", "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "271896", "mcmId": "689064", "mcmMetaId": "9308", "mtgjsonV4Id": "0d0c0b3c-e6a5-5650-812e-763cebee7193", "mtgoFoilId": "103917", "mtgoId": "103916", "scryfallId": "ecbe8717-07a1-4145-9cd4-b98b145c2d4c", "scryfallIllustrationId": "bbea305c-edb5-44c9-9820-5baf52b6a4cd", "scryfallOracleId": "8c35fd11-be45-4984-bd83-6e4f3fbc47a9", "tcgplayerProductId": "456970"}, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{2}{R}{R}", "manaValue": 4.0, "name": "Wild Ricochet", "number": "169", "printings": ["C13", "CMD", "CMR", "LRW", "M14", "SCD"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/a5d6a526581f83ab", "cardmarket": "https://mtgjson.com/links/011c4b4e48050347", "tcgplayer": "https://mtgjson.com/links/3dbe9505c426293f"}, "rarity": "rare", "rulings": [{"date": "2013-07-01", "text": "Wild Ricochet can target (and copy) any instant or sorcery spell, not just one with targets. It doesn’t matter who controls it."}, {"date": "2013-07-01", "text": "When Wild Ricochet resolves, it creates a copy of a spell. You control the copy. The controller of the original spell retains control of that spell. The copy is created on the stack, so it’s not “cast.” Abilities that trigger when a player casts a spell won’t trigger. The copy will then resolve like a normal spell, after players get a chance to cast spells and activate abilities. The copy resolves before the original spell."}, {"date": "2013-07-01", "text": "The copy will have the same targets as the spell it’s copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can’t choose a new legal target, then it remains unchanged (even if the current target is illegal)."}, {"date": "2013-07-01", "text": "If the spell Wild Ricochet copies is modal (that is, it says “Choose one —” or the like), the copy will have the same mode. You can’t choose a different one."}, {"date": "2013-07-01", "text": "If the spell Wild Ricochet copies has an X whose value was determined as it was cast (like Volcanic Geyser does), the copy has the same value of X."}, {"date": "2013-07-01", "text": "You can’t choose to pay any additional costs for the copy. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too. For example, if a player sacrifices a 3/3 creature to cast Fling, and you copy it with Wild Ricochet, the copy of Fling will also deal 3 damage to its target."}, {"date": "2013-07-01", "text": "If the copy says that it affects “you,” it affects the controller of the copy, not the controller of the original spell. Similarly, if the copy says that it affects an “opponent,” it affects an opponent of the copy’s controller, not an opponent of the original spell’s controller."}], "securityStamp": "oval", "setCode": "SCD", "subtypes": [], "supertypes": [], "text": "You may choose new targets for target instant or sorcery spell. Then copy that spell. You may choose new targets for the copy.", "type": "Instant", "types": ["Instant"], "uuid": "750ec421-1602-51a7-a702-fb6def4b549b"}