{"artist": "Kekai Kotaki", "availability": ["paper"], "borderColor": "black", "colorIdentity": [], "colors": [], "convertedManaCost": 0.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "210234", "mcmId": "294480", "mtgjsonV4Id": "4ab64882-0d96-5abb-8e7d-99ff848b7b1f", "multiverseId": "423666", "scryfallId": "27f3c16a-34f9-497d-835c-5942e395ded8", "scryfallIllustrationId": "e35493dd-bea9-4990-a6c0-2618fa85905d", "scryfallOracleId": "e4b941d1-60cb-4e14-89a4-62a9785f6eda", "tcgplayerProductId": "125650"}, "isOversized": true, "isReprint": true, "isStarter": true, "keywords": ["Mill"], "language": "English", "layout": "planar", "legalities": {}, "manaValue": 0.0, "name": "Windriddle Palaces", "number": "85", "originalText": "Players play with the top card of their libraries revealed.\nYou may play the top card of any player's library.\nWhenever you roll {Chaos}, each player puts the top card of his or her library into his or her graveyard.", "originalType": "Plane — Belenon", "printings": ["OPC2", "OPCA"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/6b2aae90e3b161f0", "tcgplayer": "https://mtgjson.com/links/8494a7eae3ce1440"}, "rarity": "common", "rulings": [{"date": "2012-06-01", "text": "You can only play the top cards of players’ libraries when you are the planar controller. Generally, this means as long as it’s your turn. When another player begins their turn, that player becomes the planar controller and can play the top card of players’ libraries. You won’t be able to until you again become the planar controller."}, {"date": "2012-06-01", "text": "You may play the top card of any player’s library, including your own. This effect doesn’t change when you can play any of these cards (meaning play it if it’s a land card or cast it if it’s a nonland card). You can still cast creature spells only on your turn during your main phase and so on."}, {"date": "2012-06-01", "text": "If the top card of a player’s library is a land card, you may play it only if you haven’t played a land yet that turn."}, {"date": "2012-06-01", "text": "As soon as you finish playing the card on top of a player’s library, the next card in that library becomes revealed."}, {"date": "2012-06-01", "text": "If a player draws multiple cards at once, they reveal each one before drawing it."}, {"date": "2012-06-01", "text": "Other players won’t be able to play the top card of their libraries unless another effect allows it. If you and another player can play the top card of that player’s library (because of some other effect), you’ll be able to in most cases. This is because you have priority first at the beginning of each phase and step and after each spell or ability resolves. Once you play that card, it immediately moves from that library to the appropriate zone (the battlefield if it’s a land card or the stack if it’s a nonland card). The other player can’t respond by playing that card."}], "setCode": "OPCA", "subtypes": ["Belenon"], "supertypes": [], "text": "Players play with the top card of their libraries revealed.\nYou may play lands and cast spells from the top of any player's library.\nWhenever you roll {CHAOS}, each player mills a card.", "type": "Plane — Belenon", "types": ["Plane"], "uuid": "56f3cef7-62c3-50e9-aff3-982caa61b445"}