{"artist": "Edward P. Beard, Jr.", "availability": ["paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 1.0, "edhrecRank": 13102, "finishes": ["nonfoil"], "foreignData": [{"language": "German", "name": "Winterkälte", "text": "Sprich diesen Spruch nur während eines Kampfes, bevor die Verteidigung deklariert wurde. Zerstöre am Ende des Kampfes X angreifende Zielkreaturen. X kann nicht größer sein als die Anzahl der verschneiten Länder, die Du beherrschst. Der Beherrscher der angreifenden Kreaturen kann für jede angreifende Kreatur 1 oder 2 bezahlen, um ihre Zerstörung zu verhindern. Zahlt ein Spieler 1, teilt diese Kreatur keinen Schaden aus und erhält dann auch keinen Schaden während dieses Kampfes. Zahlt dieser Spieler 2, teilt diese Kreatur normalen Schaden aus und erhält auch den normalen Schaden während dieses Kampfes.", "type": "Spontanzauber"}, {"language": "Spanish", "name": "Frío invernal"}, {"language": "French", "name": "Fraîcheur hivernale"}, {"language": "Italian", "name": "Brivido dell'Inverno"}, {"language": "Portuguese (Brazil)", "name": "Calafrio de Inverno"}], "frameVersion": "1993", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "20361", "cardsphereId": "20355", "mcmId": "6319", "mcmMetaId": "6666", "mtgjsonV4Id": "f0a5432f-3d78-501d-943c-3720d27b4e01", "multiverseId": "2543", "scryfallId": "a779aca7-ff2c-48d8-9484-6ad04b2c6bcb", "scryfallIllustrationId": "997aa4be-465f-417a-a461-bb7a0c1b43f2", "scryfallOracleId": "ae78d498-11c7-427f-9d13-3f1b7096f803", "tcgplayerProductId": "4946"}, "isReserved": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "premodern": "Legal", "vintage": "Legal"}, "manaCost": "{X}{U}", "manaValue": 1.0, "name": "Winter's Chill", "number": "107", "originalText": "Cast only during combat before defense is chosen. At end of combat, destroy X target attacking creatures; X cannot be greater than the number of snow-covered lands you control. For each attacking creature, its controller may pay o1 or o2 to prevent it from being destroyed in this way. If that player pays o1, the creature neither deals nor receives damage in combat. If that player pays o2, the creature deals and receives damage in combat as normal.", "originalType": "Instant", "printings": ["ICE"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/b9e1922b980bafe1", "cardmarket": "https://mtgjson.com/links/4c60eeaa76ca512e", "tcgplayer": "https://mtgjson.com/links/5f89de241fe6a404"}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "The payments are made when the spell resolves. The three options are: pay {2} to let creature act as normal, pay {1} to have creature neither deal or receive damage, or pay nothing and the creature does deal and receive damage but it will be destroyed at end of combat."}, {"date": "2013-09-20", "text": "If a turn has multiple combat phases, this spell can be cast during any of them as long as it’s before the beginning of that phase’s Declare Blockers Step."}], "setCode": "ICE", "subtypes": [], "supertypes": [], "text": "Cast this spell only during combat before blockers are declared.\nX can't be greater than the number of snow lands you control.\nChoose X target attacking creatures. For each of those creatures, its controller may pay {1} or {2}. If that player doesn't, destroy that creature at end of combat. If that player pays only {1}, prevent all combat damage that would be dealt to and dealt by that creature this combat.", "type": "Instant", "types": ["Instant"], "uuid": "c9d28c5a-afd6-5a11-9830-26cc26aae107"}