{"artist": "Jesper Myrfors", "availability": ["mtgo"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 2.0, "edhrecRank": 15375, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "1997", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "737820df-8d48-585f-bd52-b982898ea789", "mtgoFoilId": "38641", "mtgoId": "38640", "multiverseId": "202591", "scryfallId": "8b1be5ba-6e5e-4801-815b-5e82b9e72b3d", "scryfallIllustrationId": "58147ab5-fb67-4102-9b17-64adac0a4482", "scryfallOracleId": "e8ad3a77-b293-4d69-b080-27ca9f95d443"}, "isOnlineOnly": true, "isReprint": true, "isReserved": true, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{B}{B}", "manaValue": 2.0, "name": "Word of Command", "number": "103", "originalText": "Look at target opponent's hand and choose a card from it. You control that player until Word of Command finishes resolving. The player plays that card if able. While doing so, the player can activate mana abilities only if they're from lands he or she controls and only if mana they produce is spent to activate other mana abilities of lands he or she controls and/or play that card. If the chosen card is cast as a spell, you control the player while that spell is resolving.", "originalType": "Instant", "printings": ["2ED", "30A", "CED", "CEI", "LEA", "LEB", "ME4"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2004-10-04", "text": "To “play a card” is to either cast a spell or to put a land onto the battlefield using the main phase special action."}, {"date": "2009-10-01", "text": "You do get to choose which lands get tapped. You can make them choose an optional mana generating ability of the land that they tap, such as making them tap and sacrifice the land instead of just tap it."}, {"date": "2011-01-01", "text": "You control the player while this spell is resolving, which means you get to see anything they can see. If that player is required to search their library as part of playing the card or as part of its resolution if it’s cast as a spell, then you can see the cards in that player’s library as well."}, {"date": "2011-01-01", "text": "Your opponent can’t counter the Word of Command after letting you look at their hand, but they can attempt to counter the spell you force them to cast."}, {"date": "2011-01-01", "text": "You may Command your opponent to play a land (if they have not already done so this turn)."}, {"date": "2011-01-01", "text": "If there is a non-mana way to cast a spell, as with Pitch Spells, you may require that way to be used if it is possible to do so."}, {"date": "2011-01-01", "text": "Since this spell is an instant, your opponent gets a chance to respond to it as normal. Once this spell resolves, you look at your opponent’s hand and choose a card. Note that it is common practice to respond to Word of Command by using up any spells or mana you have prior to letting it resolve."}, {"date": "2011-01-01", "text": "During the resolution of this spell, that player plays the chosen card."}, {"date": "2011-01-01", "text": "You must order your opponent to play the chosen card if it is possible to do so."}, {"date": "2011-01-01", "text": "Word of Command can’t be used to force a player to play a card that isn’t in their hand."}, {"date": "2016-07-13", "text": "While controlling another player, you can see all cards in the game that player can see. This includes cards in that player’s hand, face-down cards that player controls, and any cards in that player’s library the player may look at."}, {"date": "2016-07-13", "text": "Controlling a player doesn’t allow you to look at that player’s sideboard. If an effect instructs that player to choose a card from outside the game, you can’t have that player choose any card."}], "setCode": "ME4", "subtypes": [], "supertypes": [], "text": "Look at target opponent's hand and choose a card from it. You control that player until Word of Command finishes resolving. The player plays that card if able. While doing so, the player can activate mana abilities only if they're from lands that player controls and only if mana they produce is spent to activate other mana abilities of lands the player controls and/or to play that card. If the chosen card is cast as a spell, you control the player while that spell is resolving.", "type": "Instant", "types": ["Instant"], "uuid": "f13c5998-f9dd-56da-bb93-ab884b649989"}