{"artist": "Eric Deschamps", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 8.0, "edhrecRank": 6307, "finishes": ["nonfoil", "foil"], "flavorText": "Elspeth feared that her trespass into Nyx would not go unanswered.", "foreignData": [{"flavorText": "Elspeth befürchtete, dass ihr Eindringen nach Nyx geahndet werden würde.", "language": "German", "multiverseId": 381023, "name": "Schlimmste Befürchtungen", "text": "Du kontrollierst einen Spieler deiner Wahl während des nächsten Zugs dieses Spielers. Schicke die Schlimmsten Befürchtungen ins Exil. (Du siehst alle Karten, die dieser Spieler sehen könnte, und triffst alle Entscheidungen für diesen Spieler.)", "type": "Hexerei"}, {"flavorText": "Elspeth temía que su entrada indebida a Nyx no pasara inadvertida.", "language": "Spanish", "multiverseId": 382178, "name": "Los más indecibles temores", "text": "Controlas al jugador objetivo durante el próximo turno de ese jugador. Exilia Los más indecibles temores. (Ves todas las cartas que ese jugador podría ver y tomas todas las decisiones en su lugar.)", "type": "Conjuro"}, {"flavorText": "Elspeth craignait que son intrusion dans Nyx ne soit pas sans conséquences.", "language": "French", "multiverseId": 381188, "name": "Pires craintes", "text": "Vous contrôlez le joueur ciblé pendant son prochain tour. Exilez les Pires craintes. (Vous voyez toutes les cartes que ce joueur pourrait voir et vous prenez toutes les décisions pour ce joueur.)", "type": "Rituel"}, {"flavorText": "Elspeth temeva che la sua intrusione in Nyx non sarebbe stata ignorata.", "language": "Italian", "multiverseId": 381353, "name": "Paure Recondite", "text": "Controlli un giocatore bersaglio durante il prossimo turno di quel giocatore. Esilia le Paure Recondite. (Vedi tutte le carte che quel giocatore può vedere e prendi tutte le decisioni per quel giocatore.)", "type": "Stregoneria"}, {"flavorText": "エルズペスは、自分がニクスの領域に侵入したことにより、何らかの報復があることを恐れていた。", "language": "Japanese", "multiverseId": 381518, "name": "最悪の恐怖", "text": "プレイヤー１人を対象とする。そのプレイヤーの次のターンの間、あなたはそのプレイヤーをコントロールする。最悪の恐怖を追放する。（あなたはそのプレイヤーが見ることのできるカードをすべて見て、そのプレイヤーが行うすべての決定を行う。）", "type": "ソーサリー"}, {"flavorText": "엘스페스는 닉스에 들어온 자신을 신들이 가만히 두지 않으리라는 생각에 두려워했다.", "language": "Korean", "multiverseId": 381683, "name": "최악의 공포", "text": "플레이어를 목표로 정한다. 그 플레이어의 다음 턴 동안 그 플레이어를 조종한다. 최악의 공포를 추방한다. (그 플레이어가 보는 카드를 모두 보고 그 플레이어 대신 모든 결정을 내린다.)", "type": "집중마법"}, {"flavorText": "Elspeth temia que sua invasão a Nyx não ficaria impune.", "language": "Portuguese (Brazil)", "multiverseId": 381848, "name": "Piores Medos", "text": "Você controla o jogador alvo durante o próximo turno dele. Exile Piores Medos. (Você vê todos os cards que aquele jogador poderia ver e toma todas as decisões pelo jogador.)", "type": "Feitiço"}, {"flavorText": "Элспет боялась, что ее вторжение в Никс не останется без ответа.", "language": "Russian", "multiverseId": 382013, "name": "Худшие Страхи", "text": "Вы контролируете целевого игрока во время его следующего хода. Изгоните Худшие Страхи. (Вы видите все карты, которые мог бы видеть тот игрок, и принимаете все решения за того игрока.)", "type": "Волшебство"}, {"flavorText": "艾紫培害怕的就是她擅闯尼兹的下场。", "language": "Chinese Simplified", "multiverseId": 380693, "name": "极端恐惧", "text": "目标牌手在他下个回合由你来操控。放逐极端恐惧。（你能看所有该牌手能看到的牌，并代该牌手作出所有决定。）", "type": "法术"}, {"flavorText": "艾紫培害怕的就是她擅闖尼茲的下場。", "language": "Chinese Traditional", "multiverseId": 380858, "name": "極端恐懼", "text": "目標玩家在他下個回合由你來操控。放逐極端恐懼。（你能看所有該玩家能看到的牌，並代該玩家作出所有決定。）", "type": "巫術"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "194215", "cardKingdomId": "193954", "cardsphereId": "22311", "mcmId": "266623", "mcmMetaId": "209519", "mtgjsonV4Id": "a0039dcf-885e-5ab1-a83f-44631f43ce35", "mtgoFoilId": "52227", "mtgoId": "52226", "multiverseId": "380528", "scryfallId": "8f4e21ac-4f3e-4a3e-83c0-0a59a1b84020", "scryfallIllustrationId": "fa500ac3-c542-4485-8ef4-352d93e96577", "scryfallOracleId": "face0a43-6604-4508-b511-81ab0bef7b18", "tcgplayerProductId": "82228"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{7}{B}", "manaValue": 8.0, "name": "Worst Fears", "number": "87", "originalText": "You control target player during that player's next turn. Exile Worst Fears. (You see all cards that player could see and make all decisions for the player.)", "originalType": "Sorcery", "printings": ["JOU"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/77f7f25d69760af4", "cardKingdomFoil": "https://mtgjson.com/links/20b83d4e3bbe4398", "cardmarket": "https://mtgjson.com/links/2fe64249d3158260", "tcgplayer": "https://mtgjson.com/links/cd584148cb301c4e"}, "rarity": "mythic", "rulings": [{"date": "2014-04-26", "text": "While controlling another player, you make all choices and decisions that player is allowed to make or is told to make during that turn. This includes choices about what spells to cast or what abilities to activate, as well as any decisions called for by triggered abilities or for any other reason."}, {"date": "2014-04-26", "text": "You can't make the affected player concede. That player may choose to concede at any time, even while you're controlling them."}, {"date": "2014-04-26", "text": "You can't make any illegal decisions or illegal choices—you can't do anything that player couldn't do. You can't make choices or decisions for that player that aren't called for by the game rules or by any cards, permanents, spells, abilities, and so on. If an effect causes another player to make decisions that the affected player would normally make (such as Master Warcraft does), that effect takes precedence. In other words, if the affected player wouldn't make a decision, you wouldn't make that decision on their behalf."}, {"date": "2014-04-26", "text": "You also can't make any choices or decisions for the player that would be called for by the tournament rules (such as whether to take an intentional draw or whether to call a judge)."}, {"date": "2014-04-26", "text": "The player you're controlling is still the active player during that turn."}, {"date": "2014-04-26", "text": "You only control the player. You don't control any of their permanents, spells, or abilities."}, {"date": "2014-04-26", "text": "If the target player skips their next turn, you'll control the next turn the affected player actually takes."}, {"date": "2014-04-26", "text": "Multiple player-controlling effects that affect the same player overwrite each other. The last one to be created is the one that works."}, {"date": "2014-04-26", "text": "You could gain control of yourself using Worst Fears, but unless you do so to overwrite someone else's player-controlling effect, this doesn't do anything."}, {"date": "2014-04-26", "text": "You can use only the affected player's resources (cards, mana, and so on) to pay costs for that player; you can't use your own. Similarly, you can use the affected player's resources only to pay that player's costs; you can't spend them on your costs."}, {"date": "2014-04-26", "text": "While controlling another player, you also continue to make your own choices and decisions."}, {"date": "2016-07-13", "text": "While controlling another player, you can see all cards in the game that player can see. This includes cards in that player's hand, face-down cards that player controls, and any cards in that player's library the player may look at."}, {"date": "2016-07-13", "text": "Controlling a player doesn't allow you to look at that player's sideboard. If an effect instructs that player to choose a card from outside the game, you can't have that player choose any card."}], "setCode": "JOU", "subtypes": [], "supertypes": [], "text": "You control target player during that player's next turn. Exile Worst Fears. (You see all cards that player could see and make all decisions for the player.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "e28539b2-26da-5ddc-b4c2-b9337495a1af"}