{"artist": "Dave Allsop", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["G", "R"], "colors": ["G", "R"], "convertedManaCost": 6.0, "edhrecRank": 5542, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 174700, "name": "Wurz, die Mutter aller Überfälle", "text": "Wenn Wurz, die Mutter aller Überfälle, ins Spiel kommt, bringe zwei 1/1 rote und grüne (Goblin, Krieger)-Kreaturenspielsteine ins Spiel.\nAlle roten oder grünen Spontanzauber oder Hexereien, die du spielst, haben Verschwören. (Sowie du jenen Zauberspruch spielst, kannst du zwei ungetappte Kreaturen tappen, die du kontrollierst und die mindestens eine Farbe mit dem Zauberspruch gemeinsam haben. Wenn du das tust, kopiere den Zauberspruch; du kannst für die Kopie neue Ziele bestimmen.)", "type": "Legendäre Kreatur — Goblin, Schamane"}, {"language": "Spanish", "multiverseId": 172894, "name": "Mosto, madre incursora", "text": "Cuando Mosto, madre incursora entre en juego, pon en juego dos fichas de criatura Guerrero Trasgo rojas y verdes 1/1.\nCada hechizo de instantáneo o conjuro rojo o verde que juegues tiene la habilidad de conspirar. (En cuanto juegues el hechizo puedes girar dos criaturas enderezadas que controles que compartan un color con él. Cuando lo hagas, cópialo y puedes elegir nuevos objetivos para la copia.)", "type": "Criatura legendaria — Chamán trasgo"}, {"language": "French", "multiverseId": 173496, "name": "Moût, la Mère-pilleuse", "text": "Quand Moût, la Mère-pilleuse arrive en jeu, mettez en jeu deux jetons de créature 1/1 rouge et verte Gobelin et Guerrier.\nChaque sort d'éphémère ou de rituel rouge ou vert que vous jouez a la conspiration. (Au moment où vous jouez le sort, vous pouvez engager deux créatures dégagées que vous contrôlez qui partagent une couleur avec lui. Quand vous faites ainsi, copiez-le et vous pouvez choisir des nouvelles cibles pour la copie.)", "type": "Créature légendaire : gobelin et shamane"}, {"language": "Italian", "multiverseId": 173797, "name": "Larva, la Madre Razziatrice", "text": "Quando Larva, la Madre Razziatrice entra in gioco, metti in gioco due pedine creatura Guerriero Goblin 1/1 rosse e verdi.\nOgni magia istantaneo o stregoneria verde o rossa che giochi ha cospirare. (Mentre giochi la magia, puoi TAPpare due creature STAPpate che controlli che condividono un colore con essa. Quando lo fai, copia la magia. Puoi scegliere dei nuovi bersagli per la copia.)", "type": "Creatura Leggendaria — Sciamano Goblin"}, {"language": "Japanese", "multiverseId": 174098, "name": "略奪の母、汁婆", "text": "略奪の母、汁婆が場に出たとき、赤であり緑である１/１のゴブリン・戦士・クリーチャー・トークンを２体場に出す。\nあなたがプレイする赤か緑である各インスタント呪文や各ソーサリー呪文は共謀を持つ。 （その呪文をプレイするに際し、あなたはあなたがコントロールするこの呪文と共通の色を持つアンタップ状態のクリーチャー２体をタップしてもよい。 そうした場合、その呪文をコピーする。あなたはそのコピーの新たな対象を選んでもよい。）", "type": "伝説のクリーチャー — ゴブリン・シャーマン"}, {"language": "Portuguese (Brazil)", "multiverseId": 172292, "name": "Mosto, a Mãe-de-Ataque", "text": "Quando Mosto, a Mãe-de-Ataque, entrar em jogo, coloque em jogo duas fichas de criatura vermelha e verde 1/1 do tipo Goblin Guerreiro.\nCada mágica instantânea ou de feitiço vermelha ou verde que você joga tem conspirar. (Conforme você joga a mágica, você pode virar duas criaturas desviradas que você controla que compartilhem uma cor com ela. Quando fizer isso, faça uma cópia dela e você poderá escolher novos alvos para a cópia.)", "type": "Criatura Lendária — Goblin Xamã"}, {"language": "Russian", "multiverseId": 172593, "name": "Бражка, Мамаша Налетчиков", "text": "Когда Бражка, Мамаша Налетчиков входит в игру, положите в игру две фишки существа 1/1 красный и зеленый Гоблин Воин.\nКаждое разыгрываемое вами красное или зеленое мгновенное заклинание или заклинание волшебства имеет Заговор. (При разыгрывании такого заклинания вы можете повернуть два неповернутых существа под вашим контролем, у которых есть такой же цвет, как у него. Когда вы это делаете, скопируйте его, и вы можете выбрать новые цели для этой копии.)", "type": "Легендарное Существо — Гоблин Шаман"}, {"language": "Chinese Simplified", "multiverseId": 173195, "name": "掠夺大妈麦汁", "text": "当掠夺大妈麦汁进场时，将两个1/1，红绿双色的精灵／战士衍生物放置进场。\n你使用的每个红色或绿色的瞬间或法术咒语都具有协力异能。 （于你使用该咒语时，你可以横置两个由你操控、且与该咒语有共通颜色的未横置生物。 当你如此作，则复制该咒语，且你可以为该复制品选择新的目标。）", "type": "传奇生物～精灵／祭师"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "125072", "cardKingdomId": "124786", "cardsphereId": "41612", "mcmId": "19237", "mcmMetaId": "9786", "mtgjsonV4Id": "d0a91349-ec7c-5d58-8627-24da177f093d", "mtgoFoilId": "29530", "mtgoId": "29529", "multiverseId": "147379", "scryfallId": "535189ec-572f-44ed-9741-09b9f575fc40", "scryfallIllustrationId": "7d46dda1-a2fa-4035-a4ce-d94e3689ff97", "scryfallOracleId": "d6b67c7e-3b24-4f60-8e3a-c6ca45229d7f", "tcgplayerProductId": "18851"}, "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{4}{R/G}{R/G}", "manaValue": 6.0, "name": "Wort, the Raidmother", "number": "223", "originalText": "When Wort, the Raidmother comes into play, put two 1/1 red and green Goblin Warrior creature tokens into play.\nEach red or green instant or sorcery spell you play has conspire. (As you play the spell, you may tap two untapped creatures you control that share a color with it. When you do, copy it and you may choose new targets for the copy.)", "originalType": "Legendary Creature - Goblin Shaman", "power": "3", "printings": ["C20", "MM3", "SHM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/a2fe3384d0a9149c", "cardKingdomFoil": "https://mtgjson.com/links/3b0c52bff4253336", "cardmarket": "https://mtgjson.com/links/c1309b9da02e0a85", "tcgplayer": "https://mtgjson.com/links/a99f424b50e01988"}, "rarity": "rare", "rulings": [{"date": "2017-03-14", "text": "If a spell gains a second instance of conspire from Wort’s ability, you may choose to pay for one, both, or none of those abilities. Each conspire ability triggers only if you tap two creatures specifically for that ability."}, {"date": "2017-03-14", "text": "If the spell that’s copied is modal (that is, it says “Choose one —” or the like), the copy will have the same mode. A different mode can’t be chosen."}, {"date": "2017-03-14", "text": "If the spell that’s copied has an X whose value was determined as it was cast (like Bonfire of the Damned does), the copy will have the same value of X."}, {"date": "2017-03-14", "text": "If the spell has damage divided as it was cast (like Fiery Justice does), the division can’t be changed (although the targets receiving that damage still can)."}, {"date": "2017-03-14", "text": "Some spells instruct you to sacrifice a creature as an additional cost to cast that spell. If you sacrifice Wort to pay that cost, that spell won’t have conspire at the moment it becomes cast, so conspire won’t trigger, even if you tapped two creatures."}, {"date": "2017-03-14", "text": "If you’re casting a spell for its flashback cost, you can’t pay another alternative cost (such as an overload cost or a Trap’s alternative cost) instead. You may pay additional costs, such as conspire."}], "setCode": "SHM", "subtypes": ["Goblin", "Shaman"], "supertypes": ["Legendary"], "text": "When Wort, the Raidmother enters the battlefield, create two 1/1 red and green Goblin Warrior creature tokens.\nEach red or green instant or sorcery spell you cast has conspire. (As you cast the spell, you may tap two untapped creatures you control that share a color with it. When you do, copy it and you may choose new targets for the copy.)", "toughness": "3", "type": "Legendary Creature — Goblin Shaman", "types": ["Creature"], "uuid": "c6306a2a-5399-535a-bdfe-679f84013388"}