{"artist": "Terese Nielsen & Ron Spencer", "availability": ["mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["B"], "colors": ["B"], "convertedManaCost": 6.0, "edhrecRank": 1939, "finishes": ["nonfoil", "foil"], "flavorText": "The mission of the Nighthearth, Illulia's cult of murderous cinders, is to intensify every pain suffered in Shadowmoor.", "foreignData": [{"flavorText": "Die Nachtesse, Illulias mörderischer Kult von Rußwesen, hat es sich zur Mission gemacht, jeden Schmerz zu intensivieren, den jemand im Schattenmoor erleidet.", "language": "German", "multiverseId": 174558, "name": "Wundenspiegelung", "text": "Am Ende jedes Zuges verliert jeder Gegner Lebenspunkte in Höhe der Lebenspunkte, die er in diesem Zug bisher verloren hat. (Schaden verursacht den Verlust von Lebenspunkten.)", "type": "Verzauberung"}, {"flavorText": "La misión del Fogón Nocturno, el culto de Illulia de cenicientos asesinos, es intensificar todo dolor sufrido en el Páramo Sombrío.", "language": "Spanish", "multiverseId": 172752, "name": "Reflejo de la herida", "text": "Al final de cada turno, cada oponente pierde una cantidad de vida igual a las vidas que perdió este turno. (El daño causa pérdida de vida.)", "type": "Encantamiento"}, {"flavorText": "La mission des Noctâtres, les scoriacés meurtriers du culte d'Illulia, est d'intensifier la moindre souffrance ressentie sur Sombrelande.", "language": "French", "multiverseId": 173354, "name": "Réverbération de blessure", "text": "À la fin de chaque tour, chaque adversaire perd un nombre de points de vie égal au nombre de points de vie qu'il a perdu ce tour. (Les blessures provoquent la perte de points de vie.)", "type": "Enchantement"}, {"flavorText": "Lo scopo del Tetro Focolare, il culto di assassini cinerei di Illulia, è di intensificare ogni dolore sofferto nella Landa Tenebrosa.", "language": "Italian", "multiverseId": 173655, "name": "Riflesso di Ferita", "text": "Alla fine di ogni turno, ogni avversario perde punti vita pari ai punti vita che ha perso in questo turno. (Il danno causa la perdita di punti vita.)", "type": "Incantesimo"}, {"flavorText": "ナイトハースとは残忍な燃えがら達のイルリアへの崇拝であり、その使命はシャドウムーアに起こるあらゆる苦痛を増大させることだ。", "language": "Japanese", "multiverseId": 173956, "name": "傷の反射", "text": "各ターンの終了時に、各対戦相手はこのターンにそのプレイヤーが失ったライフの点数に等しい点数のライフを失う。 （ダメージによりライフは失われる。）", "type": "エンチャント"}, {"flavorText": "A missão dos Larescuros, o culto de Illulia de cinzeríneos assassinos, é intensificar toda dor sofrida em Pântano Sombrio.", "language": "Portuguese (Brazil)", "multiverseId": 172150, "name": "Reflexo de Ferida", "text": "No final de cada turno, cada oponente perde pontos de vida igual à quantidade que perdeu neste turno. (O dano causa perda de pontos de vida.)", "type": "Encantamento"}, {"flavorText": "Миссия темносветов созданного Иллулией культа золовиков-убийц состоит в том, чтобы усилить любую боль обитателей Шэдоумура.", "language": "Russian", "multiverseId": 172451, "name": "Отражение Раны", "text": "В конце каждого хода каждый оппонент теряет столько жизней, сколько жизней он потерял в этом ходу. (Повреждения вызывают потерю жизней.)", "type": "Чары"}, {"flavorText": "伊璐里领导的烬身教派名为夜炉，其宗旨是让暗影荒原上的一切苦痛更加剧烈。", "language": "Chinese Simplified", "multiverseId": 173053, "name": "伤痛映象", "text": "在每个回合结束时，每位对手各失去若干生命，其数量等同于他在本回合所失去的生命数量。 （伤害会导致失去生命。）", "type": "结界"}], "frameVersion": "2003", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "125073", "cardKingdomId": "124787", "cardsphereId": "41614", "mcmId": "19095", "mcmMetaId": "9644", "mtgjsonV4Id": "976c3b6d-9630-5b9b-b38b-f14d5fb614c6", "mtgoFoilId": "29510", "mtgoId": "29509", "multiverseId": "146762", "scryfallId": "b8cf8332-0ff2-40c5-980a-6f6be690fad0", "scryfallIllustrationId": "0fce1cc5-4a48-4baa-abc2-0bf2ec94ce4f", "scryfallOracleId": "b09206a4-8b73-4125-8b79-53f6fd511b16", "tcgplayerProductId": "18852"}, "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "penny": "Legal", "vintage": "Legal"}, "manaCost": "{5}{B}", "manaValue": 6.0, "name": "Wound Reflection", "number": "81", "originalText": "At the end of each turn, each opponent loses life equal to the life he or she lost this turn. (Damage causes loss of life.)", "originalType": "Enchantment", "printings": ["2XM", "SHM"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/0b1ffe14b59e02a2", "cardKingdomFoil": "https://mtgjson.com/links/6296b5e6d9d47def", "cardmarket": "https://mtgjson.com/links/68f711d4b2907540", "tcgplayer": "https://mtgjson.com/links/1b16d5721bba1b9b"}, "rarity": "rare", "rulings": [{"date": "2020-08-07", "text": "When Wound Reflection's ability resolves, it checks how much life each opponent lost over the course of the turn, then it causes that opponent to lose that much life. It doesn't matter how the opponent lost life or who caused it. It also doesn't matter if Wound Reflection wasn't on the battlefield at the time some or all of the life was lost."}, {"date": "2020-08-07", "text": "Wound Reflection's ability checks only whether life was lost. It doesn't care whether life was also gained. For example, if an opponent lost 4 life and gained 6 life during the turn, that player will have a higher life total than they started the turn with but Wound Reflection's ability will still cause that player to lose 4 life."}, {"date": "2020-08-07", "text": "If Wound Reflection's ability resolves, then an opponent loses life later in the same turn, that life loss is never counted by Wound Reflection."}, {"date": "2020-08-07", "text": "Multiple Wound Reflections each trigger separately. For example, if an opponent lost 1 life, the first one's triggered ability to resolve causes them to lose another 1 life. Since they've now lost 2 life, the next triggered ability causes them to lose 2 life, and the next 4, and so on."}], "setCode": "SHM", "subtypes": [], "supertypes": [], "text": "At the beginning of each end step, each opponent loses life equal to the life they lost this turn. (Damage causes loss of life.)", "type": "Enchantment", "types": ["Enchantment"], "uuid": "0cc21525-2e70-5260-b828-f96e249fb300"}