{"artist": "Jason A. Engle", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["G", "R"], "colors": ["G", "R"], "convertedManaCost": 5.0, "edhrecRank": 1105, "finishes": ["foil"], "foreignData": [], "frameEffects": ["nyxtouched", "legendary", "showcase"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "231899", "cardsphereId": "66065", "mcmId": "440318", "mtgjsonV4Id": "302a1136-79aa-5796-9e52-1ff7aa08ade8", "multiverseId": "479510", "scryfallId": "e144aa4d-3ea7-44fb-b1cb-ad51cf84bba2", "scryfallIllustrationId": "20e72d4e-7e37-41e5-9b48-ae6e5f7d0e6d", "scryfallOracleId": "cb15a8dd-57fe-466f-847e-66476b690a1f", "tcgplayerProductId": "209397"}, "isFullArt": true, "isReprint": true, "isStarter": true, "keywords": ["Indestructible"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "modern": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{R}{G}", "manaValue": 5.0, "name": "Xenagos, God of Revels", "number": "81", "originalReleaseDate": "2020-02-14", "originalText": "Indestructible\nAs long as your devotion to red and green is less than seven, Xenagos isn't a creature.\nAt the beginning of combat on your turn, another target creature you control gains haste and gets +X/+X until end of turn, where X is that creature's power.", "originalType": "Legendary Enchantment Creature — God", "power": "6", "printings": ["BNG", "CMR", "PRM", "SLD"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/5181be4b6027e7c2", "tcgplayer": "https://mtgjson.com/links/cc50e6e5b6a5e6db"}, "rarity": "mythic", "rulings": [{"date": "2013-09-15", "text": "Mana symbols in the text boxes of permanents you control don’t count toward your devotion to any color."}, {"date": "2013-09-15", "text": "Hybrid mana symbols, monocolored hybrid mana symbols, and Phyrexian mana symbols do count toward your devotion to their color(s)."}, {"date": "2013-09-15", "text": "If an activated ability or triggered ability has an effect that depends on your devotion to a color, you count the number of mana symbols of that color among the mana costs of permanents you control as the ability resolves. The permanent with that ability will be counted if it’s still on the battlefield at that time."}, {"date": "2013-09-15", "text": "Numeric mana symbols ({0}, {1}, and so on) in mana costs of permanents you control don’t count toward your devotion to any color."}, {"date": "2014-02-01", "text": "The value of X is calculated only once, as the ability resolves."}, {"date": "2020-11-10", "text": "If an effect causes Xenagos to lose all abilities, its ability that causes it to stop being a creature still applies if appropriate."}, {"date": "2020-11-10", "text": "When Xenagos enters the battlefield, your devotion to red and green will determine if a creature entered the battlefield or not for abilities that trigger whenever a creature enters the battlefield. The mana symbols in Xenagos’s own mana cost are counted when determining this."}, {"date": "2020-11-10", "text": "If Xenagos stops being a creature, it loses the type creature and the creature type God. It continues to be a legendary enchantment."}, {"date": "2020-11-10", "text": "Xenagos’s abilities function as long as it’s on the battlefield, regardless of whether it’s a creature."}, {"date": "2020-11-10", "text": "If Xenagos is attacking or blocking and it stops being a creature, it will be removed from combat. It won’t rejoin combat if it resumes being a creature later during that combat."}, {"date": "2020-11-10", "text": "Counters put on Xenagos remain on it while it’s not a creature, even if they have no effect."}, {"date": "2020-11-10", "text": "Your devotion to two colors is the number of mana symbols among mana costs of permanents you control that are the first color, the second, or both. If an effect counts your devotion to two colors, a hybrid symbol that is both of those colors is counted just once."}, {"date": "2020-11-10", "text": "The type-changing ability that can make Xenagos not be a creature functions only on the battlefield. It’s always a creature card in other zones, regardless of your devotion to red and green. It’s always a creature spell while it’s on the stack."}, {"date": "2020-11-10", "text": "As Xenagos enters the battlefield, your devotion to red and green will determine whether any replacement effects that affect creatures entering the battlefield apply. Because replacement effects are considered before Xenagos is on the battlefield, the mana symbols in its mana cost won’t be counted when determining this."}], "securityStamp": "oval", "setCode": "SLD", "subset": ["Theros Stargazing, Volume V"], "subtypes": ["God"], "supertypes": ["Legendary"], "text": "Indestructible\nAs long as your devotion to red and green is less than seven, Xenagos isn't a creature.\nAt the beginning of combat on your turn, another target creature you control gains haste and gets +X/+X until end of turn, where X is that creature's power.", "toughness": "5", "type": "Legendary Enchantment Creature — God", "types": ["Enchantment", "Creature"], "uuid": "184745b0-6ba3-5fc0-9304-8f6acd7c386f"}