{"artist": "Grzegorz Rutkowski", "availability": ["mtgo", "paper"], "borderColor": "black", "colorIdentity": ["G", "W"], "colors": ["G", "W"], "convertedManaCost": 4.0, "edhrecRank": 9637, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 484746, "name": "Yannik, plündernder Wächter", "text": "Partner von Nikara der Höhlenplünderin\nWachsamkeit\nWenn Yannik, plündernder Wächter, ins Spiel kommt, schicke eine andere Kreatur, die du kontrollierst, ins Exil, bis Yannik das Spiel verlässt. Wenn du dies tust, verteile X +1/+1-Marken auf eine beliebige Anzahl an Kreaturen deiner Wahl, wobei X gleich der Stärke der ins Exil geschickten Kreatur ist.", "type": "Legendäre Kreatur — Hyäne, Bestie"}, {"language": "Spanish", "multiverseId": 484766, "name": "Yánnik, centinela saqueadora", "text": "Camarada de Nikara, saqueadora de guaridas.\nVigilancia.\nCuando Yánnik, centinela saqueadora entre al campo de batalla, exilia otra criatura que controlas hasta que Yánnik deje el campo de batalla. Cuando lo hagas, distribuye X contadores +1/+1 entre cualquier cantidad de criaturas objetivo, donde X es la fuerza de la criatura exiliada.", "type": "Criatura legendaria — Bestia hiena"}, {"language": "French", "multiverseId": 484786, "name": "Yannik, sentinelle nécrophage", "text": "Partenariat avec Nikara, charognarde des tanières\nVigilance\nQuand Yannik, sentinelle nécrophage arrive sur le champ de bataille, exilez une autre créature que vous contrôlez jusqu'à ce que Yannik quitte le champ de bataille. Quand vous faites ainsi, répartissez X marqueurs +1/+1 entre n'importe quel nombre de créatures ciblées, X étant la force de la créature exilée.", "type": "Créature légendaire : hyène et bête"}, {"language": "Italian", "multiverseId": 484806, "name": "Yannik, Sentinella Predatrice", "text": "Partner di Nikara, Predona delle Tane\nCautela\nQuando Yannik, Sentinella Predatrice entra nel campo di battaglia, esilia un'altra creatura che controlli finché Yannik non lascia il campo di battaglia. Quando lo fai, distribuisci X segnalini +1/+1 tra un qualsiasi numero di creature bersaglio, dove X è la forza della creatura esiliata.", "type": "Creatura Leggendaria — Bestia Iena"}, {"language": "Japanese", "multiverseId": 484826, "name": "物あさりの見張り役、ヤーンニック", "text": "巣穴あさり、ニカーラとの共闘\n警戒\n物あさりの見張り役、ヤーンニックが戦場に出たとき、物あさりの見張り役、ヤーンニックが戦場を離れるまで、他の、あなたがコントロールしているクリーチャー１体を追放する。そうしたとき、望む数のクリーチャーを対象とし、それらの上に＋１/＋１カウンターＸ個を望むように割り振って置く。Ｘはその追放されたクリーチャーのパワーに等しい。", "type": "伝説のクリーチャー — ハイエナ・ビースト"}, {"language": "Portuguese (Brazil)", "multiverseId": 484846, "name": "Yannik, Sentinela Necrófaga", "text": "Parceira de Nikara, Necrófaga dos Covis\nVigilância\nQuando Yannik, Sentinela Necrófaga, entrar no campo de batalha, exile outra criatura que você controla até que Yannik deixe o campo de batalha. Quando fizer isso, distribua X marcadores +1/+1 entre qualquer número de criaturas alvo, sendo X o poder da criatura exilada.", "type": "Criatura Lendária — Hiena Besta"}, {"language": "Russian", "multiverseId": 484866, "name": "Янник, Сторожевой Грабитель", "text": "Партнер с Никарой, Обирающей Гнезда\nБдительность\nКогда Янник, Сторожевой Грабитель выходит на поле битвы, изгоните другое существо под вашим контролем до тех пор, пока Янник не покинет поле битвы. Когда вы это делаете, распределите X жетонов +1/+1 среди любого количества целевых существ, где X — значение силы изгнанного существа.", "type": "Легендарное Существо — Гиена Зверь"}], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "233251", "cardKingdomId": "232344", "cardsphereId": "66379", "mcmId": "452363", "mtgjsonV4Id": "d78dd6aa-1f71-5da6-91a2-aaf50b80b572", "mtgoId": "80761", "multiverseId": "484726", "scryfallId": "11c0e89b-ab29-4739-a88e-1e7966d87d25", "scryfallIllustrationId": "7e339c3c-8336-4f96-989f-49bbf10d2866", "scryfallOracleId": "81ab8947-8046-4944-ae58-006a6eefa08a", "tcgplayerProductId": "212201"}, "isStarter": true, "keywords": ["Partner", "Partner with", "Vigilance"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{2}{G}{W}", "manaValue": 4.0, "name": "Yannik, Scavenging Sentinel", "number": "19", "originalText": "Partner with Nikara, Lair Scavenger\nVigilance\nWhen Yannik, Scavenging Sentinel enters the battlefield, exile another creature you control until Yannik leaves the battlefield. When you do, distribute X +1/+1 counters among any number of target creatures, where X is the exiled creature's power.", "originalType": "Legendary Creature — Hyena Beast", "power": "3", "printings": ["C20"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/29d13d3404670b14", "cardKingdomFoil": "https://mtgjson.com/links/8253d87dd9595b00", "tcgplayer": "https://mtgjson.com/links/471280d341c65f7a"}, "rarity": "mythic", "rulings": [{"date": "2020-04-17", "text": "If Yannik leaves the battlefield before its triggered ability resolves, you won’t exile any creature you control. Yannik’s reflexive triggered ability won’t trigger."}, {"date": "2020-04-17", "text": "Auras attached to the exiled creature will be put into their owners’ graveyards. Any Equipment will become unattached and remain on the battlefield. Any counters on the exiled creature will cease to exist. When the card returns to the battlefield, it will be a new object with no connection to the card that was exiled."}, {"date": "2020-04-17", "text": "If a token is exiled this way, it will cease to exist and won’t return to the battlefield. It will still let the ability distribute counters."}, {"date": "2020-04-17", "text": "Yannik’s triggered ability doesn’t target the creature you control. That creature is chosen as the triggered ability resolves. After it’s exiled, the reflexive triggered ability triggers and targets are chosen to receive the counters."}, {"date": "2020-04-17", "text": "Use the power of the creature as it last existed on the battlefield to determine how many +1/+1 counters to distribute."}, {"date": "2020-04-17", "text": "You choose how the counters will be distributed as you put the reflexive triggered ability onto the stack. Each target creature must be assigned at least one counter."}, {"date": "2020-04-17", "text": "You may choose zero target creatures for Yannik’s reflexive triggered ability. If you do, no creature receives +1/+1 counters."}, {"date": "2020-04-17", "text": "If one of the target creatures becomes an illegal target in response to the reflexive triggered ability, the +1/+1 counters that would have been put on that creature are lost. They can’t be put on another legal target."}, {"date": "2020-04-17", "text": "Yannik can be the target of its own reflexive triggered ability."}, {"date": "2020-04-17", "text": "Nikara’s last ability causes you to draw only one card and lose only 1 life, no matter how many counters or kinds of counters that creature had on it."}, {"date": "2020-04-17", "text": "If a creature with +1/+1 counters on it receives an equal number of -1/-1 counters and this causes it to be destroyed by lethal damage or put into its owner’s graveyard for having 0 or less toughness, Nikara’s last ability triggers. That’s because the ability checks the creature as it last existed on the battlefield, and it still had those counters on it at that point."}, {"date": "2020-04-17", "text": "If a creature with counters on it leaves the battlefield at the same time as Nikara, Nikara’s ability triggers for that creature."}, {"date": "2020-04-17", "text": "“Partner with [name]” represents two abilities. The first is a triggered ability: “When this permanent enters the battlefield, target player may search their library for a card named [name], reveal it, put it into their hand, then shuffle their library.”"}, {"date": "2020-04-17", "text": "Note that the target player searches their library (which may be affected by effects such as that of Stranglehold) and that the card they find is revealed, even though these words aren’t included in the ability’s reminder text."}, {"date": "2020-04-17", "text": "The second ability represented by the “partner with [name]” keyword modifies the rules for deck construction in the Commander variant and has no function outside of that variant. If a legendary creature card with “partner with [name]” is designated as your commander, the named legendary creature card can also be designated as your commander."}, {"date": "2020-04-17", "text": "If your Commander deck has two commanders, you can only include cards whose own color identities are also found in your commanders’ combined color identities. If Haldan and Pako are your commanders, your deck may contain cards with blue, red, and/or green in their color identity, but not cards with white or black."}, {"date": "2020-04-17", "text": "Both commanders start in the command zone, and the remaining 98 cards of your deck are shuffled to become your library."}, {"date": "2020-04-17", "text": "A creature with a “partner with” ability can’t partner with any creature other than its designated partner. Losing a partner ability during the game doesn’t cause either to cease to be your commander."}, {"date": "2020-04-17", "text": "Once the game begins, your two commanders are tracked separately. If you cast one, you won’t have to pay an additional {2} the first time you cast the other. A player loses the game after having been dealt 21 damage from one of them, not from both of them combined. Command Beacon’s effect puts one into your hand from the command zone, not both."}, {"date": "2020-04-17", "text": "The triggered ability of the “partner with” keyword still triggers in a Commander game. If your other commander has somehow ended up in your library, you can find it. You can also target another player who might have that card in their library."}], "securityStamp": "oval", "setCode": "C20", "subtypes": ["Hyena", "Beast"], "supertypes": ["Legendary"], "text": "Partner with Nikara, Lair Scavenger\nVigilance\nWhen Yannik, Scavenging Sentinel enters the battlefield, exile another creature you control until Yannik leaves the battlefield. When you do, distribute X +1/+1 counters among any number of target creatures, where X is the exiled creature's power.", "toughness": "3", "type": "Legendary Creature — Hyena Beast", "types": ["Creature"], "uuid": "cc7ce750-70e4-5329-868c-7ad95163ccfa"}