{"artist": "David Day", "availability": ["paper"], "borderColor": "silver", "colorIdentity": ["R"], "colors": ["R"], "convertedManaCost": 5.0, "finishes": ["foil"], "flavorText": "It puts the \"vortex\" in \"flavortext.\"", "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "267673", "cardsphereId": "94490", "mtgjsonV4Id": "e62fde78-0202-5460-b1ed-a7500068e91a", "scryfallId": "248621ac-7516-48fd-b08a-3b3f6ee1149f", "scryfallIllustrationId": "8a68b5e7-dcc8-4d57-9acb-c1ea98c4d555", "scryfallOracleId": "77d1489b-e7c1-4185-9269-766ca554f0e8", "tcgplayerProductId": "287552"}, "isFunny": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {}, "manaCost": "{3}{R}{R}", "manaValue": 5.0, "name": "Yet Another Aether Vortex", "number": "32", "printings": ["UND", "UNH", "UPLIST"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/02cd853c80761e30", "tcgplayer": "https://mtgjson.com/links/6c0bcf838e5569c0"}, "rarity": "rare", "rulings": [{"date": "2020-02-29", "text": "If the top card of your library is a creature, planeswalker, land, enchantment, or artifact card, it’s also on the battlefield. Ta-da! This is, as they say, very weird."}, {"date": "2020-02-29", "text": "If the top card of your library is a creature card, it can attack. It does have haste, after all. It can also block."}, {"date": "2020-02-29", "text": "If the top card of your library is a permanent card with an activated ability that requires it to be tapped, that ability can be activated. Land cards on top of your library can be tapped for mana, and so on."}, {"date": "2020-02-29", "text": "A permanent card that becomes the top card of your library enters the battlefield (unless it went from the battlefield to the top of your library), so any enters-the-battlefield abilities will trigger and “as [this creature] enters the battlefield” abilities will apply. Similarly, a permanent card that stops being the top card of your library leaves the battlefield (unless it went from the top of your library to the battlefield directly)."}, {"date": "2020-02-29", "text": "If the top card of your library is a creature card and it’s put into your graveyard, the creature did die. Note that it wasn’t destroyed or sacrificed or anything. It just died. <sad trombone noises>"}, {"date": "2020-02-29", "text": "If a creature you control that isn’t part of your library is put on top of your library, surprisingly little happens, at least at first. That creature doesn’t leave or enter the battlefield. It just stays on the battlefield. Of course, now that it’s also the top card of your library, you’ll probably draw it soon. This is also true if something puts the top card of your library directly onto the battlefield, without you having to play it."}, {"date": "2020-02-29", "text": "If the top card is your library is an Aura card, that Aura is on the battlefield not attached to anything. As such, it’s put into your graveyard. The new top card of your library is then revealed."}, {"date": "2020-02-29", "text": "If you are instructed to draw multiple cards, you draw them one at a time. Each card you draw after the first becomes the top card of your library briefly and is revealed. Each permanent card revealed this way enters and then leaves the battlefield, for any abilities that care about that."}], "securityStamp": "oval", "setCode": "UPLIST", "subtypes": [], "supertypes": [], "text": "All creatures have haste.\nPlayers play with the top card of their libraries revealed.\nNoninstant, nonsorcery cards on top of a library are on the battlefield under their owner's control in addition to being in that library.", "type": "Enchantment", "types": ["Enchantment"], "uuid": "f40acac4-e993-5c1b-a847-4fe3d1508b58"}