{"artist": "Steven Belledin", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["U", "W"], "colors": ["U", "W"], "convertedManaCost": 5.0, "edhrecRank": 2288, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "4e850ca8-d1f5-54de-a0fc-900f54a61fa4", "mtgoId": "80865", "scryfallId": "4fe7b570-7893-407b-87aa-1c30c319c0de", "scryfallIllustrationId": "b91fb435-3541-44fa-99a8-eabf59376ee5", "scryfallOracleId": "e15504a7-2b67-4185-b916-172145f10b19"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Companion", "Flying"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Banned", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W/U}{W/U}", "manaValue": 5.0, "name": "Yorion, Sky Nomad", "number": "80865", "originalReleaseDate": "2020-04-30", "power": "4", "printings": ["IKO", "PIKO", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "You choose which permanents to exile as Yorion’s triggered ability resolves. No player may take action between the time you choose the permanents and the time they’re exiled."}, {"date": "2020-04-17", "text": "You can’t exile permanents you control but don’t own, or permanents that you own but don’t control."}, {"date": "2020-04-17", "text": "Auras attached to the exiled permanents will be put into their owners’ graveyards. Equipment attached to the exiled permanents will become unattached and remain on the battlefield. Any counters on the exiled permanents will cease to exist. Once the exiled permanents return, they’re considered new objects with no relation to the objects that they were."}, {"date": "2020-04-17", "text": "If a token is exiled this way, it will cease to exist and won’t return to the battlefield."}, {"date": "2020-04-17", "text": "Your companion begins the game outside the game. In tournament play, this means your sideboard. In casual play, it’s simply a card you own that’s not in your starting deck."}, {"date": "2020-04-17", "text": "The companion’s other abilities apply only if the creature is on the battlefield. They have no effect while the companion is outside the game."}, {"date": "2020-04-17", "text": "The requirements of the companion ability apply only to your starting deck. They do not apply to your sideboard."}, {"date": "2020-04-17", "text": "If more than one player wishes to reveal a companion, the starting player does so first, and players proceed in turn order. Once a player has chosen not to reveal a companion, that player can’t change their mind."}, {"date": "2020-04-17", "text": "The companion ability has no effect if the card is in your starting deck and creates no restriction on putting a card with a companion ability into your starting deck. For example, Zirda may be in your starting deck even if your other permanent cards don’t all have activated abilities."}, {"date": "2020-04-17", "text": "You may have one companion in the Commander variant. Your deck, including your commander, must meet its companion requirement. Your companion is not one of your one hundred cards."}, {"date": "2020-04-17", "text": "Before shuffling your deck to become your library, you may reveal one card from outside the game to be your companion if your starting deck meets the requirements of the companion ability. You can’t reveal more than one. It remains revealed outside the game as the game begins."}, {"date": "2020-04-17", "text": "Your minimum deck size is forty cards for Limited events (such as Booster Draft and Sealed Deck) and sixty cards for Constructed events (such as Standard or casual freeform play). Certain variants may have other minimums. The Commander variant requires exactly one hundred cards, so Yorion can never be your chosen companion in a Commander game."}, {"date": "2020-06-01", "text": "Once you put your companion into your hand, it behaves like any other card you’ve brought into the game. For example, if it’s countered or destroyed, it’s put into your graveyard, remaining in the game."}, {"date": "2020-06-01", "text": "Wizards of the Coast has issued functional errata for the Companion mechanic. Instead of casting companions from outside the game: Once per game, any time you could cast a sorcery (during your main phase when the stack is empty), you can pay {3} to put your companion from your sideboard into your hand. This is a special action, not an activated ability. It happens immediately and can’t be responded to. It can’t be countered or stopped by cards like Phyrexian Revoker. For more information please see https://magic.wizards.com/en/articles/archive/news/june-1-2020-banned-and-restricted-announcement"}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Bird", "Serpent"], "supertypes": ["Legendary"], "text": "Companion — Your starting deck contains at least twenty cards more than the minimum deck size. (If this card is your chosen companion, you may put it into your hand from outside the game for {3} any time you could cast a sorcery.)\nFlying\nWhen Yorion enters the battlefield, exile any number of other nonland permanents you own and control. Return those cards to the battlefield at the beginning of the next end step.", "toughness": "5", "type": "Legendary Creature — Bird Serpent", "types": ["Creature"], "uuid": "824aa8d8-55c5-52f6-9b7d-224ff39e29d7"}