{"artist": "Jehan Choo", "availability": ["arena", "mtgo", "paper"], "boosterTypes": ["draft"], "borderColor": "black", "colorIdentity": ["W"], "colors": [], "convertedManaCost": 1.0, "edhrecRank": 18086, "finishes": ["nonfoil", "foil"], "foreignData": [{"language": "German", "multiverseId": 583888, "name": "Yotischer Frontkämpfer", "text": "Immer wenn der Yotische Frontkämpfer angreift, erhält eine andere Kreatur deiner Wahl, die du kontrollierst, +1/+1 bis zum Ende des Zuges.\nExhumieren {W} ({W}: Bringe diese Karte aus deinem Friedhof ins Spiel zurück. Sie erhält Eile. Schicke sie zu Beginn des nächsten Endsegments, oder falls sie das Spiel verlassen würde, ins Exil. Spiele Exhumieren wie eine Hexerei.)", "type": "Artefaktkreatur — Soldat"}, {"language": "Spanish", "multiverseId": 584149, "name": "Yotiano de primera línea", "text": "Siempre que el Yotiano de primera línea ataque, otra criatura objetivo que controlas obtiene +1/+1 hasta el final del turno.\nDesenterrar {W}. ({W}: Regresa esta carta de tu cementerio al campo de batalla. Gana la habilidad de prisa. Exíliala al comienzo del próximo paso final o si fuera a dejar el campo de batalla. Activa la habilidad de desenterrar solo como un conjuro.)", "type": "Criatura artefacto — Soldado"}, {"language": "French", "multiverseId": 584410, "name": "Frontalier yotien", "text": "À chaque fois que le Frontalier yotien attaque, une autre créature ciblée que vous contrôlez gagne +1/+1 jusqu'à la fin du tour.\nExhumation {W} ({W} : Renvoyez cette carte sur le champ de bataille depuis votre cimetière. Elle acquiert la célérité. Exilez-la au début de la prochaine étape de fin ou si elle devait quitter le champ de bataille. N'exhumez que lorsque vous pourriez lancer un rituel.)", "type": "Créature-artefact : soldat"}, {"language": "Italian", "multiverseId": 584671, "name": "Prima Linea di Yotia", "text": "Ogniqualvolta la Prima Linea di Yotia attacca, un'altra creatura bersaglio che controlli prende +1/+1 fino alla fine del turno.\nDissotterrare {W} ({W}: Rimetti sul campo di battaglia questa carta dal tuo cimitero. Ha rapidità. Esiliala all'inizio della prossima sottofase finale o se sta per lasciare il campo di battaglia. Dissotterra solo come una stregoneria.)", "type": "Creatura Artefatto — Soldato"}, {"language": "Japanese", "multiverseId": 584932, "name": "ヨーティアの前線兵", "text": "ヨーティアの前線兵が攻撃するたび、あなたがコントロールしていてこれでないクリーチャー１体を対象とする。ターン終了時まで、それは＋１/＋１の修整を受ける。\n蘇生{W} （{W}：あなたの墓地にあるこのカードを戦場に戻す。こは速攻を得る。次の終了ステップの開始時に、あるいは、これが戦場を離れるなら、これを追放する。蘇生はソーサリーとしてのみ行う。）", "type": "アーティファクト・クリーチャー — 兵士"}, {"language": "Portuguese (Brazil)", "multiverseId": 585193, "name": "Vanguardeiro Yotiano", "text": "Toda vez que Vanguardeiro Yotiano ataca, outra criatura alvo que você controla recebe +1/+1 até o final do turno.\nDesenterrar {W} ({W}: Devolva este card de seu cemitério para o campo de batalha. Ele ganha ímpeto. Exile-o no início da próxima etapa final ou se ele for deixar o campo de batalha. Use desenterrar somente como um feitiço.)", "type": "Criatura Artefato — Soldado"}, {"language": "Chinese Simplified", "multiverseId": 585454, "name": "佑天前线兵", "text": "每当佑天前线兵攻击时，另一个目标由你操控的生物得+1/+1直到回合结束。\n破坟{W}（{W}：将此牌从你的坟墓场移回战场。它获得敏捷异能。在下一个结束步骤开始时，或若它将离开战场，将它放逐。只能于法术时机破坟。）", "type": "神器生物 ～士兵"}], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"cardKingdomFoilId": "269103", "cardKingdomId": "268696", "cardsphereId": "95245", "mcmId": "682538", "mcmMetaId": "413717", "mtgArenaId": "82526", "mtgjsonV4Id": "6bbf89dc-4090-5ffb-9cb3-3e86d9b86544", "mtgoId": "104702", "multiverseId": "583627", "scryfallId": "bfa05d1e-6728-4e77-bfb2-da0b9598e44b", "scryfallIllustrationId": "aa58fc4b-b254-4bf2-b622-33b4dd7091f9", "scryfallOracleId": "cd39e485-71ba-40cb-8608-f5a0dfb7ef5f", "tcgplayerProductId": "452385"}, "keywords": ["Unearth"], "language": "English", "layout": "normal", "legalities": {"alchemy": "Legal", "brawl": "Legal", "commander": "Legal", "duel": "Legal", "explorer": "Legal", "future": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Legal", "modern": "Legal", "paupercommander": "Restricted", "penny": "Legal", "pioneer": "Legal", "standard": "Legal", "vintage": "Legal"}, "manaCost": "{1}", "manaValue": 1.0, "name": "Yotian Frontliner", "number": "42", "originalText": "Whenever Yotian Frontliner attacks, another target creature you control gets +1/+1 until end of turn.\nUnearth {W} ({W}: Return this card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.)", "originalType": "Artifact Creature — Soldier", "power": "1", "printings": ["BRO"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/1f0630eb6036a529", "cardKingdomFoil": "https://mtgjson.com/links/f103e375f36b6074", "cardmarket": "https://mtgjson.com/links/9b2e219cfd3d66e3", "tcgplayer": "https://mtgjson.com/links/5935bc7681205fb0"}, "rarity": "uncommon", "rulings": [{"date": "2022-10-14", "text": "If you activate a card’s unearth ability but that card is removed from your graveyard before the ability resolves, that unearth ability will do nothing as it resolves."}, {"date": "2022-10-14", "text": "Activating a card’s unearth ability isn’t the same as casting that card. The unearth ability is put on the stack, but the card is not. Spells and abilities that interact with activated abilities (such as Defabricate’s second mode) will interact with unearth, but spells and abilities that interact with spells (such as Scatter Ray) will not."}, {"date": "2022-10-14", "text": "At the beginning of the next end step, a permanent returned to the battlefield with unearth is exiled. This is a delayed triggered ability, and it can be countered by effects such as Defabricate that counter triggered abilities. If the ability is countered, the permanent will stay on the battlefield and the delayed triggered ability won’t trigger again. However, the replacement effect will still exile the permanent if it eventually leaves the battlefield."}, {"date": "2022-10-14", "text": "Unearth grants haste to the permanent that’s returned to the battlefield (even if it’s not a creature card). However, neither of the “exile” abilities is granted to that permanent. If that permanent loses all its abilities, it will still be exiled at the beginning of the next end step, and if it would leave the battlefield, it is still exiled instead."}, {"date": "2022-10-14", "text": "If a permanent returned to the battlefield with unearth would leave the battlefield for any reason, it’s exiled instead—unless the spell or ability that’s causing the permanent to leave the battlefield is actually trying to exile it! In that case, it succeeds at exiling it. If that spell or ability later returns the card to the battlefield (as Static Net might, for example), the permanent card will return to the battlefield as a new object with no relation to its previous existence. The unearth effects will no longer apply to it."}], "setCode": "BRO", "subtypes": ["Soldier"], "supertypes": [], "text": "Whenever Yotian Frontliner attacks, another target creature you control gets +1/+1 until end of turn.\nUnearth {W} ({W}: Return this card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.)", "toughness": "1", "type": "Artifact Creature — Soldier", "types": ["Artifact", "Creature"], "uuid": "6249d867-06d9-5d40-b0d3-53281b51ca7e"}