{"artist": "Cody Culp", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 2.0, "finishes": ["nonfoil"], "foreignData": [], "frameVersion": "2015", "hasFoil": false, "hasNonFoil": true, "identifiers": {"cardKingdomId": "250153", "cardsphereId": "83101", "mcmId": "415344", "mtgjsonV4Id": "7bb4fe93-a48f-533e-96bd-fb7544678dbd", "scryfallId": "f8604945-8dbb-47d1-a56c-9dcd84d2a6e7", "scryfallIllustrationId": "ff7c93a1-bde8-4202-a81b-ed1b22265c6e", "scryfallOracleId": "2234989f-270e-4d4c-9800-4fbf3176939d", "tcgplayerProductId": "247044"}, "isFunny": true, "isReprint": true, "isStarter": true, "language": "English", "layout": "normal", "legalities": {}, "manaCost": "{1}{W}", "manaValue": 2.0, "name": "You're in Command", "number": "15", "printings": ["CMB1", "CMB2"], "purchaseUrls": {"cardKingdom": "https://mtgjson.com/links/e0c536c4b0bb860b", "tcgplayer": "https://mtgjson.com/links/826da75d4fde8952"}, "rarity": "rare", "rulings": [{"date": "2019-11-12", "text": "You’re in Command gives you a commander even if you’re not playing a Commander game."}, {"date": "2019-11-12", "text": "To become your commander, the following things are true: If your commander would be put into a zone other than the stack or battlefield, you may put it into the command zone instead. You may cast that commander from the command zone. You pay an additional {2} for each time you’ve cast it from the command zone this game. If a commander has dealt 21 combat damage to a player while it’s a commander, that player loses the game. Damage dealt before it was your commander isn’t counted."}, {"date": "2019-11-12", "text": "If a card becomes your commander during a game, no deckbuilding rules of the Commander variant apply. You can still play cards that don’t correspond to that commander’s color identity."}, {"date": "2019-11-12", "text": "If you have a commander in the command zone as You’re in Command resolves, that card is no longer your commander. It remains in the command zone and can’t be cast."}, {"date": "2019-11-12", "text": "If You’re in Command targets a creature that’s represented by multiple cards, each of those cards become your commander. The additional cost to cast them and combat damage dealt by them are tracked separately for each card. Damage dealt while they’re together representing one creature counts for each of those commanders."}, {"date": "2019-11-12", "text": "If you cast You’re in Command targeting a token and that token leaves the battlefield, it ceases to exist. Why did you put a token in charge?"}], "setCode": "CMB2", "subtypes": [], "supertypes": [], "text": "Choose target creature you own and control. That creature becomes your commander. Any other commanders you have are no longer your commander. (That creature starts with a commander tax of {0}.)", "type": "Sorcery", "types": ["Sorcery"], "uuid": "e4ccd4e1-b14e-5eda-a8c5-a14677fb147b"}