{"artist": "Anna Steinbauer", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["W"], "colors": ["W"], "convertedManaCost": 4.0, "edhrecRank": 10574, "finishes": ["foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "266474", "cardsphereId": "94412", "mtgjsonV4Id": "8fb241b5-9796-5cc7-900f-8a01d5968432", "scryfallId": "3698b37f-0d86-42ea-9031-8f7e54b5d953", "scryfallIllustrationId": "b0cac3c8-d1d7-4715-bc4f-cad7efce4826", "scryfallOracleId": "d29551ab-e314-4872-9fc5-fe9a442dc8a9", "tcgplayerProductId": "286589"}, "isAlternative": true, "isStarter": true, "keywords": ["Flying", "Miracle", "Squad", "Vigilance"], "language": "English", "layout": "normal", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{3}{W}", "manaValue": 4.0, "name": "Zephyrim", "number": "20★", "power": "3", "printings": ["40K"], "promoTypes": ["surgefoil"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/2f199e77c76cf35b", "tcgplayer": "https://mtgjson.com/links/30ec7bb957493648"}, "rarity": "rare", "rulings": [{"date": "2022-10-07", "text": "If you cast Zephyrim for its miracle cost, you may also choose to pay its squad cost one or more times."}, {"date": "2022-10-07", "text": "See also “New Keyword Ability: Squad” and “Returning Keyword Ability: Miracle” in the General Notes section."}, {"date": "2022-10-07", "text": "You may pay the squad cost any number of times. You will get a token that is a copy of that permanent for each time you paid the squad cost."}, {"date": "2022-10-07", "text": "The ability will not trigger and tokens will not be created if the original spell has been countered or is otherwise no longer on the stack as the triggered ability resolves."}, {"date": "2022-10-07", "text": "The tokens created by the squad ability aren’t “cast,” so any abilities that trigger when a spell is cast won’t trigger for the copies."}, {"date": "2022-10-07", "text": "If, for some reason, the creature doesn’t have the squad ability when it’s on the battlefield, the ability won’t trigger, even if you’ve paid the squad cost one or more times."}, {"date": "2022-10-07", "text": "It’s important to reveal a card with miracle before it is mixed with the other cards in your hand."}, {"date": "2022-10-07", "text": "You can reveal and cast a card with miracle on any turn, not just your own, if it’s the first card you’ve drawn that turn."}, {"date": "2022-10-07", "text": "Multiple card draws are always treated as a sequence of individual card draws. For example, if you haven’t drawn any cards yet during a turn and cast a spell that instructs you to draw three cards, you’ll draw them one at a time. Only the first card drawn this way may be revealed and cast using its miracle ability."}, {"date": "2022-10-07", "text": "If an effect puts a card into your hand without using the word “draw,” the card wasn’t drawn."}, {"date": "2022-10-07", "text": "You don’t have to reveal a drawn card with miracle if you don’t wish to cast it at that time."}, {"date": "2022-10-07", "text": "You can cast a card for its miracle cost only as the miracle triggered ability resolves. If you don’t want to cast it at that time (or you can’t cast it, perhaps because there are no legal targets available), you won’t be able to cast it later for the miracle cost."}, {"date": "2022-10-07", "text": "You cast the card with miracle during the resolution of the triggered ability. Ignore any timing rules based on the card’s type."}, {"date": "2022-10-07", "text": "Miracle is an alternative cost to cast the spell with miracle. It can’t be combined with other alternative costs, such as casting a spell “without paying its mana cost.”"}, {"date": "2022-10-07", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a miracle cost) you’re paying, add any cost increases, then apply any cost reductions. The mana value of the spell remains unchanged, no matter what the total cost to cast it was."}, {"date": "2022-10-07", "text": "If the card with miracle leaves your hand before the triggered ability resolves, you won’t be able to cast it using its miracle ability."}, {"date": "2022-10-07", "text": "You still draw the card, whether you use the miracle ability or not. Any ability that triggers whenever you draw a card, for example, will trigger. If you don’t cast the card using its miracle ability, it will remain in your hand."}], "securityStamp": "triangle", "setCode": "40K", "subtypes": ["Human", "Warrior"], "supertypes": [], "text": "Squad {2} (As an additional cost to cast this spell, you may pay {2} any number of times. When this creature enters the battlefield, create that many tokens that are copies of it.)\nFlying, vigilance\nMiracle {1}{W} (You may cast this card for its miracle cost when you draw it if it's the first card you drew this turn.)", "toughness": "3", "type": "Creature — Human Warrior", "types": ["Creature"], "uuid": "c17747a6-55fb-5550-9bf5-5521d91541d8", "variations": ["6c705195-98e5-5ec0-bc1d-a4c00ab3cced"]}