{"artist": "David Rapoza", "availability": ["paper"], "borderColor": "black", "colorIdentity": ["B", "R", "U"], "colors": ["B", "R", "U"], "convertedManaCost": 4.0, "edhrecRank": 9626, "finishes": ["foil"], "foreignData": [], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"cardKingdomFoilId": "262332", "cardsphereId": "88299", "mcmId": "662216", "mtgjsonV4Id": "9ec75bad-7c96-53b9-bbad-fc5476a3d397", "scryfallId": "44ad5058-e01a-4453-951a-a8c7752265bf", "scryfallIllustrationId": "883104d4-a5f8-4e7d-8737-a2c11f3ad4c5", "scryfallOracleId": "0c85a577-db82-4a36-bc42-49644eba1cf2", "tcgplayerProductId": "274541"}, "isPromo": true, "isReprint": true, "isStarter": true, "keywords": ["Haste"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{1}{U}{B}{R}", "manaValue": 4.0, "name": "Zevlor, Elturel Exile", "number": "296s", "power": "4", "printings": ["CLB", "PCLB"], "promoTypes": ["prerelease", "datestamped"], "purchaseUrls": {"cardKingdomFoil": "https://mtgjson.com/links/8725cd1389efd5a5", "tcgplayer": "https://mtgjson.com/links/3c2b715ca42acb1c"}, "rarity": "rare", "rulings": [{"date": "2022-06-10", "text": "Zevlor, Elturel Exile has received an update to its Oracle text. The word “only” was inadvertently left off the printed card. The updated text is included above. Notably, an instant or sorcery spell with multiple targets will not cause the delayed triggered ability to trigger, even if only one of those targets is an opponent or an permanent an opponent controls."}, {"date": "2022-06-10", "text": "When the delayed triggered ability of Zevlor, Elturel Exile resolves, it may create one or more copies of a spell. You control each of the copies. Those copies are created on the stack, so they're not “cast.” Abilities that trigger when a player casts a spell won't trigger. The copies will then resolve like normal spells, after players get a chance to cast spells and activate abilities."}, {"date": "2022-06-10", "text": "The delayed triggered ability can copy the spell that caused it to trigger even if that spell has been countered by the time that ability resolves."}, {"date": "2022-06-10", "text": "As you make your choices for each other opponent, you can choose that opponent or any permanent they control, but if the chosen player or permanent isn't a legal target for the spell, the copy won't be created."}, {"date": "2022-06-10", "text": "Like any spell, each copy will check to see if its target is still legal as it tries to resolve."}, {"date": "2022-06-10", "text": "If instant or sorcery spell could have multiple targets but only one target is chosen as it is cast, that spell will cause Zevlor's delayed triggered ability to trigger. The copies will similarly have only one target. For example, if you cast Explosive Entry (“Destroy up to one target artifact. Put a +1/+1 counter on up to one target creature”) targeting only a creature, the copies can each legally target a single creature."}, {"date": "2022-06-10", "text": "If the spell is modal (that is, it has a bulleted list of choices), the copies will have the same mode(s). You can't choose different ones."}, {"date": "2022-06-10", "text": "If the spell has an X whose value was determined as it was cast (like Fireball does), the copy has the same value of X."}, {"date": "2022-06-10", "text": "You can't choose to pay any additional costs for the copies. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copies too. For example, if you sacrifice a 3/3 creature to cast Fling and then copy it, each copy of Fling will also deal 3 damage to its target."}], "securityStamp": "oval", "setCode": "PCLB", "subtypes": ["Tiefling", "Warrior"], "supertypes": ["Legendary"], "text": "Haste\n{2}, {T}: When you next cast an instant or sorcery spell that targets only a single opponent or a single permanent an opponent controls this turn, for each other opponent, choose that player or a permanent they control, copy that spell, and the copy targets the chosen player or permanent.", "toughness": "2", "type": "Legendary Creature — Tiefling Warrior", "types": ["Creature"], "uuid": "68a8f0c6-e365-52f4-a159-f17ed30d9ff2"}