{"artist": "Jesper Ejsing", "availability": ["mtgo"], "borderColor": "black", "colorIdentity": ["R", "W"], "colors": ["R", "W"], "convertedManaCost": 3.0, "edhrecRank": 2054, "finishes": ["nonfoil", "foil"], "foreignData": [], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": true, "identifiers": {"mtgjsonV4Id": "0c2d2dab-86c9-5959-8a82-f34d69cd2808", "mtgoId": "80867", "scryfallId": "1516afba-4ffd-423c-a695-c64dd1ff6a8e", "scryfallIllustrationId": "0261c04a-8c21-4b5c-a33d-7b158da20cc9", "scryfallOracleId": "7b515c56-7b1e-42a8-82b0-1b30201fb162"}, "isOnlineOnly": true, "isPromo": true, "isReprint": true, "keywords": ["Companion"], "language": "English", "layout": "normal", "leadershipSkills": {"brawl": false, "commander": true, "oathbreaker": false}, "legalities": {"commander": "Legal", "duel": "Legal", "explorer": "Legal", "gladiator": "Legal", "historic": "Legal", "historicbrawl": "Legal", "legacy": "Banned", "modern": "Legal", "penny": "Legal", "pioneer": "Legal", "vintage": "Legal"}, "manaCost": "{1}{R/W}{R/W}", "manaValue": 3.0, "name": "Zirda, the Dawnwaker", "number": "80867", "originalReleaseDate": "2020-04-30", "power": "3", "printings": ["IKO", "PIKO", "PRM"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2020-04-17", "text": "Activated abilities contain a colon. They’re generally written “[Cost]: [Effect].” Some keyword abilities are activated abilities (such as cycling) and will have colons in their reminder text."}, {"date": "2020-04-17", "text": "An activated mana ability is one that produces mana as it resolves, not one that costs mana to activate."}, {"date": "2020-04-17", "text": "Effects that reduce the generic mana cost of an activation cost can’t reduce that cost’s colored mana requirements. The activation cost is reduced by only {1} if doing so reduces that cost to one mana. For example, a cycling cost of {2} would become {1}, and one of {1}{R} would become {R}. The activation cost is unaffected if it already costs one or zero mana (such as the activation cost of Zirda’s last ability)."}, {"date": "2020-04-17", "text": "Activating Zirda’s last ability after a creature has blocked won’t remove the blocking creature from combat or cause the creature it blocked to become unblocked."}, {"date": "2020-04-17", "text": "Your companion begins the game outside the game. In tournament play, this means your sideboard. In casual play, it’s simply a card you own that’s not in your starting deck."}, {"date": "2020-04-17", "text": "Permanent cards are artifact, creature, enchantment, land, and planeswalker cards. Land cards with basic land types have intrinsic activated mana abilities associated with those types."}, {"date": "2020-04-17", "text": "The requirements of the companion ability apply only to your starting deck. They do not apply to your sideboard."}, {"date": "2020-04-17", "text": "If more than one player wishes to reveal a companion, the starting player does so first, and players proceed in turn order. Once a player has chosen not to reveal a companion, that player can’t change their mind."}, {"date": "2020-04-17", "text": "The companion’s other abilities apply only if the creature is on the battlefield. They have no effect while the companion is outside the game."}, {"date": "2020-04-17", "text": "The companion ability has no effect if the card is in your starting deck and creates no restriction on putting a card with a companion ability into your starting deck. For example, Zirda may be in your starting deck even if your other permanent cards don’t all have activated abilities."}, {"date": "2020-04-17", "text": "You may have one companion in the Commander variant. Your deck, including your commander, must meet its companion requirement. Your companion is not one of your one hundred cards."}, {"date": "2020-04-17", "text": "Before shuffling your deck to become your library, you may reveal one card from outside the game to be your companion if your starting deck meets the requirements of the companion ability. You can’t reveal more than one. It remains revealed outside the game as the game begins."}, {"date": "2020-06-01", "text": "Wizards of the Coast has issued functional errata for the Companion mechanic. Instead of casting companions from outside the game: Once per game, any time you could cast a sorcery (during your main phase when the stack is empty), you can pay {3} to put your companion from your sideboard into your hand. This is a special action, not an activated ability. It happens immediately and can’t be responded to. It can’t be countered or stopped by cards like Phyrexian Revoker. For more information please see https://magic.wizards.com/en/articles/archive/news/june-1-2020-banned-and-restricted-announcement"}], "securityStamp": "oval", "setCode": "PRM", "subtypes": ["Elemental", "Fox"], "supertypes": ["Legendary"], "text": "Companion — Each permanent card in your starting deck has an activated ability. (If this card is your chosen companion, you may put it into your hand from outside the game for {3} any time you could cast a sorcery.)\nAbilities you activate that aren't mana abilities cost {2} less to activate. This effect can't reduce the mana in that cost to less than one mana.\n{1}, {T}: Target creature can't block this turn.", "toughness": "3", "type": "Legendary Creature — Elemental Fox", "types": ["Creature"], "uuid": "d08c845a-9814-5720-9816-a48a8b0f3e2e"}