{"artist": "Alexis Ziritt", "availability": ["paper"], "borderColor": "borderless", "colorIdentity": ["U"], "colors": ["U"], "convertedManaCost": 5.0, "edhrecRank": 7658, "faceName": "Zndrsplt, Eye of Wisdom", "finishes": ["foil"], "foreignData": [], "frameEffects": ["legendary"], "frameVersion": "2015", "hasFoil": true, "hasNonFoil": false, "identifiers": {"mtgjsonV4Id": "eb3c369e-ccda-5d05-813f-1de2a924a519", "scryfallId": "e25ce640-baf5-442b-8b75-d05dd9fb20dd", "scryfallIllustrationId": "c5e6cb8f-c7bd-4ba7-988f-1332bd6d595b"}, "isAlternative": true, "isReprint": true, "keywords": ["Partner", "Partner with"], "language": "English", "layout": "reversible_card", "legalities": {"commander": "Legal", "duel": "Legal", "legacy": "Legal", "vintage": "Legal"}, "manaCost": "{4}{U}", "manaValue": 5.0, "name": "Zndrsplt, Eye of Wisdom // Zndrsplt, Eye of Wisdom", "number": "379★", "originalReleaseDate": "2022-04-22", "otherFaceIds": ["2ef3715f-fcb9-5385-a161-962c83ae5bab"], "power": "1", "printings": ["BBD", "PBBD", "SLD"], "promoTypes": ["thick"], "purchaseUrls": {}, "rarity": "rare", "rulings": [{"date": "2018-06-08", "text": "“Partner with [name]” represents two abilities. The first is a triggered ability: “When this permanent enters the battlefield, target player may search their library for a card named [name], reveal it, put it into their hand, then shuffle their library.”"}, {"date": "2018-06-08", "text": "Note that the target player searches their library (which may be affected by effects such as that of Stranglehold) and that the card they find is revealed, even though these words aren’t included in the ability’s reminder text."}, {"date": "2018-06-08", "text": "The second ability represented by the “partner with [name]” keyword modifies the rules for deck construction in the Commander variant and has no function outside of that variant. If a legendary creature card with “partner with [name]” is designated as your commander, the named legendary creature card can also be designated as your commander. For more information on the Commander variant, please visit Wizards.com/Commander."}, {"date": "2018-06-08", "text": "If your Commander deck has two commanders, you can only include cards whose own color identities are also found in your commanders’ combined color identities. If Khorvath and Sylvia are your commanders, your deck may contain cards with red and/or white in their color identity, but not blue, black, or green."}, {"date": "2018-06-08", "text": "Both commanders start in the command zone, and the remaining 98 cards of your deck are shuffled to become your library."}, {"date": "2018-06-08", "text": "To have two commanders, both must have the partner ability (featured in the Magic: The Gathering—Commander™ (2016 Edition) set) or corresponding “partner with” abilities as the game begins. A creature with a “partner with” ability can’t partner with any creature other than its designated partner. Losing a partner ability during the game doesn’t cause either to cease to be your commander."}, {"date": "2018-06-08", "text": "Once the game begins, your two commanders are tracked separately. If you cast one, you won’t have to pay an additional {2} the first time you cast the other. A player loses the game after having been dealt 21 damage from one of them, not from both of them combined. Command Beacon’s effect puts one into your hand from the command zone, not both."}, {"date": "2018-06-08", "text": "An effect that checks whether you control your commander is satisfied if you control one or both of your two commanders."}, {"date": "2018-06-08", "text": "The triggered ability of the “partner with” keyword still triggers in a Commander game. If your other commander has somehow ended up in your library, you can find it. You can also target another player who might have that card in their library."}, {"date": "2018-06-08", "text": "If an effect instructs you to “double” a creature’s power, that creature gets +X/+0, where X is its power. The same is true for its toughness."}, {"date": "2018-06-08", "text": "If an effect has a player flip a coin but refers to whether the flip came up heads or tails, that flip has no winner or loser."}, {"date": "2018-06-08", "text": "If a creature’s power is less than 0 when it’s doubled, instead that creature gets -X/-0, where X is how much less than 0 its power is. The same is true for its toughness. For example, if an effect has given Okaun -7/-0 so that its power and toughness are -4/3, doubling its power and toughness gives it -4/+3 and it’s -8/6 until end of turn."}, {"date": "2018-07-13", "text": "If an effect has a player flip a coin and refers to winning or losing a flip, only the player who flipped the coin wins or loses the flip. If that player loses the flip, nobody wins the flip."}], "securityStamp": "oval", "setCode": "SLD", "side": "b", "subtypes": ["Homunculus"], "supertypes": ["Legendary"], "text": "Partner with Okaun, Eye of Chaos (When this creature enters the battlefield, target player may put Okaun into their hand from their library, then shuffle.)\nAt the beginning of combat on your turn, flip a coin until you lose a flip.\nWhenever a player wins a coin flip, draw a card.", "toughness": "4", "type": "Legendary Creature — Homunculus", "types": ["Creature"], "uuid": "2f7b07c3-fc95-5e5e-a63e-393d685b15ac", "variations": ["9f9c49af-02d5-5219-8827-98b857cfae3f", "c765d1e2-2e30-50fb-af77-a6b128061a05"]}